Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/cupertino_*.arb
Languages: bo, rw, tk

# datePickerHourSemanticsLabelOne
source: $hour o'clock
bo: $hour ཆུ་ཚོད།
rw: $hour zuzuye
tk: Sagat $hour

# datePickerHourSemanticsLabelOther
source: $hour o'clock
bo: $hour ཆུ་ཚོད།
rw: $hour zuzuye
tk: Sagat $hour

# datePickerMinuteSemanticsLabelOne
source: 1 minute
bo: སྐར་མ། 1
rw: Umunota 1
tk: 1 minut

# datePickerMinuteSemanticsLabelOther
source: $minute minutes
bo: $minute སྐར་མ་དུ་མ།
rw: Iminota $minute
tk: $minute minut

# datePickerDateOrder
source: mdy
bo: ymd
tk: dmy

# anteMeridiemAbbreviation
source: AM
bo: སྔ་དྲོ

# postMeridiemAbbreviation
source: PM
bo: ཕྱི་དྲོ།

# todayLabel
source: Today
bo: དེ་རིང་།
rw: Uyumunsi
tk: Şugün

# alertDialogLabel
source: Alert
bo: གསལ་བརྡ།
rw: Imenyesha
tk: Bildiriş

# tabSemanticsLabel
source: Tab $tabIndex of $tabCount
bo: འཛར་གནོན་ $tabIndex ཡི $tabCount
rw: Paji ya $tabIndex muri $tabCount

# timerPickerHourLabelOne
source: hour
bo: ཆུ་ཚོད།
rw: isaha
tk: sagat

# timerPickerHourLabelOther
source: hours
bo: ཆུ་ཚོད་དུ་མ།
rw: amasaha
tk: sagat

# timerPickerMinuteLabelOne
source: min.
bo: སྐར་མ།
rw: umun.

# timerPickerMinuteLabelOther
source: min.
bo: སྐར་མ།
rw: imin.

# timerPickerSecondLabelOne
source: sec.
bo: སྐར་ཆ།
rw: iseg.
tk: sek.

# timerPickerSecondLabelOther
source: sec.
bo: སྐར་ཆ།
rw: amaseg.
tk: sek.

# cutButtonLabel
source: Cut
bo: གཅོད།
rw: Kata
tk: Kesip almak

# copyButtonLabel
source: Copy
bo: བཤུས།
rw: Kopiya
tk: Kopiýasyny almak

# pasteButtonLabel
source: Paste
bo: འཕོས་པ།
rw: Koporora
tk: Goýmak

# clearButtonLabel
source: Clear
bo: གཙང་བཟོ།

# selectAllButtonLabel
source: Select All
bo: ཚང་འདེམས།
rw: Hitamo byose
tk: Hemmesini saýlamak

# lookUpButtonLabel
source: Look Up
bo: འཚོལ་བ།
rw: Shakisha

# searchWebButtonLabel
source: Search Web
bo: དྲ་ཐོག་འཚོལ་བཤེར།
rw: Shakisha kurubuga

# shareButtonLabel
source: Share...
bo: མཉམ་སྤྱོད།…
rw: Sangiza...

# noSpellCheckReplacementsLabel
source: No Replacements Found
bo: བརྗེས་ལེན་མ་རྙེད།
rw: Nta gisimbura ihari

# searchTextFieldPlaceholderLabel
source: Search
bo: འཚོལ་བཤེར།
rw: Shakisha

# modalBarrierDismissLabel
source: Dismiss
bo: འདོར་བ།
rw: Byirengagize

# menuDismissLabel
source: Dismiss menu
bo: ཐོ་གཞུང་འདོར་བ།
rw: Kuraho meni

# cancelButtonLabel
source: Cancel
bo: ཕྱིར་འཐེན།
