Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/material_*.arb
Languages: am, ar, as, az, bn, bo, ckb, gu, hi, hy, kab, kk, km, kn, ky, lo, mi, mn, my, ne, or, pa, ro, si, sr_latn, sw, ta, te, tl, tw, ug, ur, uz, zu

# expandedHint
source: Collapsed
am: ተሰብስቧል
ar: مصغَّر
as: সংকোচন কৰা আছে
az: Yığcamlaşdırıldı
bn: আড়াল করা হয়েছে
ckb: بچووککراوەتەوە
gu: નાની કરી
hi: छोटा किया गया
hy: Ծալված է
kk: Жиылды
km: បាន​បង្រួម
kn: ಕುಗ್ಗಿಸಲಾಗಿದೆ
ky: Жыйыштырылды
lo: ຫຍໍ້ລົງແລ້ວ
mn: Хураасан
my: ခေါက်ထားသည်
ne: कोल्याप्स गरियो
or: ସଙ୍କୁଚିତ କରାଯାଇଛି
pa: ਸਮੇਟਿਆ ਗਿਆ
ro: Restrâns
si: හකුළන ලදි
sr_latn: Skupljeno je
sw: Imekunjwa
ta: சுருக்கப்பட்டது
te: కుదించబడింది
ug: يىغىلدى
ur: سکڑا ہوا
uz: Yigʻilgan
zu: Kugoqiwe

# collapsedHint
source: Expanded
am: ተዘርግቷል
ar: موسَّع
as: বিস্তাৰ কৰা আছে
az: Genişləndirildi
bn: বড় করা হয়েছে
ckb: فراوانکراوە
gu: મોટી કરી
hi: बड़ा किया गया
hy: Ծավալված է
kk: Жайылды
km: បាន​ពង្រីក
kn: ವಿಸ್ತರಿಸಲಾಗಿದೆ
ky: Жайылып көрсөтүлдү
lo: ຂະຫຍາຍແລ້ວ
mn: Дэлгэсэн
my: ဖြန့်ထားသည်
ne: एक्स्पान्ड गरियो
or: ବିସ୍ତାର କରାଯାଇଛି
pa: ਵਿਸਤਾਰ ਕੀਤਾ ਗਿਆ
ro: Extins
si: දිග හරින ලදි
sr_latn: Prošireno je
sw: Imepanuliwa
ta: விரிவாக்கப்பட்டது
te: విస్తరించబడింది
ug: يېيىلدى
ur: پھیلا ہوا
uz: Yoyilgan
zu: Kunwetshiwe

# menuDismissLabel
source: Dismiss menu
am: ምናሌን አሰናብት
ar: إغلاق القائمة
as: অগ্ৰাহ্য কৰাৰ মেনু
az: Menyunu qapadın
bn: বাতিল করার মেনু
bo: ཟ་མའི་མིང་ཐོ་ སྒོ་བརྒྱབ་པ་རེད།
ckb: داخستنی مێنوو
gu: મેનૂ છોડી દો
hi: मेन्यू खारिज करें
hy: Փակել ընտրացանկը
kab: Ad d-yeǧǧ adlis
kk: Мәзірді жабу
km: ច្រានចោល​ម៉ឺនុយ
kn: ಮೆನುವನ್ನು ವಜಾಗೊಳಿಸಿ
ky: Менюну жабуу
lo: ປິດເມນູ
mi: Ākiritia te tahua
mn: Цэсийг хаах
my: မီနူးကိုပယ်ပါ
ne: मेनु खारेज गर्नुहोस्
or: ମେନୁ ଖାରଜ କରନ୍ତୁ
pa: ਮੀਨੂ ਖਾਰਜ ਕਰੋ
ro: Respingeți meniul
si: මෙනුව අස් කරන්න
sr_latn: Odbacite meni
sw: Ondoa menyu
ta: மெனுவை மூடும்
te: మెనూను తీసివేయండి
tw: Fa no kɔ baabiara
ug: تىزىملىكنى بىكار قىلىش
ur: مینو برخاست کریں
uz: Menyuni yopish
zu: Chitha imenyu

# lookUpButtonLabel
source: Look Up
am: ይመልከቱ
ar: بحث عام
as: ওপৰলৈ চাওক
az: Axtarın
bn: লুক-আপ
bo: 㚧།
ckb: گەڕانی گشتی
gu: શોધો
hi: लुक अप बटन
hy: Փնտրել
kab: Muqel ɣer lqaεa
kk: Іздеу
km: រកមើល
kn: ಮೇಲೆ ನೋಡಿ
ky: Издөө
lo: ຊອກຫາຂໍ້ມູນ
mi: Tirohia ake
mn: Дээшээ харах
my: အပေါ်ကြည့်ရန်
ne: माथितिर हेर्नुहोस्
or: ଉପରକୁ ଦେଖନ୍ତୁ
pa: ਖੋਜੋ
ro: Privire în sus
si: උඩ බලන්න
sr_latn: Pogled nagore
sw: Tafuta
ta: தேடு
te: వెతకండి
tw: Hwehwɛ soro
ug: ئىزدەش
ur: تفصیل دیکھیں
uz: Tepaga qarang
zu: Bheka Phezulu

# searchWebButtonLabel
source: Search Web
am: ድርን ፈልግ
ar: البحث على الويب
as: ৱেবত সন্ধান কৰক
az: Vebdə axtarın
bn: ওয়েবে সার্চ করুন
bo: འཚོལ་ཞིབ་Webཞེས་པ།
ckb: گەڕان لە وێب
gu: વેબ પર શોધો
hi: वेब पर खोजें
hy: Որոնել համացանցում
kab: Afed deg web
kk: Интернеттен іздеу
km: ស្វែងរក​លើបណ្ដាញ
kn: ವೆಬ್‌ನಲ್ಲಿ ಹುಡುಕಿ
ky: Интернеттен издөө
lo: ຊອກຫາຢູ່ອິນເຕີເນັດ
mi: Rapua te tukutuku
mn: Вебээс хайх
my: ဝဘ်တွင်ရှာရန်
ne: वेबमा खोज्नुहोस्
or: ୱେବ ସର୍ଚ୍ଚ କରନ୍ତୁ
pa: ਵੈੱਬ 'ਤੇ ਖੋਜੋ
ro: Căutați pe web
si: වෙබය සොයන්න
sr_latn: Pretraži veb
sw: Tafuta kwenye Wavuti
ta: இணையத்தில் தேடு
te: వెబ్‌లో సెర్చ్ చేయండి
tw: Hwehwɛ Intanɛt so
ug: توردا ئىزدەش
ur: ویب تلاش کریں
uz: Internetdan qidirish
zu: Sesha Iwebhu

# shareButtonLabel
source: Share
am: አጋራ
ar: مشاركة
as: শ্বেয়াৰ কৰক
az: Paylaşın
bn: শেয়ার করুন
bo: མཉམ་དུ་ལོངས་སུ་སྤྱོད་
ckb: هاوبەشکردن
gu: શેર કરો
hi: शेयर करें
hy: Կիսվել
kab: Ssekni
kk: Бөлісу
km: ចែករំលែក
kn: ಹಂಚಿಕೊಳ್ಳಿ
ky: Бөлүшүү
lo: ແບ່ງປັນ
mi: Tohaina
mn: Хуваалцах
my: မျှဝေရန်
ne: सेयर गर्नुहोस्
or: ସେୟାର କରନ୍ତୁ
pa: ਸਾਂਝਾ ਕਰੋ
ro: Trimiteți
si: බෙදා ගන්න
sr_latn: Deli
sw: Tuma
ta: பகிர்
te: షేర్ చేయండి
tw: Fa no
ug: ھەمبەھرلەش
ur: اشتراک کریں
uz: Ulashish
zu: Yabelana

# clearButtonTooltip
source: Clear text
am: ጽሁፍን አጽዳ
ar: محو النص
as: পাঠ মচক
az: Mətni silin
bn: টেক্সট মুছুন
bo: གསལ་པོར་ཤེས་པ།
ckb: سڕینەوەی دەق
gu: ટેક્સ્ટ સાફ કરો
hi: टेक्स्ट मिटाएं
hy: Մաքրել տեքստը
kab: Yettban
kk: Мәтінді тазалау
km: សម្អាតអក្សរ
kn: ಪಠ್ಯ ತೆರವುಗೊಳಿಸಿ
ky: Текстти тазалоо
lo: ລຶບລ້າງຂໍ້ຄວາມ
mi: Mahea
mn: Текстийг арилгах
my: စာသား ဖယ်ရှားရန်
ne: टेक्स्ट हटाउनुहोस्
or: ଟେକ୍ସଟ ଖାଲି କରନ୍ତୁ
pa: ਲਿਖਤ ਕਲੀਅਰ ਕਰੋ
ro: Ștergeți textul
si: පෙළ හිස් කරන්න
sr_latn: Obriši tekst
sw: Futa maandishi
ta: வார்த்தைகளை அழிக்கும்
te: టెక్స్ట్‌ను క్లియర్ చేయండి
tw: Hyɛ no nsow
ug: تېكىستنى تازىلاش
ur: ٹیکسٹ صاف کریں
uz: Matnni tozalash
zu: Sula umbhalo

# selectedDateLabel
source: Selected
am: ተመርጧል
ar: التاريخ المحدّد
as: বাছনি কৰা হৈছে
az: Seçilib
bn: বেছে নেওয়া হয়েছে
bo: འདེམས་བསྐོ་བྱས་པའི་ཚེས་གྲངས།
ckb: بەرواری هەڵبژێردراو
gu: પસંદ કરેલો
hi: चुनी गई
hy: Ընտրված է
kab: Taɣrawt yettwafren
kk: Таңдалды.
km: បានជ្រើសរើស
kn: ಆಯ್ಕೆಮಾಡಲಾಗಿದೆ
ky: Тандалды
lo: ເລືອກໄວ້
mi: Rā kua tīpakohia
mn: Сонгосон
my: ရွေးထားသည်
ne: चयन गरिएको
or: ଚୟନିତ
pa: ਚੁਣਿਆ ਗਿਆ
ro: Selectată
si: තෝරන ලදි
sr_latn: Izabrano
sw: Umechagua
ta: தேர்ந்தெடுக்கப்பட்டது
te: ఎంచుకోబడింది
tw: Da a wɔpaw no
ug: تاللاندى
ur: منتخب کردہ
uz: Tanlangan
zu: Okukhethiwe

# scriptCategory
source: English-like
ar: tall
bn: tall
ckb: tall
gu: tall
hi: dense
km: dense
kn: tall
lo: tall
my: tall
ne: tall
or: tall
pa: tall
ta: dense
te: tall
ug: tall
ur: tall

# keyboardKeyBackspace
source: Backspace
am: የኋሊት መደምሰሻ
bo: མཐེབ་བཀྱག་ཕྱིར་འཐེན་
kab: Taɣawsa n uḍar
mi: Mokowāwhakamuri
my: နောက်ပြန်ခလုတ်
tw: Nkyena

# selectedRowCountTitleZero
source: No items selected
ar: لم يتم اختيار أي عنصر
ckb: هیچ ڕیزێک هەڵنەبژێردراوە
hy: Տողերը ընտրված չեն
kk: Тармақ таңдалмаған
mn: Бичлэг сонгоогүй байна
ro: Nu există elemente selectate
sw: Hamna kilicho chaguliwa
ta: எந்த வரிசையும் தேர்ந்தெடுக்கவில்லை

# okButtonLabel
source: OK
am: እሺ
ar: حسنًا
as: ঠিক আছে
bn: ঠিক আছে
bo: ད་དུང་འགྲིག་གི་རེད།
ckb: باشە
gu: ઓકે
hi: ठीक है
hy: Եղավ
kab: D ayen yelhan.
kk: Иә
km: យល់ព្រម
kn: ಸರಿ
ky: Макул
lo: ຕົກລົງ
mi: Ka pai
ne: ठिक छ
or: ଠିକ୍ ଅଛି
pa: ਠੀਕ ਹੈ
si: හරි
sr_latn: Potvrdi
sw: Sawa
ta: சரி
te: సరే
tw: Ɛhɛe!
ug: ماقۇل
ur: ٹھیک ہے
zu: KULUNGILE

# anteMeridiemAbbreviation
source: AM
am: ጥዋት
ar: ص
as: পূৰ্বাহ্ন
bo: དེ་ནི་རེད།
ckb: پ.ن
kk: түстен кейін
kn: ಬೆಳಿಗ್ಗೆ
ky: түшкө чейин
lo: ກ່ອນທ່ຽງ
mn: ӨГЛӨӨ
si: පෙ.ව.
sr_latn: pre podne
ug: چۈشتىن بۇرۇن

# postMeridiemAbbreviation
source: PM
am: ከሰዓት
ar: م
as: অপৰাহ্ন
bo: ཕྱི་དྲོ།ཕྱི་དྲོ།
ckb: د.ن
kk: түстен кейін
kn: ಸಂಜೆ
ky: түштөн кийин
lo: ຫຼັງທ່ຽງ
mn: ОРОЙ
si: ප.ව.
sr_latn: po podne
tw: Ɔmampanyin
ug: چۈشتىن كېيىن

# remainingTextFieldCharacterCountZero
source: No characters remaining
ar: لا أحرف متبقية
ckb: هیچ پیتێک نەماوە
hy: Նիշի հնարավորություն չկա
kk: Таңбалар қалмады
sw: Hapana herufi zilizo baki
ta: எழுத்துக்கள் எதுவும் இல்லை
tl: TBD

# licensesPackageDetailTextZero
source: No licenses
ar: ما مِن تراخيص
ckb: هیچ مۆڵەتێک نییە

# keyboardKeyAlt
source: Alt
bo: Altཡི་མཐེབ་བཀྱག
tw: Nkyinkyin

# keyboardKeyAltGraph
source: AltGr
bo: Alt Graph
kab: Alt Graph
mi: Kauwhata Alt
tw: Alt Graph

# keyboardKeyControl
source: Ctrl
bo: ཚོད་འཛིན།
kab: Aselway
mi: Mana
tw: Adesoa

# keyboardKeyDelete
source: Del
bo: སུབ་དགོས།
kab: Sseffɣen
mi: Whakakore
tw: Sɛe

# keyboardKeyEscape
source: Esc
bo: བྲོས་བྱོལ་དུ་
kab: Ad d-yeffeɣ
mi: mawhiti
tw: Wɔdwane

# keyboardKeyMeta
source: Meta
am: ሜታ
bn: মেটা
bo: ཡོན་ཡིན།
ky: Мета
mn: Мета
ug: مېتا
zu: I-Meta

# keyboardKeyMetaWindows
source: Win
bo: སྒེའུ་ཁུང་།
kab: Tifranin
mi: Matapihi
tw: Nkyɛnkyɛm

# keyboardKeyShift
source: Shift
am: ቀያይር
bo: འགྱུར་ལྡོག་གཏོང་དགོས།
kab: Taɣawsa
mi: Neke
tw: Adwuma
zu: U-Shift
