Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/material_*.arb
Languages: am, ar, as, az, bn, bo, ckb, gu, hi, hy, kab, kk, km, kn, ky, lo, mi, mn, my, ne, or, pa, ro, si, sr_latn, sw, ta, te, tl, tw, ug, ur, uz, zu

# calendarModeButtonLabel
source: Switch to calendar
am: ወደ የቀን መቁጠሪያ ቀይር
ar: التبديل إلى التقويم
as: কেলেণ্ডাৰলৈ সলনি কৰক
az: Təqvimə keçin
bn: ক্যালেন্ডার মোডে বদল করুন
bo: ཉི་མའི་ལོ་རྒྱུས་ཀྱི་དཔེ་དབྱིབས་སུ་འགྱུར་བ་བྱེད་དགོས།
ckb: گۆڕین بۆ ڕۆژژمێر
gu: કૅલેન્ડર મોડ પર સ્વિચ કરો
hi: कैलेंडर पर जाएं
hy: Անցնել օրացույցին
kab: Ssuq ɣer uselmed n uselmed
kk: Күнтізбеге ауысу
km: ប្ដូរទៅ​ប្រតិទិន
kn: ಕ್ಯಾಲೆಂಡರ್‌ಗೆ ಬದಲಿಸಿ
ky: Жылнаамага которулуңуз
lo: ສະຫຼັບໄປປະຕິທິນ
mi: Whakawhiti ki te aratau maramataka
mn: Календарь луу сэлгэх
my: ပြက္ခဒိန်သို့ ပြောင်းရန်
ne: पात्रो मोड प्रयोग गर्नुहोस्
or: କ୍ୟାଲେଣ୍ଡରକୁ ସ୍ୱିଚ୍ କରନ୍ତୁ
pa: ਕੈਲੰਡਰ 'ਤੇ ਜਾਓ
ro: Comutați la calendar
si: දින දර්ශනය වෙත මාරු වන්න
sr_latn: Pređite na kalendar
sw: Badili utumie hali ya kalenda
ta: கேலெண்டருக்கு மாற்று
te: క్యాలెండర్‌కు మారండి
tl: Lumipat sa kalendaryo
tw: Fa wo ho kɔ kalenda so
ug: كالېندارغا ئۆتۈش
ur: کیلنڈر پر سوئچ کریں
uz: Taqvimda ochish
zu: Shintshela kukhalenda

# inputDateModeButtonLabel
source: Switch to input
am: ወደ ግቤት ቀይር
ar: التبديل إلى الإدخال
as: ইনপুটলৈ সলনি কৰক
az: Daxiletməyə keçin
bn: ইনপুট মোডে বদল করুন
bo: ནང་འདྲེན་བྱས་པའི་དུས་ཚོད་ཀྱི་དཔེ་དབྱིབས་སུ་འགྱུར་བ་བྱེད་དགོས།
ckb: گۆڕین بۆ تێخستن
gu: ઇનપુટ મોડ પર સ્વિચ કરો
hi: इनपुट पर जाएं
hy: Անցնել ներածման ռեժիմին
kab: Ssuq ɣer uselmed n useggas
kk: Мәтін енгізуге ауысу
km: ប្ដូរទៅ​ការបញ្ចូល
kn: ಇನ್‌ಪುಟ್‌ಗೆ ಬದಲಿಸಿ
ky: Терип киргизүү режимине которулуңуз
lo: ສະຫຼັບໄປການປ້ອນຂໍ້ມູນ
mi: Whakawhiti ki te aratau rā tāuru
mn: Оролт руу сэлгэх
my: ထည့်သွင်းမှုသို့ ပြောင်းရန်
ne: इनपुट मोड प्रयोग गर्नुहोस्
or: ଇନପୁଟକୁ ସ୍ୱିଚ୍ କରନ୍ତୁ
pa: ਇਨਪੁੱਟ 'ਤੇ ਜਾਓ
ro: Comutați la introducerea textului
si: ආදානය වෙත මාරු වන්න
sr_latn: Pređite na unos
sw: Badili utumie hali ya kuweka maandishi
ta: உள்ளீட்டுக்கு மாற்று
te: ఇన్‌పుట్‌కు మారండి
tl: Lumipat sa input
tw: Fa kɔfa da a wɔde hyɛ mu no mu
ug: خەت كىرگۈزۈشكە ئۆتۈش
ur: ان پٹ پر سوئچ کریں
uz: Mustaqil kiritish
zu: Shintshela kokokufaka

# timePickerDialHelpText
source: Select time
am: ጊዜ ይምረጡ
ar: اختيار الوقت
as: সময় বাছনি কৰক
az: Vaxt seçin
bn: সময় বেছে নিন
bo: དུས་ཚོད་འདེམས་པ།
ckb: هەڵبژاردنی کات
gu: સમય પસંદ કરો
hi: समय चुनें
hy: Ընտրեք ժամը
kab: Aɣmis
kk: Уақытты таңдау
km: ជ្រើសរើសម៉ោង
kn: ಸಮಯವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Убакытты тандоо
lo: ເລືອກເວລາ
mi: Tīpako wā
mn: Хугацаа сонгох
my: အချိန်ရွေးရန်
ne: समय चयन गर्नुहोस्
or: ସମୟ ଚୟନ କରନ୍ତୁ
pa: ਸਮਾਂ ਚੁਣੋ
ro: Selectați ora
si: වේලාව තෝරන්න
sr_latn: Izaberite vreme
sw: Chagua muda
ta: நேரத்தைத் தேர்ந்தெடுக்கவும்
te: సమయాన్ని ఎంచుకోండి
tl: PUMILI NG ORAS
tw: Paw bere
ug: ۋاقىت تاللاش
ur: وقت منتخب کریں
uz: Vaqtni tanlang
zu: Khetha isikhathi

# timePickerInputHelpText
source: Enter time
am: ሰዓት ያስገቡ
ar: إدخال الوقت
as: সময় দিয়ক
az: Vaxt daxil edin
bn: সময় লিখুন
bo: ནང་འཇུག་བྱེད་པའི་དུས་ཚོད།
ckb: تێخستنی کات
gu: સમય દાખલ કરો
hi: समय डालें
hy: Մուտքագրեք ժամը
kab: Ad d-yesseɣ
kk: Уақытты енгізу
km: បញ្ចូលម៉ោង
kn: ಸಮಯವನ್ನು ನಮೂದಿಸಿ
ky: Убакытты киргизүү
lo: ລະບຸເວລາ
mi: Tāuru wā
mn: Хугацаа оруулах
my: အချိန်ထည့်ရန်
ne: समय हाल्नुहोस्
or: ସମୟ ଲେଖନ୍ତୁ
pa: ਸਮਾਂ ਦਾਖਲ ਕਰੋ
ro: Introduceți ora
si: කාලය ඇතුළු කරන්න
sr_latn: Unesite vreme
sw: Weka muda
ta: நேரத்தை உள்ளிடுக
te: సమయాన్ని ఎంటర్ చేయండి
tl: MAGLAGAY NG ORAS
tw: Fa bere no hyɛ mu
ug: ۋاقىت كىرگۈزۈش
ur: وقت درج کریں
uz: Vaqtni kiriting
zu: Faka isikhathi

# timePickerHourLabel
source: Hour
am: ሰዓት
ar: ساعة
as: ঘণ্টা
az: Saat
bn: ঘণ্টা
bo: ཆུ་ཚོད་གཅིག་གི་
ckb: کاتژمێر
gu: કલાક
hi: घंटा
hy: Ժամ
kab: Taṣem
kk: Сағат
km: ម៉ោង
kn: ಗಂಟೆ
ky: Саат
lo: ຊົ່ວໂມງ
mi: Haora
mn: Цаг
my: နာရီ
ne: घन्टा
or: ଘଣ୍ଟା
pa: ਘੰਟਾ
ro: Oră
si: පැය
sr_latn: Sat
sw: Saa
ta: மணிநேரம்
te: గంట
tl: Oras
tw: Dɔnhwerew
ug: سائەت
ur: گھنٹہ
uz: Soat
zu: Ihora

# timePickerMinuteLabel
source: Minute
am: ደቂቃ
ar: دقيقة
as: মিনিট
az: Dəqiqə
bn: মিনিট
bo: སྐར་མ་སྐར་མ་གཅིག་ཙམ
ckb: خولەک
gu: મિનિટ
hi: मिनट
hy: Րոպե
kab: Teddart
kk: Mинут
km: នាទី​
kn: ನಿಮಿಷ
ky: Мүнөт
lo: ນາທີ
mi: Meneti
mn: Минут
my: မိနစ်
ne: मिनेट
or: ମିନିଟ୍
pa: ਮਿੰਟ
ro: Minut
si: මිනිත්තු
sr_latn: Minut
sw: Dakika
ta: நிமிடம்
te: నిమిషం
tl: Minuto
tw: Da koro
ug: مىنۇت
ur: منٹ
uz: Daqiqa
zu: Iminithi

# invalidTimeLabel
source: Enter a valid time
am: የሚሠራ ሰዓት ያስገቡ
ar: يُرجى إدخال وقت صالح.
as: এটা মান্য সময় দিয়ক
az: Düzgün vaxt daxil edin
bn: সঠিক সময় লিখুন
bo: གོ་མི་ཆོད་པའི་དུས་ཚོད།
ckb: تکایە کاتێکی دروست تێبخە
gu: માન્ય સમય દાખલ કરો
hi: मान्य समय डालें
hy: Մուտքագրեք վավեր ժամ
kab: Taggara n usebter
kk: Жарамды уақыт мәліметін енгізіңіз.
km: បញ្ចូលពេលវេលា​ដែល​ត្រឹមត្រូវ
kn: ಮಾನ್ಯವಾದ ಸಮಯವನ್ನು ನಮೂದಿಸಿ
ky: Убакытты туура көрсөтүңүз
lo: ລະບຸເວລາທີ່ຖືກຕ້ອງ
mi: Wā muhu
mn: Цагийг зөв оруулна уу
my: မှန်ကန်သည့်အချိန် ထည့်ပါ
ne: वैध समय प्रविष्टि गर्नुहोस्
or: ଏକ ବୈଧ ସମୟ ଲେଖନ୍ତୁ
pa: ਵੈਧ ਸਮਾਂ ਦਾਖਲ ਕਰੋ
ro: Introduceți o oră validă
si: වලංගු වේලාවක් ඇතුළු කරන්න
sr_latn: Unesite važeće vreme
sw: Weka saa sahihi
ta: சரியான நேரத்தை உள்ளிடவும்
te: చెల్లుబాటు అయ్యే సమయాన్ని ఎంటర్ చేయండి
tl: Maglagay ng valid na oras
tw: Bere a enni mu
ug: ئىناۋەتلىك بىر ۋاقىت كىرگۈزۈڭ
ur: درست وقت درج کریں
uz: Vaqt xato kiritildi
zu: Faka igama elivumelekile

# dialModeButtonLabel
source: Switch to dial picker mode
am: ወደ መደወያ መራጭ ሁነታ ቀይር
ar: التبديل إلى وضع "منتقي قُرص الساعة"
as: ডায়েল বাছনিকৰ্তাৰ ম’ডলৈ সলনি কৰক
az: Yığım seçici rejiminə keçin
bn: ডায়াল বেছে নেওয়ার মোডে পাল্টান
bo: ཨང་གྲངས་གཏོང་བའི་དཔེ་དབྱིབས་སུ་འགྱུར་བ་བྱེད་དགོས།
ckb: گۆڕین بۆ دۆخی کاتژمێری خولگەیی
gu: ડાયલ પિકર મોડ પર સ્વિચ કરો
hi: डायल पिकर मोड पर स्विच करें
hy: Անցնել թվերի ընտրման ռեժիմին
kab: Ssuq ɣer uselmed n uselmed
kk: Таңдау режиміне ауысу
km: ប្ដូរទៅមុខងារផ្ទាំង​ជ្រើសរើសលេខ
kn: ಡಯಲ್ ಪಿಕರ್‌ ಮೋಡ್‌ಗೆ ಬದಲಾಯಿಸಿ
ky: Терүүнү тандагыч режимине которулуу
lo: ສະຫຼັບໄປໃຊ້ໂໝດເລືອກຕົວເລກ
mi: Whakawhiti ki te aratau waea
mn: Цаг сонгогч горим руу сэлгэх
my: နံပါတ်ရွေးချယ်ခြင်းမုဒ်သို့ ပြောင်းရန်
ne: डायल चयनकर्ता मोड प्रयोग गर्नुहोस्
or: ଡାଏଲ୍ ପିକର୍ ମୋଡକୁ ସ୍ୱିଚ୍ କରନ୍ତୁ
pa: ਡਾਇਲ ਚੋਣਕਾਰ ਮੋਡ 'ਤੇ ਜਾਓ
ro: Comutați la modul selector cadran
si: ඩයලන තෝරක ප්‍රකාරයට මාරු කරන්න
sr_latn: Pređite na režim birača brojčanika
sw: Badilisha ili utumie hali ya kiteuzi cha kupiga simu
ta: டயல் தேர்வுக் கருவி பயன்முறைக்கு மாற்றும்
te: డయల్ పికర్ మోడ్‌కు మారుస్తుంది
tl: Lumipat sa dial picker mode
tw: Fa wo ho kɔ fon so
ug: ئىشكالا تاختىسىدا تاللاش ھالىتىگە ئۆتۈش
ur: ڈائل منتخب کنندہ وضع پر سوئچ کریں
uz: Vaqtni burab tanlash rejimi
zu: Shintshela kwimodi yesikhi sokudayela

# inputTimeModeButtonLabel
source: Switch to text input mode
am: ወደ ጽሁፍ ግቤት ሁነታ ቀይር
ar: التبديل إلى وضع "إدخال النص"
as: পাঠ ইনপুটৰ ম’ডলৈ সলনি কৰক
az: Mətn daxiletmə rejiminə keçin
bn: টেক্সট ইনপুট মোডে পাল্টান
bo: ནང་འདྲེན་དུས་ཚོད་ཀྱི་དཔེ་དབྱིབས་སུ་འགྱུར་བ་བྱེད་དགོས།
ckb: گۆڕین بۆ دۆخی تێخستنی دەق
gu: ટેક્સ્ટ ઇનપુટ મોડ પર સ્વિચ કરો
hi: टेक्स्ट के इनपुट मोड पर स्विच करें
hy: Անցնել տեքստի մուտքագրման ռեժիմին
kab: Ssuq ɣer uswir n teswiεt
kk: Мәтін енгізу режиміне ауысу
km: ប្ដូរទៅ​មុខងារ​បញ្ចូល​អក្សរ
kn: ಪಠ್ಯ ಇನ್‌ಪುಟ್ ಮೋಡ್‌ಗೆ ಬದಲಾಯಿಸಿ
ky: Текст киргизүү режимине которулуу
lo: ສະຫຼັບໄປໃຊ້ໂໝດປ້ອນຂໍ້ຄວາມ
mi: Whakawhiti ki te aratau wā tāuru
mn: Текст оруулах горим руу сэлгэх
my: စာသား ထည့်သွင်းမှုမုဒ်သို့ ပြောင်းရန်
ne: पाठ इनपुट मोड प्रयोग गर्नुहोस्
or: ଟେକ୍ସଟ୍ ଇନପୁଟ୍ ମୋଡକୁ ସ୍ୱିଚ୍ କରନ୍ତୁ
pa: ਲਿਖਤ ਇਨਪੁੱਟ ਮੋਡ 'ਤੇ ਜਾਓ
ro: Comutați la modul de introducere a textului
si: පෙළ ආදාන ප්‍රකාරයට මාරු කරන්න
sr_latn: Pređite na režim unosa teksta
sw: Tumia programu ya kuingiza data ya maandishi
ta: உரை உள்ளீட்டு முறைக்கு மாற்றும்
te: టెక్స్ట్ ఇన్‌పుట్ మోడ్‌కు మారుస్తుంది
tl: Lumipat sa text input mode
tw: Fa no kɔ input time mode
ug: خەت كىرگۈزۈش ھالىتىگە ئۆتۈش
ur: ٹیکسٹ ان پٹ وضع پر سوئچ کریں
uz: Vaqtni yozib tanlash rejimi
zu: Shintshela kwimodi yokufaka yombhalo

# licensesPackageDetailTextOne
source: 1 license
am: 1 ፈቃድ
ar: ترخيص واحد
as: ১ খন অনুজ্ঞাপত্ৰ
az: 1 lisenziya
bn: ১টি লাইসেন্স
ckb: یەک مۆڵەت
gu: 1 લાઇસન્સ
hi: 1 लाइसेंस
hy: 1 լիցենզիա
kk: 1 лицензия
km: អាជ្ញាបណ្ណ 1
kn: 1 ಪರವಾನಗಿ
ky: 1 уруксаттама
lo: 1 ໃບອະນຸຍາດ
mn: 1 лиценз
my: လိုင်စင် 1 ခု
ne: एउटा इजाजतपत्र
or: 1ଟି ଲାଇସେନ୍ସ
pa: 1 ਲਾਇਸੰਸ
ro: O licență
si: බලපත්‍ර 1
sr_latn: 1 licenca
sw: Leseni moja
ta: 1 உரிமம்
te: 1 లైసెన్స్
tl: 1 lisensya
ug: 1 ئىجازەتنامە
ur: 1 لائسنس
uz: 1 ta litsenziya
zu: ilayisense e-1

# licensesPackageDetailTextOther
source: $licenseCount licenses
am: $licenseCount ፈቃዶች
ar: $licenseCount ترخيص
as: $licenseCount খন অনুজ্ঞাপত্ৰ
az: $licenseCount lisenziya
bn: $licenseCountটি লাইসেন্স
ckb: $licenseCount مۆڵەت
gu: $licenseCount લાઇસન્સ
hi: $licenseCount लाइसेंस
hy: $licenseCount լիցենզիա
kk: $licenseCount лицензия
km: អាជ្ញាបណ្ណ $licenseCount
kn: $licenseCount ಪರವಾನಗಿಗಳು
ky: $licenseCount уруксаттама
lo: $licenseCount ໃບອະນຸຍາດ
mn: $licenseCount лиценз
my: လိုင်စင် $licenseCount ခု
ne: $licenseCount वटा इजाजतपत्र
or: $licenseCountଟି ଲାଇସେନ୍ସ
pa: $licenseCount ਲਾਇਸੰਸ
ro: $licenseCount de licențe
si: බලපත්‍ර $licenseCount
sr_latn: $licenseCount licenci
sw: Leseni $licenseCount
ta: $licenseCount உரிமங்கள்
te: $licenseCount లైసెన్స్‌లు
tl: $licenseCount na lisensya
ug: $licenseCount ئىجازەتنامە
ur: $licenseCount لائسنسز
uz: $licenseCount ta litsenziya
zu: amalayisense angu-$licenseCount

# keyboardKeyCapsLock
source: Caps Lock
az: Böyük Hərf
bo: ཟྭ་ཆེན་པོ་བརྒྱབ་ནས་གཏན་འཁེལ་བྱས་
kab: Tissit n tmes
mi: Pātuhi pūmatua mau
my: စားလုံးကြီးလော့ခ်
tw: Kapu Ahyehyɛde

# keyboardKeyChannelDown
source: Channel Down
am: ጣቢያ ወደ ታች
ar: القناة التالية
az: Aşağıdakı kanala keçin
bn: আগের চ্যানেলে যান
bo: བགྲོད་ལམ་སྒོ་རྒྱག་པ།
ckb: کەناڵی داهاتوو
hy: Հաջորդ ալիքը
kab: Tiddukla ɣer Da
kk: Келесі арна
mi: Hongere Whakararo
my: ချန်နယ်အောက်
ro: Înapoi
sr_latn: Prethodni kanal
tw: Fa Wo Ho To Asase So
ug: ئاستىنقى قانال
uz: Keyingi kanal
zu: I-Channel Down

# keyboardKeyChannelUp
source: Channel Up
am: ጣቢያ ወደ ላይ
ar: القناة السابقة
az: Yuxarıdakı kanala keçin
bn: পরের চ্যানেলে যান
bo: བགྲོད་ལམ་ཡར་ལ་འགྲོ་བ།
ckb: کەناڵی پێشوو
hy: Նախորդ ալիքը
kab: Yettwaḥseb ɣer lqaεa
kk: Алдыңғы арна
mi: Hongere Whakarunga
my: ချန်နယ်အပေါ်
ro: Înainte
sr_latn: Sledeći kanal
tw: Fa no Kɔ Ɔfasu So
ug: يۇقىرىقى قانال
uz: Avvalgi kanal
zu: I-Channel Up

# keyboardKeyEject
source: Eject
am: አስወጣ
az: Çıxarın
bn: ইজেক্ট করুন
bo: མདེལ་འཕེན་པ།
kab: Yettwaḥḍeb
mi: Whakaputa
my: ထုတ်ရန်
tw: W'ayi

# keyboardKeyEnd
source: End
am: ጨርስ
az: Son
bo: མཇུག་བསྒྲིལ་
kab: Taggara
mi: Mutunga
my: အဆုံး
tw: Awiei

# keyboardKeyHome
source: Home
am: መነሻ
az: Əsas səhifə
bo: ཁྱིམ་ཚང་།
kab: Tamdint
mi: Kāinga
mn: Гэр
my: ပင်မခလုတ်
tw: Fie
ug: باشبەت

# keyboardKeyInsert
source: Insert
am: አስገባ
az: Daxil edin
bo: ནང་དུ་འཇུག་པ།
kab: Yettwasser
mi: Kōkuhu
mn: Оруулах
my: ထည့်သွင်းခလုတ်
tw: Fa hyɛ mu
ug: قىستۇرۇش

# keyboardKeyNumLock
source: Num Lock
az: Rəqəm
my: နံပါတ်လော့ခ်

# keyboardKeyNumpad1
source: Num 1
ar: الرقم 1
az: Rəq 1
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 1
kab: Numpad 1
lo: ເລກ 1
mi: Papatau 1
my: နံပါတ် ၁
ro: 1 de pe tastatura numerică
tw: Numpad 1

# keyboardKeyNumpad2
source: Num 2
ar: الرقم 2
az: Rəq 2
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 2
kab: Numpad 2
lo: ເລກ 2
mi: Papatau 2
my: နံပါတ် ၂
ro: 2 de pe tastatura numerică
tw: Numpad 2

# keyboardKeyNumpad3
source: Num 3
ar: الرقم 3
az: Rəq 3
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 3
kab: Numpad 3
lo: ເລກ 3
mi: Papatau 3
my: နံပါတ် ၃
ro: 3 de pe tastatura numerică
tw: Numpad 3

# keyboardKeyNumpad4
source: Num 4
ar: الرقم 4
az: Rəq 4
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 4
kab: Numpad 4
lo: ເລກ 4
mi: Pūpatotau 4
my: နံပါတ် ၄
ro: 4 de pe tastatura numerică
tw: Numpad 4

# keyboardKeyNumpad5
source: Num 5
ar: الرقم 5
az: Rəq 5
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 5
kab: Numpad 5
lo: ເລກ 5
mi: Papatau 5
my: နံပါတ် ၅
ro: 5 de pe tastatura numerică
tw: Numpad 5

# keyboardKeyNumpad6
source: Num 6
ar: الرقم 6
az: Rəq 6
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 6
kab: Numpad 6
lo: ເລກ 6
mi: Papatau 6
my: နံပါတ် ၆
ro: 6 de pe tastatura numerică
tw: Numpad 6

# keyboardKeyNumpad7
source: Num 7
ar: الرقم 7
az: Rəq 7
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 7
kab: Numpad 7
lo: ເລກ 7
mi: Papatau 7
my: နံပါတ် ၇
ro: 7 de pe tastatura numerică
tw: Numpad 7

# keyboardKeyNumpad8
source: Num 8
ar: الرقم 8
az: Rəq 8
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 8
kab: Numpad 8
lo: ເລກ 8
mi: Papatau 8
my: နံပါတ် ၈
ro: 8 de pe tastatura numerică
tw: Numpad 8

# keyboardKeyNumpad9
source: Num 9
ar: الرقم 9
az: Rəq 9
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞུང་ཆུང་བ།9
ckb: ژمارە 9
kab: Numpad 9
lo: ເລກ 9
mi: Papatau 9
my: နံပါတ် ၉
ro: 9 de pe tastatura numerică
tw: Numpad 9

# keyboardKeyNumpad0
source: Num 0
ar: الرقم 0
az: Rəq 0
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ།
ckb: ژمارە 0
kab: Numpad 0
lo: ເລກ 0
mi: Papatau 0
my: နံပါတ် ၀
ro: 0 de pe tastatura numerică
tw: Numpad 0

# keyboardKeyNumpadAdd
source: Num +
ar: علامة الجمع +
az: Rəq +
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ་ཁ་སྣོན་བྱས
ckb: نیشانەی کۆکردن +
kab: Add Numpad
lo: ປຸ່ມ +
mi: Tāpiri Papatau
my: နံပါတ် +
ro: + de pe tastatura numerică
tw: Numpad Add

# keyboardKeyNumpadComma
source: Num ,
ar: الفاصلة ,
az: Rəq ,
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་བཀྱག་ཆུང་བ་དགོད་ཁ
ckb: کۆما ,
kab: Numpad Comma
lo: ປຸ່ມ ,
mi: Piko Papatau
my: နံပါတ် ၊
ro: , de pe tastatura numerică
tw: Numpad Comma

# keyboardKeyNumpadDecimal
source: Num .
ar: النقطة .
az: Rəq .
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་བཀྱག་བཅུའི་ལམ་ལུགས།
ckb: خاڵ .
kab: Numpad decimal
lo: ປຸ່ມ .
mi: Papatau Ā-Ira
my: နံပါတ် ။
ro: . de pe tastatura numerică
tw: Numpad Decimal

# keyboardKeyNumpadDivide
source: Num /
ar: علامة القسمة /
az: Rəq /
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་བཀྱག་རྒྱག་སྟངས།
ckb: نیشانەی دابەشکردن /
kab: Numpad Divide
lo: ປຸ່ມ /
mi: Whakawehe Papatau
my: နံပါတ် /
ro: / de pe tastatura numerică
tw: Numpad Nkyekyɛ

# keyboardKeyNumpadEnter
source: Num Enter
ar: المفتاح Enter
az: Rəqəm Daxiletmə
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ་Entreerཡིན།
ckb: کلیلی Enter
kab: Numpad Enter
lo: ປຸ່ມ Enter
mi: Tāuru Papatau
my: နံပါတ် Enter ခလုတ်
ro: Enter de pe tastatura numerică
tw: Numpad Enter

# keyboardKeyNumpadEqual
source: Num =
ar: علامة التساوي =
az: Rəq =
bo: Numpdདང་གཅིག་མཚུངས་ཡིན།
ckb: نیشانەی یەکسانی =
kab: Numpad Equal
lo: ປຸ່ມ =
mi: Pūpatotau Ōrite
my: နံပါတ် =
ro: = de pe tastatura numerică
tw: Numpad Equal

# keyboardKeyNumpadMultiply
source: Num *
ar: علامة الضرب *
az: Rəq *
bo: ཨང་ཀིའི་མཐེབ་བཀྱག་ཆུང་བའི་སྒྱུར་རྩིས།
ckb: نیشانەی لێکدان *
kab: Numpad Multiply
lo: ປຸ່ມ *
mi: Pūpatotau Whakarea
my: နံပါတ် *
ro: * de pe tastatura numerică
tw: Numpad Multiply

# keyboardKeyNumpadParenLeft
source: Num (
ar: القوس الأيسر )
az: Rəq (
bo: ཨང་ཀིའི་མཐེབ་གཞོང་ཆུང་བའི་གཡོན་ཕྱོགས་སུ་ཡོད།
ckb: کروچەی چەپ (
kab: Numpad Paren Iɣelmaḍ
lo: ປຸ່ມ (
mi: Parea Pūtau Mauī
my: နံပါတ် (
ro: ( de pe tastatura numerică
tw: Numpad Paren Abusuakuw

# keyboardKeyNumpadParenRight
source: Num )
ar: القوس الأيمن (
az: Rəq )
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བའི་གཡས་ཕྱོགས།།
ckb: کروچەی ڕاست )
kab: Numpad Paren Right
lo: ປຸ່ມ )
mi: Parea Pūtau Matau
my: နံပါတ် )
ro: ) de pe tastatura numerică
tw: Numpad Paren N'anim

# keyboardKeyNumpadSubtract
source: Num -
ar: علامة الطرح -
az: Rəq -
bo: གྲངས་ཀ་ཆུང་བའི་མཐེབ་གཞོང་ཆུང་བ་འཕྲི་
ckb: نیشانەی لێدەرهێنان -
kab: Numpad Subtract
lo: ປຸ່ມ -
mi: Tango Papatau
my: နံပါတ် -
ro: - de pe tastatura numerică
tw: Numpad Subtract

# keyboardKeyPageDown
source: PgDown
az: Aşağı Səhifə
bo: ཤོག་ངོས་རྗེས་མ།
kab: Asebtar ɣer Deffir
mi: Whārangi whakararo
tw: Kɔfa W'asɛmti no

# keyboardKeyPageUp
source: PgUp
az: Yuxarı Səhifə
bo: Page Up
kab: Asebtar n Yiger
mi: Whārangi whakarunga
tw: Hwɛ Nsɛm a Ɛwɔ Wiase Yi So

# keyboardKeyPower
source: Power
am: ኃይል
ar: زر التشغيل
az: Qidalanma
bo: དབང་ཆ།
ckb: دوگمەی پاور
hy: Սնուցում
kab: Tazmert
kk: Қуат
lo: ເປີດປິດ
mi: Mana
mn: Асаах/унтраах товч
my: ပါဝါခလုတ်
sr_latn: Dugme za uključivanje
tw: Tumi
ug: توك
zu: Amandla

# keyboardKeyPowerOff
source: Power Off
am: ኃይል አጥፋ
ar: زر الإطفاء
az: Söndürmə
bo: གློག་ཁུངས་སྒོ་རྒྱག་དགོས།
ckb: دوگمەی کوژاندنەوە
hy: Անջատել
kab: Tameẓla
kk: Қуатты өшіру
lo: ປິດເຄື່ອງ
mi: Whakaweto hiko
mn: Унтраах
my: စက်ပိတ်ရန်
sr_latn: Dugme za isključivanje
tw: Ɔde Nsuo no Betu
ug: ئېتىش
zu: Cisha

# keyboardKeyPrintScreen
source: Print Screen
az: Ekran Çapı
bo: བརྙན་ཤེལ་དཔར་རྒྱག་པ།
kab: Taɣna n usekru
mi: Tā Mata
my: ပရင့်စခရင်
tw: Wode W'anim Nsɛm

# keyboardKeyScrollLock
source: Scroll Lock
az: Sürüşdürmə
kab: Sserwal n useklu
my: လှိမ့်သည့်လော့ခ်
tw: Fa Nhoma no Kyekye

# keyboardKeySelect
source: Select
am: ምረጥ
ar: مفتاح الاختيار
az: Seçin
bn: বেছে নিন
bo: གདམ་ག་རྒྱག་པ།
ckb: کلیلی هەڵبژاردن
hy: Ընտրել
ky: Тандоо
mi: Kōwhiria
mn: Сонгох
my: ရွေးရန်
tw: Paw
ug: تاللاش
zu: Khetha

# keyboardKeySpace
source: Space
am: ክፍተት
ar: مفتاح المسافة
az: Boşluq
bo: བར་སྟོང་།
ckb: کلیلی بۆشایی
hy: Բացատ
kab: Amḍiq
kk: Бос орын
ky: Боштук
mi: Mokowā
my: နေရာခြားခလုတ်
ro: Spațiu
sr_latn: Taster za razmak
tw: Amansan
ug: بوشلۇق
uz: Boʻsh joy

# keyboardKeyMetaMacOs
source: Command
am: ትዕዛዝ
az: Əmr
bo: བཀའ་རྒྱ།
kab: Aḍebsi
mi: Tohutohu
mn: Тушаал
my: ကွန်မန်း
tw: Ahyɛde
ug: بۇيرۇق

# menuBarMenuLabel
source: Menu bar menu
am: የምናሌ አሞሌ ምናሌ
ar: قائمة شريط القوائم
as: মেনু বাৰ মেনু
az: Menyu paneli menyusu
bn: মেনু বার মেনু
bo: ཟས་ཐོའི་བྱང་བུ།
ckb: مێنووی شریتی مێنووەکان
gu: મેનૂ બાર મેનૂ
hi: मेन्यू बार का मेन्यू
hy: Ընտրացանկի գոտու ընտրացանկ
kab: Tabla n imeslayen
kk: Мәзір жолағының мәзірі
km: ម៉ឺនុយរបារម៉ឺនុយ
kn: ಮೆನು ಬಾರ್‌ ಮೆನು
ky: Меню тилкеси менюсу
lo: ເມນູແຖບເມນູ
mi: Pae tahua
mn: Цэсний талбарын цэс
my: မီနူးဘား မီနူး
ne: "मेनु बार" मेनु
or: ମେନୁ ବାର ମେନୁ
pa: ਮੀਨੂ ਬਾਰ ਮੀਨੂ
ro: Bară de meniu
si: මෙනු තීරු මෙනුව
sr_latn: Meni traka menija
sw: Menyu ya upau wa menyu
ta: மெனு பட்டியின் மெனு
te: మెనూ బార్ మెనూ
tw: Menua bar
ug: تىزىملىك بالدىقى تىزىملىكى
ur: مینیو بار کا مینیو
uz: Menyu paneli
zu: Imenyu yebha yemenyu

# currentDateLabel
source: Today
am: ዛሬ
ar: تاريخ اليوم
as: আজি
az: Bugün
bn: আজ
bo: མིག་སྔའི་ཟླ་ཚེས།
ckb: بەرواری ئەمڕۆ
gu: આજે
hi: आज
hy: Այսօր
kab: Tawsit n useggas
kk: Бүгін
km: ថ្ងៃនេះ
kn: ಇಂದು
ky: Бүгүн
lo: ມື້ນີ້
mi: Rā o nāianei
mn: Өнөөдөр
my: ယနေ့
ne: आज
or: ଆଜି
pa: ਅੱਜ
ro: Azi
si: අද
sr_latn: Danas
sw: Leo
ta: இன்று
te: నేడు
tw: Da a edi kan
ug: بۈگۈن
ur: آج
uz: Bugun
zu: Namuhla

# scrimLabel
source: Scrim
am: ገዳቢ
ar: تمويه
as: স্ক্ৰিম
az: Kətan
bn: স্ক্রিম
bo: རས་སོབ་སོབ།
ckb: تەمکردن
gu: સ્ક્રિમ
hi: स्क्रिम
hy: Դիմակ
kab: Skrim
kk: Кенеп
km: ផ្ទាំងស្រអាប់
kn: ಸ್ಕ್ರಿಮ್
ky: Кенеп
mi: Kiriata
mn: Скрим
ne: स्क्रिम
or: ସ୍କ୍ରିମ
pa: ਸਕ੍ਰਿਮ
ro: Material
si: ස්ක්‍රිම්
sr_latn: Skrim
ta: ஸ்க்ரிம்
te: స్క్రిమ్
tw: Nsonsonoe
ur: اسکریم
uz: Kanop
zu: I-Scrim

# bottomSheetLabel
source: Bottom Sheet
am: የግርጌ ሉህ
ar: بطاقة سفلية
as: তলৰ শ্বীট
az: Aşağıdakı Vərəq
bn: স্ক্রিনের নিচে অ্যাটাচ করা শিট
bo: མཐིལ་ཤིང་།
ckb: پەڕەی خوارەوە
gu: બોટમ શીટ
hi: बॉटम शीट
hy: Ներքևի էկրան
kab: Taɣnaḍt n usebter
kk: Төменгі парақша
km: សន្លឹក​ខាងក្រោម
kn: ಕೆಳಭಾಗದ ಶೀಟ್
ky: Ылдыйкы экран
lo: ຊີດລຸ່ມສຸດ
mi: Rau o raro
mn: Доод хүснэгт
my: အောက်ခြေအပိုဆောင်း စာမျက်နှာ
ne: पुछारको पाना
or: ବଟମ ସିଟ
pa: ਹੇਠਲੀ ਸ਼ੀਟ
ro: Foaie din partea de jos
si: පහළම පත්‍රය
sr_latn: Donja tabela
sw: Safu ya Chini
ta: கீழ்த் திரை
te: దిగువున ఉన్న షీట్
tw: Asase no ase nhoma
ug: ئاستىنقى كۆزنەك
ur: نیچے کی شیٹ
uz: Quyi ekran
zu: Ishidi Eliphansi

# scrimOnTapHint
source: Close $modalRouteContentName
am: $modalRouteContentNameን ዝጋ
ar: إغلاق "$modalRouteContentName"
as: $modalRouteContentName বন্ধ কৰক
az: Bağlayın: $modalRouteContentName
bn: $modalRouteContentName বন্ধ করুন
ckb: داخستنی "$modalRouteContentName"
gu: $modalRouteContentNameને બંધ કરો
hi: $modalRouteContentName को बंद करें
hy: Փակել՝ $modalRouteContentName
kk: $modalRouteContentName жабу
km: បិទ $modalRouteContentName
kn: $modalRouteContentName ಅನ್ನು ಮುಚ್ಚಿರಿ
ky: $modalRouteContentName жабуу
lo: ປິດ $modalRouteContentName
mn: $modalRouteContentName-г хаах
my: $modalRouteContentName ပိတ်ရန်
ne: $modalRouteContentName बन्द गर्नुहोस्
or: $modalRouteContentNameକୁ ବନ୍ଦ କରନ୍ତୁ
pa: $modalRouteContentName ਨੂੰ ਬੰਦ ਕਰੋ
ro: Închideți $modalRouteContentName
si: $modalRouteContentName වසන්න
sr_latn: Zatvori: $modalRouteContentName
sw: Funga $modalRouteContentName
ta: $modalRouteContentName ஐ மூடுக
te: $modalRouteContentName‌ను మూసివేయండి
ug: $modalRouteContentName نى يېپىش
ur: $modalRouteContentName بند کریں
uz: Yopish: $modalRouteContentName
zu: Vala i-$modalRouteContentName

# expansionTileExpandedHint
source: double tap to collapse
am: ለመሰብሰብ ሁለቴ መታ ያድርጉ
ar: يُرجى النقر مرّتين للتصغير.
as: সংকোচন কৰিবলৈ দুবাৰ টিপক
az: yığcamlaşdırmaq üçün iki dəfə toxunun
bn: আড়াল করতে ডবল ট্যাপ করুন
ckb: تکایە دوو جار کلیک بکە بۆ بچووککردنەوە
gu: નાની કરવા માટે બે વાર ટૅપ કરો
hi: छोटा करने के लिए दो बार टैप करें
hy: կրկնակի հպեք ծալելու համար
kk: жию үшін екі рет түртіңіз
km: ចុចពីរដង ដើម្បីបង្រួម
kn: ಕುಗ್ಗಿಸಲು ಡಬಲ್ ಟ್ಯಾಪ್ ಮಾಡಿ
ky: жыйыштыруу үчүн эки жолу таптаңыз
lo: ແຕະສອງເທື່ອເພື່ອຫຍໍ້ລົງ
mn: хураахын тулд хоёр товшино уу
my: ခေါက်ရန် နှစ်ချက်တို့ပါ
ne: कोल्याप्स गर्न डबल ट्याप गर्नुहोस्
or: ସଙ୍କୁଚିତ କରିବା ପାଇଁ ଦୁଇଥର ଟାପ କରନ୍ତୁ
pa: ਸਮੇਟਣ ਲਈ ਡਬਲ ਟੈਪ ਕਰੋ
ro: atingeți de două ori pentru a restrânge
si: හැකිළවීමට දෙවරක් තට්ටු කරන්න
sr_latn: dvaput dodirnite da biste skupili
sw: gusa mara mbili ili ukunje
ta: சுருக்க இருமுறை தட்டவும்
te: కుదించడానికి డబుల్ ట్యాప్ చేయండి
ug: يىغىش ئۈچۈن قوش چېكىڭ
ur: سکیڑنے کے لیے دوبار تھپتھپائیں
uz: yigʻish uchun ikki marta bosing
zu: thepha kabili ukuze ugoqe

# expansionTileCollapsedHint
source: double tap to expand
am: ለመዘርጋት ድርብ ሁለቴ መታ ያድርጉ
ar: انقر مرّتين للتوسيع
as: বিস্তাৰ কৰিবলৈ দুবাৰ টিপক
az: genişləndirmək üçün iki dəfə toxunun
bn: বড় করে দেখতে ডবল ট্যাপ করুন
ckb: دوو جار کلیک بکە بۆ فراوانکردن
gu: મોટી કરવા માટે બે વાર ટૅપ કરો
hi: बड़ा करने के लिए दो बार टैप करें
hy: կրկնակի հպեք ծավալելու համար
kk: жаю үшін екі рет түртіңіз
km: ចុចពីរដង ដើម្បីពង្រីក
kn: ವಿಸ್ತರಿಸಲು ಡಬಲ್ ಟ್ಯಾಪ್ ಮಾಡಿ
ky: жайып көрсөтүү үчүн эки жолу таптаңыз
lo: ແຕະສອງເທື່ອເພື່ອຂະຫຍາຍ
mn: дэлгэхийн тулд хоёр товшино уу
my: ဖြန့်ရန် နှစ်ချက်တို့ပါ
ne: एक्स्पान्ड गर्न डबल ट्याप गर्नुहोस्
or: ବିସ୍ତାର କରିବା ପାଇଁ ଦୁଇଥର ଟାପ କରନ୍ତୁ
pa: ਵਿਸਤਾਰ ਕਰਨ ਲਈ ਡਬਲ ਟੈਪ ਕਰੋ
ro: atingeți de două ori pentru a extinde
si: විහිදුවීමට දෙවරක් තට්ටු කරන්න
sr_latn: dvaput dodirnite da biste proširili
sw: gusa mara mbili ili upanue
ta: விரிவாக்க இருமுறை தட்டுங்கள்
te: విస్తరించడానికి డబుల్ ట్యాప్ చేయండి
ug: يېيىش ئۈچۈن قوش چېكىڭ
ur: پھیلانے کے لیے دوبار تھپتھپائیں
uz: yoyish uchun ikki marta bosing
zu: Thepha kabili ukuze unwebe

# expansionTileExpandedTapHint
source: Collapse
am: ሰብስብ
ar: تصغير
as: সংকোচন কৰক
az: Yığcamlaşdırın
bn: আড়াল করুন
ckb: بچووککردنەوە
gu: નાની કરો
hi: छोटा करें
hy: Ծալել
kk: Жию
km: បង្រួម
kn: ಕುಗ್ಗಿಸಿ
ky: Жыйыштыруу
lo: ຫຍໍ້ລົງ
mn: Хураах
my: ခေါက်ရန်
ne: कोल्याप्स गर्नुहोस्
or: ସଙ୍କୁଚିତ କରନ୍ତୁ
pa: ਸਮੇਟੋ
ro: Restrângeți
si: හකුළන්න
sr_latn: Skupite
sw: Kunja
ta: சுருக்கும்
te: కుదించండి
ug: يىغىش
ur: سکیڑیں
uz: Yigʻish
zu: Goqa

# expansionTileCollapsedTapHint
source: Expand for more details
am: ለተጨማሪ ዝርዝሮች ይዘርጉ
ar: وسِّع المربّع لعرض مزيد من التفاصيل.
as: অধিক সবিশেষ জানিবলৈ বিস্তাৰ কৰক
az: Daha çox detallar üçün genişləndirin
bn: আরও বিবরণ পেতে বড় করে দেখুন
ckb: فراوان بکەرەوە بۆ بینینی زیاتر وردەکاری
gu: વધુ વિગતો માટે મોટી કરો
hi: ज़्यादा जानकारी के लिए बड़ा करें
hy: ծավալեք՝ մանրամասները տեսնելու համար
kk: Толық мәлімет алу үшін жайыңыз.
km: ពង្រីក​ដើម្បីទទួលបាន​ព័ត៌មានលម្អិត​បន្ថែម
kn: ಇನ್ನಷ್ಟು ವಿವರಗಳಿಗಾಗಿ ವಿಸ್ತರಿಸಿ
ky: Толук маалымат алуу үчүн жайып көрүңүз
lo: ຂະຫຍາຍສຳລັບຂໍ້ມູນເພີ່ມເຕີມ
mn: Илүү дэлгэрэнгүй авах бол дэлгэнэ үү
my: အသေးစိတ်အတွက် ဖြန့်ရန်
ne: थप विवरण हेर्न एक्स्पान्ड गर्नुहोस्
or: ଅଧିକ ବିବରଣୀ ପାଇଁ ବିସ୍ତାର କରନ୍ତୁ
pa: ਹੋਰ ਵੇਰਵਿਆਂ ਲਈ ਵਿਸਤਾਰ ਕਰੋ
ro: Extindeți pentru mai multe detalii
si: වැඩි විස්තර සඳහා පුළුල් කරන්න
sr_latn: Proširite za još detalja
sw: Panua ili upate maelezo zaidi
ta: கூடுதல் விவரங்களுக்கு விரிவாக்கலாம்
te: మరిన్ని వివరాల కోసం విస్తరించండి
ug: تېخىمۇ كۆپ تەپسىلاتلار ئۈچۈن يېيىڭ
ur: مزید تفصیلات کے لیے پھیلائیں
uz: Batafsil koʻrish uchun yoying
zu: Nweba ukuze uthole imininingwane eyengeziwe
