Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/material_*.arb
Languages: am, ar, as, az, bn, bo, ckb, gu, hi, hy, kab, kk, km, kn, ky, lo, mi, mn, my, ne, or, pa, ro, si, sr_latn, sw, ta, te, tl, tw, ug, ur, uz, zu

# hideAccountsLabel
source: Hide accounts
am: መለያዎችን ደብቅ
ar: إخفاء الحسابات
as: একাউণ্টসমূহ লুকুৱাওক
az: Hesabları gizlədin
bn: অ্যাকাউন্টগুলি লুকান
bo: རྩིས་ཐོ་སྦས་སྐུང་བྱས་པ།
ckb: شاردنەوەی ئەکاونتەکان
gu: એકાઉન્ટ છુપાવો
hi: खाते छिपाएं
hy: Թաքցնել հաշիվները
kab: Iɣil n yiɣallen
kk: Аккаунттарды жасыру
km: លាក់គណនី
kn: ಖಾತೆಗಳನ್ನು ಮರೆಮಾಡಿ
ky: Аккаунттарды жашыруу
lo: ເຊື່ອງບັນຊີ
mi: Hunaia ngā pūkete
mn: Бүртгэлүүдийг нуух
my: အကောင့်များကို ဝှက်ရန်
ne: खाताहरू लुकाउनुहोस्
or: ଆକାଉଣ୍ଟଗୁଡ଼ିକୁ ଲୁଚାନ୍ତୁ
pa: ਖਾਤੇ ਲੁਕਾਓ
ro: Ascundeți conturile
si: ගිණුම් සඟවන්න
sr_latn: Sakrij naloge
sw: Ficha akaunti
ta: கணக்குகளை மறைக்கும்
te: ఖాతాలను దాచు
tl: Itago ang mga account
tw: Hintaw akonta
ug: ھېساباتنى يوشۇرۇش
ur: اکاؤنٹس چھپائیں
uz: Hisoblarni berkitish
zu: Fihla ama-akhawunti

# showAccountsLabel
source: Show accounts
am: መለያዎችን አሳይ
ar: إظهار الحسابات
as: একাউণ্টসমূহ দেখুৱাওক
az: Hesabları göstərin
bn: অ্যাকাউন্টগুলি দেখান
bo: ཐོ་ཁོངས་མཚོན་པ།
ckb: پیشاندانی ئەکاونتەکان
gu: એકાઉન્ટ બતાવો
hi: खाते दिखाएं
hy: Ցույց տալ հաշիվները
kab: Isken isefra
kk: Аккаунттарды көрсету
km: បង្ហាញគណនី
kn: ಖಾತೆಗಳನ್ನು ತೋರಿಸಿ
ky: Аккаунттарды көрсөтүү
lo: ສະແດງບັນຊີ
mi: Whakaaturia ngā pūkete
mn: Бүртгэлүүдийг харуулах
my: အကောင့်များကို ပြရန်
ne: खाताहरू देखाउनुहोस्
or: ଆକାଉଣ୍ଟ ଦେଖାନ୍ତୁ
pa: ਖਾਤੇ ਦਿਖਾਓ
ro: Afișați conturile
si: ගිණුම් පෙන්වන්න
sr_latn: Prikaži naloge
sw: Onyesha akaunti
ta: கணக்குகளைக் காட்டும்
te: ఖాతాలను చూపు
tl: Ipakita ang mga account
tw: Kyerɛw akontaabu
ug: ھېساباتنى كۆرسىتىش
ur: اکاؤنٹس دکھائیں
uz: Hisoblarni koʻrsatish
zu: Bonisa ama-akhawunti

# drawerLabel
source: Navigation menu
am: የዳሰሳ ምናሌ
ar: قائمة تنقل
as: নেভিগেশ্বন মেনু
az: Naviqasiya menyusu
bn: নেভিগেশান মেনু
bo: ཟས་ཐོ་ཕྱོགས་སྟོན་བྱེད་པ།
ckb: مێنووی گەڕان
gu: નૅવિગેશન મેનૂ
hi: नेविगेशन मेन्यू
hy: Նավիգացիայի ընտրացանկ
kab: Adlis n usebtar
kk: Навигация мәзірі
km: ម៉ឺនុយរុករក
kn: ನ್ಯಾವಿಗೇಶನ್‌ ಮೆನು
ky: Чабыттоо менюсу
lo: ເມນູນຳທາງ
mi: Tahua whakaterenga
mn: Навигацын цэс
my: လမ်းညွှန် မီနူး
ne: नेभिगेसन मेनु
or: ନେଭିଗେସନ୍ ମେନୁ
pa: ਨੈਵੀਗੇਸ਼ਨ ਮੀਨੂ
ro: Meniu de navigare
si: සංචාලන මෙනුව
sr_latn: Meni za navigaciju
sw: Menyu ya kusogeza
ta: வழிசெலுத்தல் மெனு
te: నావిగేషన్ మెనూ
tl: Menu ng navigation
tw: Nnansa a wɔde kɔ hɔ
ug: يېتەگلىگۈچى تىزىملىكى
ur: نیویگیشن مینیو
uz: Navigatsiya menyusi
zu: Imenyu yokuzulazula

# popupMenuLabel
source: Popup menu
am: የብቅ-ባይ ምናሌ
ar: قائمة منبثقة
as: পপআপ মেনু
az: Popap menyusu
bn: পপ-আপ মেনু
bo: ཟས་ཐོ་འཕེན་པ།
ckb: مێنووی پەنجەرەیی
gu: પૉપઅપ મેનૂ
hi: पॉपअप मेन्यू
hy: Ելնող ընտրացանկ
kab: Menu n usemmiḍ
kk: Қалқымалы терезе мәзірі
km: ​ម៉ឺនុយ​លោត​ឡើង
kn: ಪಾಪ್ಅಪ್ ಮೆನು
ky: Калкып чыгуучу меню
lo: ເມນູປັອບອັບ
mi: Tahua pakūake
mn: Попап цэс
my: ပေါ့ပ်အပ်မီနူး
ne: पपअप मेनु
or: ପପ୍-ଅପ୍ ମେନୁ
pa: ਪੌਪਅੱਪ ਮੀਨੂ
ro: Meniu pop-up
si: උත්පතන මෙනුව
sr_latn: Iskačući meni
sw: Menyu ibukizi
ta: பாப்-அப் மெனு
te: పాప్‌అప్ మెనూ
tl: Popup na menu
ug: سەكرىمە تىزىملىك
ur: پاپ اپ مینیو
uz: Pop-ap menyusi
zu: Imenyu ye-popup

# dialogLabel
source: Dialog
am: መገናኛ
ar: مربع حوار
as: ডায়লগ
az: Dialoq
bn: ডায়ালগ
bo: ཁ་བརྡ་བྱེད་པ།
ckb: دیالۆگ
gu: સંવાદ
hi: डायलॉग
hy: Երկխոսության պատուհան
kab: Ameslay
kk: Диалогтық терезе
km: ប្រអប់
kn: ಡೈಲಾಗ್
ky: Диалог
lo: ຂໍ້ຄວາມ
mi: Kōrero
mn: Харилцах цонх
my: ဒိုင်ယာလော့
ne: संवाद
or: ଡାୟଲଗ୍
pa: ਵਿੰਡੋ
ro: Casetă de dialog
si: සංවාදය
sr_latn: Dijalog
sw: Kidirisha
ta: உரையாடல்
te: డైలాగ్
tw: Ɔkasa
ug: دىئالوگ
ur: ڈائلاگ
uz: Muloqot oynasi
zu: Ingxoxo

# alertDialogLabel
source: Alert
am: ማንቂያ
ar: تنبيه
as: সতৰ্কবাৰ্তা
az: Bildiriş
bn: সতর্কতা
bo: ཉེན་བརྡ་གཏོང་བ།
ckb: ئاگاداری
gu: અલર્ટ
hi: अलर्ट
hy: Ծանուցում
kab: Alerta
kk: Дабыл
km: ជូនដំណឹង
kn: ಎಚ್ಚರಿಕೆ
ky: Эскертүү
lo: ການເຕືອນ
mi: Matohi
mn: Сэрэмжлүүлэг
my: သတိပေးချက်
ne: अलर्ट
or: ଆଲର୍ଟ
pa: ਅਲਰਟ
ro: Alertă
si: ඇඟවීම
sr_latn: Obaveštenje
sw: Arifa
ta: விழிப்பூட்டல்
te: అలర్ట్
tl: Alerto
tw: Ɛbɔ a Ɛbɔ no Hyɛ
ug: ئاگاھلاندۇرۇش
ur: الرٹ
uz: Ogohlantirish
zu: Isexwayiso

# searchFieldLabel
source: Search
am: ይፈልጉ
ar: بحث
as: সন্ধান কৰক
az: Axtarın
bn: খুঁজুন
bo: འཚོལ་ཞིབ་བྱེད་པ།
ckb: گەڕان
gu: શોધો
hi: खोजें
hy: Որոնել
kab: Aḥerḍ
kk: Іздеу
km: ស្វែងរក
kn: ಹುಡುಕಿ
ky: Издөө
lo: ຊອກຫາ
mi: Rapua
mn: Хайх
my: ရှာဖွေရန်
ne: खोज्नुहोस्
or: ସନ୍ଧାନ କରନ୍ତୁ
pa: ਖੋਜੋ
ro: Căutați
si: සෙවීම
sr_latn: Pretražite
sw: Tafuta
ta: தேடல்
te: వెతకండి
tl: Maghanap
tw: Hwehwɛ
ug: ئىزدەش
ur: تلاش
uz: Qidirish
zu: Sesha

# reorderItemToStart
source: Move to the start
am: ወደ መጀመሪያ ውሰድ
ar: نقل إلى بداية القائمة
as: আৰম্ভণিলৈ নিয়ক
az: Əvvələ köçürün
bn: চালু করতে সরান
bo: འགོ་འཛུགས་སར་སྤོ་དགོས།
ckb: بردن بۆ سەرەتای لیست
gu: પ્રારંભમાં ખસેડો
hi: शुरुआत पर ले जाएं
hy: Տեղափոխել սկիզբ
kab: Ad d-nebdu
kk: Басына өту
km: ផ្លាស់ទីទៅ​ចំណុច​ចាប់ផ្ដើម
kn: ಪ್ರಾರಂಭಕ್ಕೆ ಸರಿಸಿ
ky: Башына жылдыруу
lo: ຍ້າຍໄປເລີ່ມຕົ້ນ
mi: Nuku ki te tīmata
mn: Эхлэл рүү зөөх
my: အစသို့ ရွှေ့ရန်
ne: सुरुमा सार्नुहोस्
or: ଆରମ୍ଭକୁ ଯାଆନ୍ତୁ
pa: ਸ਼ੁਰੂ ਵਿੱਚ ਲਿਜਾਓ
ro: Mutați la început
si: ආරම්භය වෙත යන්න
sr_latn: Pomerite na početak
sw: Sogeza hadi mwanzo
ta: தொடக்கத்திற்கு நகர்த்தவும்
te: ప్రారంభానికి తరలించండి
tl: Ilipat sa simula
tw: Yɛkɔyɛ adwuma
ug: باشلىنىشقا يۆتكەش
ur: شروع میں منتقل کریں
uz: Boshiga siljitish
zu: Yisa ekuqaleni

# reorderItemToEnd
source: Move to the end
am: ወደ መጨረሻ ውሰድ
ar: نقل إلى نهاية القائمة
as: শেষলৈ নিয়ক
az: Sona köçürün
bn: একদম শেষের দিকে যান
bo: མཐར་ཐུག་གི་གནས་སུ་སྤོ་དགོས།
ckb: بردن بۆ کۆتایی لیست
gu: અંતમાં ખસેડો
hi: आखिर में ले जाएं
hy: Տեղափոխել վերջ
kab: Ruḥ ɣer tagara
kk: Соңына өту
km: ផ្លាស់ទីទៅ​ចំណុចបញ្ចប់
kn: ಕೊನೆಗೆ ಸರಿಸಿ
ky: Аягына жылдыруу
lo: ຍ້າຍໄປສິ້ນສຸດ
mi: Nuku ki te mutunga
mn: Төгсгөл рүү зөөх
my: အဆုံးသို့ ‌ရွှေ့ရန်
ne: अन्त्यमा जानुहोस्
or: ଶେଷକୁ ଯାଆନ୍ତୁ
pa: ਅੰਤ ਵਿੱਚ ਲਿਜਾਓ
ro: Mutați la sfârșit
si: අවසානයට යන්න
sr_latn: Pomerite na kraj
sw: Sogeza hadi mwisho
ta: இறுதிக்கு நகர்த்தவும்
te: చివరకు తరలించండి
tl: Ilipat sa dulo
tw: Kɔ awiei
ug: ئاخىرىغا يۆتكەش
ur: آخر میں منتقل کریں
uz: Oxiriga siljitish
zu: Yisa ekugcineni

# reorderItemUp
source: Move up
am: ወደ ላይ ውሰድ
ar: نقل لأعلى
as: ওপৰলৈ নিয়ক
az: Yuxarı köçürün
bn: উপরের দিকে সরান
bo: ཡར་འཕགས་པ།
ckb: بردن بۆ سەرەوە
gu: ઉપર ખસેડો
hi: ऊपर ले जाएं
hy: Տեղափոխել վերև
kab: Ruḥ ɣer deffir
kk: Жоғарыға жылжыту
km: ផ្លាស់ទី​ឡើង​លើ
kn: ಮೇಲೆ ಸರಿಸಿ
ky: Жогору жылдыруу
lo: ຍ້າຍຂຶ້ນ
mi: Nuku whakarunga
mn: Дээш зөөх
my: အပေါ်သို့ ရွှေ့ရန်
ne: माथि सार्नुहोस्
or: ଉପରକୁ ନିଅନ୍ତୁ
pa: ਉੱਪਰ ਲਿਜਾਓ
ro: Mutați în sus
si: ඉහළට ගෙන යන්න
sr_latn: Pomerite nagore
sw: Sogeza juu
ta: மேலே நகர்த்தவும்
te: పైకి జరపండి
tl: Ilipat pataas
tw: Monkɔ soro
ug: يۇقىرىغا يۆتكەش
ur: اوپر منتقل کریں
uz: Tepaga siljitish
zu: Iya phezulu

# reorderItemDown
source: Move down
am: ወደ ታች ውሰድ
ar: نقل لأسفل
as: তললৈ নিয়ক
az: Aşağı köçürün
bn: নিচের দিকে সরান
bo: མར་སྤོས་པ།
ckb: بردن بۆ خوارەوە
gu: નીચે ખસેડો
hi: नीचे ले जाएं
hy: Տեղափոխել ներքև
kab: Ruḥ ɣer lqaεa
kk: Төменге жылжыту
km: ផ្លាស់ទី​ចុះ​ក្រោម
kn: ಕೆಳಗೆ ಸರಿಸಿ
ky: Төмөн жылдыруу
lo: ຍ້າຍລົງ
mi: Nuku whakararo
mn: Доош зөөх
my: အောက်သို့ရွှေ့ရန်
ne: तल सार्नुहोस्
or: ତଳକୁ ଯାଆନ୍ତୁ
pa: ਹੇਠਾਂ ਲਿਜਾਓ
ro: Mutați în jos
si: පහළට ගෙන යන්න
sr_latn: Pomerite nadole
sw: Sogeza chini
ta: கீழே நகர்த்தவும்
te: కిందికు జరుపు
tl: Ilipat pababa
tw: Kɔ fam
ug: ئاستىغا يۆتكەش
ur: نیچے منتقل کریں
uz: Pastga siljitish
zu: Iya phansi

# reorderItemLeft
source: Move left
am: ወደ ግራ ውሰድ
ar: نقل لليمين
as: বাওঁফাললৈ স্থানান্তৰ কৰক
az: Sola köçürün
bn: বাঁদিকে সরান
bo: གཡོན་ཕྱོགས་སུ་གནས་སྤོ་བ།
ckb: بردن بۆ چەپ
gu: ડાબે ખસેડો
hi: बाएं ले जाएं
hy: Տեղափոխել ձախ
kab: Ruḥ ɣer tama tama tama tama tamaziɣt
kk: Солға жылжыту
km: ផ្លាស់ទី​ទៅ​ឆ្វេង
kn: ಎಡಕ್ಕೆ ಸರಿಸಿ
ky: Солго жылдыруу
lo: ຍ້າຍໄປຊ້າຍ
mi: Nuku whakatemauī
mn: Зүүн тийш зөөх
my: ဘယ်ဘက်သို့ရွှေ့ရန်
ne: बायाँ सार्नुहोस्
or: ବାମକୁ ଯାଆନ୍ତୁ
pa: ਖੱਬੇ ਲਿਜਾਓ
ro: Mutați la stânga
si: වමට ගෙන යන්න
sr_latn: Pomerite ulevo
sw: Sogeza kushoto
ta: இடப்புறம் நகர்த்தவும்
te: ఎడమవైపుగా జరపండి
tl: Ilipat pakaliwa
tw: Kɔ benkum
ug: سولغا يۆتكەش
ur: بائیں منتقل کریں
uz: Chapga siljitish
zu: Hambisa kwesokunxele

# reorderItemRight
source: Move right
am: ወደ ቀኝ ውሰድ
ar: نقل لليسار
as: সোঁফাললৈ নিয়ক
az: Sağa köçürün
bn: ডানদিকে সরান
bo: གཡས་ཕྱོགས་སུ་སྤོ་བ།
ckb: بردن بۆ ڕاست
gu: જમણે ખસેડો
hi: दाएं ले जाएं
hy: Տեղափոխել աջ
kab: Ruḥ ɣer tama n waman
kk: Оңға жылжыту
km: ផ្លាស់ទីទៅ​ស្តាំ
kn: ಬಲಕ್ಕೆ ಸರಿಸಿ
ky: Оңго жылдыруу
lo: ຍ້າຍໄປຂວາ
mi: Nuku whakatematau
mn: Баруун тийш зөөх
my: ညာဘက်သို့ရွှေ့ရန်
ne: दायाँ सार्नुहोस्
or: ଡାହାଣକୁ ଯାଆନ୍ତୁ
pa: ਸੱਜੇ ਲਿਜਾਓ
ro: Mutați la dreapta
si: දකුණට ගෙන යන්න
sr_latn: Pomerite udesno
sw: Sogeza kulia
ta: வலப்புறம் நகர்த்தவும்
te: కుడివైపుగా జరపండి
tl: Ilipat pakanan
tw: Fa wo nsa nifa
ug: ئوڭغا يۆتكەش
ur: دائیں منتقل کریں
uz: Oʻngga siljitish
zu: Yisa kwesokudla

# expandedIconTapHint
source: Collapse
am: ሰብስብ
ar: تصغير
as: সংকোচন কৰক
az: Yığcamlaşdırın
bn: আড়াল করুন
ckb: بچووککردنەوە
gu: સંકુચિત કરો
hi: छोटा करें
hy: Ծալել
kk: Жию
km: បង្រួម
kn: ಕುಗ್ಗಿಸಿ
ky: Жыйыштыруу
lo: ຫຍໍ້ເຂົ້າ
mn: Буулгах
my: လျှော့ပြရန်
ne: संक्षिप्त गर्नुहोस्
or: ସଙ୍କୁଚିତ କରନ୍ତୁ
pa: ਸਮੇਟੋ
ro: Restrângeți
si: හකුළන්න
sr_latn: Skupi
sw: Kunja
ta: சுருக்கும்
te: కుదించు
tl: I-collapse
ug: يىغىش
ur: سکیڑیں
uz: Kichraytirish
zu: Goqa

# collapsedIconTapHint
source: Expand
am: ዘርጋ
ar: توسيع
as: বিস্তাৰ কৰক
az: Genişləndirin
bn: বড় করুন
ckb: فراوانکردن
gu: વિસ્તૃત કરો
hi: बड़ा करें
hy: Ծավալել
kk: Жаю
km: ពង្រីក
kn: ವಿಸ್ತರಿಸಿ
ky: Жайып көрсөтүү
lo: ຂະຫຍາຍ
mn: Дэлгэх
my: ချဲ့ရန်
ne: विस्तार गर्नुहोस्
or: ପ୍ରସାରିତ କରନ୍ତୁ
pa: ਵਿਸਤਾਰ ਕਰੋ
ro: Extindeți
si: දිග හරින්න
sr_latn: Proširi
sw: Panua
ta: விரிக்கும்
te: విస్తరించు
tl: I-expand
ug: يېيىش
ur: پھیلائیں
uz: Yoyish
zu: Nweba

# remainingTextFieldCharacterCountOne
source: 1 character remaining
am: 1 ቁምፊ ይቀራል
ar: حرف واحد متبقٍ
as: ১ টা বর্ণসংখ্যা বাকী আছে
az: 1 simvol qalır
bn: আর ১টি অক্ষর লেখা যাবে
ckb: یەک پیت ماوە
gu: 1 અક્ષર બાકી
hi: एक वर्ण आैर डाला जा सकता है
hy: Մնացել է 1 նիշ
kk: 1 таңба қалды.
km: នៅសល់​ 1 តួ​ទៀត
kn: 1 ಅಕ್ಷರ ಉಳಿದಿದೆ
ky: 1 белги калды
lo: ຍັງອີກ 1 ຕົວອັກສອນ
mn: 1 тэмдэгт үлдсэн
my: အက္ခရာ ၁ လုံးကျန်သည်
ne: १ वर्ण बाँकी
or: 1ଟି ଅକ୍ଷର ବାକି ଅଛି
pa: 1 ਅੱਖਰ-ਚਿੰਨ੍ਹ ਬਾਕੀ
ro: un caracter rămas
si: අනුලකුණු 1ක් ඉතිරිය
sr_latn: Preostao je 1 znak
sw: Imesalia herufi 1
ta: 1 எழுத்து மீதமுள்ளது
te: 1 అక్షరం మిగిలి ఉంది
tl: 1 character ang natitira
ug: 1 ھەرپ-بەلگە قالدى
ur: 1 حرف باقی ہے
uz: 1 ta belgi qoldi
zu: 1 uhlamvu olusele

# remainingTextFieldCharacterCountOther
source: $remainingCount characters remaining
am: $remainingCount ቁምፊዎች ይቀራሉ
ar: $remainingCount حرف متبقٍ
as: $remainingCount টা বর্ণসংখ্যা বাকী আছে
az: $remainingCount simvol qalır
bn: আর $remainingCountটি অক্ষর লেখা যাবে
ckb: $remainingCount پیت ماوە
gu: $remainingCount અક્ષર બાકી
hi: $remainingCount वर्ण आैर डाले जा सकते हैं
hy: Մնացել է $remainingCount նիշ
kk: $remainingCount таңба қалды.
km: នៅសល់ $remainingCount តួ​ទៀត
kn: $remainingCount ಅಕ್ಷರಗಳು ಉಳಿದಿವೆ
ky: $remainingCount белги калды
lo: ຍັງອີກ $remainingCount ຕົວອັກສອນ
mn: $remainingCount тэмдэгт үлдсэн
my: အက္ခရာ $remainingCount လုံးကျန်သည်
ne: $remainingCount वर्णहरू बाँकी
or: $remainingCountଟି ଅକ୍ଷର ବାକି ଅଛି
pa: $remainingCount ਅੱਖਰ-ਚਿੰਨ੍ਹ ਬਾਕੀ
ro: $remainingCount de caractere rămase
si: අනුලකුණු $remainingCountක් ඉතිරිය
sr_latn: Preostalo je $remainingCount znakova
sw: Zimesalia herufi $remainingCount
ta: $remainingCount எழுத்துகள் மீதமுள்ளன
te: $remainingCount అక్షరాలు మిగిలి ఉన్నాయి
tl: $remainingCount na character ang natitira
ug: $remainingCount ھەرپ-بەلگە قالدى
ur: $remainingCount حروف باقی ہیں
uz: $remainingCount ta belgi qoldi
zu: $remainingCount izinhlamvu ezisele

# refreshIndicatorSemanticLabel
source: Refresh
am: አድስ
ar: إعادة تحميل
as: ৰিফ্ৰেশ্ব কৰক
az: Yeniləyin
bn: রিফ্রেশ করুন
bo: གསར་དུ་བཀྲུ་བ།
ckb: نوێکردنەوە
gu: રિફ્રેશ કરો
hi: रीफ़्रेश करें
hy: Թարմացնել
kab: Aḥersi
kk: Жаңарту
km: ផ្ទុកឡើងវិញ
kn: ರಿಫ್ರೆಶ್ ಮಾಡಿ
ky: Жаңыртуу
lo: ໂຫຼດຄືນໃໝ່
mi: Whakahou
mn: Сэргээх
my: ပြန်လည်စတင်ရန်
ne: पुनः ताजा गर्नुहोस्
or: ରିଫ୍ରେସ୍ କରନ୍ତୁ
pa: ਰਿਫ੍ਰੈਸ਼ ਕਰੋ
ro: Actualizați
si: නැවුම් කරන්න
sr_latn: Osveži
sw: Onyesha upya
ta: ரெஃப்ரெஷ் செய்யும்
te: రిఫ్రెష్ చేయండి
tl: Nagre-refresh
tw: Nnansa
ug: يېڭىلاش
ur: ریفریش کریں
uz: Yangilash
zu: Vuselela

# moreButtonTooltip
source: More
am: ተጨማሪ
ar: المزيد
as: অধিক
az: Daha çox
bn: আরও
bo: དེ་བས་ཀྱང་མང་
ckb: زیاتر
gu: વધુ
hi: ज़्यादा
hy: Այլ
kab: Aṭas n
kk: Жаю
km: ច្រើន​ទៀត
kn: ಇನ್ನಷ್ಟು
ky: Дагы
lo: ເພີ່ມເຕີມ
mi: Ētahi atu
mn: Бусад
my: နောက်ထပ်
ne: थप
or: ଅଧିକ
pa: ਹੋਰ
ro: Mai multe
si: තව
sr_latn: Još
sw: Zaidi
ta: மேலும்
te: మరిన్ని
tl: Higit Pa
tw: Nea Ɛsen Saa
ug: تېخىمۇ كۆپ
ur: مزید
uz: Yana
zu: Okuningi

# dateHelpText
source: mm/dd/yyyy
am: ወወ/ቀቀ/ዓዓዓዓ
ar: yyyy/mm/dd
az: aa.gg.iiii
bn: dd/mm/yyyy
bo: ཉི་ཟླ་ཟླ་བ་གཅིག་ལ་ཞལ་ཞལ་མ་ཞལ་ཞལ་རེད།
ckb: ساڵ/مانگ/ڕۆژ
gu: dd/mm/yyyy
hi: dd/mm/yyyy
hy: օօ.աա.տտտտ
kab: dd/mm/yyyyyy
kk: кк.аа.жжжж
km: ថ្ងៃ/ខែ/ឆ្នាំ
ky: кк.аа.жжжж
lo: ດດ/ວວ/ປປປປ
mi: dd/mm/yyyy
mn: жжжж.сс.өө
my: dd-mm-yyyy
ne: yyyy/mm/dd
ro: zz.ll.aaaa
sr_latn: dd.mm.gggg.
sw: dd/mm/yyyy
tw: dd/mm/yyyy
ug: dd-mm-yyyy
ur: dd/mm/yyyy

# selectYearSemanticsLabel
source: Select year
am: ዓመት ይምረጡ
ar: اختيار العام
as: বছৰ বাছনি কৰক
az: İl seçin
bn: বছর বেছে নিন
bo: ལོ་སྐལ་འདེམས་པ།
ckb: هەڵبژاردنی ساڵ
gu: વર્ષ પસંદ કરો
hi: साल चुनें
hy: Ընտրել տարին
kab: Aseggas yettwafren
kk: Жылды таңдау
km: ជ្រើសរើសឆ្នាំ
kn: ವರ್ಷವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Жылды тандоо
lo: ເລືອກ​ປີ
mi: Tīpako Tau
mn: Жил сонгох
my: ခုနှစ် ရွေးရန်
ne: वर्ष छान्नुहोस्
or: ବର୍ଷ ଚୟନ କରନ୍ତୁ
pa: ਸਾਲ ਚੁਣੋ
ro: Selectați anul
si: වර්ෂය තෝරන්න
sr_latn: Izaberite godinu
sw: Chagua mwaka
ta: ஆண்டைத் தேர்ந்தெடுக்கவும்
te: సంవత్సరాన్ని ఎంచుకోండి
tl: Pumili ng taon
tw: Afe a wɔpaw no
ug: يىل تاللاش
ur: سال منتخب کریں
uz: Yilni tanlang
zu: Khetha unyaka

# unspecifiedDate
source: Date
am: ቀን
ar: التاريخ
as: তাৰিখ
az: Tarix
bn: তারিখ
bo: དམིགས་འཛུགས་བྱས་མེད་པའི་དུས་ཚོད།
ckb: بەروار
gu: તારીખ
hi: तारीख
hy: Ամսաթիվ
kab: Ass ur yettwasemmi
kk: Күн
km: កាលបរិច្ឆេទ
kn: ದಿನಾಂಕ
ky: Күн
lo: ວັນທີ
mi: Rā kāore i whakapūtātia
mn: Огноо
my: ရက်စွဲ
ne: मिति
or: ତାରିଖ
pa: ਤਾਰੀਖ
ro: Data
si: දිනය
sr_latn: Datum
sw: Tarehe
ta: தேதி
te: తేదీ
tl: Petsa
tw: Da a wɔnkyerɛw
ug: چېسلا
ur: تاریخ
uz: Sana
zu: Idethi

# unspecifiedDateRange
source: Date Range
am: የቀኖች ርዝመት
ar: النطاق الزمني
as: তাৰিখৰ পৰিসৰ
az: Tarix aralığı
bn: তারিখের ব্যাপ্তি
bo: དུས་ཚོད་ཀྱི་ཁྱབ་ཁོངས་དམིགས་འཛུགས་མ་བྱས་པ།
ckb: مەودای بەروار
gu: તારીખ રેંજ
hi: तारीख की सीमा
hy: Ժամանակահատված
kab: Taɣawsa n yiseggasen ur yettwasemmi ara
kk: Күндер ауқымы
km: ចន្លោះ​កាលបរិច្ឆេទ
kn: ದಿನಾಂಕ ವ್ಯಾಪ್ತಿ
ky: Даталар диапазону
lo: ຊ່ວງວັນທີ
mi: Awhe rā kāore i whakapūtātia
mn: Хугацааны интервал
my: ရက်အပိုင်းအခြား
ne: मितिको दायरा
or: ତାରିଖ ସୀମା
pa: ਤਾਰੀਖ ਦੀ ਰੇਂਜ
ro: Interval de date
si: දින පරාසය
sr_latn: Period
sw: Kipindi
ta: தேதி வரம்பு
te: తేదీల పరిధి
tl: Hanay ng Petsa
tw: Da a wɔammɔ ho asɛm
ug: چېسلا دائىرىسى
ur: تاریخ کی حد
uz: Sana oraligʻi
zu: Ibanga ledethi

# dateInputLabel
source: Enter Date
am: ቀን ያስገቡ
ar: إدخال التاريخ
as: তাৰিখ দিয়ক
az: Tarix daxil edin
bn: তারিখ লিখুন
bo: ནང་འདྲེན་བྱས་པའི་ཚེས་གྲངས།
ckb: تێخستنی بەروار
gu: તારીખ દાખલ કરો
hi: तारीख डालें
hy: Մուտքագրել ամսաթիվ
kab: Ad d-ssekcem
kk: Күнді енгізу
km: បញ្ចូល​កាលបរិច្ឆេទ
kn: ದಿನಾಂಕ ನಮೂದಿಸಿ
ky: Күндү киргизүү
lo: ໃສ່ວັນທີ
mi: Tāuru Rā
mn: Огноо оруулах
my: ရက်စွဲ ထည့်ရန်
ne: मिति प्रविष्टि गर्नुहोस्
or: ତାରିଖ ଲେଖନ୍ତୁ
pa: ਤਾਰੀਖ ਦਾਖਲ ਕਰੋ
ro: Introduceți data
si: දිනය ඇතුළු කරන්න
sr_latn: Unesite datum
sw: Weka Tarehe
ta: தேதியை உள்ளிடுக
te: తేదీని ఎంటర్ చేయండి
tl: Ilagay ang Petsa
tw: Fa Da no hyɛ mu
ug: چېسلا كىرگۈزۈش
ur: تاریخ درج کریں
uz: Sanani kiriting
zu: Faka idethi

# dateRangeStartLabel
source: Start Date
am: የመጀመሪያ ቀን
ar: تاريخ البدء
as: আৰম্ভণিৰ তাৰিখ
az: Başlama tarixi
bn: শুরুর তারিখ
bo: འགོ་ཚུགས་པའི་ཚེས་གྲངས།
ckb: بەرواری دەستپێک
gu: શરૂ કરવાની તારીખ
hi: पेमेंट करने की तारीख
hy: Մեկնարկի ամսաթիվը
kab: Taɣmi n tebda
kk: Басталу күні
km: កាលបរិច្ឆេទ​ចាប់ផ្ដើម
kn: ಪ್ರಾರಂಭ ದಿನಾಂಕ
ky: Баштоо күнү
lo: ວັນທີເລີ່ມຕົ້ນ
mi: Rā tīmata
mn: Эхлэх огноо
my: စတင်သည့် ရက်စွဲ
ne: सुरु हुने मिति
or: ଆରମ୍ଭ ତାରିଖ
pa: ਸ਼ੁਰੂਆਤੀ ਤਾਰੀਖ
ro: Data de începere
si: ආරම්භක දිනය
sr_latn: Datum početka
sw: Tarehe ya Kuanza
ta: தொடங்கும் தேதி
te: ప్రారంభ తేదీ
tl: Petsa ng Pagsisimula
tw: Da a Wɔfi Ase
ug: باشلىنىش ۋاقتى
ur: تاریخ آغاز
uz: Boshlanish sanasi
zu: Idethi yokuqala

# dateRangeEndLabel
source: End Date
am: የመጨረሻ ቀን
ar: تاريخ الانتهاء
as: সমাপ্তিৰ তাৰিখ
az: Bitmə tarixi
bn: শেষ হওয়ার তারিখ
bo: མཇུག་བསྒྲིལ་བའི་ཚེས་གྲངས།
ckb: بەرواری کۆتایی
gu: સમાપ્તિની તારીખ
hi: खत्म होने की तारीख
hy: Ավարտի ամսաթիվը
kab: Taggara n umennuɣ
kk: Аяқталу күні
km: កាលបរិច្ឆេទ​បញ្ចប់
kn: ಅಂತಿಮ ದಿನಾಂಕ
ky: Качан аяктайт
lo: ວັນທີສິ້ນສຸດ
mi: Rā mutunga
mn: Дуусах огноо
my: ပြီးဆုံးရက်စွဲ
ne: समाप्त हुने मिति
or: ଶେଷ ତାରିଖ
pa: ਸਮਾਪਤੀ ਦੀ ਤਾਰੀਖ
ro: Data de încheiere
si: අවසන් වන දිනය
sr_latn: Datum završetka
sw: Tarehe ya Kumalizika
ta: முடிவுத் தேதி
te: ముగింపు తేదీ
tl: Petsa ng Pagtatapos
tw: Awiei Da
ug: ئاخىرلىشىش ۋاقتى
ur: تاریخ اختتام
uz: Tugash sanasi
zu: Idethi yokugcina

# dateRangeStartDateSemanticLabel
source: Start date $fullDate
am: የመጀመሪያ ቀን $fullDate
ar: تاريخ البدء $fullDate
as: আৰম্ভণিৰ তাৰিখ $fullDate
az: Başlama tarixi: $fullDate
bn: শুরুর তারিখ $fullDate
ckb: بەرواری دەستپێک $fullDate
gu: શરૂ કરવાની તારીખ $fullDate
hi: शुरू होने की तारीख $fullDate
hy: Մեկնարկի ամսաթիվը՝ $fullDate
kab: Taɣra n tebda $formattedDate
kk: Басталу күні $fullDate
km: កាលបរិច្ឆេទ​ចាប់ផ្ដើម $fullDate
kn: ಪ್ರಾರಂಭ ದಿನಾಂಕ $fullDate
ky: Баштоо күнү $fullDate
lo: ວັນທີເລີ່ມຕົ້ນ $fullDate
mn: Эхлэх огноо $fullDate
my: စတင်သည့် ရက်စွဲ $fullDate
ne: सुरु हुने मिति $fullDate
or: ଆରମ୍ଭ ତାରିଖ $fullDate
pa: ਸ਼ੁਰੂਆਤੀ ਤਾਰੀਖ $fullDate
ro: Data de începere: $fullDate
si: ආරම්භක දිනය $fullDate
sr_latn: Datum početka: $fullDate
sw: Tarehe ya kuanza $fullDate
ta: தொடங்கும் தேதி $fullDate
te: ప్రారంభ తేదీ $fullDate
tl: Petsa ng pagsisimula $fullDate
tw: Mfiase da $formattedDate
ug: باشلىنىش ۋاقتى fullDate$
ur: تاریخ آغاز $fullDate
uz: Boshlanish sanasi: $fullDate
zu: Idethi yokuqala umhla ka-$fullDate

# dateRangeEndDateSemanticLabel
source: End date $fullDate
am: የማብቂያ ቀን $fullDate
ar: تاريخ الانتهاء $fullDate
as: সমাপ্তিৰ তাৰিখ $fullDate
az: Bitmə tarixi: $fullDate
bn: শেষ হওয়ার তারিখ $fullDate
ckb: بەرواری کۆتایی $fullDate
gu: સમાપ્તિની તારીખ $fullDate
hi: खत्म होने की तारीख $fullDate
hy: Ավարտի ամսաթիվը՝ $fullDate
kab: Taɣra n taggara $formattedDate
kk: Аяқталу күні $fullDate
km: កាលបរិច្ឆេទ​បញ្ចប់ $fullDate
kn: ಮುಕ್ತಾಯ ದಿನಾಂಕ $fullDate
ky: Качан аяктайт $fullDate
lo: ວັນທີສິ້ນສຸດ $fullDate
mn: Дуусах огноо $fullDate
my: ပြီးဆုံးရက်စွဲ $fullDate
ne: समाप्त हुने मिति $fullDate
or: ଶେଷ ତାରିଖ $fullDate
pa: ਸਮਾਪਤੀ ਦੀ ਤਾਰੀਖ $fullDate
ro: Data de încheiere: $fullDate
si: අවසන් වන දිනය $fullDate
sr_latn: Datum završetka: $fullDate
sw: Tarehe ya kumalizika $fullDate
ta: முடிவுத் தேதி $fullDate
te: ముగింపు తేదీ $fullDate
tl: Petsa ng pagtatapos $fullDate
tw: Awiei Da $formattedDate
ug: ئاخىرلىشىش ۋاقتى fullDate$
ur: تاریخ اختتام $fullDate
uz: Tugash sanasi: $fullDate
zu: Idethi yokuphela umhla ka-$fullDate

# invalidDateFormatLabel
source: Invalid format.
am: ልክ ያልሆነ ቅርጸት።
ar: التنسيق غير صالح.
as: অমান্য ফৰ্মেট।
az: Yanlış format.
bn: ভুল ফর্ম্যাট।
bo: ཚེས་གྲངས་ཀྱི་རྣམ་གཞག་ལ་ནུས་པ་མེད།
ckb: فۆرماتەکە هەڵەیە
gu: અમાન્ય ફોર્મેટ.
hi: अमान्य फ़ॉर्मैट.
hy: Ձևաչափն անվավեր է։
kab: Format n useggas ur yettwaḥseb ara
kk: Формат жарамсыз.
km: ទម្រង់មិន​ត្រឹមត្រូវទេ។
kn: ಅಮಾನ್ಯವಾದ ಫಾರ್ಮ್ಯಾಟ್.
ky: Туура эмес формат.
lo: ຮູບແບບບໍ່ຖືກຕ້ອງ.
mi: Hōputu rā muhu
mn: Буруу формат байна.
my: ဖော်မက် မမှန်ကန်ပါ။
ne: अवैध ढाँचा।
or: ଅବୈଧ ଫର୍ମାଟ୍।
pa: ਅਵੈਧ ਫਾਰਮੈਟ।
ro: Format nevalid.
si: අවලංගු ආකෘතියකි.
sr_latn: Format je nevažeći.
sw: Muundo si sahihi.
ta: தவறான வடிவம்.
te: ఫార్మాట్ చెల్లదు.
tl: Invalid ang format.
tw: Da a enni nnyinaso
ug: فورمات ئىناۋەتسىز.
ur: غلط فارمیٹ۔
uz: Yaroqsiz format.
zu: Ifomethi engavumelekile.

# invalidDateRangeLabel
source: Invalid range.
am: ልክ ያልኾነ ክልል።
ar: النطاق غير صالح.
as: অমান্য পৰিসৰ।
az: Yanlış aralıq.
bn: তারিখ সঠিক নয়।
bo: ཚེས་གྲངས་ཀྱི་ཁྱབ་ཁོངས་རྩིས་འགྲོ་མེད།
ckb: مەوداکە هەڵەیە
gu: અમાન્ય રેંજ.
hi: तारीख की अमान्य सीमा.
hy: Ժամանակահատվածն անվավեր է:
kab: Taɣawsa n yiseggasen
kk: Ауқым жарамсыз.
km: ចន្លោះ​មិនត្រឹមត្រូវទេ។
kn: ಅಮಾನ್ಯ ಶ್ರೇಣಿ.
ky: Жараксыз диапазон.
lo: ໄລຍະບໍ່ຖືກຕ້ອງ.
mi: Awhe rā muhu
mn: Буруу интервал байна.
my: အပိုင်းအခြား မမှန်ပါ။
ne: अवैध दायरा।
or: ଅବୈଧ ସୀମା।
pa: ਅਵੈਧ ਰੇਂਜ।
ro: Interval nevalid.
si: අවලංගු පරාසයකි.
sr_latn: Period je nevažeći.
sw: Kipindi si sahihi.
ta: தவறான வரம்பு.
te: పరిధి చెల్లదు.
tl: Invalid ang hanay.
tw: Da a enni hɔ
ug: دائىرە ئىناۋەتسىز.
ur: غلط رینج۔
uz: Yaroqsiz oraliq.
zu: Ibanga elingavumelekile.

# dateOutOfRangeLabel
source: Out of range.
am: ከክልል ውጭ።
ar: التاريخ خارج النطاق.
as: পৰিসৰৰ বাহিৰত।
az: Aralıqdan kənar.
bn: তারিখের ব্যাপ্তির বাইরে।
bo: ཚེས་གྲངས་ཁྱབ་ཁོངས་ལས་བརྒལ་བ།
ckb: بەروارەکە لە دەرەوەی مەوداکەیە
gu: રેંજમાં નથી.
hi: सीमा से ज़्यादा.
hy: Թույլատրելի ընդգրկույթից դուրս է։
kab: Taɣmis n usebter
kk: Ауқымнан тыc.
km: ក្រៅចន្លោះ។
kn: ವ್ಯಾಪ್ತಿಯ ಹೊರಗಿದೆ
ky: Аракет чегинен тышкары.
lo: ຢູ່ນອກໄລຍະ.
mi: Rā i waho i te awhe
mn: Интервалаас гадуур байна.
my: အပိုင်းအခြား ပြင်ပတွင်ဖြစ်နေသည်။
ne: दायराभन्दा बाहिर
or: ସୀମା ବାହାରେ।
pa: ਰੇਂਜ-ਤੋਂ-ਬਾਹਰ।
ro: Fără acoperire.
si: පරාසයෙන් පිටත.
sr_latn: Izvan perioda.
sw: Umechagua tarehe iliyo nje ya kipindi.
ta: வரம்பிற்கு வெளியே உள்ளது.
te: పరిధి వెలుపల ఉంది.
tl: Wala sa hanay.
tw: Da a wɔrentumi nyɛ adwuma
ug: دائىرىدىن چىقىپ كەتتى
ur: حد سے باہر۔
uz: Diapazondan tashqarida.
zu: Ikude kubanga.

# saveButtonLabel
source: Save
am: አስቀምጥ
ar: الحفظ
as: ছেভ কৰক
az: Yadda saxlayın
bn: সেভ করুন
bo: སྐྱོབ་ཐབས་བྱ་དགོས།
ckb: پاشەکەوتکردن
gu: સાચવો
hi: सेव करें
hy: Պահել
kab: Sellek
kk: Сақтау
km: រក្សាទុក
kn: ಸೇವ್ ಮಾಡಿ
ky: Сактоо
lo: ບັນທຶກ
mi: Tiaki
mn: Хадгалах
my: သိမ်းရန်
ne: सेभ गर्नुहोस्
or: ସେଭ କରନ୍ତୁ
pa: ਰੱਖਿਅਤ ਕਰੋ
ro: Salvați
si: සුරකින්න
sr_latn: Sačuvaj
sw: Hifadhi
ta: சேமி
te: సేవ్ చేయండి
tl: I-SAVE
tw: Fa no
ug: ساقلاش
ur: محفوظ کریں
uz: Saqlash
zu: Londoloza

# datePickerHelpText
source: Select date
am: ቀን ይምረጡ
ar: اختيار التاريخ
as: তাৰিখ বাছনি কৰক
az: Tarix seçin
bn: তারিখ বেছে নিন
bo: འདེམས་པའི་དུས་ཚོད།
ckb: هەڵبژاردنی بەروار
gu: તારીખ પસંદ કરો
hi: तारीख चुनें
hy: Ընտրեք ամսաթիվը
kab: Ad d-tefremt aseggwas
kk: Күнді таңдау
km: ជ្រើសរើស​កាល​បរិច្ឆេទ
kn: ದಿನಾಂಕವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Күндү тандоо
lo: ເລືອກວັນທີ
mi: Tīpako rā
mn: Огноо сонгох
my: ရက်စွဲရွေးရန်
ne: मिति चयन गर्नुहोस्
or: ତାରିଖ ଚୟନ କରନ୍ତୁ
pa: ਤਾਰੀਖ ਚੁਣੋ
ro: Selectați data
si: දිනය තෝරන්න
sr_latn: Izaberite datum
sw: Chagua tarehe
ta: தேதியைத் தேர்வுசெய்க
te: తేదీ ఎంచుకోండి
tl: PUMILI NG PETSA
tw: Fa da a wɔpaw no
ug: چېسلا تاللاش
ur: تاریخ منتخب کریں
uz: Sanani tanlang
zu: Khetha usuku

# dateRangePickerHelpText
source: Select range
am: ክልል ይምረጡ
ar: اختيار النطاق
as: পৰিসৰ বাছনি কৰক
az: Aralıq seçin
bn: তারিখের রেঞ্জ বেছে নিন
bo: གདམ་གསེས་བྱེད་ཁོངས།
ckb: هەڵبژاردنی مەودا
gu: રેંજ પસંદ કરો
hi: रेंज चुनें
hy: Ընտրեք ժամանակահատվածը
kab: IWELQEN
kk: Аралықты таңдау
km: ជ្រើសរើសចន្លោះ
kn: ದಿನಾಂಕದ ವ್ಯಾಪ್ತಿಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Даталар диапазонун тандоо
lo: ເລືອກໄລຍະ
mi: TĪPAKO AWHE
mn: Хугацааны интервал сонгох
my: အပိုင်းအခြားရွေးရန်
ne: मितिको दायरा चयन गर्नुहोस्
or: ରେଞ୍ଜ ଚୟନ କରନ୍ତୁ
pa: ਰੇਂਜ ਚੁਣੋ
ro: Selectați intervalul
si: පරාසය තෝරන්න
sr_latn: Izaberite period
sw: Chagua kipindi
ta: வரம்பைத் தேர்ந்தெடுக்கவும்
te: పరిధిని ఎంచుకోండి
tl: PUMILI NG HANAY
tw: SƐ WƆHWƐ ƆWƐN
ug: دائىرە تاللاش
ur: حد منتخب کریں
uz: Oraliqni tanlang
zu: Khetha Ibanga
