Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/material_*.arb
Languages: am, ar, as, az, bn, bo, ckb, gu, hi, hy, kab, kk, km, kn, ky, lo, mi, mn, my, ne, or, pa, ro, si, sr_latn, sw, ta, te, tl, tw, ug, ur, uz, zu

# timeOfDayFormat
source: h:mm a
am: H:mm
as: H:mm
az: H:mm
bn: H:mm
bo: HH:mm
gu: H:mm
hy: H:mm
kab: HH:mm
kk: H:mm
kn: H:mm
ky: H:mm
lo: H:mm
mi: HH:mm
mn: HH:mm
my: H:mm
ne: H:mm
or: H:mm
pa: H:mm
ro: HH:mm
si: H:mm
sr_latn: HH:mm
te: H:mm
tl: HH:mm
tw: HH:mm
ug: HH:mm
uz: H:mm
zu: H:mm

# openAppDrawerTooltip
source: Open navigation menu
am: የዳሰሳ ምናሌን ክፈት
ar: فتح قائمة التنقل
as: নেভিগেশ্বন মেনু খোলক
az: Naviqasiya menyusunu açın
bn: নেভিগেশন মেনু খুলুন
bo: ཕྱོགས་སྟོན་གྱི་ཟས་ཐོ་ཕྱེ་བ།
ckb: کردنەوەی مێنووی گەڕان
gu: નૅવિગેશન મેનૂ ખોલો
hi: नेविगेशन मेन्यू खोलें
hy: Բացել նավիգացիայի ընտրացանկը
kab: Adlis n usebtar
kk: Навигация мәзірін ашу
km: បើក​ម៉ឺនុយរុករក
kn: ನ್ಯಾವಿಗೇಶನ್‌ ಮೆನು ತೆರೆಯಿರಿ
ky: Чабыттоо менюсун ачуу
lo: ເປີດເມນູການນຳທາງ
mi: Whakatuwheratia te tahua whakaterenga
mn: Навигацын цэсийг нээх
my: လမ်းညွှန်မီနူးကို ဖွင့်ရန်
ne: नेभिगेसन मेनु खोल्नुहोस्
or: ନାଭିଗେସନ୍ ମେନୁ ଖୋଲନ୍ତୁ
pa: ਨੈਵੀਗੇਸ਼ਨ ਮੀਨੂ ਖੋਲ੍ਹੋ
ro: Deschideți meniul de navigare
si: සංචාලන මෙනුව විවෘත කරන්න
sr_latn: Otvorite meni za navigaciju
sw: Fungua menyu ya kusogeza
ta: வழிசெலுத்தல் மெனுவைத் திற
te: నావిగేషన్ మెనూను తెరువు
tl: Buksan ang menu ng navigation
tw: Nantew a wobɛtumi akɔfa
ug: يېتەكچى تىزىملىكىنى ئېچىىش
ur: نیویگیشن مینیو کھولیں
uz: Navigatsiya menyusini ochish
zu: Vula imenyu yokuzulazula

# backButtonTooltip
source: Back
am: ተመለስ
ar: رجوع
as: উভতি যাওক
az: Geri
bn: ফিরে যান
bo: ཕྱིར་ལོག་པ།
ckb: گەڕانەوە
gu: પાછળ
hi: वापस जाएं
hy: Հետ
kab: Uɣal
kk: Артқа
km: ថយក្រោយ
kn: ಹಿಂತಿರುಗಿ
ky: Артка
lo: ກັບຄືນ
mi: Whakamuri
mn: Буцах
my: နောက်သို့
ne: पछाडि जानुहोस्
or: ପଛକୁ ଫେରନ୍ତୁ
pa: ਪਿੱਛੇ
ro: Înapoi
si: ආපසු
sr_latn: Nazad
sw: Rudi Nyuma
ta: முந்தைய பக்கம்
te: వెనుకకు
tl: Bumalik
tw: Yɛsan kɔ
ug: قايتىش
ur: پیچھے
uz: Orqaga
zu: Emuva

# closeButtonTooltip
source: Close
am: ዝጋ
ar: إغلاق
as: বন্ধ কৰক
az: Bağlayın
bn: বন্ধ করুন
bo: སྒོ་རྒྱག་པ།
ckb: داخستن
gu: બંધ કરો
hi: बंद करें
hy: Փակել
kab: Yeqqer
kk: Жабу
km: បិទ
kn: ಮುಚ್ಚಿರಿ
ky: Жабуу
lo: ປິດ
mi: Katia
mn: Хаах
my: ပိတ်ရန်
ne: बन्द गर्नुहोस्
or: ବନ୍ଦ କରନ୍ତୁ
pa: ਬੰਦ ਕਰੋ
ro: Închideți
si: වසන්න
sr_latn: Zatvorite
sw: Funga
ta: மூடுக
te: మూసివేయండి
tl: Isara
tw: Ɛbɛn
ug: يېپىش
ur: بند کریں
uz: Yopish
zu: Vala

# deleteButtonTooltip
source: Delete
am: ሰርዝ
ar: حذف
as: মচক
az: Silin
bn: মুছে দিন
bo: སུབ་དགོས།
ckb: سڕینەوە
gu: ડિલીટ કરો
hi: मिटाएं
hy: Ջնջել
kab: Sseffɣen
kk: Жою
km: លុប
kn: ಅಳಿಸಿ
ky: Жок кылуу
lo: ລຶບ
mi: Whakakore
mn: Устгах
my: ဖျက်ရန်
ne: मेट्नुहोस्
or: ଡିଲିଟ୍ କରନ୍ତୁ
pa: ਮਿਟਾਓ
ro: Ștergeți
si: මකන්න
sr_latn: Izbrišite
sw: Futa
ta: நீக்கு
te: తొలగించండి
tl: I-delete
tw: Sɛe
ug: ئۆچۈرۈش
ur: حذف کریں
uz: Olib tashlash
zu: Susa

# nextMonthTooltip
source: Next month
am: ቀጣይ ወር
ar: الشهر التالي
as: পৰৱৰ্তী মাহ
az: Növbəti ay
bn: পরের মাস
bo: ཟླ་བ་རྗེས་མར།
ckb: مانگی داهاتوو
gu: આગલો મહિનો
hi: अगला महीना
hy: Հաջորդ ամիս
kab: Aseggas i d-iteddun
kk: Келесі ай
km: ខែ​​ក្រោយ
kn: ಮುಂದಿನ ತಿಂಗಳು
ky: Кийинки ай
lo: ເດືອນໜ້າ
mi: A tērā marama
mn: Дараах сар
my: နောက်လ
ne: अर्को महिना
or: ପରବର୍ତ୍ତୀ ମାସ
pa: ਅਗਲਾ ਮਹੀਨਾ
ro: Luna viitoare
si: ඊළඟ මාසය
sr_latn: Sledeći mesec
sw: Mwezi ujao
ta: அடுத்த மாதம்
te: తర్వాత నెల
tl: Susunod na buwan
tw: Bosome a edi hɔ
ug: كېيىنكى ئاي
ur: اگلا مہینہ
uz: Keyingi oy
zu: Inyanga ezayo

# previousMonthTooltip
source: Previous month
am: ቀዳሚ ወር
ar: الشهر السابق
as: পূৰ্বৱৰ্তী মাহ
az: Keçən ay
bn: আগের মাস
bo: ཟླ་སྔོན་མའི་ནང་།
ckb: مانگی پێشوو
gu: પાછલો મહિનો
hi: पिछला महीना
hy: Նախորդ ամիս
kab: Aseggas iɛeddan
kk: Өткен ай
km: ខែមុន
kn: ಹಿಂದಿನ ತಿಂಗಳು
ky: Мурунку ай
lo: ເດືອນແລ້ວ
mi: Marama tōmua
mn: Өмнөх сар
my: ယခင်လ
ne: अघिल्लो महिना
or: ପୂର୍ବ ମାସ
pa: ਪਿਛਲਾ ਮਹੀਨਾ
ro: Luna trecută
si: පෙර මාසය
sr_latn: Prethodni mesec
sw: Mwezi uliopita
ta: முந்தைய மாதம்
te: మునుపటి నెల
tl: Nakaraang buwan
tw: Bosome a etwaam
ug: ئالدىنقى ئاي
ur: پچھلا مہینہ
uz: Avvalgi oy
zu: Inyanga edlule

# nextPageTooltip
source: Next page
am: ቀጣይ ገፅ
ar: الصفحة التالية
as: পৰৱৰ্তী পৃষ্ঠা
az: Növbəti səhifə
bn: পরের পৃষ্ঠা
bo: ཤོག་ངོས་རྗེས་མ།
ckb: لاپەڕەی داهاتوو
gu: આગલું પેજ
hi: अगला पेज
hy: Հաջորդ էջ
kab: Asebter i d-iteddun
kk: Келесі бет
km: ទំព័របន្ទាប់
kn: ಮುಂದಿನ ಪುಟ
ky: Кийинки бет
lo: ໜ້າຕໍ່ໄປ
mi: Whārangi whai ake
mn: Дараах хуудас
my: နောက်စာမျက်နှာ
ne: अर्को पेज
or: ପରବର୍ତ୍ତୀ ପେଜ୍
pa: ਅਗਲਾ ਪੰਨਾ
ro: Pagina următoare
si: ඊළඟ පිටුව
sr_latn: Sledeća stranica
sw: Ukurasa unaofuata
ta: அடுத்த பக்கம்
te: తర్వాత పేజీ
tl: Susunod na page
tw: Kratafa a Edi hɔ
ug: كېيىنكى بەت
ur: اگلا صفحہ
uz: Keyingi sahifa
zu: Ikhasi elilandelayo

# firstPageTooltip
source: First page
am: የመጀመሪያው ገፅ
ar: الصفحة الأولى
as: প্রথম পৃষ্ঠা
az: Birinci səhifə
bn: প্রথম পৃষ্ঠা
bo: ཤོག་ངོས་དང་པོ།
ckb: یەکەم لاپەڕە
gu: પહેલું પેજ
hi: पहला पेज
hy: Առաջին էջ
kab: Tafsirt tamezwarut
kk: Бірінші бет
km: ទំព័រ​ដំបូង
kn: ಮೊದಲ ಪುಟ
ky: Биринчи бет
lo: ໜ້າທຳອິດ
mi: Whārangi tuatahi
mn: Эхний хуудас
my: ပထမ စာမျက်နှာ
ne: प्रथम पेज
or: ପ୍ରଥମ ପୃଷ୍ଠା
pa: ਪਹਿਲਾ ਪੰਨਾ
ro: Prima pagină
si: පළමු පිටුව
sr_latn: Prva stranica
sw: Ukurasa wa kwanza
ta: முதல் பக்கத்திற்குச் செல்லும்
te: మొదటి పేజీ
tw: Kratafa a edi kan
ug: بىرىنچى بەت
ur: پہلا صفحہ
uz: Birinchi sahifa
zu: Ikhasi lokuqala

# lastPageTooltip
source: Last page
am: የመጨረሻው ገፅ
ar: الصفحة الأخيرة
as: অন্তিম পৃষ্ঠা
az: Son səhifə
bn: শেষ পৃষ্ঠা
bo: མཇུག་མཐའི་ཤོག་ངོས།
ckb: دوایین لاپەڕە
gu: છેલ્લું પેજ
hi: आखिरी पेज
hy: Վերջին էջ
kab: Asebter aneggaru
kk: Соңғы бет
km: ទំព័រ​ចុង​ក្រោយ
kn: ಕೊನೆಯ ಪುಟ
ky: Акыркы бет
lo: ໜ້າສຸດທ້າຍ
mi: Whārangi whakamutunga
mn: Сүүлийн хуудас
my: နောက်ဆုံး စာမျက်နှာ
ne: अन्तिम पेज
or: ଶେଷ ପୃଷ୍ଠା
pa: ਆਖਰੀ ਪੰਨਾ
ro: Ultima pagină
si: අවසන් පිටුව
sr_latn: Poslednja stranica
sw: Ukurasa wa mwisho
ta: கடைசிப் பக்கத்திற்குச் செல்லும்
te: చివరి పేజీ
tw: Kratafa a etwa to
ug: ئاخىرقى بەت
ur: آخری صفحہ
uz: Oxirgi sahifa
zu: Ikhasi lokugcina

# previousPageTooltip
source: Previous page
am: ቀዳሚ ገፅ
ar: الصفحة السابقة
as: পূৰ্বৱৰ্তী পৃষ্ঠা
az: Əvvəlki səhifə
bn: আগের পৃষ্ঠা
bo: ཤོག་ངོས་དང་པོ།
ckb: لاپەڕەی پێشوو
gu: પાછલું પેજ
hi: पिछला पेज
hy: Նախորդ էջ
kab: Asebter amezwaru
kk: Алдыңғы бет
km: ទំព័រមុន
kn: ಹಿಂದಿನ ಪುಟ
ky: Мурунку бет
lo: ໜ້າກ່ອນໜ້າ
mi: Whārangi o mua
mn: Өмнөх хуудас
my: ယခင်စာမျက်နှာ
ne: अघिल्लो पृष्ठ
or: ପୂର୍ବବର୍ତ୍ତୀ ପେଜ୍
pa: ਪਿਛਲਾ ਪੰਨਾ
ro: Pagina anterioară
si: පෙර පිටුව
sr_latn: Prethodna stranica
sw: Ukurasa uliotangulia
ta: முந்தைய பக்கம்
te: మునుపటి పేజీ
tl: Nakaraang page
tw: N'asɛmti
ug: ئالدىنقى بەت
ur: گزشتہ صفحہ
uz: Avvalgi sahifa
zu: Ikhasi elidlule

# showMenuTooltip
source: Show menu
am: ምናሌን አሳይ
ar: عرض القائمة
as: মেনুখন দেখুৱাওক
az: Menyunu göstərin
bn: মেনু দেখান
bo: SHowཡི་ཟས་ཐོ།
ckb: پیشاندانی مێنوو
gu: મેનૂ બતાવો
hi: मेन्यू दिखाएं
hy: Ցույց տալ ընտրացանկը
kab: Isken imennuɣ
kk: Мәзірді көрсету
km: បង្ហាញ​ម៉ឺនុយ
kn: ಮೆನು ತೋರಿಸಿ
ky: Менюну көрсөтүү
lo: ສະແດງເມນູ
mi: Whakaaturia te tahua
mn: Цэсийг харуулах
my: မီနူး ပြရန်
ne: मेनु देखाउनुहोस्
or: ମେନୁ ଦେଖାନ୍ତୁ
pa: ਮੀਨੂ ਦਿਖਾਓ
ro: Afișați meniul
si: මෙනුව පෙන්වන්න
sr_latn: Prikaži meni
sw: Onyesha menyu
ta: மெனுவைக் காட்டு
te: మెనూను చూపు
tl: Ipakita ang menu
tw: Yi menua no kyerɛ
ug: تىزىملىكنى كۆرسىتىش
ur: مینیو دکھائیں
uz: Menyuni koʻrsatish
zu: Bonisa imenyu

# aboutListTileTitle
source: About $applicationName
am: ስለ $applicationName
ar: لمحة عن "$applicationName"
as: $applicationNameৰ বিষয়ে
az: $applicationName haqqında
bn: $applicationName সম্পর্কে
ckb: دەربارەی "$applicationName"
gu: $applicationName વિશે
hi: $applicationName के बारे में जानकारी
hy: $applicationName հավելվածի մասին
kk: $applicationName туралы
km: អំពី $applicationName
kn: $applicationName ಬಗ್ಗೆ
ky: $applicationName каналы жөнүндө
lo: ກ່ຽວກັບ $applicationName
mn: $applicationName-н тухай
my: $applicationName အကြောင်း
ne: $applicationName बारे
or: $applicationName ବିଷୟରେ
pa: $applicationName ਬਾਰੇ
ro: Despre $applicationName
si: $applicationName ගැන
sr_latn: O aplikaciji $applicationName
sw: Kuhusu $applicationName
ta: $applicationName பற்றி
te: $applicationName గురించి
tl: Tungkol sa $applicationName
ug: $applicationName ھەققىدە
ur: $applicationName کے بارے میں
uz: $applicationName haqida
zu: Mayelana no-$applicationName

# licensesPageTitle
source: Licenses
am: ፈቃዶች
ar: التراخيص
as: অনুজ্ঞাপত্ৰ
az: Lisenziyalar
bn: লাইসেন্স
bo: འཁྲོལ་འཛིན།
ckb: مۆڵەتەکان
gu: લાઇસન્સ
hi: लाइसेंस
hy: Արտոնագրեր
kab: Timsiḥin
kk: Лицензиялар
km: អាជ្ញាបណ្ណ
kn: ಪರವಾನಗಿಗಳು
ky: Уруксаттамалар
lo: ໃບອະນຸຍາດ
mi: Ngā Raihana
mn: Лиценз
my: လိုင်စင်များ
ne: इजाजतपत्रहरू
or: ଲାଇସେନ୍ସଗୁଡ଼କ
pa: ਲਾਇਸੰਸ
ro: Licențe
si: බලපත්‍ර
sr_latn: Licence
sw: Leseni
ta: உரிமங்கள்
te: లైసెన్స్‌లు
tl: Mga Lisensya
tw: Ahyehyɛde
ug: ئىجازەتننامىلەر
ur: لائسنسز
uz: Litsenziyalar
zu: Amalayisense

# pageRowsInfoTitle
source: $firstRow–$lastRow of $rowCount
am: $firstRow–$lastRow ከ$rowCount ውስጥ
ar: من $firstRow إلى $lastRow من إجمالي $rowCount
as: $rowCountৰ $firstRow–$lastRow
az: $firstRow–$lastRow/$rowCount
bn: $rowCountটির মধ্যে $firstRow-$lastRow
ckb: لە $firstRow بۆ $lastRow لە کۆی $rowCount
gu: $rowCountમાંથી $firstRow–$lastRow
hi: $rowCount का $firstRow–$lastRow
hy: $firstRow–$lastRow $rowCount-ից
kk: $rowCount ішінен $firstRow–$lastRow
km: $firstRow–$lastRow ក្នុង​ចំណោម​ $rowCount
kn: $rowCount ರಲ್ಲಿ $firstRow–$lastRow
ky: $rowCount ичинен $firstRow–$lastRow
lo: $firstRow–$lastRow ຈາກທັງໝົດ $rowCount
mn: $rowCount-н $firstRow–$lastRow
my: $rowCount အနက် $firstRow–$lastRow
ne: $rowCount मध्ये $firstRow–$lastRow
or: $rowCountର $firstRow–$lastRow
pa: $rowCount ਵਿੱਚੋਂ $firstRow–$lastRow
ro: $firstRow–$lastRow din $rowCount
si: $rowCountන් $firstRow–$lastRow
sr_latn: $firstRow – $lastRow od $rowCount
sw: $firstRow hadi $lastRow kati ya $rowCount
ta: $firstRow–$lastRow / $rowCount
te: $rowCountలో $firstRow - $lastRow
tl: $firstRow–$lastRow ng $rowCount
ug: جەمئىي $rowCount قۇر $firstRow-دىن $lastRow-گىچە
ur: $firstRow–$lastRow از $rowCount
uz: $firstRow–$lastRow, jami: $rowCount
zu: $firstRow–$lastRow kokungu-$rowCount

# pageRowsInfoTitleApproximate
source: $firstRow–$lastRow of about $rowCount
am: $firstRow–$lastRow ከ$rowCount ያህል ውስጥ
ar: من $firstRow إلى $lastRow من إجمالي $rowCount تقريبًا
as: প্ৰায় $rowCountৰ $firstRow–$lastRow
az: $firstRow–$lastRow/ təxminən $rowCount
bn: প্রায় $rowCountটির মধ্যে $firstRow-$lastRow নম্বর
ckb: لە $firstRow بۆ $lastRow لە کۆی نزیکەی $rowCount
gu: આશરે $rowCountમાંથી $firstRow–$lastRow
hi: $rowCount में से करीब $firstRow–$lastRow
hy: $firstRow–$lastRow մոտավորապես $rowCount-ից
kk: Шамамен $rowCount ішінен $firstRow–$lastRow
km: $firstRow–$lastRow ក្នុង​ចំណោម​ប្រហែល $rowCount
kn: $rowCount ರಲ್ಲಿ $firstRow–$lastRow
ky: Болжол менен $rowCount ичинен $firstRow–$lastRow
lo: $firstRow–$lastRow ຈາກປະມານ $rowCount
mn: Ойролцоогоор $rowCount-н $firstRow–$lastRow
my: $rowCount ခန့်မှ $firstRow–$lastRow
ne: लगभग $rowCount को $firstRow–$lastRow
or: ପାଖାପାଖି $rowCountର $firstRow–$lastRow
pa: ਲਗਭਗ $rowCount ਵਿੱਚੋਂ $firstRow–$lastRow
ro: $firstRow–$lastRow din aproximativ $rowCount
si: $rowCountකින් පමණ $firstRow–$lastRow
sr_latn: $firstRow – $lastRow od približno $rowCount
sw: $firstRow hadi $lastRow kati ya takriban $rowCount
ta: $firstRow–$lastRow / $rowCount
te: $rowCountలో $firstRow–$lastRow
tl: $firstRow–$lastRow ng humigit kumulang $rowCount
ug: تەخمىنەن جەمئىي $rowCount قۇر $firstRow-دىن $lastRow-گىچە
ur: $firstRow–$lastRow $rowCount میں سے تقریباً
uz: $firstRow–$lastRow, jami: $rowCount
zu: $firstRow–$lastRow cishe kokungu-$rowCount

# rowsPerPageTitle
source: Rows per page:
am: ረድፎች በገጽ፦
ar: عدد الصفوف في الصفحة:
as: প্ৰতিটো পৃষ্ঠাত থকা শাৰী:
az: Hər səhifə üzrə sıra:
bn: প্রতি পৃষ্ঠায় সারির সংখ্যা:
bo: ཤོག་ངོས་རེ་རེའི་གྲངས་ཀ་
ckb: ژمارەی ڕیزەکان لە هەر لاپەڕەیەک:
gu: પેજ દીઠ પંક્તિઓ:
hi: हर पेज में पंक्तियों की संख्या:
hy: Մեկ էջի տողերը՝
kab: Tamazight ɣef usebter:
kk: Әр беттегі жолдар саны:
km: ជួរ​ដេក​ក្នុង​មួយ​ទំព័រ៖
kn: ಪ್ರತಿ ಪುಟಕ್ಕೆ ಸಾಲುಗಳು:
ky: Бир беттеги саптардын саны:
lo: ແຖວຕໍ່ໜ້າ:
mi: Ngā haupae mō ia whārangi:
mn: Хуудсан дахь мөрийн тоо:
my: စာတစ်မျက်နှာပါ လိုင်းအရေအတွက်−
ne: प्रत्येक पृष्ठमा रहेका पङ्क्तिहरूको सङ्ख्या:
or: ପୃଷ୍ଠା ପିଛା ଧାଡ଼ି:
pa: ਹਰ ਪੰਨੇ 'ਤੇ ਕਤਾਰਾਂ:
ro: Rânduri pe pagină:
si: පිටුවකට පේළි:
sr_latn: Redova na stranici:
sw: Safu mlalo kwa kila ukurasa:
ta: ஒரு பக்கத்திற்கான வரிசைகள்:
te: పేజీకి ఉండే అడ్డు వరుసలు:
tl: Mga row bawat page:
tw: Nsraban a ɛwɔ kratafa biara mu:
ug: ھەر بەتتىكى قۇر سانى:
ur: قطاریں فی صفحہ:
uz: Har bir sahifadagi qatorlar soni:
zu: Imigqa ekhasini ngalinye:

# tabLabel
source: Tab $tabIndex of $tabCount
am: ትር $tabIndex ከ$tabCount
ar: علامة التبويب $tabIndex من $tabCount
as: $tabCount টাৰ ভিতৰত $tabIndex টা টেব
az: $tabIndex/$tabCount tab
bn: $tabCount-এর মধ্যে $tabIndexটি ট্যাব
ckb: تابی $tabIndex لە $tabCount
gu: $tabCountમાંથી $tabIndex ટૅબ
hi: $tabCount का टैब $tabIndex
hy: Ներդիր $tabIndex՝ $tabCount-ից
kk: $tabCount/$tabIndex қойынды
km: ផ្ទាំង $tabIndex ក្នុង​ចំណោម​ $tabCount
kn: $tabCount ರಲ್ಲಿನ $tabIndex ಟ್ಯಾಬ್
ky: $tabCount кыналма ичинен $tabIndex
lo: ແຖບທີ $tabIndex ຈາກທັງໝົດ $tabCount
mn: $tabCount-н $tabIndex-р таб
my: တဘ် $tabCount အနက် $tabIndex ခု
ne: $tabCount मध्ये $tabIndex ट्याब
or: $tabCountର $tabIndex ଟାବ୍
pa: $tabCount ਵਿੱਚੋਂ $tabIndex ਟੈਬ
ro: Fila $tabIndex din $tabCount
si: ටැබ $tabIndexකින් $tabCount
sr_latn: $tabIndex. kartica od $tabCount
sw: Kichupo cha $tabIndex kati ya $tabCount
ta: தாவல் $tabIndex / $tabCount
te: $tabCountలో $tabIndexవ ట్యాబ్
tl: Tab $tabIndex ng $tabCount
ug: بەتكۈچ $tabIndex جەمئىي $tabCount
ur: $tabCount میں سے $tabIndex ٹیب
uz: $tabCount varaqdan $tabIndex
zu: Ithebhu $tabIndex kwangu-$tabCount

# selectedRowCountTitleOne
source: 1 item selected
am: 1 ንጥል ተመርጧል
ar: تم اختيار عنصر واحد
as: ১ টা বস্তু বাছনি কৰা হ’ল
az: 1 element seçildi
bn: ১টি আইটেম বেছে নেওয়া হয়েছে
ckb: یەک ڕیز هەڵبژێردراوە
gu: 1 આઇટમ પસંદ કરી
hi: 1 चीज़ चुनी गई
hy: Ընտրվել է 1 տարր
kk: 1 элемент таңдалды.
km: បាន​ជ្រើស​រើស​ធាតុ 1
kn: 1 ಐಟಂ ಆಯ್ಕೆ ಮಾಡಲಾಗಿದೆ
ky: 1 нерсе тандалды
lo: ເລືອກ 1 ລາຍການແລ້ວ
mn: 1 зүйл сонгосон
my: ၁ ခု ရွေးထားသည်
ne: १ वस्तु चयन गरियो
or: 1ଟି ଆଇଟମ୍ ଚୟନ କରାଯାଇଛି
pa: 1 ਆਈਟਮ ਚੁਣੀ ਗਈ
ro: Un articol selectat
si: අයිතම 1ක් තෝරන ලදී
sr_latn: Izabrana je 1 stavka
sw: Umechagua kipengee 1
ta: 1 வரிசை தேர்ந்தெடுக்கப்பட்டது
te: 1 అంశం ఎంచుకోబడింది
tl: 1 item ang napili
ug: 1 ماددا تاللاندى
ur: 1 آئٹم منتخب کیا گیا
uz: 1 ta element tanlandi
zu: 1 into ekhethiwe

# selectedRowCountTitleOther
source: $selectedRowCount items selected
am: $selectedRowCount ንጥሎች ተመርጠዋል
ar: تم اختيار $selectedRowCount عنصر
as: $selectedRowCount টা বস্তু বাছনি কৰা হ’ল
az: $selectedRowCount element seçildi
bn: $selectedRowCountটি আইটেম বেছে নেওয়া হয়েছে
ckb: $selectedRowCount ڕیز هەڵبژێردراوە
gu: $selectedRowCount આઇટમ પસંદ કરી
hi: $selectedRowCount चीज़ें चुनी गईं
hy: Ընտրվել է $selectedRowCount տարր
kk: $selectedRowCount элемент таңдалды.
km: បាន​ជ្រើស​រើស​ធាតុ $selectedRowCount
kn: $selectedRowCount ಐಟಂಗಳನ್ನು ಆಯ್ಕೆ ಮಾಡಲಾಗಿದೆ
ky: $selectedRowCount нерсе тандалды
lo: ເລືອກ $selectedRowCount ລາຍການແລ້ວ
mn: $selectedRowCount зүйл сонгосон
my: $selectedRowCount ခု ရွေးထားသည်
ne: $selectedRowCount वस्तुहरू चयन गरिए
or: $selectedRowCountଟି ଆଇଟମ୍ ଚୟନ କରାଯାଇଛି
pa: $selectedRowCount ਆਈਟਮਾਂ ਚੁਣੀਆਂ ਗਈਆਂ
ro: $selectedRowCount de articole selectate
si: අයිතම $selectedRowCountක් තෝරන ලදී
sr_latn: Izabrano je $selectedRowCount stavki
sw: Umechagua vipengee $selectedRowCount
ta: $selectedRowCount வரிசைகள் தேர்ந்தெடுக்கப்பட்டன
te: $selectedRowCount అంశాలు ఎంచుకోబడ్డాయి
tl: $selectedRowCount na item ang napili
ug: $selectedRowCount ماددا تاللاندى
ur: $selectedRowCount آئٹمز منتخب کیے گئے
uz: $selectedRowCount ta element tanlandi
zu: $selectedRowCount izinto ezikhethiwe

# cancelButtonLabel
source: Cancel
am: ይቅር
ar: الإلغاء
as: বাতিল কৰক
az: Ləğv edin
bn: বাতিল করুন
bo: མེད་པར་བཟོ་དགོས།
ckb: هەڵوەشاندنەوە
gu: રદ કરો
hi: रद्द करें
hy: Չեղարկել
kab: Ad t-tekkes
kk: Бас тарту
km: បោះបង់
kn: ರದ್ದುಮಾಡಿ
ky: Токтотуу
lo: ຍົກເລີກ
mi: Whakakore
mn: Цуцлах
my: မလုပ်တော့
ne: रद्द गर्नुहोस्
or: ବାତିଲ କରନ୍ତୁ
pa: ਰੱਦ ਕਰੋ
ro: Anulați
si: අවලංගු කරන්න
sr_latn: Otkaži
sw: Ghairi
ta: ரத்துசெய்
te: రద్దు చేయండి
tl: KANSELAHIN
tw: Sɛe
ug: بىكار قىلىش
ur: منسوخ کریں
uz: Bekor qilish
zu: Khansela

# closeButtonLabel
source: Close
am: ዝጋ
ar: الإغلاق
as: বন্ধ কৰক
az: Bağlayın
bn: বন্ধ করুন
bo: སྒོ་རྒྱག་པ།
ckb: داخستن
gu: બંધ કરો
hi: बंद करें
hy: Փակել
kab: Yeqqer
kk: Жабу
km: បិទ
kn: ಮುಚ್ಚಿರಿ
ky: Жабуу
lo: ປິດ
mi: Katia
mn: Хаах
my: ပိတ်ရန်
ne: बन्द गर्नुहोस्
or: ବନ୍ଦ କରନ୍ତୁ
pa: ਬੰਦ ਕਰੋ
ro: Închideți
si: වසන්න
sr_latn: Zatvori
sw: Funga
ta: மூடுக
te: మూసివేయండి
tl: ISARA
tw: Ɛbɛn
ug: يېپىش
ur: بند کریں
uz: Yopish
zu: Vala

# continueButtonLabel
source: Continue
am: ቀጥል
ar: المتابعة
as: অব্যাহত ৰাখক
az: Davam edin
bn: চালিয়ে যান
bo: མུ་མཐུད་ནས་ཡོང་
ckb: بەردەوامبوون
gu: ચાલુ રાખો
hi: जारी रखें
hy: Շարունակել
kab: Tkemmel
kk: Жалғастыру
km: បន្ត
kn: ಮುಂದುವರಿಸಿ
ky: Улантуу
lo: ສືບຕໍ່
mi: Haere tonu
mn: Үргэлжлүүлэх
my: ရှေ့ဆက်ရန်
ne: जारी राख्नुहोस्
or: ଜାରି ରଖନ୍ତୁ
pa: ਜਾਰੀ ਰੱਖੋ
ro: Continuați
si: ඉදිරියට යන්න
sr_latn: Nastavi
sw: Endelea
ta: தொடர்
te: కొనసాగించండి
tl: MAGPATULOY
tw: Kɔ so
ug: داۋاملاشتۇرۇش
ur: جاری رکھیں
uz: Davom etish
zu: Qhubeka

# copyButtonLabel
source: Copy
am: ቅዳ
ar: نسخ
as: প্ৰতিলিপি কৰক
az: Kopyalayın
bn: কপি করুন
bo: འདྲ་བཟོ་བྱས་པ།
ckb: کۆپیکردن
gu: કૉપિ કરો
hi: कॉपी करें
hy: Պատճենել
kab: Tameẓla
kk: Көшіру
km: ចម្លង
kn: ನಕಲಿಸಿ
ky: Көчүрүү
lo: ສຳເນົາ
mi: Tārua
mn: Хуулах
my: မိတ္တူကူးရန်
ne: कपी गर्नुहोस्
or: କପି କରନ୍ତୁ
pa: ਕਾਪੀ ਕਰੋ
ro: Copiați
si: පිටපත් කරන්න
sr_latn: Kopiraj
sw: Nakili
ta: நகலெடு
te: కాపీ చేయి
tl: Kopyahin
tw: Wɔahyehyɛ
ug: كۆچۈرۈش
ur: کاپی کریں
uz: Nusxa olish
zu: Kopisha

# cutButtonLabel
source: Cut
am: ቁረጥ
ar: قص
as: কাট কৰক
az: Kəsin
bn: কাট করুন
bo: གཏུབ་པ།
ckb: بڕین
gu: કાપો
hi: काटें
hy: Կտրել
kab: Tẓegger
kk: Қию
km: កាត់
kn: ಕತ್ತರಿಸಿ
ky: Кесүү
lo: ຕັດ
mi: tapahi
mn: Таслах
my: ဖြတ်ယူရန်
ne: काट्नुहोस्
or: କଟ୍ କରନ୍ତୁ
pa: ਕੱਟ ਕਰੋ
ro: Decupați
si: කපන්න
sr_latn: Iseci
sw: Kata
ta: வெட்டு
te: కత్తిరించండి
tl: I-cut
tw: Wodi mu
ug: كېسىش
ur: کٹ کریں
uz: Kesib olish
zu: Sika

# scanTextButtonLabel
source: Scan text
am: ጽሁፍን ቃኝ
ar: مسح النص ضوئيًا
as: পাঠ স্কেন কৰক
az: Mətni skan edin
bn: টেক্সট স্ক্যান করুন
bo: ཡིག་ཆ་གཙང་ཕྱག་བྱེད་པ།
ckb: سکانی دەق
gu: ટેક્સ્ટ સ્કૅન કરો
hi: टेक्स्ट स्कैन करें
hy: Սկանավորել տեքստ
kab: Imeslay n uselkim
kk: Мәтінді сканерлеу
km: ស្កេន​អក្សរ
kn: ಪಠ್ಯವನ್ನು ಸ್ಕ್ಯಾನ್ ಮಾಡಿ
ky: Текстти скандоо
lo: ສະແກນຂໍ້ຄວາມ
mi: Karapa kuputuhi
mn: Текстийг скан хийх
my: စာသား စကင်ဖတ်ရန်
ne: टेक्स्ट स्क्यान गर्नुहोस्
or: ଟେକ୍ସଟ୍ ସ୍କାନ୍ କରନ୍ତୁ
pa: ਲਿਖਤ ਨੂੰ ਸਕੈਨ ਕਰੋ
ro: Scanați textul
si: පෙළ ස්කෑන් කරන්න
sr_latn: Skeniraj tekst
sw: Changanua maandishi
ta: வார்த்தைகளை ஸ்கேன் செய்
te: టెక్స్ట్‌ను స్కాన్ చేయండి
tw: Nhwɛso a wohwehwɛ
ug: تېكىستنى سايىلەش
ur: ٹیکسٹ اسکین کریں
uz: Matnni skanerlash
zu: Skena umbhalo

# pasteButtonLabel
source: Paste
am: ለጥፍ
ar: لصق
as: পে'ষ্ট কৰক
az: Yerləşdirin
bn: পেস্ট করুন
bo: རབ་རིབ་ཏུ་གྱུར
ckb: لکاندن
gu: પેસ્ટ કરો
hi: चिपकाएं
hy: Տեղադրել
kab: Taɣawsa
kk: Қою
km: ដាក់​ចូល
kn: ಅಂಟಿಸಿ
ky: Чаптоо
lo: ວາງ
mi: Whakapiri
mn: Буулгах
my: ကူးထည့်ရန်
ne: टाँस्नुहोस्
or: ପେଷ୍ଟ କରନ୍ତୁ
pa: ਪੇਸਟ ਕਰੋ
ro: Inserați
si: අලවන්න
sr_latn: Nalepi
sw: Bandika
ta: ஒட்டு
te: పేస్ట్ చేయండి
tl: I-paste
tw: Nkyene
ug: چاپلاش
ur: پیسٹ کریں
uz: Joylash
zu: Namathisela

# selectAllButtonLabel
source: Select all
am: ሁሉንም ምረጥ
ar: اختيار الكل
as: আটাইবোৰ বাছনি কৰক
az: Hamısını seçin
bn: সব বেছে নিন
bo: ཡོངས་རྫོགས་འདེམས་བསྐོ་བྱ་དགོས
ckb: هەڵبژاردنی هەموو
gu: બધા પસંદ કરો
hi: सभी को चुनें
hy: Նշել բոլորը
kab: Select akk
kk: Барлығын таңдау
km: ជ្រើសរើស​ទាំងអស់
kn: ಎಲ್ಲವನ್ನೂ ಆಯ್ಕೆ ಮಾಡಿ
ky: Баарын тандоо
lo: ເລືອກທັງໝົດ
mi: Tīpako Katoa
mn: Бүгдийг сонгох
my: အားလုံး ရွေးရန်
ne: सबै बटनहरू चयन गर्नुहोस्
or: ସବୁ ଚୟନ କରନ୍ତୁ
pa: ਸਭ ਚੁਣੋ
ro: Selectați tot
si: සියල්ල තෝරන්න
sr_latn: Izaberi sve
sw: Chagua vyote
ta: அனைத்தையும் தேர்ந்தெடு
te: అన్నింటినీ ఎంచుకోండి
tl: Piliin lahat
tw: Paw nyinaa
ug: ھەممىنى تاللاش
ur: سبھی کو منتخب کریں
uz: Hammasi
zu: Khetha konke

# viewLicensesButtonLabel
source: View licenses
am: ፈቃዶችን ይመልከቱ
ar: الاطّلاع على التراخيص
as: অনুজ্ঞাপত্ৰসমূহ চাওক
az: Lisenziyalara baxın
bn: লাইসেন্স দেখুন
bo: འཁྲོལ་འཛིན་ལ་ལྟ་ཞིབ་བྱེད་པ།
ckb: بینینی مۆڵەتەکان
gu: લાઇસન્સ જુઓ
hi: लाइसेंस देखें
hy: Դիտել լիցենզիաները
kab: Isebtaren n uselmed
kk: Лицензияларды көру
km: មើលអាជ្ញាបណ្ណ
kn: ಪರವಾನಗಿಗಳನ್ನು ವೀಕ್ಷಿಸಿ
ky: Уруксаттамаларды көрүү
lo: ເບິ່ງໃບອະນຸຍາດ
mi: Tirohia ngā raihana
mn: Лиценз харах
my: လိုင်စင်များကြည့်ရန်
ne: लाइसेन्सहरू हेर्नुहोस्
or: ଲାଇସେନ୍ସ ଦେଖନ୍ତୁ
pa: ਲਾਇਸੰਸ ਦੇਖੋ
ro: Vedeți licențele
si: බලපත්‍ර බලන්න
sr_latn: Prikaži licence
sw: Angalia leseni
ta: உரிமங்களைக் காட்டு
te: లైసెన్స్‌లను చూడండి
tl: TINGNAN ANG MGA LISENSYA
tw: Hwɛ tumi krataa
ug: ئىجازەتنامىلەرنى كۆرۈش
ur: لائسنسز دیکھیں
uz: Litsenziyalarni koʻrish
zu: Buka amalayisense

# timePickerHourModeAnnouncement
source: Select hours
am: ሰዓታትን ምረጥ
ar: اختيار الساعات
as: ঘণ্টা বাছনি কৰক
az: Saat seçin
bn: ঘণ্টা বেছে নিন
bo: ལས་གཉེར་གྱི་དུས་ཚོད་གདམ་དགོས།
ckb: هەڵبژاردنی کاتژمێر
gu: કલાક પસંદ કરો
hi: घंटे के हिसाब से समय चुनें
hy: Ընտրեք ժամը
kab: Isebtaren i sɛan azday
kk: Сағаттарды таңдаңыз
km: ជ្រើសរើស​ម៉ោង
kn: ಗಂಟೆಗಳನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Саатты тандаңыз
lo: ເລືອກໂມງ
mi: Tīpako hāora
mn: Цаг сонгоно уу
my: နာရီကို ရွေးပါ
ne: घन्टा चयन गर्नुहोस्
or: ଘଣ୍ଟା ଚୟନ କରନ୍ତୁ
pa: ਘੰਟੇ ਚੁਣੋ
ro: Selectați orele
si: පැය ගණන තෝරන්න
sr_latn: Izaberite sate
sw: Chagua saa
ta: மணிநேரத்தைத் தேர்ந்தெடுக்கவும்
te: గంటలను ఎంచుకోండి
tl: Pumili ng mga oras
tw: Hwɛ nnɔnhwerew a wɔde yɛ adwuma
ug: سائەت تاللاش
ur: گھنٹے منتخب کریں
uz: Soatni tanlang
zu: Khetha amahora

# timePickerMinuteModeAnnouncement
source: Select minutes
am: ደቂቃዎችን ይምረጡ
ar: اختيار الدقائق
as: মিনিট বাছনি কৰক
az: Dəqiqə seçin
bn: মিনিট বেছে নিন
bo: སྐར་མ་འགར་འདེམས་པ།
ckb: هەڵبژاردنی خولەک
gu: મિનિટ પસંદ કરો
hi: मिनट के हिसाब से समय चुनें
hy: Ընտրեք րոպեները
kk: Минуттарды таңдаңыз
km: ជ្រើសរើស​នាទី
kn: ನಿಮಿಷಗಳನ್ನು ಆಯ್ಕೆಮಾಡಿ
ky: Мүнөттөрдү тандаңыз
lo: ເລືອກນາທີ
mi: Tīpako meneti
mn: Минут сонгоно уу
my: မိနစ်ကို ရွေးပါ
ne: मिनेट चयन गर्नुहोस्
or: ମିନିଟ୍ ଚୟନ କରନ୍ତୁ
pa: ਮਿੰਟ ਚੁਣੋ
ro: Selectați minutele
si: මිනිත්තු ගණන තෝරන්න
sr_latn: Izaberite minute
sw: Chagua dakika
ta: நிமிடங்களைத் தேர்ந்தெடுக்கவும்
te: నిమిషాలను ఎంచుకోండి
tl: Pumili ng mga minuto
tw: Paw nnɔnhwerew
ug: مىنۇت تاللاش
ur: منٹ منتخب کریں
uz: Daqiqani tanlang
zu: Khetha amaminithi

# modalBarrierDismissLabel
source: Dismiss
am: አሰናብት
ar: رفض
as: অগ্ৰাহ্য কৰক
az: İmtina edin
bn: খারিজ করুন
bo: ལས་ཁོངས་ནས་ཕྱིར་འབུད་
ckb: ڕەتکردنەوە
gu: છોડી દો
hi: खारिज करें
hy: Փակել
kab: Ad d-yeǧǧ
kk: Жабу
km: ច្រាន​ចោល
kn: ವಜಾಗೊಳಿಸಿ
ky: Жабуу
lo: ປິດໄວ້
mi: Ākiritia
mn: Үл хэрэгсэх
my: ပယ်ရန်
ne: खारेज गर्नुहोस्
or: ଖାରଜ କରନ୍ତୁ
pa: ਖਾਰਜ ਕਰੋ
ro: Închideți
si: ඉවත ලන්න
sr_latn: Odbaci
sw: Ondoa
ta: நிராகரிக்கும்
te: విస్మరించు
tl: I-dismiss
tw: W'ayi
ug: بىكار قىلىش
ur: برخاست کریں
uz: Yopish
zu: Cashisa

# signedInLabel
source: Signed in
am: በመለያ ገብቷል
ar: تم تسجيل الدخول
as: ছাইন ইন কৰা হ’ল
az: Daxil olundu
bn: সাইন-ইন করা হয়েছে
bo: ཐོ་འགོད་བྱས་ཟིན།
ckb: چووەتە ژوورەوە
gu: આમાં સાઇન ઇન કર્યું છે
hi: साइन इन किया हुआ है
hy: Դուք մուտք եք գործել
kab: Tessaweḍ
kk: Аккаунтқа кірген
km: បានចូល​គណនី
kn: ಸೈನ್ ಇನ್ ಮಾಡಲಾಗಿದೆ
ky: Аккаунтуңузга кирдиңиз
lo: ເຂົ້າສູ່ລະບົບແລ້ວ
mi: Kua takiurua
mn: Нэвтэрсэн
my: လက်မှတ်ထိုး ဝင်ထားသည်
ne: साइन इन गरियो
or: ସାଇନ୍ ଇନ୍ କରାଯାଇଛି
pa: ਸਾਈਨ-ਇਨ ਕੀਤਾ ਗਿਆ
ro: V-ați conectat
si: පුරන ලදී
sr_latn: Prijavljeni ste
sw: Umeingia katika akaunti
ta: உள்நுழைந்துள்ளீர்கள்
te: సైన్ ఇన్ చేశారు
tl: Naka-sign in
tw: Wɔhyɛ ase
ug: تىزىملاپ كىردىڭىز
ur: سائن ان کردہ ہے
uz: Hisobingizga kirgansiz
zu: Ungene ngemvume
