Repository: flutter/flutter
Catalog: packages/flutter_localizations/lib/src/l10n/widgets_*.arb
Languages: as, bn, ckb, et, ku, ky, mg, ml, mt, or, sd, te, tg, tk, uz, zu

# reorderItemToStart
source: Move to the start
as: আৰম্ভণিলৈ নিয়ক
bn: চালু করতে সরান
ckb: بزانە بۆ دەستپێک
et: Teisalda algusesse
ku: بجوڵێ بۆ دەستپێکردن
ky: Башына жылдыруу
mg: Mandrosoa manomboka
ml: തുടക്കത്തിലേക്ക് പോവുക
mt: Mexxi biex tibda
or: ଆରମ୍ଭକୁ ମୁଭ କରନ୍ତୁ
sd: شروع ڪرڻ لاء منتقل ڪريو
te: ప్రారంభానికి తరలించండి
tg: Ба оғоз ҳаракат кунед
tk: Başlamak üçin göç
uz: Boshiga siljitish
zu: Yisa ekuqaleni

# reorderItemToEnd
source: Move to the end
as: শেষলৈ নিয়ক
bn: একদম শেষের দিকে যান
ckb: بەرەو کۆتایی
et: Teisalda l천ppu
ku: بگوێزەرەوە بۆ کۆتایی
ky: Аягына жылдыруу
mg: Mifindra any amin'ny faran'ny
ml: അവസാന ഭാഗത്തേക്ക് പോവുക
mt: Mexxi lejn it-tmiem
or: ଶେଷକୁ ମୁଭ କରନ୍ତୁ
sd: ختم ڪرڻ لاء منتقل ڪريو
te: చివరకు తరలించండి
tg: Ба охир ҳаракат кунед
tk: Soňuna göç
uz: Oxiriga siljitish
zu: Yisa ekugcineni

# reorderItemUp
source: Move up
as: ওপৰলৈ নিয়ক
bn: উপরের দিকে সরান
ckb: بەرەو سەرەوە بڕۆ
et: Teisalda 체les
ku: بجوڵێ بۆ سەرەوە
ky: Жогору жылдыруу
mg: Mandrosoa
ml: മുകളിലോട്ട് നീക്കുക
mt: Imxi 'l fuq
or: ଉପରକୁ ମୁଭ କରନ୍ତୁ
sd: مٿي هلي وڃو
te: పైకి జరపండి
tg: Ба боло равед
tk: ýokaryk galmak
uz: Tepaga siljitish
zu: Iya phezulu

# reorderItemDown
source: Move down
as: তললৈ নিয়ক
bn: নিচের দিকে সরান
ckb: دابەزێنە خوارەوە
et: Teisalda alla
ku: چوونە خوارەوە
ky: Төмөн жылдыруу
mg: Midina midina
ml: താഴോട്ട് നീക്കുക
mt: Mexxi 'l isfel
or: ତଳକୁ ମୁଭ କରନ୍ତୁ
sd: هيٺ هلي وڃو
te: కిందికు జరుపు
tg: Ба поён равед
tk: aşak süýşür
uz: Pastga siljitish
zu: Iya phansi

# reorderItemLeft
source: Move left
as: বাওঁফাললৈ স্থানান্তৰ কৰক
bn: বাঁদিকে সরান
ckb: بچۆ چەپ
et: Teisalda vasakule
ku: بگوێزەرەوە بۆ لای چەپ
ky: Солго жылдыруу
mg: Mifindra eo ankavia
ml: ഇടത്തോട്ട് നീക്കുക
mt: Mexxi lejn ix-xellug
or: ବାମକୁ ମୁଭ କରନ୍ତୁ
sd: کاٻي پاسي منتقل ڪريو
te: ఎడమవైపుగా జరపండి
tg: Ба чап ҳаракат кунед
tk: Çepe süýşür
uz: Chapga siljitish
zu: Hambisa kwesokunxele

# reorderItemRight
source: Move right
as: সোঁফাললৈ নিয়ক
bn: ডানদিকে সরান
ckb: بگەڕێ ڕاست
et: Teisalda paremale
ku: بگوێزەرەوە بۆ لای ڕاست
ky: Оңго жылдыруу
mg: Mihetsika tsara
ml: വലത്തോട്ട് നീക്കുക
mt: Mexxi lejn il-lemin
or: ଡାହାଣକୁ ମୁଭ କରନ୍ତୁ
sd: ساڄي پاسي هلي وڃو
te: కుడివైపుగా జరపండి
tg: Ба рост ҳаракат кунед
tk: Saga süýşür
uz: OÊ»ngga siljitish
zu: Yisa kwesokudla

# copyButtonLabel
source: Copy
as: প্ৰতিলিপি কৰক
bn: কপি করুন
ckb: کۆپی
et: Kopeeri
ku: کۆپی
ky: Көчүрүү
mg: Tahadika mitovy
ml: പകർത്തുക
mt: Kopja
or: କପି କରନ୍ତୁ
sd: نقل ڪريو
te: కాపీ చేయి
tg: Нусхаи муаллифӣ
tk: nusgala
uz: Nusxa olish
zu: Kopisha

# cutButtonLabel
source: Cut
as: কাট কৰক
bn: কাট করুন
ckb: بڕین
et: L천ika
ku: بڕین
ky: Кесүү
mg: Hetezo
ml: മുറിക്കുക
mt: Maqtugħa
or: କଟ କରନ୍ତୁ
sd: ڪٽي
te: కత్తిరించండి
tg: Тақсим
tk: gyrkmak
uz: Kesib olish
zu: Sika

# lookUpButtonLabel
source: Look Up
as: ওপৰলৈ চাওক
bn: লুক-আপ
ckb: سەیری بەرز بکە
ku: سەیری سەرەوە بکە
ky: Издөө
mg: Jereo ny tohiny
ml: മുകളിലേക്ക് നോക്കുക
mt: Fittex 'il fuq
or: ଉପରକୁ ଦେଖନ୍ତୁ
sd: مٿي ڏسو
te: వెతకండి
tg: Ба боло нигаред
tk: seretmek
uz: Tepaga qarang
zu: Bheka Phezulu

# searchWebButtonLabel
source: Search Web
as: ৱেবত সন্ধান কৰক
bn: ওয়েবে সার্চ করুন
ckb: گەڕان لە تۆڕەکەدا
et: Otsi veebist
ku: گەڕان لە وێب
ky: Интернеттен издөө
mg: Tadiavo ny tranonkala
ml: വെബിൽ തിരയുക
mt: Fittex fuq il-web
or: ୱେବ ସର୍ଚ୍ଚ କରନ୍ତୁ
sd: ويب ڳوليو
te: వెబ్‌లో సెర్చ్ చేయండి
tg: Дар интернет ҷустуҷӯ кунед
tk: Webi Ahtar
uz: Internetdan qidirish
zu: Sesha Iwebhu

# shareButtonLabel
source: Share
as: শ্বেয়াৰ কৰক
bn: শেয়ার করুন
ckb: دابەشکردن
et: Jagamine
ku: بەش پێکردن
ky: Бөлүшүү
mg: Zarao
ml: പങ്കിടുക
mt: Sehem
or: ସେୟାର କରନ୍ତୁ
sd: حصيداري ڪريو
te: షేర్ చేయండి
tg: Мубодила
tk: paýlaşmak
uz: Ulashish
zu: Yabelana

# pasteButtonLabel
source: Paste
as: পে'ষ্ট কৰক
bn: পেস্ট করুন
ckb: پست
et: Kleebi
ku: لکاندن
ky: Чаптоо
mg: Apetaho
ml: ഒട്ടിക്കുക
mt: Ippejstja
or: ପେଷ୍ଟ କରନ୍ତୁ
sd: پيسٽ ڪريو
te: పేస్ట్ చేయండి
tg: Паст
tk: ýelmemek
uz: Joylash
zu: Namathisela

# selectAllButtonLabel
source: Select all
as: আটাইবোৰ বাছনি কৰক
bn: সব বেছে নিন
ckb: هەمووان هەڵبژێرە
et: Vali k천ik
ku: هەموو دیاریبکە
ky: Баарын тандоо
mg: Safidio ny zava-drehetra
ml: എല്ലാം തിരഞ്ഞെടുക്കുക
mt: Agħżel kollox
or: ସବୁ ଚୟନ କରନ୍ତୁ
sd: سڀ چونڊيو
te: అన్నింటినీ ఎంచుకోండి
tg: Ҳамаро интихоб кунед
tk: Ehlisini Saýla
uz: Hammasi
zu: Khetha konke

source: Search results found
as: সন্ধানৰ ফলাফল পোৱা গৈছে
bn: সার্চ ফলাফল পাওয়া গেছে
et: Leiti otsingutulemusi
ky: Изделген нерсе табылды
or: ସର୍ଚ୍ଚ ଫଳାଫଳ ମିଳିଛି
te: సెర్చ్ ఫలితాలు కనుగొనబడ్డాయి
uz: Qidiruv natijalari topildi
zu: Imiphumela yokusesha itholakele

source: No results found
as: কোনো ফলাফল পোৱা নগ’ল
bn: কোনো ফলাফল পাওয়া যায়নি
et: Tulemusi ei leitud
ky: Эч нерсе табылган жок
or: କୌଣସି ଫଳାଫଳ ମିଳିଲା ନାହିଁ
te: ఫలితాలు ఏవీ కనుగొనబడలేదు
uz: Hech narsa topilmadi
zu: Ayikho imiphumela etholakele

# radioButtonUnselectedLabel
source: Not selected
as: বাছনি কৰা হোৱা নাই
bn: বেছে নেওয়া হয়নি
et: Pole valitud
ky: Тандалган жок
or: ଚୟନ କରାଯାଇନାହିଁ
te: ఎంచుకోబడలేదు
uz: Tanlanmagan
zu: Ayikhethiwe
