Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTabsScrollingTitle
source: Scrolling
af: Rollees
am: ሽብለላ
ar_eg: التمرير
as: স্ক্ৰ’ল হোৱা
az: Sürüşən
be: Прагортка
bn: স্ক্রলিং
bs: Klizanje
ca: Desplaçable
da: Kan rulle
es_ar: Con desplazamiento
et: Keritav
eu: Korritzen dena
fa: پیمایش
fil: Naso-scroll
fr_ca: Défilement
gl: Desprázase
gu: સ્ક્રોલ થાય તેવું
he: גלילה
hi: टैब बार जिसे स्क्रोल किया जा सकता है
hu: Görgethető
hy: Ոլորում
id: Scroll
it: Scorre
ja: スクロール可
ka: გადაადგილებადი
km: អាច​រំកិលបាន
kn: ಸ್ಕ್ರಾಲ್ ಮಾಡುವಿಕೆ
ko: 스크롤
ky: Сыдырылма
lo: ເລື່ອນໄດ້
lt: Slenkama
lv: Ritināšana
mk: Лизгање
ml: സ്‍ക്രോൾ ചെയ്യാവുന്നത്
mn: Гүйлгэх
mr: स्क्रोल करणारा
ms: Menatal
my: လှိမ့်ခြင်း
nb: Rullende
ne: स्क्रोल गर्ने
pa: ਸਕ੍ਰੋਲਿੰਗ
pl: Przewijany
pt: Rolagem
pt_pt: Deslocamento
ro: Derulantă
ru: Прокрутка
si: අනුචලනය කරමින්
sk: Posúvací
sq: Me lëvizje
sr: Померање
sr_latn: Pomeranje
sv: Scrollbar
te: స్క్రోల్ చేస్తోంది
th: แบบเลื่อน
tr: Kaydırarak
uk: Можна прокручувати
ur: اسکرولنگ
uz: Aylantirish
vi: Cuộn
zh_hk: 可捲動
zu: Iyapheqa

# demoTabsNonScrollingTitle
source: Non-scrolling
af: Nie-rollees
am: ሽብለላ ያልሆነ
ar_eg: عدم التمرير
as: স্ক্ৰ’ল নোহোৱা
az: Sürüşməyən
be: Без прагорткі
bn: নন-স্ক্রলিং
bs: Bez klizanja
ca: No desplaçable
da: Kan ikke rulle
es_ar: Sin desplazamiento
et: Mittekeritav
eu: Korritzen ez dena
fa: غیرپیمایشی
fil: Hindi naso-scroll
fr_ca: Pas de défilement
gl: Non se despraza
gu: સ્ક્રોલ ન થાય તેવું
he: ללא גלילה
hi: टैब बार जिसे स्क्रोल नहीं किया जा सकता
hu: Nem görgethető
hy: Առանց ոլորման
id: Non-scroll
it: Non scorre
ja: スクロール不可
ka: არაგადაადგილებადი
km: មិនអាច​រំកិលបាន
kn: ಸ್ಕ್ರೋಲಿಂಗ್ ಆಗದ
ko: 스크롤 불가능
ky: Сыдырылма эмес
lo: ເລື່ອນບໍ່ໄດ້
lt: Neslenkama
lv: Bez ritināšanas
mk: Без лизгање
ml: സ്ക്രോൾ ചെയ്യാനാവാത്തത്
mn: Гүйлгэх боломжгүй
mr: स्क्रोल न करणारा
ms: Bukan menatal
my: လှိမ့်၍မရသော
nb: Ikke-rullende
ne: स्क्रोल नगर्ने
pa: ਸਕ੍ਰੋਲਿੰਗ ਰਹਿਤ
pl: Nieprzewijany
pt: Sem rolagem
pt_pt: Sem deslocamento
ro: Nederulantă
ru: Без прокрутки
si: අනුචලනය නොකරමින්
sk: Neposúvací
sq: Pa lëvizje
sr: Без померања
sr_latn: Bez pomeranja
sv: Inte scrollbar
te: స్క్రోల్ చేయడం లేదు
th: แบบไม่เลื่อน
tr: Kaydırma olmadan
uk: Не можна прокручувати
ur: غیر اسکرولنگ
uz: Aylantirilmasin
vi: Không cuộn
zh_hk: 不可捲動
zu: Ukungaskroli

# craneHours
source: {hours, plural, =1{1h} other{{hours}h}}
af: {hours,plural,=1{1 u.}other{{hours} u.}}
am: {hours,plural,=1{1 ሰ}other{{hours} ሰ}}
ar_eg: {hours,plural,=1{1 س}zero{{hours} س}two{{hours} س}few{{hours} س}many{{hours} س}other{{hours} س}}
as: {hours,plural,=1{১ ঘ}other{{hours} ঘ}}
az: {hours,plural,=1{1 saat}other{{hours} saat}}
be: {hours,plural,=1{1 гадз}few{{hours} гадз}many{{hours} гадз}other{{hours} гадз}}
bn: {hours,plural,=1{১ ঘণ্টা}other{{hours} ঘণ্টা}}
bs: {hours,plural,=1{1 h}few{{hours} h}other{{hours} h}}
da: {hours,plural,=1{1 time}other{{hours} timer}}
fa: {hours,plural,=1{۱ ساعت}other{{hours} ساعت}}
gu: {hours,plural,=1{1 કલાક}other{{hours} કલાક}}
he: {hours,plural,=1{שעה}two{{hours} ש‘}other{{hours} ש‘}}
hi: {hours,plural,=1{1 घं.}other{{hours} घं.}}
hu: {hours,plural,=1{1 ó}other{{hours} ó}}
hy: {hours,plural,=1{1 ժ}other{{hours} ժ}}
id: {hours,plural,=1{1 jam}other{{hours} jam}}
ka: {hours,plural,=1{1 სთ}other{{hours} სთ}}
km: {hours,plural,=1{1 ម៉}other{{hours} ម៉}}
kn: {hours,plural,=1{1ಗಂ}other{{hours}ಗಂ}}
ko: {hours,plural,=1{1시간}other{{hours}시간}}
ky: {hours,plural,=1{1 с.}other{{hours} с.}}
lo: {hours,plural,=1{1ຊມ}other{{hours}ຊມ}}
lt: {hours,plural,=1{1 h}few{{hours} h}many{{hours} h}other{{hours} h}}
lv: {hours,plural,=1{1 h}zero{{hours} h}other{{hours} h}}
mk: {hours,plural,=1{1 ч.}other{{hours} ч.}}
ml: {hours,plural,=1{ഒരു മണിക്കൂർ}other{{hours}മണിക്കൂർ}}
mn: {hours,plural,=1{1 цаг}other{{hours}h}}
mr: {hours,plural,=1{१ता}other{{hours}ता}}
ms: {hours,plural,=1{1j}other{{hours}j}}
my: {hours,plural,=1{၁နာရီ}other{{hours}နာရီ}}
nb: {hours,plural,=1{1 t}other{{hours} t}}
ne: {hours,plural,=1{१ घन्टा}other{{hours} घन्टा}}
pa: {hours,plural,=1{1 ਘੰ.}other{{hours} ਘੰ.}}
pl: {hours,plural,=1{1 g}few{{hours} g}many{{hours} g}other{{hours} g}}
ro: {hours,plural,=1{1 h}few{{hours} h}other{{hours} de h}}
ru: {hours,plural,=1{1 ч.}few{{hours} ч.}many{{hours} ч.}other{{hours} ч.}}
si: {hours,plural,=1{පැ1}other{පැ{hours}}}
sk: {hours,plural,=1{1 h}few{{hours} h}many{{hours} h}other{{hours} h}}
sq: {hours,plural,=1{1 orë}other{{hours} orë}}
sr: {hours,plural,=1{1 ч}few{{hours} ч}other{{hours} ч}}
sr_latn: {hours,plural,=1{1 č}few{{hours} č}other{{hours} č}}
sv: {hours,plural,=1{1 t}other{{hours} t}}
te: {hours,plural,=1{1గం}other{{hours}గం}}
th: {hours,plural,=1{1 ชม.}other{{hours} ชม.}}
tr: {hours,plural,=1{1 sa.}other{{hours} sa.}}
uk: {hours,plural,=1{1 год}few{{hours} год}many{{hours} год}other{{hours} год}}
ur: {hours,plural,=1{1گھنٹہ}other{{hours} گھنٹے}}
uz: {hours,plural,=1{1 soat}other{{hours} soat}}
vi: {hours,plural,=1{1 giờ}other{{hours} giờ}}

# craneMinutes
source: {minutes, plural, =1{1m} other{{minutes}m}}
am: {minutes,plural,=1{1 ደ}other{{minutes}ደ}}
ar_eg: {minutes,plural,=1{1 د}zero{{minutes} د}two{{minutes} د}few{{minutes} د}many{{minutes} د}other{{minutes} د}}
as: {minutes,plural,=1{১ মি}other{{minutes} মি}}
az: {minutes,plural,=1{1 dəq}other{{minutes} dəq}}
be: {minutes,plural,=1{1 хв}few{{minutes} хв}many{{minutes} хв}other{{minutes} хв}}
bn: {minutes,plural,=1{১ মিনিট}other{{minutes} মিনিট}}
bs: {minutes,plural,=1{1 min}few{{minutes} min}other{{minutes} min}}
ca: {minutes,plural,=1{1 min}other{{minutes} min}}
da: {minutes,plural,=1{1 min.}other{{minutes} min.}}
et: {minutes,plural,=1{1 min}other{{minutes} min}}
eu: {minutes,plural,=1{1 min}other{{minutes} min}}
fa: {minutes,plural,=1{۱ دقیقه}other{{minutes} دقیقه}}
fr_ca: {minutes,plural,=1{1 min}other{{minutes} min}}
gl: {minutes,plural,=1{1 min}other{{minutes} min}}
gu: {minutes,plural,=1{1 મિનિટ}other{{minutes} મિનિટ}}
he: {minutes,plural,=1{דקה}two{{minutes} ד‘}other{{minutes} ד‘}}
hi: {minutes,plural,=1{1 मि.}other{{minutes} मि.}}
hu: {minutes,plural,=1{1 p}other{{minutes} p}}
hy: {minutes,plural,=1{1 ր}other{{minutes} ր}}
id: {minutes,plural,=1{1 mnt}other{{minutes} mnt}}
ka: {minutes,plural,=1{1 წთ}other{{minutes} წთ}}
km: {minutes,plural,=1{1 ន}other{{minutes} ន}}
kn: {minutes,plural,=1{1ನಿ}other{{minutes}ನಿ}}
ko: {minutes,plural,=1{1분}other{{minutes}분}}
ky: {minutes,plural,=1{1 мүн.}other{{minutes} мүн.}}
lo: {minutes,plural,=1{1ນທ}other{{minutes}ນທ}}
lt: {minutes,plural,=1{1 min}few{{minutes} min}many{{minutes} min}other{{minutes} min}}
lv: {minutes,plural,=1{1 min}zero{{minutes} min}other{{minutes} min}}
mk: {minutes,plural,=1{1 м.}other{{minutes} м.}}
ml: {minutes,plural,=1{ഒരു മിനിറ്റ്}other{{minutes}മിനിറ്റ്}}
mr: {minutes,plural,=1{१मि}other{{minutes}मि}}
my: {minutes,plural,=1{၁မိနစ်}other{{minutes}မိနစ်}}
ne: {minutes,plural,=1{१ मिनेट}other{{minutes} मिनेट}}
pa: {minutes,plural,=1{1 ਮਿੰ.}other{{minutes} ਮਿੰ.}}
pl: {minutes,plural,=1{1 min}few{{minutes} min}many{{minutes} min}other{{minutes} min}}
pt: {minutes,plural,=1{1min}other{{minutes}min}}
pt_pt: {minutes,plural,=1{1 min}other{{minutes} min}}
ro: {minutes,plural,=1{1 min.}few{{minutes} min.}other{{minutes} de min.}}
ru: {minutes,plural,=1{1 мин.}few{{minutes} мин.}many{{minutes} мин.}other{{minutes} мин.}}
si: {minutes,plural,=1{මි1}other{මි{minutes}}}
sk: {minutes,plural,=1{1 min}few{{minutes} min}many{{minutes} min}other{{minutes} min}}
sq: {minutes,plural,=1{1 min.}other{{minutes} min.}}
sr: {minutes,plural,=1{1 м}few{{minutes} м}other{{minutes} м}}
sr_latn: {minutes,plural,=1{1 m}few{{minutes} m}other{{minutes} m}}
te: {minutes,plural,=1{1నిమి}other{{minutes}నిమి}}
th: {minutes,plural,=1{1 นาที}other{{minutes} นาที}}
tr: {minutes,plural,=1{1 dk.}other{{minutes} dk.}}
uk: {minutes,plural,=1{1 хв}few{{minutes} хв}many{{minutes} хв}other{{minutes} хв}}
ur: {minutes,plural,=1{1منٹ}other{{minutes}منٹ}}
uz: {minutes,plural,=1{1 daqiqa}other{{minutes} daqiqa}}
vi: {minutes,plural,=1{1 phút}other{{minutes} phút}}

# dataTableHeader
source: Nutrition
af: Voeding
am: ስነ ምግብ
ar_eg: التغذية
as: পৰিপুষ্টি
az: Qidalanma
be: Харчаванне
bn: পুষ্টি
bs: Ishrana
ca: Nutrició
da: Ernæring
es_ar: Nutrición
et: Toitumine
eu: Elikadura
fa: تغذیه
fil: Nutrisyon
gl: Nutrición
gu: પોષણ
he: תזונה
hi: पोषण
hu: Táplálkozás
hy: Սնունդ
id: Gizi
it: Alimentazione
ja: 栄養
ka: კვება
km: អាហារូបត្ថម្ភ
kn: ಪೌಷ್ಟಿಕತೆ
ko: 영양
ky: Тамактануу
lo: ໂພຊະນາການ
lt: Mityba
lv: Uzturs
mk: Исхрана
ml: പോഷകാഹാരം
mn: Тэжээллэг чанар
mr: पोषण
ms: Pemakanan
my: အာဟာရ
nb: Ernæring
ne: पोषण
pa: ਪੋਸ਼ਣ
pl: Wartości odżywcze
pt: Valor nutricional
pt_pt: Nutrição
ro: Nutriție
ru: Питание
si: පෝෂණය
sk: Výživa
sq: Të ushqyerit
sr: Исхрана
sr_latn: Ishrana
sv: Näring
te: పోషకాహారం
th: โภชนาการ
tr: Beslenme
uk: Харчування
ur: غذائیت
uz: Ovqatlanish
vi: Dinh dưỡng
zh_hk: 營養
zu: Ukudla okunomsonco

# demoDatePickerTitle
source: Date Picker
af: Datumkieser
am: ቀን መራጭ
ar_eg: أداة اختيار التاريخ
as: তাৰিখ বাছনি কৰোঁতা
az: Tarix Seçicisi
be: Інструмент выбару даты
bn: তারিখ চয়নকারী
bs: Birač datuma
ca: Selector de data
da: Datovælger
es_ar: Selector de fecha
et: Kuupäevavalija
eu: Data-hautatzailea
fa: انتخابگر تاریخ
fil: Picker ng Petsa
fr_ca: Sélecteur de dates
gl: Selector de data
gu: તારીખ પિકર
he: בורר תאריך
hi: तारीख चुनने वाला टूल
hu: Dátumválasztó
hy: Ամսաթվի ընտրիչ
id: Alat Pilih Tanggal
it: Selettore data
ja: 日付選択ツール
ka: თარიღის ამომრჩევი
km: ផ្ទាំង​ជ្រើសរើស​កាលបរិច្ឆេទ
kn: ದಿನಾಂಕ ಪಿಕರ್
ko: 날짜 선택도구
ky: Күн тандагыч
lo: ຕົວເລືອກວັນທີ
lt: Datos rinkiklis
lv: Datuma atlasītājs
mk: Избирач на датум
ml: തീയതി പിക്കർ
mn: Огноо сонгогч
mr: तारीख पिकर
ms: Pemilih Tarikh
my: ရက်စွဲ ရွေးချယ်ရေးစနစ်
nb: Datovelger
ne: मिति चयनकर्ता
pa: ਤਾਰੀਖ ਚੋਣਕਾਰ
pl: Selektor daty
pt: Seletor de data
pt_pt: Selecionador de data
ro: Selector de dată
ru: Окно выбора даты
si: දින තෝරකය
sk: Výber dátumu
sq: Zgjedhësi i datës
sr: Бирач датума
sr_latn: Birač datuma
sv: Datumväljare
te: తేదీ పికర్
th: เครื่องมือเลือกวันที่
tr: Tarih Seçici
uk: Засіб вибору дати
ur: تاریخ منتخب کنندہ
uz: Sana tanlash oynasi
vi: Bộ chọn ngày
zh_hk: 日期點選器
zu: Isikhi sedethi

# demoPickersSubtitle
source: Date and time selection
af: Keuse van datum en tyd
am: የቀን እና ሰዓት ምርጫ
ar_eg: اختيار التاريخ والوقت
as: তাৰিখ আৰু সময়ৰ বাছনি
az: Tarix və vaxt seçimi
be: Выбар даты і часу
bn: তারিখ ও সময় বাছাই
bs: Odabir datuma i vremena
ca: Selecció de data i hora
da: Valg af dato og tids
es_ar: Selección de fecha y hora
et: Kuupäeva ja kellaaja valimine
eu: Data eta orduaren hautapena
fa: انتخاب تاریخ و زمان
fil: Pagpili ng petsa at oras
fr_ca: Sélection de la date et de l'heure
gl: Selección de data e hora
gu: તારીખ અને સમયની પસંદગી
he: בחירה בתאריך ובשעה
hi: तारीख और समय चुनना
hu: Dátum és idő kiválasztása
hy: Ամսաթվի և ժամի ընտրություն
id: Pemilihan Tanggal dan Waktu
it: Selezione di data e ora
ja: 日付と時刻の選択
ka: თარიღისა და დროის არჩევა
km: ការជ្រើសរើស​កាលបរិច្ឆេទ និងម៉ោង
kn: ದಿನಾಂಕ ಮತ್ತು ಸಮಯದ ಅಯ್ಕೆ
ko: 날짜 및 시간 선택
ky: Күн менен убакытты тандоо
lo: ການເລືອກວັນທີ ແລະ ເວລາ
lt: Datos ir laiko pasirinkimas
lv: Datuma un laika atlasīšana
mk: Избор на датум и време
ml: തീയതിയും സമയവും തിരഞ്ഞെടുക്കൽ
mn: Огноо болон цагийн сонголт
mr: तारीख आणि वेळ निवड
ms: Pilihan tarikh dan masa
my: ရက်စွဲနှင့် အချိန် ရွေးချယ်မှု
nb: Valg av dato og klokkeslett
ne: मिति तथा समयको चयन
pa: ਤਾਰੀਖ ਅਤੇ ਸਮੇਂ ਦੀ ਚੋਣ
pl: Wybór daty i godziny
pt: Seleção de data e horário
pt_pt: Seleção de data e hora
ro: Selecția pentru dată și oră
ru: Выбор даты и времени
si: දිනය සහ වේලාව තේරීම
sk: Výber dátumu a času
sq: Zgjedhja e datës dhe orës
sr: Бирање датума и времена
sr_latn: Biranje datuma i vremena
sv: Val av datum och tid
te: తేదీ, సమయం ఎంపిక
th: การเลือกวันที่และเวลา
tr: Tarih ve saat seçme
uk: Вибір дати й часу
ur: تاریخ اور وقت کا انتخاب
uz: Sana va vaqtni tanlash
vi: Chọn ngày và giờ
zh_hk: 選擇日期和時間
zu: Ukukhetha usuku nesikhathi

# demoPickersTitle
source: Pickers
af: Kiesers
am: መራጮች
ar_eg: أدوات اختيار الوقت
as: বাছনি কৰোঁতাসকল
az: Seçicilər
be: Інструменты выбару
bn: চয়নকারী
bs: Birači
ca: Selectors
da: Vælgere
es_ar: Selectores
et: Valijad
eu: Hautatzaileak
fa: انتخابگر
fil: Mga Picker
fr_ca: Sélecteurs
gl: Selectores
gu: પિકર
he: בוררים
hi: तारीख और समय चुनने वाले टूल
hu: Választók
hy: Ընտրիչներ
id: Alat Pilih
it: Selettori
ja: 選択ツール
ka: ამომრჩევები
km: ផ្ទាំងជ្រើសរើស
kn: ಪಿಕರ್‌ಗಳು
ko: 선택도구
ky: Тандагычтар
lo: ຕົວເລືອກ
lt: Rinkikliai
lv: Atlasītāji
mk: Избирачи
ml: പിക്കറുകൾ
mn: Сонгогч
mr: पिकर
ms: Pemilih
my: ရွေးချယ်ရေးစနစ်များ
nb: Velgere
ne: चयनकर्ता
pa: ਚੋਣਕਾਰ
pl: Selektory
pt: Seletores
pt_pt: Selecionadores
ro: Selectori
ru: Окна выбора
si: තෝරක
sk: Výbery
sq: Zgjedhësit
sr: Бирачи
sr_latn: Birači
sv: Väljare
te: పికర్‌లు
th: เครื่องมือเลือก
tr: Seçiciler
uk: Засоби вибору
ur: تاریخ اور وقت منتخب کرنے والے ٹولز
uz: Tanlash oynasi
vi: Bộ chọn
zh_hk: 點選器
zu: Izikhi

# demo2dTransformationsEditTooltip
source: Edit tile
af: Wysig teël
am: ስድርን አርትዕ ያድርጉ
ar_eg: تعديل المربّع
as: টাইল সম্পাদনা কৰক
az: Lövhəciyə düzəliş edin
be: Змяніць плітку
bn: শীর্ষক এডিট করুন
bs: Uredite naslov
ca: Edita el mosaic
da: Rediger felt
es_ar: Editar mosaico
et: Paani muutmine
eu: Editatu lauza
fa: ویرایش کاشی
fil: I-edit ang tile
fr_ca: Modifier la tuile
gl: Editar o mosaico
gu: ટાઇલમાં ફેરફાર કરો
he: עריכת אריח
hi: टाइल में बदलाव करें
hu: Mozaik szerkesztése
hy: Փոփոխել սալիկը
id: Edit potongan foto
it: Modifica riquadro
ja: タイルを編集
ka: ბლოკის რედაქტირება
km: កែ​ប្រអប់
kn: ಟೈಲಕ್ ಅನ್ನು ಎಡಿಟ್ ಮಾಡಿ
ko: 타일 수정
ky: Мозаиканы түзөтүү
lo: ແກ້ໄຂແຜ່ນ
lt: Redaguoti išklotinės elementą
lv: Rediģēt elementu
mk: Изменете го насловот
ml: ടൈൽ എഡിറ്റ് ചെയ്യുക
mn: Хавтан засах
mr: टाइल संपादित करा
ms: Edit jubin
my: လေးထောင့်ကွက်ကို တည်းဖြတ်ရန်
nb: Rediger tittelen
ne: टाइल सम्पादन गर्नुहोस्
pa: ਟਾਇਲ ਦਾ ਸੰਪਾਦਨ ਕਰੋ
pl: Edytuj kafelek
pt: Editar bloco
pt_pt: Editar mosaico
ro: Editați fila
ru: Изменить элемент
si: ටයිල් සංස්කරණය කරන්න
sk: Upraviť dlaždicu
sq: Modifiko pllakëzën
sr: Измените део слике
sr_latn: Izmenite deo slike
sv: Redigera ram
te: టైల్‌లను ఎడిట్ చేయండి
th: แก้ไขชิ้นส่วน
tr: Bloğu düzenle
uk: Змінити мозаїку
ur: ٹائل میں ترمیم کریں
uz: Katakchani tahrirlash
vi: Chỉnh sửa thẻ thông tin
zh_hk: 編輯圖塊
zu: Hlela uthayela
