Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneFly0
source: Aspen, United States
af: Aspen, Verenigde State
am: አስፐን፣ አሜሪካ
ar_eg: أسبن، الولايات المتحدة
as: এছপেন, মার্কিন যুক্তৰাষ্ট্ৰ
az: Aspen, ABŞ
be: Аспен, ЗША
bn: অ্যাসপেন, মার্কিন যুক্তরাষ্ট্র
bs: Aspen, Sjedinjene Američke Države
ca: Aspen, Estats Units
da: Aspen, USA
es_ar: Aspen, Estados Unidos
et: Aspen, Ameerika Ühendriigid
eu: Aspen (Ameriketako Estatu Batuak)
fa: آسپن، ایالات متحده
fr_ca: Aspen, États-Unis
gl: Aspen, Estados Unidos
gu: અસ્પેન, યુનાઇટેડ સ્ટેટ્સ
he: אספן, ארצות הברית
hi: ऐस्पन, अमेरिका
hu: Aspen, Amerikai Egyesült Államok
hy: Ասպեն, ԱՄՆ
id: Aspen, Amerika Serikat
it: Aspen, Stati Uniti
ja: アスペン（米国）
ka: ასპენი, შეერთებული შტატები
km: អាស្ប៉ិន សហរដ្ឋ​អាមេរិក
kn: ಆಸ್ಪೆನ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 애스펀
ky: Аспен, Америка Кошмо Штаттары
lo: ແອສເພນ, ສະຫະລັດ
lt: Aspenas, Jungtinės Amerikos Valstijos
lv: Espena, ASV
mk: Аспен, САД
ml: ആസ്പെൻ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Аспен
mr: ॲस्पेन, युनायटेड स्टेट्स
ms: Aspen, Amerika Syarikat
my: အက်စ်ပန်၊ အမေရိကန် ပြည်ထောင်စု
nb: Aspen, USA
ne: एस्पेन, संयुक्त राज्य अमेरिका
pa: ਐਸਪਨ, ਸੰਯੁਕਤ ਰਾਜ
pl: Aspen, Stany Zjednoczone
pt: Aspen, Estados Unidos
pt_pt: Aspen, Estados Unidos
ro: Aspen, Statele Unite
ru: Аспен, США
si: ඇස්පෙන්, එක්සත් ජනපදය
sk: Aspen, USA
sr: Аспен, Сједињене Америчке Државе
sr_latn: Aspen, Sjedinjene Američke Države
sv: Aspen, USA
te: ఆస్పెన్, యునైటెడ్ స్టేట్స్
th: แอสเพน สหรัฐอเมริกา
tr: Aspen, ABD
uk: Аспен, США
ur: اسپین، ریاستہائے متحدہ
uz: Aspen, AQSH
vi: Aspen, Hoa Kỳ
zh_hk: 美國阿斯彭
zu: I-Aspen, United States

# demoCupertinoSegmentedControlSubtitle
source: iOS-style segmented control
af: Gesegmenteerde kontrole in iOS-styl
am: በiOS-ቅጥ የተከፋፈለ መቆጣጠሪያ
ar_eg: عنصر تحكّم شريحة بنمط iOS
as: iOS-শৈলীৰ বিভাজিত নিয়ন্ত্ৰণ
az: iOS üslubunda seqmentləşdirilmiş nəzarət
be: Сегментаваныя элементы кіравання ў стылі iOS
bn: iOS-স্টাইলে বিভাগীয় নিয়ন্ত্রন
bs: Segmentirano kontroliranje u stilu iOS-a
ca: Control segmentat d'estil iOS
da: Segmenteret styring i iOS-stil
es_ar: Control segmentado de estilo iOS
et: iOS-i stiilis segmenditud juhtimine
eu: iOS estiloarekin segmentatutako kontrola
fa: کنترل تقسیم‌بندی‌شده سبک iOS
fil: iOS-style na naka-segment na control
fr_ca: Contrôle segmenté de style iOS
gl: Control segmentado ao estilo de iOS
gu: iOS-શૈલીના વિભાગ મુજબ નિયંત્રણ
he: בקרה מחולקת בסגנון iOS
hi: iOS की शैली वाले सेगमेंट में दिया नियंत्रण
hu: iOS-stílusú szegmentált vezérlés
hy: iOS-ի ոճով սեգմենտավորված կառավարման տարր
id: Kontrol tersegmen gaya iOS
it: Controllo segmentato in stile iOS
ja: iOS スタイルのセグメンテッド コントロール
ka: iOS-სტილის სეგმენტირებული მართვა
km: ការគ្រប់គ្រង​ដែលបែងចែក​ជាផ្នែក​តាមរចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿಯ ವಿಭಾಗೀಕರಣದ ನಿಯಂತ್ರಣ
ko: iOS 스타일 세그먼트 컨트롤
ky: iOS стилиндеги сегменттер боюнча көзөмөлдөө
lo: ການຄວບຄຸມແຍກສ່ວນແບບ iOS
lt: „iOS“ stiliaus segmentuotas valdiklis
lv: iOS stila segmentēta pārvaldība
mk: Сегментирана контрола во iOS-стил
ml: iOS-സ്റ്റെെലിലുള്ള വിഭാഗീകരിച്ച നിയന്ത്രണം
mn: iOS загварын хэсэгчилсэн хяналт
mr: iOS शैलीचे विभाजित नियंत्रण
ms: Kawalan disegmenkan gaya iOS
my: iOS ပုံစံ အပိုင်းလိုက် ထိန်းချုပ်မှု
nb: Segmentert kontroll i iOS-stil
ne: iOS शैलीको सेग्मेन्ट गरिएका अवयवको नियन्त्रण
pa: iOS-style ਉਪ-ਸਮੂਹ ਕੰਟਰੋਲ
pl: Sterowanie segmentowe w stylu iOS
pt: Controle segmentado no estilo iOS
pt_pt: Controlo segmentado ao estilo do iOS.
ro: Control segmentat în stil iOS
ru: Сегментированный элемент управления в стиле iOS
si: iOS-විලාස කොටස් කළ පාලනය
sk: Segmentované ovládanie v štýle systému iOS
sq: Kontrolli i segmentuar në stilin e iOS
sr: Сегментирана контрола у iOS стилу
sr_latn: Segmentirana kontrola u iOS stilu
sv: Segmentstyrning i iOS-stil
te: iOS-శైలి 'విభజించబడిన నియంత్రణ'
th: ส่วนควบคุมที่แบ่งกลุ่มแบบ iOS
tr: iOS-tarzı bölümlere ayrılmış kontrol
uk: Сегментований контроль у стилі iOS
ur: iOS طرز کا سیگمنٹ کردہ کنٹرول
uz: iOS uslubidagi boshqaruv elementlari
vi: Chế độ kiểm soát được phân đoạn theo kiểu iOS
zh_hk: iOS 樣式的劃分控制
zu: ulawulo olwenziwe isegmenti lwesitayela se-iOS

# craneSleep10
source: Cairo, Egypt
af: Kaïro, Egipte
am: ካይሮ፣ ግብጽ
ar_eg: القاهرة، مصر
as: কাইৰ', ঈজিপ্ত
az: Qahirə, Misir
be: Каір, Егіпет
bn: কায়েরো, মিশর
bs: Kairo, Egipat
ca: El Caire, Egipte
da: Cairo, Egypten
es_ar: El Cairo, Egipto
et: Kairo, Egiptus
eu: Kairo (Egipto)
fa: قاهره، مصر
fr_ca: Le Caire, Égypte
gl: O Cairo, Exipto
gu: કેરો, ઇજિપ્ત
he: קהיר, מצרים
hi: काहिरा, मिस्र
hu: Kairó, Egyiptom
hy: Կահիրե, Եգիպտոս
id: Kairo, Mesir
it: Il Cairo, Egitto
ja: カイロ（エジプト）
ka: კაირო, ეგვიპტე
km: គែរ អេហ្ស៊ីប
kn: ಕೈರೊ, ಈಜಿಪ್ಟ್
ko: 이집트 카이로
ky: Каир, Египет
lo: ໄຄໂຣ, ອີ​ຢິບ
lt: Kairas, Egiptas
lv: Kaira, Ēģipte
mk: Каиро, Египет
ml: കെയ്‌റോ, ഈജിപ്ത്
mn: Египет, Каир
mr: कैरो, इजिप्त
ms: Kaherah, Mesir
my: ကိုင်ရို၊ အီဂျစ်
nb: Kairo, Egypt
ne: कायरो, इजिप्ट
pa: ਕਾਹਿਰਾ, ਮਿਸਰ
pl: Kair, Egipt
pt: Cairo, Egito
pt_pt: Cairo, Egito
ro: Cairo, Egipt
ru: Каир, Египет
si: කයිරෝ, ඊජිප්තුව
sk: Káhira, Egypt
sq: Kajro, Egjipt
sr: Каиро, Египат
sr_latn: Kairo, Egipat
sv: Kairo, Egypten
te: కైరో, ఈజిప్ట్
th: ไคโร อียิปต์
tr: Kahire, Mısır
uk: Каїр, Єгипет
ur: قاہرہ، مصر
uz: Qohira, Misr
vi: Cairo, Ai Cập
zh_hk: 埃及開羅
zu: I-Cairo, Egypt

# craneEat9
source: Madrid, Spain
af: Madrid, Spanje
am: ማድሪድ፣ ስፔን
ar_eg: مدريد، إسبانيا
as: মাদ্ৰিদ, স্পেইন
az: Madrid, İspaniya
be: Мадрыд, Іспанія
bn: মাদ্রিদ, স্পেন
bs: Madrid, Španija
ca: Madrid, Espanya
da: Madrid, Spanien
es_ar: Madrid, España
et: Madrid, Hispaania
eu: Madril (Espainia)
fa: مادرید، اسپانیا
fr_ca: Madrid, Espagne
gl: Madrid, España
gu: મેડ્રિડ, સ્પેઇન
he: מדריד, ספרד
hi: मैड्रिड, स्पेन
hu: Madrid, Spanyolország
hy: Մադրիդ, Իսպանիա
id: Madrid, Spanyol
it: Madrid, Spagna
ja: マドリッド（スペイン）
ka: მადრიდი, ესპანეთი
km: ម៉ាឌ្រីដ អេស្ប៉ាញ
kn: ಮ್ಯಾಡ್ರಿಡ್, ಸ್ಪೇನ್
ko: 스페인 마드리드
ky: Мадрид, Испания
lo: ມາດຣິດ​, ສະເປນ
lt: Madridas, Ispanija
lv: Madride, Spānija
mk: Мадрид, Шпанија
ml: മാഡ്രിഡ്, സ്‌പെയിൻ
mn: Испани, Мадрид
mr: माद्रिद, स्पेन
ms: Madrid, Sepanyol
my: မဒရစ်၊ စပိန်
nb: Madrid, Spania
ne: म्याड्रिड, स्पेन
pa: ਮਾਦਰੀਦ, ਸਪੇਨ
pl: Madryt, Hiszpania
pt: Madri, Espanha
pt_pt: Madrid, Espanha
ro: Madrid, Spania
ru: Мадрид, Испания
si: මැඩ්‍රිඩ්, ස්පාඤ්ඤය
sk: Madrid, Španielsko
sq: Madrid, Spanjë
sr: Мадрид, Шпанија
sr_latn: Madrid, Španija
sv: Madrid, Spanien
te: మాడ్రిడ్, స్పెయిన్
th: มาดริด สเปน
tr: Madrid, İspanya
uk: Мадрид, Іспанія
ur: میڈرڈ، ہسپانیہ
uz: Madrid, Ispaniya
vi: Madrid, Tây Ban Nha
zh_hk: 西班牙馬德里
zu: I-Madrid, Spain

# craneFly1
source: Big Sur, United States
af: Big Sur, Verenigde State
am: ቢግ ሱር፣ አሜሪካ
ar_eg: بيغ سور، الولايات المتحدة
as: বিগ ছুৰ, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Biq Sur, ABŞ
be: Біг-Сур, ЗША
bn: বিগ সার, মার্কিন যুক্তরাষ্ট্র
bs: Big Sur, Sjedinjene Američke Države
ca: Big Sur, Estats Units
da: Big Sur, USA
es_ar: Big Sur, Estados Unidos
et: Big Sur, Ameerika Ühendriigid
eu: Big Sur (Ameriketako Estatu Batuak)
fa: بیگ سور، ایالات متحده
fr_ca: Big Sur, États-Unis
gl: Big Sur, Estados Unidos
gu: બિગ સર, યુનાઇટેડ સ્ટેટ્સ
he: ביג סר, ארצות הברית
hi: बिग सर, अमेरिका
hu: Big Sur, Amerikai Egyesült Államok
hy: Բիգ Սուր, ԱՄՆ
id: Big Sur, Amerika Serikat
it: Big Sur, Stati Uniti
ja: ビッグサー（米国）
ka: ბიგ სური, შეერთებული შტატები
km: ប៊ីកសឺ សហរដ្ឋ​អាមេរិក
kn: ಬಿಗ್ ಸುರ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 빅 서어
ky: Биг-Сур, Америка Кошмо Штаттары
lo: ບິກເຊີ, ສະຫະລັດ
lt: Big Sur, Jungtinės Amerikos Valstijos
lv: Bigsura, ASV
mk: Биг Сур, САД
ml: ബിഗ് സുർ, യുണൈറ്റഡ് സ്‌റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Биг Сур
mr: बिग सुर, युनायटेड स्टेट्स
ms: Big Sur, Amerika Syarikat
my: ဘစ်စာ၊ အမေရိကန် ပြည်ထောင်စု
nb: Big Sur, USA
ne: बिग सुर, संयुक्त राज्य अमेरिका
pa: ਬਿੱਗ ਸਰ, ਸੰਯੁਕਤ ਰਾਜ
pl: Big Sur, Stany Zjednoczone
pt: Big Sur, Estados Unidos
pt_pt: Big Sur, Estados Unidos
ro: Big Sur, Statele Unite
ru: Биг-Сур, США
si: බිග් සර්, එක්සත් ජනපදය
sk: Big Sur, USA
sq: Big Sur, Shtetet e Bashkuara
sr: Биг Сур, Сједињене Америчке Државе
sr_latn: Big Sur, Sjedinjene Američke Države
sv: Big Sur, USA
te: బిగ్ సర్, యునైటెడ్ స్టేట్స్
th: บิ๊กเซอร์ สหรัฐอเมริกา
tr: Big Sur, ABD
uk: Біґ-Сур, США
ur: بگ سور، ریاستہائے متحدہ
uz: Katta Sur, AQSH
vi: Big Sur, Hoa Kỳ
zh_hk: 美國大蘇爾
zu: I-Big Sur, United States

# craneEat7
source: Nashville, United States
af: Nashville, Verenigde State
am: ናሽቪል፣ አሜሪካ
ar_eg: ناشفيل، الولايات المتحدة
as: নাশ্বভিল্লে, মার্কিন যুক্তৰাষ্ট্ৰ
az: Neşvill, ABŞ
be: Нашвіл, ЗША
bn: ন্যাসভেলি, মার্কিন যুক্তরাষ্ট্র
bs: Nashville, Sjedinjene Američke Države
ca: Nashville, Estats Units
da: Nashville, USA
es_ar: Nashville, Estados Unidos
et: Nashville, Ameerika Ühendriigid
eu: Nashville (Ameriketako Estatu Batuak)
fa: نشویل، ایالات متحده
fr_ca: Nashville, États-Unis
gl: Nashville, Estados Unidos
gu: નેશવિલે, યુનાઇટેડ સ્ટેટ્સ
he: נאשוויל, ארצות הברית
hi: नैशविल, अमेरिका
hu: Nashville, Amerikai Egyesült Államok
hy: Նեշվիլ, ԱՄՆ
id: Nashville, Amerika Serikat
it: Nashville, Stati Uniti
ja: ナッシュビル（米国）
ka: ნეშვილი, შეერთებული შტატები
km: ណាសវីល សហរដ្ឋ​អាមេរិក
kn: ನ್ಯಾಶ್ವಿಲ್ಲೆ, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 내슈빌
ky: Нашвилл, Америка Кошмо Штаттары
lo: ແນຊວິວ, ສະຫະລັດ
lt: Našvilis, Jungtinės Amerikos Valstijos
lv: Našvila, ASV
mk: Нешвил, САД
ml: നാഷ്‌വിൽ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Нашвилл
mr: नॅशविल, युनायटेड स्टेट्स
ms: Nashville, Amerika Syarikat
my: နက်ရှ်ဗီးလ်၊ အမေရိကန် ပြည်ထောင်စု
nb: Nashville, USA
ne: न्यासभिल, संयुक्त राज्य अमेरिका
pa: ਨੈਸ਼ਵਿਲ, ਸੰਯੁਕਤ ਰਾਜ
pl: Nashville, Stany Zjednoczone
pt: Nashville, Estados Unidos
pt_pt: Nashville, Estados Unidos
ro: Nashville, Statele Unite
ru: Нашвилл, США
si: නෑෂ්විල්, එක්සත් ජනපදය
sk: Nashville, USA
sq: Nashvill, Shtetet e Bashkuara
sr: Нешвил, Сједињене Америчке Државе
sr_latn: Nešvil, Sjedinjene Američke Države
sv: Nashville, USA
te: నాష్విల్లె, యునైటెడ్ స్టేట్స్
th: แนชวิลล์ สหรัฐอเมริกา
tr: Nashville, ABD
uk: Нашвілл, США
ur: نیش ول، ریاستہائے متحدہ
uz: Neshvill, AQSH
vi: Nashville, Hoa Kỳ
zh_hk: 美國納什維爾
zu: I-Nashville, United States

# craneEat6
source: Seattle, United States
af: Seattle, Verenigde State
am: ሲያትል፣ አሜሪካ
ar_eg: سياتل، الولايات المتحدة
as: ছিট্টেল, আমেৰিকা যুক্তৰাষ্ট্ৰ
az: Sietl, ABŞ
be: Сіэтл, ЗША
bn: সিয়াটেল, মার্কিন যুক্তরাষ্ট্র
bs: Seattle, Sjedinjene Američke Države
ca: Seattle, Estats Units
da: Seattle, USA
es_ar: Seattle, Estados Unidos
et: Seattle, Ameerika Ühendriigid
eu: Seattle (Ameriketako Estatu Batuak)
fa: سیاتل، ایالات متحده
fr_ca: Seattle, États-Unis
gl: Seattle, Estados Unidos
gu: સિએટલ, યુનાઇટેડ સ્ટેટ્સ
he: סיאטל, ארצות הברית
hi: सिएटल, अमेरिका
hu: Seattle, Amerikai Egyesült Államok
hy: Սիեթլ, ԱՄՆ
id: Seattle, Amerika Serikat
it: Seattle, Stati Uniti
ja: シアトル（米国）
ka: სიეტლი, შეერთებული შტატები
km: ស៊ីអាថល សហរដ្ឋ​អាមេរិក
kn: ಸಿಯಾಟಲ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 시애틀
ky: Сиетл, Америка Кошмо Штаттары
lo: ຊີເອເທິນ, ສະຫະລັດ
lt: Siatlas, Jungtinės Amerikos Valstijos
lv: Sietla, ASV
mk: Сиетл, САД
ml: സീറ്റിൽ, യുണൈറ്റഡ് സ്‌റ്റേറ്റ്‌സ്
mn: Америкийн Нэгдсэн Улс, Сиэтл
mr: सीएटल, युनायटेड स्‍टेट्‍स
ms: Seattle, Amerika Syarikat
my: ဆီယက်တဲ၊ အမေရိကန် ပြည်ထောင်စု
nb: Seattle, USA
ne: सियाटल, संयुक्त राज्य अमेरिका
pa: ਸੀਐਟਲ, ਸੰਯੁਕਤ ਰਾਜ
pl: Seattle, Stany Zjednoczone
pt: Seattle, Estados Unidos
pt_pt: Seattle, Estados Unidos
ro: Seattle, Statele Unite
ru: Сиэтл, США
si: සියැටල්, එක්සත් ජනපදය
sk: Seattle, USA
sq: Siatëll, Shtetet e Bashkuara
sr: Сијетл, Сједињене Америчке Државе
sr_latn: Sijetl, Sjedinjene Američke Države
sv: Seattle, USA
te: సీటెల్, యునైటెడ్ స్టేట్స్
th: ซีแอตเทิล สหรัฐอเมริกา
tr: Seattle, ABD
uk: Сіетл, США
ur: سی‏ئٹل، ریاستہائے متحدہ
uz: Sietl, AQSH
vi: Seattle, Hoa Kỳ
zh_hk: 美國西雅圖
zu: I-Seattle, United States

# craneFly8
source: Singapore
af: Singapoer
am: ሲንጋፖር
ar_eg: سنغافورة
as: ছিংগাপুৰ
az: Sinqapur
be: Сінгапур
bn: সিঙ্গাপুর
bs: Singapur
ca: Singapur
es_ar: Singapur
et: Singapur
eu: Singapur
fa: سنگاپور
fr_ca: Singapour
gl: Singapur
gu: સિંગાપુર
he: סינגפור
hi: सिंगापुर
hu: Szingapúr
hy: Սինգապուր
id: Singapura
ja: シンガポール
ka: სინგაპური
km: សិង្ហបុរី
kn: ಸಿಂಗಾಪುರ್
ko: 싱가포르
ky: Сингапур
lo: ສິງກະໂປ
lt: Singapūras
lv: Singapūra
mk: Сингапур
ml: സിംഗപ്പൂർ
mn: Сингапур
mr: सिंगापूर
ms: Singapura
my: စင်္ကာပူ
ne: सिङ्गापुर
pa: ਸਿੰਗਾਪੁਰ
pl: Singapur
pt: Singapura
pt_pt: Singapura
ru: Сингапур
si: සිංගප්පූරුව
sk: Singapur
sq: Singapor
sr: Сингапур
sr_latn: Singapur
te: సింగపూర్
th: สิงคโปร์
tr: Singapur
uk: Сінгапур
ur: سنگاپور
uz: Singapur
zh_hk: 新加坡
zu: U-Singapore

# craneEat4
source: Paris, France
af: Parys, Frankryk
am: ፓሪስ፣ ፈረንሳይ
ar_eg: باريس، فرنسا
as: পেৰিছ, ফ্ৰান্স
az: Paris, Fransa
be: Парыж, Францыя
bn: প্যারিস, ফ্রান্স
bs: Pariz, Francuska
ca: París, França
da: Paris, Frankrig
es_ar: París, Francia
et: Pariis, Prantsusmaa
eu: Paris (Frantzia)
fa: پاریس، فرانسه
gl: París, Francia
gu: પેરિસ, ફ્રાન્સ
he: פריז, צרפת
hi: पेरिस, फ़्रांस
hu: Párizs, Franciaország
hy: Փարիզ, Ֆրանսիա
id: Paris, Prancis
it: Parigi, Francia
ja: パリ（フランス）
ka: პარიზი, საფრანგეთი
km: ប៉ារីស បារាំង
kn: ಪ್ಯಾರಿಸ್‌, ಫ್ರಾನ್ಸ್‌‌
ko: 프랑스 파리
ky: Париж, Франция
lo: ປາຣີສ, ຝຣັ່ງ
lt: Paryžius, Prancūzija
lv: Parīze, Francija
mk: Париз, Франција
ml: പാരീസ്, ഫ്രാൻസ്
mn: Франц, Парис
mr: पॅरिस, फ्रान्स
ms: Paris, Perancis
my: ပဲရစ်၊ ပြင်သစ်
nb: Paris, Frankrike
ne: पेरिस, फ्रान्स
pa: ਪੈਰਿਸ, ਫਰਾਂਸ
pl: Paryż, Francja
pt: Paris, França
pt_pt: Paris, França
ro: Paris, Franța
ru: Париж, Франция
si: පැරීසිය, ප්‍රංශය
sk: Paríž, Francúzsko
sq: Paris, Francë
sr: Париз, Француска
sr_latn: Pariz, Francuska
sv: Paris, Frankrike
te: పారిస్, ఫ్రాన్స్
th: ปารีส ฝรั่งเศส
tr: Paris, Fransa
uk: Париж, Франція
ur: پیرس، فرانس
uz: Parij, Fransiya
vi: Paris, Pháp
zh_hk: 法國巴黎
zu: I-Paris, France

# craneEat3
source: Portland, United States
af: Portland, Verenigde State
am: ፖርትላንድ፣ አሜሪካ
ar_eg: بورتلاند، الولايات المتحدة
as: পৰ্টলেণ্ড, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Portlend, ABŞ
be: Портланд, ЗША
bn: পোর্টল্যান্ড, মার্কিন যুক্তরাষ্ট্র
bs: Portland, Sjedinjene Američke Države
ca: Portland, Estats Units
da: Portland, USA
es_ar: Portland, Estados Unidos
et: Portland, Ameerika Ühendriigid
eu: Portland (Ameriketako Estatu Batuak)
fa: پورتلند، ایالات متحده
fr_ca: Portland, États-Unis
gl: Portland, Estados Unidos
gu: પૉર્ટલેન્ડ, યુનાઇટેડ સ્ટેટ્સ
he: פורטלנד, ארצות הברית
hi: पोर्टलैंड, अमेरिका
hu: Portland, Amerikai Egyesült Államok
hy: Փորթլենդ, ԱՄՆ
id: Portland, Amerika Serikat
it: Portland, Stati Uniti
ja: ポートランド（米国）
ka: პორტლენდი, შეერთებული შტატები
km: ផតឡែន សហរដ្ឋ​អាមេរិក
kn: ಪೋರ್ಟ್‌ಲ್ಯಾಂಡ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 포틀랜드
ky: Портлэнд, Америка Кошмо Штаттары
lo: ພອດແລນ, ສະຫະລັດ
lt: Portlandas, Jungtinės Amerikos Valstijos
lv: Portlenda, ASV
mk: Портланд, САД
ml: പോർട്ട്ലൻഡ്, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Портланд
mr: पोर्टलंड, युनायटेड स्टेट्स
ms: Portland, Amerika Syarikat
my: ပေါ့တ်လန်၊ အမေရိကန် ပြည်ထောင်စု
nb: Portland, USA
ne: पोर्टल्यान्ड, संयुक्त राज्य अमेरिका
pa: ਪੋਰਟਲੈਂਡ, ਸੰਯੁਕਤ ਰਾਜ
pl: Portland, Stany Zjednoczone
pt: Portland, Estados Unidos
pt_pt: Portland, Estados Unidos
ro: Portland, Statele Unite
ru: Портленд, США
si: පෝට්ලන්ඩ්, එක්සත් ජනපදය
sk: Portland, USA
sq: Portland, Shtetet e Bashkuara
sr: Портланд, Сједињене Америчке Државе
sr_latn: Portland, Sjedinjene Američke Države
sv: Portland, USA
te: పోర్ట్‌ల్యాండ్, యునైటెడ్ స్టేట్స్
th: พอร์ตแลนด์ สหรัฐอเมริกา
tr: Portland, ABD
uk: Портленд, США
ur: پورٹلینڈ، ریاست ہائے متحدہ
uz: Portlend, AQSH
vi: Portland, Hoa Kỳ
zh_hk: 美國波特蘭
zu: I-Portland, United States

# craneEat2
source: Córdoba, Argentina
af: Córdoba, Argentinië
am: ኮርዶባ፣ አርጀንቲና
ar_eg: قرطبة، الأرجنتين
as: কৰড'বা, আর্জেণ্টিনা
az: Kordova, Argentina
be: Кордава, Аргенціна
bn: কর্ডোবা, আর্জেন্টিনা
bs: Kordoba, Argentina
fa: کوردوبا، آرژانتین
fr_ca: Córdoba, Argentine
gl: Córdoba, Arxentina
gu: કોર્ડોબા, આર્જેન્ટિના
he: קורדובה, ארגנטינה
hi: कोर्डोबा, अर्जेंटीना
hu: Córdoba, Argentína
hy: Կորդոբա, արգենտինա
ja: コルドバ（アルゼンチン）
ka: კორდობა, არგენტინა
km: ខរដូបា អាហ្សង់ទីន
kn: ಕಾರ್ಡೋಬಾ, ಅರ್ಜೆಂಟೀನಾ
ko: 아르헨티나 코르도바
ky: Кордоба, Аргентина
lo: ຄໍໂດບາ, ອາເຈນທິນາ
lt: Kordoba, Argentina
lv: Kordova, Argentīna
mk: Кордоба, Аргентина
ml: കോദോബ, അർജന്റീന
mn: Аргентин, Кордова
mr: कोर्दोबा, अर्जेंटिना
my: ကော်ဒိုဘာ၊ အာဂျင်တီးနား
ne: कोर्डोबा, अर्जेन्टिना
pa: ਕੋਰਡੋਬਾ, ਅਰਜਨਟੀਨਾ
pl: Córdoba, Argentyna
ru: Кордова, Аргентина
si: කෝඩොබා, ආජන්ටීනාව
sk: Córdoba, Argentína
sq: Kordoba, Argjentinë
sr: Кордоба, Аргентина
sr_latn: Kordoba, Argentina
te: కొర్డొబా, అర్జెంటీనా
th: คอร์โดบา อาร์เจนตินา
tr: Córdoba, Arjantin
uk: Кордова, Аргентина
ur: قرطبہ، ارجنٹینا
uz: Kordova, Argentina
zh_hk: 阿根廷科爾多瓦
zu: I-Córdoba, Argentina

# craneEat1
source: Dallas, United States
af: Dallas, Verenigde State
am: ዳላስ፣ አሜሪካ
ar_eg: دالاس، الولايات المتحدة
as: ডাল্লাছ, মার্কিন যুক্তৰাষ্ট্ৰ
az: Dallas, ABŞ
be: Далас, ЗША
bn: ডালাস, মার্কিন যুক্তরাষ্ট্র
bs: Dalas, Sjedinjene Američke Države
ca: Dallas, Estats Units
da: Dallas, USA
es_ar: Dallas, Estados Unidos
et: Dallas, Ameerika Ühendriigid
eu: Dallas (Ameriketako Estatu Batuak)
fa: دالاس، ایالات متحده
fr_ca: Dallas, États-Unis
gl: Dallas, Estados Unidos
gu: ડલાસ, યુનાઇટેડ સ્ટેટ્સ
he: דאלאס, ארצות הברית
hi: डलास, अमेरिका
hu: Dallas, Amerikai Egyesült Államok
hy: Դալաս, ԱՄՆ
id: Dallas, Amerika Serikat
it: Dallas, Stati Uniti
ja: ダラス（米国）
ka: დალასი, შეერთებული შტატები
km: ដាឡាស សហរដ្ឋ​អាមេរិក
kn: ಡಲ್ಲಾಸ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 댈러스
ky: Даллас, Америка Кошмо Штаттары
lo: ດາລັສ, ສະຫະລັດ
lt: Dalasas, Jungtinės Amerikos Valstijos
lv: Dalasa, ASV
mk: Далас, САД
ml: ഡാലസ്, യുണൈറ്റഡ് സ്റ്റേറ്റ്‌സ്
mn: Америкийн Нэгдсэн Улс, Даллас
mr: डॅलस, युनायटेड स्टेट्स
ms: Dallas, Amerika Syarikat
my: ဒါးလပ်စ်၊ အမေရိကန် ပြည်ထောင်စု
nb: Dallas, USA
ne: डल्लास, संयुक्त राज्य अमेरिका
pa: ਡਾਲਸ, ਸੰਯੁਕਤ ਰਾਜ
pl: Dallas, Stany Zjednoczone
pt: Dallas, Estados Unidos
pt_pt: Dallas, Estados Unidos
ro: Dallas, Statele Unite
ru: Даллас, США
si: ඩලාස්, එක්සත් ජනපදය
sk: Dallas, USA
sq: Dallas, Shtetet e Bashkuara
sr: Далас, Сједињене Америчке Државе
sr_latn: Dalas, Sjedinjene Američke Države
sv: Dallas, USA
te: డల్లాస్, యునైటెడ్ స్టేట్స్
th: ดัลลาส สหรัฐอเมริกา
tr: Dallas, ABD
uk: Даллас, США
ur: ڈلاس، ریاستہائے متحدہ
uz: Dallas, AQSH
vi: Dallas, Hoa Kỳ
zh_hk: 美國達拉斯
zu: I-Dallas, United States

# craneEat0
source: Naples, Italy
af: Napels, Italië
am: ኔፕልስ፣ ጣልያን
ar_eg: نابولي، إيطاليا
as: নেপলচ, ইটালী
az: Neapol, İtaliya
be: Неапаль, Італія
bn: ন্যাপলি, ইতালি
bs: Napulj, Italija
ca: Nàpols, Itàlia
da: Napoli, Italien
es_ar: Nápoles, Italia
et: Napoli, Itaalia
eu: Napoles (Italia)
fa: ناپل، ایتالیا
fr_ca: Naples, Italie
gl: Nápoles, Italia
gu: નેપલ્સ, ઇટાલી
he: נאפולי, איטליה
hi: नेपल्स, इटली
hu: Nápoly, Olaszország
hy: Նեապոլ, Իտալիա
id: Naples, Italia
it: Napoli, Italia
ja: ナポリ（イタリア）
ka: ნეაპოლი, იტალია
km: នេផលស៍ អ៊ីតាលី
kn: ನಪ್ಲೆಸ್, ಇಟಲಿ
ko: 이탈리아 나폴리
ky: Неаполь, Италия
lo: ເນໂປ, ສະຫະລັດ
lt: Neapolis, Italija
lv: Neapole, Itālija
mk: Неапол, Италија
ml: നേപ്പിൾസ്, ഇറ്റലി
mn: Итали, Неаполь
mr: नेपल्स, इटली
ms: Naples, Itali
my: နေပယ်လ်၊ အီတလီ
nb: Napoli, Italia
ne: नेपल्स, इटाली
pa: ਨੇਪਲਜ਼, ਇਟਲੀ
pl: Neapol, Włochy
pt: Nápoles, Itália
pt_pt: Nápoles, Itália
ro: Napoli, Italia
ru: Неаполь, Италия
si: නේපල්ස්, ඉතාලිය
sk: Neapol, Taliansko
sq: Napoli, Itali
sr: Напуљ, Италија
sr_latn: Napulj, Italija
sv: Neapel, Italien
te: నాపల్స్, ఇటలీ
th: เนเปิลส์ อิตาลี
tr: Napoli, İtalya
uk: Неаполь, Італія
ur: نیپال، اٹلی
uz: Neapol, Italiya
vi: Naples, Ý
zh_hk: 意大利那不勒斯
zu: I-Naples, Italy

# craneSleep11
source: Taipei, Taiwan
am: ታይፔይ፣ ታይዋን
ar_eg: تايبيه، تايوان
as: তাইপেই, তাইৱান
az: Taybey, Tayvan
be: Тайбэй, Тайвань
bn: তাইপেই, তাইওয়ান
bs: Taipei, Tajvan
es_ar: Taipéi, Taiwán
fa: تایپه، تایوان
fr_ca: Taipei, Taïwan
gl: Taipei, Taiwán
gu: તાઇપેઇ, તાઇવાન
he: טאיפיי, טייוואן
hi: ताइपेई, ताइवान
hu: Tajpej, Tajvan
hy: Թայփեյ, Թայվան
ja: 台北（台湾）
ka: ტაიპეი, ტაივანი
km: តៃប៉ិ តៃវ៉ាន់
kn: ತೈಪೆ, ತೈವಾನ್
ko: 대만 타이베이
ky: Тайпей, Тайвань
lo: ໄທເປ, ໄຕ້ຫວັນ
lt: Taipėjus, Taivanas
lv: Taipeja, Taivāna
mk: Тајпеј, Тајван
ml: തായ്പേയ്, തായ്‌വാൻ
mn: Тайвань, Тайбэй
mr: ताइपै, तैवान
my: တိုင်ပေ၊ ထိုင်ဝမ်
ne: ताइपेइ, ताइवान
pa: ਤਾਈਪੇ, ਤਾਈਵਾਨ
pl: Tajpej, Tajwan
pt_pt: Taipé, Taiwan
ru: Тайбэй, Тайвань
si: තායිපේ, තායිවානය
sq: Taipei, Tajvan
sr: Тајпеј, Тајван
sr_latn: Tajpej, Tajvan
te: తైపీ, తైవాన్
th: ไทเป ไต้หวัน
tr: Taipei, Tayvan
uk: Тайбей, Тайвань
ur: تائی پے، تائیوان
uz: Taypey, Tayvan
vi: Đài Bắc, Đài Loan
zh_hk: 台灣台北
zu: I-Taipei, Taiwan

# craneSleep3
source: Havana, Cuba
af: Havana, Kuba
am: ሃቫና፣ ኩባ
ar_eg: هافانا، كوبا
as: হানাভা, কিউবা
az: Havana, Kuba
be: Гавана, Куба
bn: হাভানা, কিউবা
bs: Havana, Kuba
ca: L'Havana, Cuba
es_ar: La Habana, Cuba
et: Havanna, Kuuba
eu: Habana (Kuba)
fa: هاوانا، کوبا
fr_ca: La Havane, Cuba
gl: A Habana, Cuba
gu: હવાના, ક્યૂબા
he: הוואנה, קובה
hi: हवाना, क्यूबा
hu: Havanna, Kuba
hy: Հավանա, Կուբա
id: Havana, Kuba
it: L'Avana, Cuba
ja: ハバナ（キューバ）
ka: ჰავანა, კუბა
km: ហាវ៉ាណា គុយបា
kn: ಹವಾನಾ, ಕ್ಯೂಬಾ
ko: 쿠바 아바나
ky: Гавана, Куба
lo: ຮາວານາ, ຄິວບາ
lt: Havana, Kuba
lv: Havana, Kuba
mk: Хавана, Куба
ml: ഹവാന, ക്യൂബ
mn: Куба, Хавана
mr: हवाना, क्यूबा
my: ဟာဗားနား၊ ကျူးဘား
ne: हवाना, क्युबा
pa: ਹਵਾਨਾ, ਕਿਊਬਾ
pl: Hawana, Kuba
ru: Гавана, Куба
si: හවානා, කියුබාව
sk: Havana, Kuba
sq: Havanë, Kubë
sr: Хавана, Куба
sr_latn: Havana, Kuba
sv: Havanna, Kuba
te: హవానా, క్యూబా
th: ฮาวานา คิวบา
tr: Havana, Küba
uk: Гавана, Куба
ur: ہوانا، کیوبا
uz: Gavana, Kuba
zh_hk: 古巴哈瓦那
zu: I-Havana, Cuba

# shrineLogoutButtonCaption
source: LOGOUT
af: MELD AF
am: ዘግተህ ውጣ
ar_eg: تسجيل الخروج
as: লগ আউট কৰক
az: ÇIXIŞ EDİN
be: ВЫЙСЦІ
bn: লগ-আউট
bs: ODJAVA
ca: TANCA LA SESSIÓ
da: LOG UD
es_ar: SALIR
et: LOGI VÄLJA
eu: AMAITU SAIOA
fa: خروج از سیستم
fil: MAG-LOG OUT
fr_ca: DÉCONNEXION
gl: PECHAR SESIÓN
gu: લૉગ આઉટ
he: התנתקות
hi: लॉग आउट करें
hu: KIJELENTKEZÉS
hy: ԵԼՔ
it: ESCI
ja: ログアウト
ka: გამოსვლა
km: ចេញ
kn: ಲಾಗ್ ಔಟ್ ಮಾಡಿ
ko: 로그아웃
ky: ЧЫГУУ
lo: ອອກຈາກລະບົບ
lt: ATSIJUNGTI
lv: ATTEIKTIES
mk: ОДЈАВЕТЕ СЕ
ml: ലോഗൗട്ട് ചെയ്യുക
mn: ГАРАХ
mr: लॉग आउट करा
ms: LOG KELUAR
my: အကောင့်မှ ထွက်ရန်
nb: LOGG AV
ne: लगआउट गर्नुहोस्
pa: ਲੌਗ ਆਊਟ ਕਰੋ
pl: WYLOGUJ SIĘ
pt: SAIR
pt_pt: TERMINAR SESSÃO
ro: DECONECTAȚI-VĂ
ru: ВЫЙТИ
si: ඉවත් වන්න
sk: ODHLÁSIŤ SA
sq: DIL
sr: ОДЈАВИ МЕ
sr_latn: ODJAVI ME
sv: LOGGA UT
te: లాగ్ అవుట్ చేయి
th: ออกจากระบบ
tr: ÇIKIŞ YAP
uk: ВИЙТИ
ur: لاگ آؤٹ
uz: CHIQISH
vi: ĐĂNG XUẤT
zh_hk: 登出
zu: PHUMA NGEMVUME

# rallyTitleBills
source: BILLS
af: REKENINGE
am: ሒሳብ መጠየቂያዎች
ar_eg: الفواتير
as: বিলসমূহ
az: HESABLAR
be: РАХУНКІ
bn: বিল
bs: RAČUNI
ca: FACTURES
da: FAKTURAER
es_ar: FACTURAS
et: ARVED
eu: FAKTURAK
fa: صورت‌حساب‌ها
fil: MGA BILL
fr_ca: FACTURES
gl: FACTURAS
gu: બિલ
he: חיובים
hi: बिल
hu: SZÁMLÁK
hy: ՀԱՇԻՎՆԵՐ
id: TAGIHAN
it: FATTURE
ja: 請求
ka: გადასახადები
km: វិក្កយបត្រ
kn: ಬಿಲ್‌ಗಳು
ko: 청구서
ky: ЭСЕПТЕР
lo: ໃບບິນ
lt: SĄSKAITOS
lv: RĒĶINI
mk: СМЕТКИ
ml: ബില്ലുകൾ
mn: ТООЦОО
mr: बिले
ms: BIL
my: ငွေတောင်းခံလွှာများ
nb: REGNINGER
ne: बिलहरू
pa: ਬਿੱਲ
pl: RACHUNKI
pt: FATURAS
pt_pt: FATURAS
ro: FACTURI
ru: СЧЕТА
si: බිල්පත්
sk: FAKTÚRY
sq: FATURAT
sr: ОБРАЧУНИ
sr_latn: OBRAČUNI
sv: FAKTUROR
te: బిల్లులు
th: ใบเรียกเก็บเงิน
tr: FATURALAR
uk: ПЛАТЕЖІ
ur: بلز
uz: HISOB-KITOB
vi: HÓA ĐƠN
zh_hk: 帳單
zu: AMABHILI

# rallyTitleAccounts
source: ACCOUNTS
af: REKENINGE
am: መለያዎች
ar_eg: الحسابات
as: একাউণ্টসমূহ
az: HESABLAR
be: УЛІКОВЫЯ ЗАПІСЫ
bn: অ্যাকাউন্ট
bs: RAČUNI
ca: COMPTES
da: KONTI
es_ar: CUENTAS
et: KONTOD
eu: KONTUAK
fa: حساب‌ها
fil: MGA ACCOUNT
fr_ca: COMPTES
gl: CONTAS
gu: એકાઉન્ટ
he: חשבונות
hi: खाते
hu: FIÓKOK
hy: ՀԱՇԻՎՆԵՐ
id: REKENING
it: ACCOUNT
ja: 口座
ka: ანგარიშები
km: គណនី
kn: ಖಾತೆಗಳು
ko: 계정
ky: АККАУНТТАР
lo: ບັນຊີ
lt: PASKYROS
lv: KONTI
mk: СМЕТКИ
ml: അക്കൗണ്ടുകൾ
mn: ДАНСНУУД
mr: खाती
ms: AKAUN
my: အကောင့်များ
nb: KONTOER
ne: खाताहरू
pa: ਖਾਤੇ
pl: KONTA
pt: CONTAS
pt_pt: CONTAS
ro: CONTURI
ru: БАНКОВСКИЕ СЧЕТА
si: ගිණුම්
sk: ÚČTY
sq: LLOGARITË
sr: НАЛОЗИ
sr_latn: NALOZI
sv: KONTON
te: ఖాతాలు
th: บัญชี
tr: HESAPLAR
uk: РАХУНКИ
ur: اکاؤنٹس
uz: HISOBLAR
vi: TÀI KHOẢN
zh_hk: 帳戶
zu: AMA-AKHAWUNTI
