Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# rallySeeAllAccounts
source: See all accounts
af: Sien alle rekeninge
am: ሁሉንም መለያዎች ይመልከቱ
ar_eg: عرض جميع الحسابات
as: সকলো একাউণ্ট চাওক
az: Bütün hesablara baxın
be: Прагледзець усе рахункі
bn: সব অ্যাকাউন্ট দেখুন
bs: Vidi sve račune
ca: Mostra tots els comptes
da: Se alle konti
es_ar: Ver todas las cuentas
et: Kuva kõik kontod
eu: Ikusi kontu guztiak
fa: دیدن همه حساب‌ها
fil: Tingnan ang lahat ng account
fr_ca: Voir tous les comptes
gl: Ver todas as contas
gu: બધા એકાઉન્ટ જુઓ
he: הצגת כל החשבונות
hi: सभी खाते देखें
hu: Összes bankszámla megtekintése
hy: Դիտել բոլոր հաշիվները
id: Lihat semua rekening
it: Visualizza tutti i conti
ja: 口座をすべて表示
ka: ყველა ანგარიშის ნახვა
km: មើល​គណនី​ទាំងអស់
kn: ಎಲ್ಲಾ ಖಾತೆಗಳನ್ನು ನೋಡಿ
ko: 모든 계좌 보기
ky: Бардык аккаунттарды көрүү
lo: ເບິ່ງບັນຊີທັງໝົດ
lt: Peržiūrėti visas paskyras
lv: Skatīt visus kontus
mk: Прикажи ги сите сметки
ml: എല്ലാ അക്കൗണ്ടുകളും കാണുക
mn: Бүх бүртгэлийг харах
mr: सर्व खाती पहा
ms: Lihat semua akaun
my: အကောင့်အားလုံး ကြည့်ရန်
nb: Se alle kontoene
ne: सबै खाता हेर्नुहोस्
pa: ਸਾਰੇ ਖਾਤੇ ਦੇਖੋ
pl: Wyświetl wszystkie konta
pt: Ver todas as contas
pt_pt: Ver todas as contas
ro: Vedeți toate conturile
ru: Показать все банковские счета
si: සියලු ගිණුම් බලන්න
sk: Zobraziť všetky účty
sq: Shiko të gjitha llogaritë
sr: Прикажи све рачуне
sr_latn: Prikaži sve račune
sv: Visa alla konton
te: అన్ని ఖాతాలనూ చూడండి
th: ดูบัญชีทั้งหมด
tr: Tüm hesapları göster
uk: Переглянути всі рахунки
ur: سبھی اکاؤنٹس دیکھیں
uz: Barcha hisoblar
vi: Xem tất cả các tài khoản
zh_hk: 查看所有帳戶
zu: Bona wonke ama-akhawunti

# rallyBillAmount
source: {billName} bill due {date} for {amount}.
af: {billName}-rekening van {amount} is betaalbaar op {date}.
am: የ{billName} {amount} መክፈያ ጊዜ {date} ደርሷል።
ar_eg: تاريخ استحقاق الفاتورة {billName} التي تبلغ {amount} هو {date}.
as: {billName} বিল {amount} পৰিশোধ কৰাৰ শেষ তাৰিখ {date}।
az: {date} tarixinə {amount} məbləğində {billName} ödənişi.
be: {billName}: трэба заплаціць {amount} да {date}.
bn: {billName} {date}-এ {amount} টাকার বিল বাকি আছে।
bs: Rok za plaćanje računa ({billName}) u iznosu od {amount} je {date}.
ca: Data de venciment de la factura {billName} ({amount}): {date}.
da: Regningen {billName} på {amount}, som skal betales {date}.
es_ar: Factura de {billName} con vencimiento el {date} de {amount}
et: Arve {billName} summas {amount} tuleb tasuda kuupäevaks {date}.
eu: {billName} faktura ({amount}) data honetan ordaindu behar da: {date}.
fa: صورت‌حساب {billName} با موعد پرداخت {date} به‌مبلغ {amount}.
fil: Bill sa {billName} na nagkakahalagang {amount} na dapat bayaran bago ang {date}.
fr_ca: La facture de {billName} de {amount} est due le {date}.
gl: A data límite da factura ({billName}) é o {date} e o seu importe é de {amount}.
gu: {billName}નું {amount}નું બિલ ચુકવવાની નિયત તારીખ {date} છે.
he: יש לשלם את החיוב על {billName} בסך {amount} בתאריך {date}.
hi: {billName} के बिल के {amount} चुकाने की आखिरी तारीख {date} है.
hu: {amount} összegű {billName} számla esedékességi dátuma: {date}.
hy: {amount} գումարի {billName} հաշիվը պետք է վճարվի՝ {date}։
id: Tagihan {billName} jatuh tempo pada {date} sejumlah {amount}.
it: Fattura {billName} di {amount} in scadenza il giorno {date}.
ja: {billName}、支払い期限 {date}、金額 {amount}。
ka: {billName} ანგარიშის გასწორების ვადაა {date}, თანხა: {amount}.
km: វិក្កយបត្រ {billName} ដែលមានតម្លៃ {amount} ផុតកំណត់​នៅថ្ងៃទី {date}។
kn: {amount} ಗಾಗಿ {date} ರಂದು {billName} ಬಿಲ್ ಪಾವತಿ ಬಾಕಿಯಿದೆ.
ko: {billName} 청구서({amount}) 결제 기한은 {date}입니다.
ky: {amount} суммасындагы {billName} эсеби {date} төлөнүшү керек.
lo: ບິນ {billName} ຮອດກຳນົດ {date} ຈຳນວນ {amount}.
lt: Sąskaitą „{billName}“, kurios suma {amount}, reikia apmokėti iki {date}.
lv: Rēķins ({billName}) par summu {amount} ir jāapmaksā līdz šādam datumam: {date}.
mk: {billName} треба да се плати до {date} и изнесува {amount}.
ml: അവസാന തീയതി {date} ആയ {amount} വരുന്ന {billName} ബിൽ.
mn: {billName}-н {amount}-н тооцоог {date}-с өмнө хийх ёстой.
mr: {billName} च्या {amount} च्या बिलाची शेवटची तारीख {date} आहे.
ms: Bil {billName} perlu dijelaskan pada {date} sebanyak {amount}.
my: {billName} ငွေတောင်းခံလွှာအတွက် {date} တွင် {amount} ပေးရပါမည်။
nb: Regningen {billName} på {amount} forfaller {date}.
ne: {amount} तिर्नु पर्ने {billName} को म्याद {date}।
pa: {billName} ਲਈ {amount} ਦਾ ਬਿੱਲ ਭਰਨ ਦੀ ਨਿਯਤ ਤਾਰੀਖ {date} ਹੈ।
pl: {billName} ma termin: {date}, kwota: {amount}.
pt: A fatura {billName} de {amount} vence em {date}.
pt_pt: Fatura {billName} com data limite de pagamento a {date} no valor de {amount}.
ro: Factura {billName} în valoare de {amount} este scadentă pe {date}.
ru: Счет "{billName}" на сумму {amount}. Срок оплаты: {date}.
si: {billName} බිල්පත {date} දිනට {amount}කි.
sk: Termín splatnosti faktúry za {billName} vo výške {amount} je {date}.
sq: Fatura {billName} me afat {date} për {amount}.
sr: Рачун ({billName}) од {amount} доспева {date}.
sr_latn: Račun ({billName}) od {amount} dospeva {date}.
sv: {billName}-fakturan på {amount} förfaller den {date}.
te: {billName} అనే బిల్లుకు గాను, {amount} పేమెంట్ చేయడానికి ఆఖరి తేదీ {date}.
th: บิล{billName}ครบกำหนดชำระในวันที่ {date} จำนวน {amount}
tr: Son ödeme tarihi {date} olan {amount} tutarındaki {billName} faturası.
uk: Рахунок "{billName}" на суму {amount} потрібно сплатити до {date}.
ur: {amount} کے لیے {billName} بل کی آخری تاریخ {date}
uz: {billName} uchun {date} sanasigacha {amount} toʻlash kerak.
vi: Hóa đơn {billName} {amount} đến hạn vào {date}.
zh_hk: {billName}帳單於 {date} 到期，金額為 {amount}。
zu: {billName} inkokhelo ifuneka ngomhla ka-{date} ngokungu-{amount}.

# shrineTooltipCloseCart
source: Close cart
af: Maak mandjie toe
am: ጋሪን ዝጋ
ar_eg: إغلاق سلة التسوق
as: কাৰ্ট বন্ধ কৰক
az: Səbəti bağlayın
be: Закрыць кошык
bn: কার্ট বন্ধ করুন
bs: Zatvaranje korpe
ca: Tanca el carretó
da: Luk kurven
es_ar: Cerrar carrito
et: Sule ostukorv
eu: Itxi saskia
fa: بستن سبد خرید
fil: Isara ang cart
fr_ca: Fermer le panier
gl: Pechar a cesta
gu: કાર્ટ બંધ કરો
he: סגירת העגלה
hi: कार्ट बंद करें
hu: Kosár bezárása
hy: Փակել զամբյուղը
id: Tutup keranjang
it: Chiudi carrello
ja: カートを閉じます
ka: კალათის დახურვა
km: បិទ​ទំព័រ​រទេះ
kn: ಕಾರ್ಟ್ ಮುಚ್ಚಿರಿ
ko: 장바구니 닫기
ky: Арабаны жабуу
lo: ປິດກະຕ່າ
lt: Uždaryti krepšelį
lv: Aizvērt grozu
mk: Затворете ја кошничката
ml: കാർട്ട് അടയ്ക്കുക
mn: Сагсыг хаах
mr: कार्ट बंद करा
ms: Tutup troli
my: ဈေးခြင်းတောင်းကို ပိတ်ရန်
nb: Lukk handlekurven
ne: कार्ट बन्द गर्नुहोस्
pa: ਕਾਰਟ ਬੰਦ ਕਰੋ
pl: Zamknij koszyk
pt: Fechar carrinho
pt_pt: Fechar carrinho
ro: Închideți coșul de cumpărături
ru: Закрыть корзину
si: බහලුම වසන්න
sk: Zavrieť košík
sq: Mbyll karrocën
sr: Затворите корпу
sr_latn: Zatvorite korpu
sv: Stäng kundvagnen
te: కార్ట్‌ను మూసివేయండి
th: ปิดหน้ารถเข็น
tr: Alışveriş sepetini kapat
uk: Закрити кошик
ur: کارٹ بند کریں
uz: Savatchani yopish
vi: Đóng giỏ hàng
zh_hk: 閂埋購物車
zu: Vala ikalishi

# shrineTooltipCloseMenu
source: Close menu
af: Maak kieslys toe
am: ምናሌን ዝጋ
ar_eg: إغلاق القائمة
as: মেনু বন্ধ কৰক
az: Menyunu bağlayın
be: Закрыць меню
bn: মেনু বন্ধ করুন
bs: Zatvaranje menija
ca: Tanca el menú
da: Luk menuen
es_ar: Cerrar menú
et: Sule menüü
eu: Itxi menua
fa: بستن منو
fil: Isara ang menu
fr_ca: Fermer le menu
gl: Pechar o menú
gu: મેનૂ બંધ કરો
he: סגירת התפריט
hi: मेन्यू बंद करें
hu: Menü bezárása
hy: Փակել ընտրացանկը
id: Tutup menu
it: Chiudi menu
ja: メニューを閉じます
ka: მენიუს დახურვა
km: បិទ​ម៉ឺនុយ
kn: ಮೆನು ಮುಚ್ಚಿರಿ
ko: 메뉴 닫기
ky: Менюну жабуу
lo: ປິດເມນູ
lt: Uždaryti meniu
lv: Aizvērt izvēlni
mk: Затворете го менито
ml: മെനു അടയ്ക്കുക
mn: Цэсийг хаах
mr: मेनू बंद करा
ms: Tutup menu
my: မီနူးကို ပိတ်ရန်
nb: Lukk menyen
ne: मेनु बन्द गर्नुहोस्
pa: ਮੀਨੂ ਬੰਦ ਕਰੋ
pl: Zamknij menu
pt: Fechar menu
pt_pt: Fechar menu
ro: Închideți meniul
ru: Закрыть меню
si: මෙනුව වසන්න
sk: Zavrieť ponuku
sq: Mbyll menynë
sr: Затворите мени
sr_latn: Zatvorite meni
sv: Stäng menyn
te: మెనూని మూసివేయండి
th: ปิดเมนู
tr: Menüyü kapat
uk: Закрити меню
ur: مینیو بند کریں
uz: Menyuni yopish
vi: Đóng trình đơn
zh_hk: 閂埋選單
zu: Vala imenyu

# shrineTooltipOpenMenu
source: Open menu
af: Maak kieslys oop
am: ምናሌ ክፈት
ar_eg: فتح القائمة
as: মেনু খোলক
az: Menyunu açın
be: Адкрыць меню
bn: মেনু খুলুন
bs: Otvaranje menija
ca: Obre el menú
da: Åbn menuen
es_ar: Abrir menú
et: Ava menüü
eu: Ireki menua
fa: بازکردن منو
fil: Buksan ang menu
fr_ca: Ouvrir le menu
gl: Abrir o menú
gu: મેનૂ ખોલો
he: פתיחת תפריט
hi: मेन्यू खोलें
hu: Menü megnyitása
hy: Բացել ընտրացանկը
id: Buka menu
it: Apri menu
ja: メニューを開きます
ka: მენიუს გახსნა
km: បើកម៉ឺនុយ
kn: ಮೆನು ತೆರೆಯಿರಿ
ko: 메뉴 열기
ky: Менюну ачуу
lo: ເປີດເມນູ
lt: Atidaryti meniu
lv: Atvērt izvēlni
mk: Отворете го менито
ml: മെനു തുറക്കുക
mn: Цэсийг нээх
mr: मेनू उघडा
ms: Buka menu
my: မီနူး ဖွင့်ရန်
nb: Åpne menyen
ne: मेनु खोल्नुहोस्
pa: ਮੀਨੂ ਖੋਲ੍ਹੋ
pl: Otwórz menu
pt: Abrir menu
pt_pt: Abrir menu
ro: Deschideți meniul
ru: Открыть меню
si: මෙනුව විවෘත කරන්න
sk: Otvoriť ponuku
sq: Hap menynë
sr: Отворите мени
sr_latn: Otvorite meni
sv: Öppna menyn
te: మెనూని తెరవండి
th: เปิดเมนู
tr: Menüyü aç
uk: Відкрити меню
ur: مینیو کھولیں
uz: Menyuni ochish
vi: Mở trình đơn
zh_hk: 打開選單
zu: Vula imenyu

# shrineTooltipSettings
source: Settings
af: Instellings
am: ቅንብሮች
ar_eg: الإعدادات
as: ছেটিংসমূহ
az: Ayarlar
be: Налады
bn: সেটিংস
bs: Postavke
ca: Configuració
da: Indstillinger
es_ar: Configuración
et: Seaded
eu: Ezarpenak
fa: تنظیمات
fil: Mga Setting
fr_ca: Paramètres
gl: Configuración
gu: સેટિંગ
he: הגדרות
hi: सेटिंग
hu: Beállítások
hy: Կարգավորումներ
id: Setelan
it: Impostazioni
ja: 設定
ka: პარამეტრები
km: ការកំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 설정
ky: Параметрлер
lo: ການຕັ້ງຄ່າ
lt: Nustatymai
lv: Iestatījumi
mk: Поставки
ml: ക്രമീകരണം
mn: Тохиргоо
mr: सेटिंग्ज
ms: Tetapan
my: ဆက်တင်များ
nb: Innstillinger
ne: सेटिङ
pa: ਸੈਟਿੰਗਾਂ
pl: Ustawienia
pt: Configurações
pt_pt: Definições
ro: Setări
ru: Настройки
si: සැකසීම්
sk: Nastavenia
sq: Cilësimet
sr: Подешавања
sr_latn: Podešavanja
sv: Inställningar
te: సెట్టింగ్‌లు
th: การตั้งค่า
tr: Ayarlar
uk: Налаштування
ur: ترتیبات
uz: Sozlamalar
vi: Cài đặt
zh_hk: 設定
zu: Izilungiselelo

# shrineTooltipSearch
source: Search
af: Soek
am: ፍለጋ
ar_eg: بحث
az: Axtarış
be: Пошук
bs: Pretraživanje
ca: Cerca
da: Søg
es_ar: Buscar
et: Otsing
eu: Bilatu
fa: جستجو
fil: Maghanap
fr_ca: Rechercher
gl: Buscar
he: חיפוש
hi: खोजें
hu: Keresés
hy: Որոնել
id: Penelusuran
it: Cerca
ja: 検索
ka: ძიება
km: ស្វែងរក
ko: 검색
ky: Издөө
lo: ຊອກຫາ
lt: Ieškoti
lv: Meklēt
mk: Пребарај
mn: Хайх
ms: Cari
my: ရှာဖွေရန်
nb: Søk
ne: खोज्नुहोस्
pl: Szukaj
pt: Pesquisar
pt_pt: Pesquisar
ro: Căutați
ru: Поиск
si: සෙවීම
sk: Hľadať
sq: Kërko
sr: Претражите
sr_latn: Pretražite
sv: Sök
th: ค้นหา
tr: Ara
uk: Шукати
ur: تلاش کریں
uz: Qidiruv
vi: Tìm kiếm
zh_hk: 搜尋
zu: Sesha

# demoTabsDescription
source: Tabs organize content across different screens, data sets, and other interactions.
af: Oortjies organiseer inhoud oor verskillende skerms, datastelle, en ander interaksies heen.
am: ትሮች በተለያዩ ማያ ገጾች፣ የውሂብ ስብስቦች እና ሌሎች መስተጋብሮች ዙሪያ ይዘትን ያደራጃል
ar_eg: تساعد علامات التبويب على تنظيم المحتوى في الشاشات المختلفة ومجموعات البيانات والتفاعلات الأخرى.
as: টেবসমূহে সমলক বিভিন্ন স্ক্ৰীনসমূহত, ডেটা ছেটসমূহত আৰু অন্য ভাব-বিনিময়সমূহত সংগঠিত কৰে।
az: Tablar müxtəlif ekranlar, data dəstləri və digər qarşılıqlı əməliyyatlarda məzmunu təşkil edir.
be: Укладкі групуюць змесціва па розных экранах для прагляду, па розных наборах даных і іншых узаемадзеяннях.
bn: বিভিন্ন স্ক্রিনে, ডেটা সেটে ও অন্যান্য ইন্টার‌্যাকশনে ট্যাবগুলি কন্টেন্ট সাজায়।
bs: Kartice organiziraju sadržaj na različitim ekranima, skupovima podataka i drugim interakcijama.
ca: Les pestanyes organitzen el contingut en diferents pantalles, conjunts de dades i altres interaccions.
da: Med faner kan indhold fra forskellige skærme, datasæt og andre interaktioner organiseres.
es_ar: Las pestañas organizan el contenido en diferentes pantallas, conjuntos de datos y otras interacciones.
et: Vahekaartidega saab korrastada eri kuvadel, andkekogumites ja muudes interaktiivsetes asukohtades olevat sisu.
eu: Fitxei esker, edukia antolatuta dago pantailetan, datu multzoetan eta bestelako elkarrekintza sortetan.
fa: برگه‌ها محتوا در صفحه‌نمایش‌ها، مجموعه‌های داده و تراکنش‌های دیگر سازماندهی می‌کنند.
fil: Inaayos ng mga tab ang content na nasa magkakaibang screen, data set, at iba pang pakikipag-ugnayan.
fr_ca: Les onglets permettent d'organiser le contenu sur divers écrans, ensembles de données et d'autres interactions.
gl: As pestanas permiten organizar o contido en diversas pantallas, conxuntos de datos e outras interaccións.
gu: ટૅબ અલગ અલગ સ્ક્રીન, ડેટા સેટ અને અન્ય ક્રિયાપ્રતિક્રિયાઓ પર કન્ટેન્ટને ગોઠવે છે.
he: כרטיסיות שמארגנות תוכן במספר מסכים נפרדים, קבוצות נתונים שונות ואינטראקציות נוספות.
hi: टैब की मदद से अलग-अलग स्क्रीन, डेटा सेट, और दूसरे इंटरैक्शन पर सामग्री को व्यवस्थित किया जाता है.
hu: A lapok rendszerezik a tartalmakat különböző képernyőkön, adathalmazokban és egyéb interakciók során.
hy: Ներդիրները թույլ են տալիս դասավորել էկրանների, տվյալակազմերի բովանդակությունը և այլն։
id: Tab yang mengatur konten di beragam jenis layar, set data, dan interaksi lainnya.
it: Le schede consentono di organizzare i contenuti in diversi set di dati, schermate e altre interazioni.
ja: タブを使うことで、さまざまな画面、データセットや、その他のインタラクションにまたがるコンテンツを整理できます。
ka: ჩანართების მეშვეობით ხდება კონტენტის ორგანიზება სხვადასხვა ეკრანის, მონაცემთა ნაკრების და სხვა ინტერაქციების ფარგლებში.
km: ផ្ទាំង​រៀបចំ​ខ្លឹមសារ​នៅលើ​អេក្រង់ សំណុំ​ទិន្នន័យ​ផ្សេងៗគ្នា និងអន្តរកម្ម​ផ្សេងទៀត។
kn: ಬೇರೆ ಸ್ಕ್ರೀನ್‌ಗಳು, ಡೇಟಾ ಸೆಟ್‌ಗಳು ಮತ್ತು ಇತರ ಸಂವಹನಗಳಾದ್ಯಂತ ವಿಷಯವನ್ನು ಟ್ಯಾಬ್‌ಗಳು ಆಯೋಜಿಸುತ್ತವೆ.
ko: 탭을 사용하면 다양한 화면, 데이터 세트 및 기타 상호작용에서 콘텐츠를 정리할 수 있습니다.
ky: Өтмөктөр ар башка экрандардагы, дайындар топтомдорундагы жана башка аракеттердеги мазмунду иреттешет.
lo: ແຖບຕ່າງໆຈະເປັນການຈັດລະບຽບເນື້ອຫາໃນແຕ່ລະໜ້າຈໍ, ຊຸດຂໍ້ມູນ ແລະ ການໂຕ້ຕອບອື່ນໆ.
lt: Naudojant skirtukus tvarkomas turinys skirtinguose ekranuose, duomenų rinkiniuose ir naudojant kitas sąveikas.
lv: Cilnēs saturs ir sakārtots vairākos ekrānos, datu kopās un citos mijiedarbības veidos.
mk: Картичките ги организираат содржините на различни екрани, збирови податоци и други интеракции.
ml: വ്യത്യസ്ത സ്ക്രീനുകൾ, ഡാറ്റാ സെറ്റുകൾ, മറ്റ് ആശയവിനിമയങ്ങൾ എന്നിവയിലുടനീളം ഉള്ളടക്കം ടാബുകൾ ഓർഗനെെസ് ചെയ്യുന്നു.
mn: Табууд нь өөр дэлгэцүүд, өгөгдлийн багц болон бусад харилцан үйлдэл хооронд контентыг цэгцэлдэг.
mr: टॅब विविध स्क्रीन, डेटा सेट आणि इतर परस्‍परसंवादावर आशय व्यवस्थापित करतात.
ms: Tab menyusun kandungan untuk semua skrin, set data dan interaksi lain yang berbeza-beza.
my: တဘ်များက ဖန်သားပြင်၊ ဒေတာအတွဲနှင့် အခြားပြန်လှန်တုံ့ပြန်မှု အမျိုးမျိုးရှိ အကြောင်းအရာများကို စုစည်းပေးသည်။
nb: Faner organiserer innhold på flere skjermer, datasett og andre interaksjoner.
ne: ट्याबहरूले फरक स्क्रिन, डेटा सेट र अन्य अन्तर्क्रियाहरूभरिको सामग्री व्यवस्थापन गर्दछन्।
pa: ਟੈਬਾਂ ਸਮੱਗਰੀ ਨੂੰ ਸਾਰੀਆਂ ਵੱਖਰੀਆਂ ਸਕ੍ਰੀਨਾਂ, ਡਾਟਾ ਸੈੱਟਾਂ ਅਤੇ ਹੋਰ ਅੰਤਰਕਿਰਿਆਵਾਂ ਵਿੱਚ ਵਿਵਸਥਿਤ ਕਰਦੀਆਂ ਹਨ।
pl: Karty pozwalają na porządkowanie treści z wielu ekranów, ze zbiorów danych oraz interakcji.
pt: As guias organizam conteúdo entre diferentes telas, conjuntos de dados e outras interações.
pt_pt: Os separadores organizam o conteúdo em diferentes ecrãs, conjuntos de dados e outras interações.
ro: Filele organizează conținutul pe ecrane, în seturi de date diferite și în alte interacțiuni.
ru: Вкладки позволяют упорядочить контент на экранах, в наборах данных и т. д.
si: ටැබ විවිධ තිර, දත්ත කට්ටල සහ වෙනත් අන්තර්ක්‍රියා හරහා අන්තර්ගතය සංවිධානය කරයි.
sk: Karty usporiadajú obsah z rôznych obrazoviek, množín údajov a ďalších interakcií.
sq: Skedat i organizojnë përmbajtjet në ekrane të ndryshme, grupime të dhënash dhe ndërveprime të tjera.
sr: Картице организују садржај на различитим екранима, у скуповима података и другим интеракцијама.
sr_latn: Kartice organizuju sadržaj na različitim ekranima, u skupovima podataka i drugim interakcijama.
sv: Flikar organiserar innehåll på olika skärmar och med olika dataset och andra interaktioner.
te: విభిన్న స్క్రీన్‌లు, డేటా సెట్‌లు మరియు ఇతర పరస్పర చర్యలలో ట్యాబ్‌లు అనేవి కంటెంట్‌ను నిర్వహిస్తాయి.
th: แท็บช่วยจัดระเบียบเนื้อหาในหน้าจอต่างๆ ชุดข้อมูล และการโต้ตอบอื่นๆ
tr: Sekmeler farklı ekranlarda, veri kümelerinde ve diğer etkileşimlerde bulunan içeriği düzenler.
uk: На вкладках наведено контент із різних екранів, набори даних та іншу інформацію про взаємодії.
ur: ٹیبز مختلف اسکرینز، ڈیٹا سیٹس اور دیگر تعاملات پر مواد منظم کرتا ہے۔
uz: Varaqlarda turli ekranlardagi kontent, axborot toʻplamlari va boshqa amallar jamlanadi.
vi: Các tab sắp xếp nội dung trên nhiều màn hình, tập dữ liệu và hoạt động tương tác khác.
zh_hk: 分頁可整理不同畫面、資料集及其他互動的內容。
zu: Amathebhu ahlela okuqukethwe kuzikrini ezihlukile zokuqukethwe, amasethi edatha, nokunye ukuhlanganyela.

# demoTabsSubtitle
source: Tabs with independently scrollable views
af: Oortjies met aansigte waardeur jy onafhanklik kan rollees
am: ትሮች ራሳቸውን ከቻሉ ተሸብላይ ዕይታዎች ጋር
ar_eg: علامات تبويب تحتوي على عروض يمكن التنقّل خلالها بشكل مستقل
as: স্বতন্ত্ৰভাৱে স্ক্ৰ’ল কৰিবপৰা ভিউসমূহৰ সৈতে টেবসমূহ
az: Müstəqil şəkildə sürüşdürülə bilən baxışlarla tablar
be: Укладкі, якія можна праглядаць асобна
bn: আলাদাভাবে স্ক্রল করা যায় এমন ভিউ সহ ট্যাব
bs: Kartice s prikazima koji se mogu nezavisno klizati
ca: Pestanyes amb visualitzacions desplaçables de manera independent
da: Faner med visninger, der kan rulle uafhængigt af hinanden
es_ar: Pestañas con vistas independientes en las que el usuario puede desplazarse
et: Eraldi keritavate kuvadega vahekaardid
eu: Independenteki gora eta behera mugi daitezkeen fitxak
fa: برگه‌هایی با نماهای قابل‌پیمایش مستقل
fil: Mga tab na may mga hiwalay na naso-scroll na view
fr_ca: Onglets avec affichage à défilement indépendant
gl: Pestanas con vistas que se poden desprazar de forma independente
gu: સ્વતંત્ર રીતે સ્ક્રોલ કરવા યોગ્ય વ્યૂ ટૅબ
he: כרטיסיות עם תצוגות שניתן לגלול בהן בנפרד
hi: स्क्रोल करने पर अलग-अलग व्यू देने वाले टैब
hu: Lapok egymástól függetlenül görgethető nézettel
hy: Առանձին ոլորվող ներդիրներ
id: Tab dengan tampilan yang dapat di-scroll secara terpisah
it: Schede con visualizzazioni scorrevoli in modo indipendente
ja: 個別にスクロール可能なビューを含むタブ
ka: ჩანართები ცალ-ცალკე გადაადგილებადი ხედებით
km: ផ្ទាំង​មាន​ទិដ្ឋភាព​ដាច់ពីគ្នា​ដែលអាច​រំកិលបាន
kn: ಪ್ರತ್ಯೇಕವಾಗಿ ಸ್ಕ್ರಾಲ್ ಮಾಡಬಹುದಾದ ವೀಕ್ಷಣೆಗಳ ಜೊತೆಗಿನ ಟ್ಯಾಪ್‌ಗಳು
ko: 개별적으로 스크롤 가능한 뷰가 있는 탭
ky: Өз-өзүнчө сыдырылма көрүнүштөрү бар өтмөктөр
lo: ແຖບຕ່າງໆທີ່ມີມຸມມອງແບບເລື່ອນໄດ້ຂອງຕົນເອງ
lt: Skirtukai su atskirai slenkamais rodiniais
lv: Cilnes ar neatkarīgi ritināmiem skatiem
mk: Картички со прикази што се лизгаат неазависно еден од друг
ml: സ്വതന്ത്രമായി സ്ക്രോൾ ചെയ്യാവുന്ന കാഴ്ചകളുള്ള ടാബുകൾ
mn: Чөлөөтэй гүйлгэх харагдацтай табууд
mr: स्वतंत्रपणे स्क्रोल करण्यायोग्य व्ह्यूचे टॅब
ms: Tab dengan paparan boleh ditatal secara bebas
my: သီးခြားလှိမ့်နိုင်သော မြင်ကွင်းများဖြင့် တဘ်များ
nb: Faner med visninger som kan rulles hver for seg
ne: स्वतन्त्र रूपमा स्क्रोल गर्न मिल्ने दृश्यहरू भएका ट्याबहरू
pa: ਸੁਤੰਤਰ ਤੌਰ 'ਤੇ ਸਕ੍ਰੋਲ ਕਰਨਯੋਗ ਦ੍ਰਿਸ਼ਾਂ ਵਾਲੀ ਟੈਬ
pl: Karty, które można przewijać niezależnie
pt: Guias com visualizações roláveis independentes
pt_pt: Separadores com vistas deslocáveis independentes.
ro: File cu vizualizări care se derulează independent
ru: Вкладки, прокручиваемые по отдельности
si: ස්වාධීනව අනුචලනය කළ හැකි දසුන් සහිත ටැබ
sk: Karty so samostatne posúvateľnými zobrazeniami
sq: Skedat me pamje që mund të lëvizen në mënyrë të pavarur
sr: Картице са приказима који могу засебно да се померају
sr_latn: Kartice sa prikazima koji mogu zasebno da se pomeraju
sv: Flikar med vyer som går att skrolla igenom separat
te: స్వతంత్రంగా స్క్రోల్ చేయదగిన వీక్షణలతో ట్యాబ్‌లు
th: แท็บซึ่งมีมุมมองที่เลื่อนได้แบบอิสระ
tr: Bağımsız olarak kaydırılabilen görünümlü sekmeler
uk: Вкладки з окремим прокручуванням
ur: آزادانہ طور پر قابل اسکرول ملاحظات کے ٹیبس
uz: Alohida aylantiriladigan varaqlar
vi: Các tab có chế độ xem có thể di chuyển độc lập
zh_hk: 可獨立捲動檢視的分頁
zu: Amathebhu anokubuka okuzimele okuskrolekayo

# demoTabsTitle
source: Tabs
af: Oortjies
am: ትሮች
ar_eg: علامات التبويب
as: টেবসমূহ
az: Tablar
be: Укладкі
bn: ট্যাব
bs: Kartice
ca: Pestanyes
da: Faner
es_ar: Pestañas
et: Vahekaardid
eu: Fitxak
fa: برگه‌ها
fil: Mga Tab
fr_ca: Onglets
gl: Pestanas
gu: ટૅબ
he: כרטיסיות
hi: टैब
hu: Lapok
hy: Ներդիրներ
id: Tab
it: Schede
ja: タブ
ka: ჩანართები
km: ផ្ទាំង
kn: ಟ್ಯಾಬ್‌ಗಳು
ko: 탭
ky: Өтмөктөр
lo: ແຖບ
lt: Skirtukai
lv: Cilnes
mk: Картички
ml: ടാബുകൾ
mn: Табууд
mr: टॅब
ms: Tab
my: တဘ်များ
nb: Faner
ne: ट्याबहरू
pa: ਟੈਬਾਂ
pl: Karty
pt: Guias
pt_pt: Separadores
ro: File
ru: Вкладки
si: ටැබ
sk: Karty
sq: Skedat
sr: Картице
sr_latn: Kartice
sv: Flikar
te: ట్యాబ్‌లు
th: แท็บ
tr: Sekmeler
uk: Вкладки
ur: ٹیبز
uz: Varaqlar
vi: Tab
zh_hk: 分頁
zu: Amathebhu
