Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneSleep2SemanticLabel
source: Machu Picchu citadel
af: Machu Picchu-sitadel
am: የማቹ ፒቹ ምሽግ
ar_eg: قلعة ماتشو بيتشو
as: মাচু পিচু চিটাডেল
az: Maçu Pikçu qalası
be: Цытадэль Мачу-Пікчу
bn: মাচু পিচ্চু দুর্গ
bs: Tvrđava Machu Picchu
ca: Ciutadella de Machu Picchu
es_ar: Ciudadela de Machu Picchu
et: Machu Picchu kadunud linn
eu: Machu Picchuko hiria
fa: قلعه ماچو پیچو
fil: Citadel ng Machu Picchu
fr_ca: Citadelle du Machu Picchu
gl: Cidadela de Machu Picchu
gu: માચુ પિચ્ચુનો રાજગઢ
he: המבצר במאצ'ו פיצ'ו
hi: माचू पिच्चू सिटडल
hu: A Machu Picchu fellegvára
hy: Մաչու Պիչու ամրոց
id: Benteng Machu Picchu
it: Cittadella di Machu Picchu
ja: マチュピチュの砦
ka: მაჩუ-პიქჩუს ციტადელი
km: ប្រាសាទ​នៅ​ម៉ាឈូភីឈូ
kn: ಮಾಚು ಪಿಚು ಸಿಟಾಡೆಲ್
ko: 마추픽추 시타델
ky: Мачу-Пичу цитадели
lo: ປ້ອມມາຊູປິກຊູ
lt: Maču Pikču tvirtovė
lv: Maču Pikču citadele
mk: Тврдината Мачу Пикчу
ml: മാച്ചു പിച്ചു സിറ്റാഡെൽ
mn: Мачу Пикчу хэрэм
mr: माचू पिचू बालेकिल्ला
ms: Kubu kota Machu Picchu
my: မာချူ ပီချူ ခံတပ်
nb: Machu Picchu-festningen
ne: माचू पिक्चूको गढी
pa: ਮਾਚੂ ਪਿਕਚੂ ਕਿਲ੍ਹਾ
pl: Cytadela Machu Picchu
pt: Cidadela de Machu Picchu
pt_pt: Cidadela de Machu Picchu
ro: Cetatea Machu Picchu
ru: Крепость Мачу-Пикчу
si: මාචු පිච්චු බළකොටුව
sk: Citadela Machu Picchu
sq: Qyteti i Maçu Piçut
sr: Тврђава у Мачу Пикчуу
sr_latn: Tvrđava u Maču Pikčuu
sv: Machu Picchu
te: మాచు పిచ్చు, సిటాడెల్
th: ป้อมมาชูปิกชู
tr: Machu Picchu kalesi
uk: Цитадель Мачу-Пікчу
ur: ماچو پیچو کا قلعہ
uz: Machu Pikchu qalʼasi
vi: Thành cổ Machu Picchu
zh_hk: 古城馬丘比丘
zu: I-Machu Picchu citadel

# craneSleep1SemanticLabel
source: Chalet in a snowy landscape with evergreen trees
af: Chalet in 'n sneeulandskap met immergroen bome
am: ሁሌ ለምለም ዛፎች ባሉት በረዷሟ መሬት ላይ ያለ ሻሌት ቤት
ar_eg: شاليه في مساحة طبيعية من الثلوج وبها أشجار دائمة الخضرة
as: চিৰসেউজ উদ্ভিদৰ এক বৰফাবৃত প্ৰাকৃতিক দৃশ্যৰ সৈতে শ্ব্যালেই
az: Həmişəyaşıl ağaclar olan qarlı yerdə ağacdan ev
be: Заснежаны краявід з сельскім домікам і вечназялёнымі дрэвамі
bn: চিরসবুজ গাছ সহ একটি তুষারময় আড়াআড়ি কুটীর
bs: Planinska kućica u snježnom krajoliku sa zimzelenim drvećem
ca: Xalet en un paisatge nevat amb arbres de fulla perenne
da: Hytte i et snelandskab med stedsegrønne træer
es_ar: Chalé en un paisaje nevado con árboles de hoja perenne
et: Mägimajake lumisel maastikul koos igihaljaste puudega
eu: Txalet bat zuhaitz hostoiraunkorreko paisaia elurtuan
fa: کلبه‌ای در منظره برفی با درختان همیشه‌سبز
fil: Chalet sa isang maniyebeng tanawing may mga evergreen na puno
fr_ca: Chalet dans un paysage enneigé et entouré de conifères
gl: Chalé nunha paisaxe nevada con árbores de folla perenne
gu: સદાબહાર ઝાડવાળા બર્ફીલા લૅન્ડસ્કેપમાં ચેલેટ
he: בקתה בנוף מושלג עם עצים ירוקי-עד
hi: सदाबहार पेड़ों के बीच बर्फ़ीले लैंडस्केप में बना शैले
hu: Faház havas tájon, örökzöld fák között
hy: Շալե՝ փշատերև ծառերով ձյունե լանդշաֆտի ֆոնի վրա
id: Chalet di lanskap bersalju dengan pepohonan hijau
it: Chalet in un paesaggio innevato con alberi sempreverdi
ja: 常緑樹の雪景色の中にあるシャレー
ka: შალე თოვლიან ლანდშაფტზე მარადმწვანე ხეებით
km: ផ្ទះឈើ​នៅលើភ្នំ​ដែលស្ថិត​នៅក្នុង​ទេសភាព​មានព្រិលធ្លាក់​ជាមួយនឹង​ដើមឈើ​ដែលមាន​ស្លឹក​ពេញមួយឆ្នាំ
kn: ನಿತ್ಯಹರಿದ್ವರ್ಣ ಮರಗಳು ಮತ್ತು ಹಿಮದ ಮೇಲ್ಮೈ ಅಲ್ಲಿರುವ ಚಾಲೆಟ್
ko: 상록수가 있는 설경 속 샬레
ky: Карга жамынган жашыл дарактардын арасындагы шале
lo: ກະຕູບຫຼັງນ້ອຍຢູ່ກາງທິວທັດທີ່ມີຫິມະ ແລະ ຕົ້ນໄມ້ຂຽວ
lt: Trobelė sniegynuose su visžaliais medžiais
lv: Kotedža sniegotā ainavā ar mūžzaļiem kokiem
mk: Вила во снежен пејзаж со зимзелени дрва
ml: മഞ്ഞ് പെയ്യുന്ന നിത്യഹരിത മരങ്ങളുള്ള പ്രദേശത്തെ ഉല്ലാസ കേന്ദ്രം
mn: Мөнх ногоон модтой, цастай байгаль дахь модон байшин
mr: सदाहरित झाडे असलेल्या बर्फाळ प्रदेशातील शॅले
ms: Chalet dalam lanskap bersalji dengan pokok malar hijau
my: အမြဲစိမ်းသစ်ပင်များဖြင့် နှင်းကျသော ရှုခင်းတစ်ခုရှိ တောင်ပေါ်သစ်သားအိမ်
nb: Fjellhytte i snølandskap med grantrær
ne: सदाबहार रूखहरू भएको र साथै हिउँ परेको ल्यान्डस्केपमा सानो कुटी
pa: ਸਦਾਬਹਾਰ ਦਰੱਖਤਾਂ ਨਾਲ ਬਰਫ਼ੀਲੇ ਲੈਂਡਸਕੇਪ ਵਿੱਚ ਲੱਕੜ ਦਾ ਘਰ
pl: Zimowa chatka wśród zielonych drzew
pt: Chalé em uma paisagem com neve e árvores perenes
pt_pt: Chalé numa paisagem com árvores de folha perene e neve
ro: Castel într-un peisaj de iarnă, cu conifere
ru: Шале на фоне заснеженного пейзажа с хвойными деревьями
si: සදාහරිත ගස් සහිත මීදුම සහිත භූමිභාගයක ඇති පැල
sk: Chata v zasneženej krajine s ihličnatými stromami
sq: Shtëpi alpine në një peizazh me borë me pemë të gjelbëruara
sr: Планинска колиба у снежном пејзажу са зимзеленим дрвећем
sr_latn: Planinska koliba u snežnom pejzažu sa zimzelenim drvećem
sv: Fjällstuga i ett snötäckt landskap med granar
te: సతత హరిత వృక్షాలు, మంచుతో కూడిన ల్యాండ్‌స్కేప్‌లో చాలెట్
th: กระท่อมหลังเล็กท่ามกลางทิวทัศน์ที่มีหิมะและต้นไม้เขียวชอุ่ม
tr: Yaprak dökmeyen ağaçların bulunduğu karla kaplı bir arazideki şale
uk: Шале на сніжному тлі в оточенні хвойних дерев
ur: سدا بہار پہاڑوں کے بیچ برفیلے لینڈ اسکیپ میں چالیٹ
uz: Qishloqdagi qorli yam-yashil daraxtlar bagʻridagi uy
vi: Căn nhà gỗ trong khung cảnh đầy tuyết với cây thường xanh xung quanh
zh_hk: 雪地中的小木屋和長青樹
zu: I-chalet yokwakheka kwezwe eneqhwa enezihlahla ezihlala ziluhlaza

# craneSleep0SemanticLabel
source: Overwater bungalows
af: Hutte bo die water
am: የውሃ ላይ ባንግሎው ቤት
ar_eg: أكواخ فوق الماء
as: পানীৰ ওপৰত সজোৱা বঙলা
az: Suüstü bunqalolar
be: Бунгала над воднай паверхняй
bn: ওভার ওয়াটার বাংলো
bs: Kućice na vodi
ca: Bungalous flotants
da: Bungalows over vandet
es_ar: Cabañas sobre el agua
et: Veepeal olevad bangalod
eu: Itsasoko bungalow-ak
fa: خانه‌های ییلاقی روی آب
fil: Mga bungalow sa ibabaw ng tubig
fr_ca: Bungalows sur l'eau
gl: Cabanas flotantes
gu: પાણીની ઉપર બનાવેલો બંગલો
he: בקתות מעל המים
hi: पानी पर बने बंगले
hu: Vízen álló nyaralóházak
hy: Բունգալոներ ջրի վրա
id: Bungalo apung
it: Bungalow sull'acqua
ja: 水上バンガロー
ka: წყალზე მდგომი ბუნგალოები
km: បឹងហ្គាឡូ​លើ​ទឹក
kn: ನೀರಿನಿಂದ ಸುತ್ತುವರಿದ ಬಂಗಲೆಗಳು
ko: 수상 방갈로
ky: Суунун үстүндө жайгашкан бунгалолор
lo: ບັງກະໂລເໜືອນ້ຳ
lt: Vilos ant vandens
lv: Bungalo virs ūdens
mk: Надводни бунгалови
ml: വെള്ളത്തിന് പുറത്ത് നിർമ്മിച്ചിരിക്കുന്ന ബംഗ്ലാവുകൾ
mn: Усан дээрх бунгало
mr: पाण्यावरील तरंगते बंगले
ms: Banglo terapung
my: ရေပေါ်အိမ်လေးများ
nb: Bungalower over vann
ne: पानीमाथिका बङ्गलाहरू
pa: ਪਾਣੀ 'ਤੇ ਬਣੇ ਬੰਗਲੇ
pl: Bungalowy na wodzie
pt: Bangalô sobre a água
pt_pt: Bangalôs sobre a água
ro: Bungalouri pe malul apei
ru: Бунгало над водой
si: ජලය මත ඇති බංගලා
sk: Bungalovy nad vodou
sq: Shtëpi mbi ujë
sr: Бунгалови који се надвијају над водом
sr_latn: Bungalovi koji se nadvijaju nad vodom
sv: Bungalower på pålar i vattnet
te: ఓవర్‌వాటర్ బంగ్లాలు
th: บังกะโลที่ตั้งอยู่เหนือน้ำ
tr: Su üzerinde bungalovlar
uk: Бунгало над водою
ur: پانی کے اوپر بنگلے
uz: Suv ustidagi bir qavatli imorat
vi: Nhà gỗ một tầng trên mặt nước
zh_hk: 水上小屋
zu: Ama-bungalow angaphezu kwamanzi

# craneFly13SemanticLabel
source: Sea-side pool with palm trees
af: Strandswembad met palmbome
am: ዘንባባ ያሉት የባህር ጎን መዋኛ
ar_eg: بركة بجانب البحر حولها نخيل
as: তাল গজ থকা সাগৰৰ কাষৰীয়া সাঁতোৰা পুখুৰী
az: Palma ağacları olan dənizkənarı hovuz
be: Басейн з пальмамі з відам на мора
bn: তাল গাছ সহ সমুদ্রের পাশের পুল
bs: Bazen pored mora okružen palmama
ca: Piscina vora el mar amb palmeres
da: Swimmingpool ved havet med palmer
es_ar: Piscina con palmeras a orillas del mar
et: Mereäärne bassein ja palmid
eu: Igerileku bat itsasertzean, palmondoekin
fa: استخر ساحلی با درختان نخل
fil: Pool sa tabi ng dagat na may mga palm tree
fr_ca: Piscine face à la mer avec palmiers
gl: Piscina xunto ao mar con palmeiras
gu: સમુદ્ર કિનારે પામના વૃક્ષોવાળો પૂલ
he: בריכה לחוף הים עם עצי דקל
hi: समुद्र किनारे ताड़ के पेड़ों के साथ बना पूल
hu: Tengerparti medence pálmafákkal
hy: Արմավենիներով շրջապատված ծովափնյա լողավազան
id: Kolam renang tepi laut yang terdapat pohon palem
it: Piscina sul mare con palme
ja: ヤシの木があるシーサイド プール
ka: ზღვისპირა აუზი პალმის ხეებით
km: អាងហែលទឹក​ជាប់​មាត់សមុទ្រ​ដែលមាន​ដើមត្នោត
kn: ತಾಳೆ ಮರಗಳನ್ನು ಹೊಂದಿರುವ ಸಮುದ್ರದ ಪಕ್ಕದ ಈಜುಕೊಳ
ko: 야자수가 있는 바닷가 수영장
ky: Пальма бактары бар деңиздин жээгиндеги бассейн
lo: ສະລອຍນ້ຳຕິດທະເລທີ່ມີຕົ້ນປາມ
lt: Paplūdimio baseinas su palmėmis
lv: Peldbaseins ar palmām pie jūras
mk: Базен крај море со палми
ml: ഈന്തപ്പനകളോടുകൂടിയ സമുദ്രതീരത്തെ പൂളുകൾ
mn: Далдуу модтой далайн эргийн усан сан
mr: पामच्या झाडांच्या सान्निध्यातील समुद्रकिनाऱ्याच्या बाजूला असलेला पूल
ms: Kolam renang tepi laut dengan pokok palma
my: ထန်းပင်များဖြင့် ပင်လယ်ကမ်းစပ်ရှိ ရေကူးကန်
nb: Basseng langs sjøen med palmer
ne: खजुरका रूखहरू भएको समुद्र छेउको पोखरी
pa: ਖਜੂਰ ਦੇ ਦਰੱਖਤਾਂ ਵਾਲਾ ਸਮੁੰਦਰ ਦੇ ਨੇੜੇ ਪੂਲ
pl: Nadmorski basen z palmami
pt: Piscina com palmeiras à beira-mar
pt_pt: Piscina voltada para o mar com palmeiras
ro: Piscină pe malul mării, cu palmieri
ru: Бассейн у моря, окруженный пальмами
si: තල් ගස් සහිත මුහුද අසබඩ නාන තටාකය
sk: Bazén pri mori s palmami
sq: Pishinë buzë detit me palma
sr: Базен на обали мора са палмама
sr_latn: Bazen na obali mora sa palmama
sv: Havsnära pool och palmer
te: తాటి చెట్లు, సముద్రం పక్కన ఈత కొలను
th: สระว่ายน้ำริมทะเลซึ่งมีต้นปาล์ม
tr: Palmiye ağaçlı deniz kenarı havuzu
uk: Басейн біля моря з пальмами
ur: سمندر کنارے کھجور کے درختوں کے ساتھ پول
uz: Dengiz boʻyidagi palmalari bor hovuz
vi: Bể bơi ven biển xung quanh là những cây cọ
zh_hk: 樹影婆娑的海邊泳池
zu: Iphuli ekuhlangothi lolwandle olunezihlahla zamasundu

# craneFly12SemanticLabel
source: Pool with palm trees
af: Swembad met palmbome
am: ዘንባባ ዛፎች ያለው መዋኛ
ar_eg: بركة ونخيل
as: তাল গছৰ সৈতে সাঁতোৰা পুখুৰী
az: Palma ağacları olan hovuz
be: Басейн з пальмамі
bn: তাল গাছ সহ পুল
bs: Bazen okružen palmama
ca: Piscina amb palmeres
da: Swimmingpool med palmetræer
es_ar: Piscina con palmeras
et: Bassein ja palmid
eu: Igerileku bat palmondoekin
fa: استخر با درختان نخل
fil: Pool na may mga palm tree
fr_ca: Piscine avec des palmiers
gl: Piscina con palmeiras
gu: પામના વૃક્ષોવાળો પૂલ
he: עצי דקל לצד בריכה
hi: ताड़ के पेड़ों के साथ पूल
hu: Medence pálmafákkal
hy: Արմավենիներով շրջապատված լողավազան
id: Kolam renang yang terdapat pohon palem
it: Piscina con palme
ja: ヤシの木があるプール
ka: აუზი პალმის ხეებით
km: អាងហែលទឹក​ដែលមាន​ដើមត្នោត
kn: ತಾಳೆ ಮರಗಳ ಜೊತೆಗೆ ಈಜುಕೊಳ
ko: 야자수가 있는 수영장
ky: Пальмалары бар бассейн
lo: ສະລອຍນ້ຳທີ່ມີຕົ້ນປາມ
lt: Baseinas su palmėmis
lv: Peldbaseins ar palmām
mk: Базен со палми
ml: ഈന്തപ്പനകളോടുകൂടിയ പൂൾ
mn: Далдуу модтой усан сан
mr: पामच्या झाडांच्या सान्निध्यातील पूल
ms: Kolam renang dengan pokok palma
my: ထန်းပင်များနှင့် ရေကူးကန်
nb: Basseng med palmer
ne: खजुरको रूख भएको पोखरी
pa: ਖਜੂਰ ਦੇ ਦਰੱਖਤਾਂ ਵਾਲਾ ਪੂਲ
pl: Basen z palmami
pt: Piscina com palmeiras
pt_pt: Piscina com palmeiras
ro: Piscină cu palmieri
ru: Бассейн, окруженный пальмами
si: තල් ගස් සහිත නාන තටාකය
sk: Bazén s palmami
sq: Pishinë me palma
sr: Базен са палмама
sr_latn: Bazen sa palmama
sv: Pool och palmer
te: తాటి చెట్ల పక్కన ఈత కొలను
th: สระว่ายน้ำที่มีต้นปาล์ม
tr: Palmiye ağaçlarıyla havuz
uk: Басейн із пальмами
ur: کھجور کے درختوں کے ساتھ پول
uz: Atrofida palmalari bor hovuz
vi: Bể bơi xung quanh là những cây cọ
zh_hk: 樹影婆娑的泳池
zu: Iphuli enezihlahla zamasundu

# craneFly11SemanticLabel
source: Brick lighthouse at sea
af: Baksteenvuurtoring by die see
am: ባህር ላይ ያለ ባለጡብ ፋኖ ቤት
ar_eg: منارة من الطوب على شاطئ البحر
as: সাগৰত থকা ইটাৰ আলোকস্তম্ভ
az: Dənizdə kərpic dəniz fənəri
be: Цагельны маяк на моры
bn: সমুদ্রে ইটের বাতিঘর
bs: Svjetionik od cigle na moru
ca: Far de maons al mar
da: Murstensfyrtårn ved havet
es_ar: Faro de ladrillos en el mar
et: Kivimajakas merel
eu: Adreiluzko itsasargia
fa: فانوس دریایی آجری کنار دریا
fil: Brick na parola sa may dagat
fr_ca: Phare en briques en haute mer
gl: Faro de ladrillos xunto ao mar
gu: સમુદ્ર કિનારે ઈંટથી બનાવેલી દીવાદાંડી
he: מגדלור שבנוי מלבנים בים
hi: समुद्र तट पर ईंट से बना लाइटहाउस
hu: Téglaépítésű világítótorony a tengeren
hy: Աղյուսե փարոս՝ ծովի ֆոնի վրա
id: Mercusuar bata di laut
it: Faro di mattoni sul mare
ja: レンガ作りの海の灯台
ka: აგურის შუქურა ზღვაზე
km: ប៉មភ្លើង​នាំផ្លូវ​ធ្វើពី​ឥដ្ឋ​នៅសមុទ្រ
kn: ಸಮುದ್ರದಲ್ಲಿರುವ ಇಟ್ಟಿಗೆಯ ಲೈಟ್‌ ಹೌಸ್‌
ko: 벽돌로 지은 바다의 등대
ky: Деңиздеги кирпичтен курулган маяк
lo: ປະພາຄານດິນຈີ່ກາງທະເລ
lt: Mūrinis švyturys jūroje
lv: Ķieģeļu bāka jūrā
mk: Светилник од тули на море
ml: ഇഷ്‌ടിക കൊണ്ട് ഉണ്ടാക്കിയ കടലിലെ ലൈറ്റ്ഹൗസ്
mn: Далай дахь тоосгон гэрэлт цамхаг
mr: समुद्रात असलेले विटांचे दीपगृह
ms: Rumah api bata di laut
my: ပင်လယ်ရှိ အုတ်ဖြင့်တည်ဆောက်ထားသော မီးပြတိုက်
nb: Fyrtårn av murstein til sjøs
ne: समुद्रमा इटाले बनेको दीपगृह
pa: ਸਮੁੰਦਰ ਵਿੱਚ ਇੱਟਾਂ ਦਾ ਬਣਿਆ ਚਾਨਣ ਮੁਨਾਰਾ
pl: Ceglana latarnia na tle morza
pt: Farol de tijolos no mar
pt_pt: Farol de tijolo no mar
ro: Far din cărămidă pe malul mării
ru: Кирпичный маяк на фоне моря
si: මුහුදේ ඇති ගඩොල් ප්‍රදීපාගාරය
sk: Tehlový maják pri mori
sq: Far prej tulle buzë detit
sr: Светионик од цигала на мору
sr_latn: Svetionik od cigala na moru
sv: Tegelfyr i havet
te: సముద్రం వద్ద ఇటుకలతో నిర్మించబడిన లైట్ హౌస్
th: ประภาคารอิฐกลางทะเล
tr: Denizde tuğla deniz feneri
uk: Цегляний маяк біля моря
ur: سمندر کے کنارے برک لائٹ ہاؤس
uz: Dengiz boʻyidagi gʻishtdan qurilgan mayoq
vi: Ngọn hải đăng xây bằng gạch trên biển
zh_hk: 海上的磚燈塔
zu: Indlu enesibani yesitina esolwandle

# craneFly10SemanticLabel
source: Al-Azhar Mosque towers during sunset
af: Al-Azhar-moskeetorings tydens sonsondergang
am: የአል-አዝሃር መስጊድ ማማዎች በጸሐይ መጥለቂያ ጊዜ
ar_eg: مآذن الجامع الأزهر أثناء الغروب
as: অল-আঝাৰ মছজিদটো সূৰ্যাস্তৰ সময়ত সুউচ্চ দেখা গৈছে
az: Gün batımı zamanı Əl-Əzhər Məscidinin minarələri
be: Мінарэты мячэці аль-Азхар на захадзе сонца
bn: সূর্যাস্তের সময় আল-আজহার মসজিদের টাওয়ার
bs: Minareti džamije Al-Azhar u suton
ca: Torres de la mesquita d'Al-Azhar durant la posta de sol
da: Al-Azhar-moskéens tårne ved solnedgang
es_ar: Torres de la mezquita de al-Azhar durante una puesta de sol
et: Al-Azhari mošee tornid päikeseloojangus
eu: Al-Azhar meskitaren dorreak ilunabarrean
fa: مناره‌های مسجد الازهر در غروب
fil: Mga tore ng Al-Azhar Mosque habang papalubog ang araw
fr_ca: Tours de la mosquée Al-Azhar au coucher du soleil
gl: Minaretes da mesquita de al-Azhar ao solpor
gu: સૂર્યાસ્ત પછી અલ-અઝહર મસ્જિદના ટાવર
he: המגדלים של מסגד אל-אזהר בשקיעה
hi: सूर्यास्त के दौरान अल-अज़हर मस्ज़िद के टावर
hu: Az Al-Azhar mecset tornyai a lemenő nap fényében
hy: Ալ-Ազհարի մզկիթի մինարեթները մայրամուտին
id: Menara Masjid Al-Azhar saat matahari terbenam
it: Torri della moschea di Al-Azhar al tramonto
ja: 日没時のアズハルモスク
ka: ალ-აზჰარის მეჩეთის კოშკები მზის ჩასვლისას
km: ប៉មវិហារ​អ៊ិស្លាម Al-Azhar អំឡុងពេល​ថ្ងៃលិច
kn: ಸೂರ್ಯಾಸ್ತದ ಸಮಯದಲ್ಲಿ ಅಲ್-ಅಜರ್ ಮಸೀದಿ ಗೋಪುರಗಳು
ko: 해질녘의 알아즈하르 모스크 탑
ky: Аль-Ажар мечитинин мунаралары күн баткан учурда
lo: Al-Azhar Mosque ໃນຕອນຕາເວັນຕົກ
lt: Al Azharo mečetės bokštai per saulėlydį
lv: Al-Azhara mošejas minareti saulrietā
mk: Минарињата на џамијата Ал-Азар на зајдисонце
ml: സൂര്യാസ്‌തമയ സമയത്ത് അൽ-അസ്ഹർ പള്ളിയുടെ മിനാരങ്ങൾ
mn: Нар жаргах үеийн Аль-Азхар сүмийн цамхгууд
mr: सूर्यास्ताच्या वेळी दिसणारे अल-अजहर मशिदीचे मिनार
ms: Menara Masjid Al-Azhar semasa matahari terbenam
my: နေဝင်ချိန် Al-Azhar Mosque မျှော်စင်များ
nb: Tårnene til Al-Azhar-moskeen ved solnedgang
ne: घाम अस्ताउँदै गरेका बेला अल-अजहर मस्जिदका टावरहरू
pa: ਸੂਰਜ ਡੁੱਬਣ ਦੌਰਾਨ ਅਲ-ਅਜ਼ਹਰ ਮਸੀਤ ਦੀਆਂ ਮੀਨਾਰਾਂ
pl: Wieże meczetu Al-Azhar w promieniach zachodzącego słońca
pt: Torres da mesquita de Al-Azhar no pôr do sol
pt_pt: Torres da Mesquita de Al-Azhar durante o pôr do sol
ro: Turnurile moscheii Al-Azhar la apus
ru: Минареты мечети аль-Азхар на закате
si: ඉර බසින අතරතුර අල් අසාර් පල්ලයේ කුළුණු
sk: Veže mešity Al-Azhar pri západe slnka
sq: Minaret e Xhamisë së Al-Azharit në perëndim të diellit
sr: Минарети џамије Ал-Аџар у сумрак
sr_latn: Minareti džamije Al-Adžar u sumrak
sv: Al-Azhar-moskéns torn i solnedgången
te: సూర్యాస్తమయం సమయంలో అల్-అజార్ మసీదు టవర్‌లు
th: มัสยิดอัลอัซฮัรช่วงพระอาทิตย์ตก
tr: Gün batımında El-Ezher Camisi'nin minareleri
uk: Мечеть аль-Азхар під час заходу сонця
ur: غروب آفتاب کے دوران ازہر مسجد کے ٹاورز
uz: Kun botayotganda Al-Azhar masjidi minoralari
vi: Tháp Al-Azhar Mosque lúc hoàng hôn
zh_hk: 夕陽下的愛資哈爾清真寺
zu: I-Al-Azhar Mosque towers ngesikhathi sokushona kwelanga

# craneFly9SemanticLabel
source: Man leaning on an antique blue car
af: Man wat teen 'n antieke blou motor leun
am: አንድ አንጋፋ ሰማያዊ መኪናን ተደግፎ የቆመ ሰው
ar_eg: رجل متّكِئ على سيارة زرقاء عتيقة
as: এখন পুৰণি নীলা গাড়ীত হালি থকা মানুহ
az: Qədim mavi avtomobilə söykənən kişi
be: Мужчына, які абапіраецца на антыкварны сіні аўтамабіль
bn: একজন পুরনো নীল গাড়িতে ঝুঁকে দেখছে
bs: Muškarac naslonjen na starinski plavi automobil
ca: Home recolzat en un cotxe blau antic
da: Mand, der læner sig op ad en blå retro bil
es_ar: Hombre reclinado sobre un auto azul antiguo
et: Mees nõjatub vanaaegsele sinisele autole
eu: Gizon bat antzinako auto urdin baten aurrean makurtuta
fa: مرد تکیه‌داده به ماشین آبی عتیقه
fil: Lalaking nakasandal sa isang antique na asul na sasakyan
fr_ca: Homme s'appuyant sur une voiture bleue ancienne
gl: Home apoiado nun coche azul antigo
gu: પ્રાચીન વાદળી કારને ટેકો આપીને ઉભેલો માણસ
he: אדם שנשען על מכונית כחולה עתיקה
hi: नीले रंग की विटेंज कार से टेक लगाकर खड़ा व्यक्ति
hu: Régi kék autóra támaszkodó férfi
hy: Կապույտ ռետրո մեքենայի վրա հենված տղամարդ
id: Pria yang bersandar pada mobil antik warna biru
it: Uomo appoggiato a un'auto blu antica
ja: 青いクラシック カーに寄りかかる男性
ka: მამაკაცი ეყრდნობა ძველებურ ლურჯ მანქანას
km: បុរសផ្អែកលើ​រថយន្ត​ស៊េរីចាស់​ពណ៌ខៀវ
kn: ಹಳೆಯ ನೀಲಿ ಕಾರಿಗೆ ವಾಲಿ ನಿಂತಿರುವ ಮನುಷ್ಯ
ko: 파란색 앤티크 자동차에 기대 있는 남자
ky: Антиквардык көк унаага таянган киши
lo: ຜູ້ຊາຍຢືນພິງລົດບູຮານສີຟ້າ
lt: Žmogus, palinkęs prie senovinio mėlyno automobilio
lv: Vīrietis atspiedies pret senu, zilu automašīnu
mk: Маж се потпира на старински син автомобил
ml: നീല നിറത്തിലുള്ള പുരാതന കാറിൽ ചാരിയിരിക്കുന്ന മനുഷ്യൻ
mn: Хуучны цэнхэр өнгийн машин налж буй эр
mr: जुन्या काळातील एका निळ्या कारला टेकून उभा असलेला माणूस
ms: Lelaki bersandar pada kereta biru antik
my: ရှေးဟောင်းကားပြာဘေး မှီနေသည့်လူ
nb: Mann som lener seg på en blå veteranbil
ne: पुरानो मोडलको निलो कारमा अढेस लागेको मान्छे
pa: ਪੁਰਾਣੀ ਨੀਲੀ ਕਾਰ 'ਤੇ ਢੋਅ ਲਗਾ ਕੇ ਖੜ੍ਹਾ ਆਦਮੀ
pl: Mężczyzna opierający się o zabytkowy niebieski samochód
pt: Homem apoiado sobre um carro azul antigo
pt_pt: Homem encostado a um automóvel azul antigo
ro: Bărbat care se sprijină de o mașină albastră veche
ru: Мужчина, который опирается на синий ретроавтомобиль
si: කෞතුක වටිනාකමක් ඇති නිල් පැහැති මෝටර් රථයකට හේත්තු වී සිටින මිනිසා
sk: Muž opierajúci sa o starodávne modré auto
sq: Burrë i mbështetur te një makinë antike blu
sr: Човек се наслања на стари плави аутомобил
sr_latn: Čovek se naslanja na stari plavi automobil
sv: Man som lutar sig mot en blå veteranbil
te: పురాతన నీలి రంగు కారుపై వాలి నిలుచున్న మనిషి
th: ผู้ชายพิงรถโบราณสีน้ำเงิน
tr: Mavi antika bir arabaya dayanan adam
uk: Чоловік, який спирається на раритетний синій автомобіль
ur: نیلے رنگ کی کار سے ٹیک لگار کر کھڑا آدمی
uz: Eski koʻk avtomobilga suyanib turgan odam
vi: Người đàn ông tựa vào chiếc xe ô tô cổ màu xanh dương
zh_hk: 靠著藍色古董車的男人
zu: Indoda encike kumoto endala eluhlaza okwesibhakabhaka

# craneFly8SemanticLabel
source: Supertree Grove
am: ሱፐርትሪ ግሮቭ
ar_eg: سوبر تري غروف
as: ছুপাৰট্ৰী গ্ৰুভ
az: Supertree Grove parkı
be: Сады каля заліва
bn: সুপারট্রি গ্রোভ
es_ar: Arboleda de superárboles
fa: پارک سوپرتری گراو
gu: સુપરટ્રી ગ્રોવ
he: גן Supertree Grove
hi: सुपरट्री ग्रोव
hy: Գերծառերի պուրակ
ja: スーパーツリー グローブ
ka: სუპერხეების კორომი
kn: ಸೂಪರ್‌ಟ್ರೀ ಗ್ರೋವ್
ko: 수퍼트리 그로브
ky: Супертри багы
lt: Supermedžių giraitė
mk: Градина со супердрва
mn: Supertree төгөл
mr: सुपरट्री ग्रोव्ह
ne: सुपरट्री ग्रोभ
pa: ਸੁਪਰਟ੍ਰੀ ਗਰੋਵ
ru: Роща сверхдеревьев
si: සුපර්ට්‍රී ග්‍රොව්
sk: Háj superstromov
sv: Parken Supertree Grove
te: సూపర్‌ట్రీ తోట
th: ซูเปอร์ทรี โกรฟ
tr: Supertree Korusu
uk: Сади біля затоки
ur: سپرٹری گرو
uz: Superdaraxtzor
zh_hk: 新加坡超級樹
zu: I-Supertree Grove

# craneEat9SemanticLabel
source: Cafe counter with pastries
af: Kafeetoonbank met fyngebak
am: ኬኮች ያሉት የካፌ ካውንተር
ar_eg: طاولة مقهى لتقديم المعجنات
as: পেষ্ট্ৰিসহ কেফেৰ কাউণ্টাৰ
az: Qənnadı məmulatları düzülmüş kafe piştaxtası
be: Прылавак кафэ з кандытарскімі вырабамі
bn: পেস্ট্রি সহ ক্যাফে কাউন্টার
bs: Štand za kafu i peciva
ca: Mostrador d'una cafeteria amb pastes
da: Cafédisk med kager
es_ar: Mostrador de cafetería con pastelería
et: Küpsetistega kohvikulett
eu: Kafetegi bateko salmahaia, gozoekin
fa: پیشخوان قهوه و شیرینی
fil: Counter na may mga pastry sa isang cafe
fr_ca: Comptoir d'un café garni de pâtisseries
gl: Mostrador dunha cafetaría con pastas
gu: પેસ્ટ્રી સાથે કૅફે કાઉન્ટર
he: מאפים על דלפק בבית קפה
hi: पेस्ट्री रखी कैफ़े काउंटर
hu: Kávézó pultja péksüteményekkel
hy: Թխվածքներով վաճառասեղան սրճարանում
id: Meja kafe dengan kue-kue
it: Bancone di un bar con dolci
ja: ペストリーが置かれたカフェ カウンター
ka: კაფეს დახლი საკონდიტრო ნაწარმით
km: តុគិតលុយ​នៅ​ហាងកាហ្វេដែល​មានលក់​នំធ្វើពីម្សៅ
kn: ಪೇಸ್ಟ್ರಿಗಳನ್ನು ಹೊಂದಿರುವ ಕೆಫೆ ಕೌಂಟರ್
ko: 페이스트리가 있는 카페 카운터
ky: Кафедеги таттуу азыктар коюлган текче
lo: ເຄົາເຕີໃນຄາເຟ່ທີ່ມີເຂົ້າໜົມອົບຊະນິດຕ່າງໆ
lt: Kavinės vitrina su kepiniais
lv: Kafejnīcas lete ar konditorejas izstrādājumiem
mk: Шанк во кафуле со печива
ml: പേസ്‌ട്രികൾ ലഭ്യമാക്കുന്ന കഫേയിലെ കൗണ്ടർ
mn: Гурилан бүтээгдэхүүнүүд өрсөн кафены лангуу
mr: पेस्ट्री ठेवलेला कॅफे काउंटर
ms: Kaunter kafe dengan pastri
my: ပေါင်မုန့်များဖြင့် ကော်ဖီဆိုင်ကောင်တာ
nb: Kafédisk med kaker
ne: पेस्ट्री पाइने क्याफे काउन्टर
pa: ਪੇਸਟਰੀਆਂ ਵਾਲਾ ਕੈਫ਼ੇ ਕਾਊਂਟਰ
pl: Kawiarniana lada z wypiekami
pt: Balcão de um café com itens de padaria
pt_pt: Balcão de café com bolos
ro: Tejghea de cafenea cu dulciuri
ru: Прилавок с пирожными в кафе
si: පේස්ට්‍රි ඇති කැෆේ කවුන්ටරය
sk: Kaviarenský pult s múčnikmi
sq: Banak kafeneje me ëmbëlsira
sr: Шанк у кафеу са пецивом
sr_latn: Šank u kafeu sa pecivom
sv: Kafédisk med bakverk
te: పేస్ట్రీలతో కేఫ్ కౌంటర్
th: เคาน์เตอร์ในคาเฟ่ที่มีขนมอบต่างๆ
tr: Pastalarla kafe tezgahı
uk: Прилавок кафе з кондитерськими виробами
ur: پیسٹریز کے ساتھ کیفے کاؤنٹر
uz: Pishiriqli kafe peshtaxtasi
vi: Quầy cà phê bày những chiếc bánh ngọt
zh_hk: 擺放著糕餅的咖啡店櫃檯
zu: Ikhawunta yekhefi enama-pastry

# craneEat2SemanticLabel
source: Burger
am: በርገር
ar_eg: برغر
as: বার্গাৰ
be: Бургер
bn: বার্গার
bs: Pljeskavica
ca: Hamburguesa
es_ar: Hamburguesa
eu: Hanburgesa bat
fa: همبرگر
fr_ca: Hamburger
gl: Hamburguesa
gu: બર્ગર
he: המבורגר
hi: बर्गर
hu: Hamburger
hy: Բուրգեր
it: Hamburger
ja: ハンバーガー
ka: ბურგერი
km: ប៊ឺហ្គឺ
kn: ಬರ್ಗರ್
ko: 햄버거
ky: Бургер
lo: ເບີເກີ
lt: Mėsainis
lv: Burgers
mk: Хамбургер
ml: ബർഗർ
mn: Бургер
mr: बर्गर
my: အသားညှပ်ပေါင်မုန့်
nb: Hamburger
ne: बर्गर
pa: ਬਰਗਰ
pt: Hambúrguer
pt_pt: Hambúrguer
ru: Бургер
si: බර්ගර්
sk: Hamburger
sq: Hamburger
sr: Пљескавица
sr_latn: Pljeskavica
sv: Hamburgare
te: బర్గర్
th: เบอร์เกอร์
uk: Бургер
ur: برگر
vi: Bánh mì kẹp
zh_hk: 漢堡包
zu: Ibhega
