Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSharedZAxisBeefSandwichRecipeDescription
source: Beef Sandwich recipe
af: Beesvleistoebroodjieresep
am: የበሬ ስጋ ሳንድዊች አሰራር
ar_eg: وصفة شطيرة اللحم البقري
as: গো -মাংসৰ ছেণ্ডৱিচ্চৰ ৰন্ধনবিধি
az: Mal əti sendviçi resepti
be: Рэцэпт сандвіча з ялавічынай
bn: বিফ স্যান্ডউইচের রেসিপি
bs: Recept za sendvič s govedinom
ca: Recepta d'entrepà de vedella
da: Opskrift på oksekødssandwich
es_ar: Receta de sándwich de carne de res
et: Veiselihavõileiva retsept
eu: Behiki-ogitarteko baten errezeta
fa: دستور پخت ساندویچ گوشت گاو
fil: Recipe ng Beef Sandwich
fr_ca: Recette de sandwich au bœuf
gl: Receita de sándwich de carne de vaca
gu: બીફ સૅન્ડવિચની રૅસિપિ
he: מתכון לסנדוויץ' בקר
hi: बीफ़ सैंडविच बनाने की रेसिपी
hu: Marhahúsos szendvics receptje
hy: Տավարի մսով սենդվիչի բաղադրատոմս
id: Resep Sandwich daging sapi
it: Ricetta panino con la carne
ja: ビーフ サンドイッチのレシピ
ka: საქონლის ხორცის სენდვიჩის რეცეპტი
km: រូបមន្ត​ធ្វើសាំងវិច​សាច់គោ
kn: ಬೀಫ್ ಸ್ಯಾಂಡ್‌ವಿಚ್ ರೆಸಿಪಿ
ko: 비프 샌드위치 레시피
ky: Уй этинен жасалган сэндвичтин рецепти
lo: ສູດແຊນວິດງົວ
lt: Sumuštinio su jautiena receptas
lv: Liellopu gaļas sviestmaizes recepte
mk: Рецепт за сендвич со телешко
ml: ബീഫ് സാൻഡ്‌വിച്ച് റെസിപ്പി
mn: Үхрийн махтай хачиртай талхны жор
mr: बीफ सँडविचची पाककृती
ms: Resipi Sandwic Daging
my: အမဲသား အသားညှပ်ပေါင်မုန့်လုပ်နည်း
nb: Oppskrift på smørbrød med storfekjøtt
ne: बिफ स्यान्डविच बनाउने तरिका
pa: ਬੀਫ਼ ਸੈਂਡਵਿਚ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na kanapkę z wołowiną
pt: Receita de sanduíche de carne
pt_pt: Receita de sanduíche de carne de vaca
ro: Rețetă de sandviș cu vită
ru: Рецепт бутерброда с говядиной
si: බීෆ් සැන්ඩ්විච් වට්ටෝරුව
sk: Recept na hovädzí sendvič
sq: Recetë për sandviç me mish viçi
sr: Рецепт за сендвич са говедином
sr_latn: Recept za sendvič sa govedinom
sv: Recept på biffmacka
te: బీఫ్ శాండ్విచ్ తయారీ విధానం
th: สูตรแซนด์วิชเนื้อ
tr: Etli Sandviç tarifi
uk: Рецепт сендвіча з яловичиною
ur: بیف سینڈوچ کا نسخہ
uz: Mol goʻshtli sendvich retsepti
vi: Công thức làm bánh sandwich bò
zh_hk: 牛肉三文治食譜
zu: Iresiphu yesemishi yebhifu

# demoSharedZAxisCrabPlateRecipeDescription
source: Crab plate recipe
af: Krapbordresep
am: የሸርጣን ምግብ አሰራር
ar_eg: وصفة طبق السلطعون
as: কেঁকোৰাৰ ৰন্ধনবিধি
az: Krab yeməyi resepti
be: Рэцэпт асарці з крабам
bn: কাঁকড়ার ডিশ বানানোর রেসিপি
bs: Recept za jelo od raka
ca: Recepta de plat de cranc
da: Opskrift på ret med krabbe
es_ar: Receta de bandeja de cangrejos
et: Krabitaldriku retsept
eu: Karramarro-plater baten errezeta
fa: دستور پخت بشقاب خرچنگ
fil: Recipe ng putaheng alimango
fr_ca: Recette d'assiette de crabe
gl: Receita de prato de cangrexo
gu: કરચલાની રૅસિપિ
he: מתכון לצלחת סרטנים
hi: केकड़ा बनाने की रेसिपी
hu: Ráktál receptje
hy: Խաչափառով ուտեստի բաղադրատոմս
id: Resep hidangan berbahan kepiting
it: Ricetta a base di granchio
ja: カニ料理のレシピ
ka: კიბორჩხალის რეცეპტი
km: រូបមន្តធ្វើ​ម្ហូបដែល​ធ្វើពីក្ដាម
kn: ಏಡಿ ಪ್ಲೇಟ್ ರೆಸಿಪಿ
ko: 게 요리 레시피
ky: Крабдан жасалган тамактын рецепти
lo: ສູດອາຫານປູ
lt: Krabų patiekalo receptas
lv: Krabju plates recepte
mk: Рецепт за порција рак
ml: ഞണ്ട് കറി റെസിപ്പി
mn: Хавчтай хоолны жор
mr: खेकड्याची पाककृती
ms: Resipi sepiring ketam
my: ကဏန်းဟင်းချက်နည်း
nb: Oppskrift på krabberett
ne: गँगटोको परिकार बनाउने तरिका
pa: ਕੇਕੜੇ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na kraba
pt: Receita de prato de caranguejo
pt_pt: Receita de prato de caranguejo
ro: Rețetă cu crab
ru: Рецепт блюда с крабом
si: කකුළුවන් වට්ටෝරුව
sk: Recept na krabí tanier
sq: Recetë për gatim me gaforre
sr: Рецепт за јело са раковима
sr_latn: Recept za jelo sa rakovima
sv: Recept på krabba
te: పీత ప్లేట్ తయారీ విధానం
th: สูตรอาหารจานปู
tr: Yengeç tabağı tarifi
uk: Рецепт страви з крабами
ur: کیکڑا بنانے کا نسخہ
uz: Qisqichbaqali taom retsepti
vi: Công thức làm món cua
zh_hk: 螃蟹拼盤食譜
zu: Iresiphu yepuleti lenkalankala

# demoSharedXAxisCoursePageTitle
source: Streamline your courses
af: Stroomlyn jou kursusse
am: ትምህርቶችዎን ያሳልጡ
ar_eg: تقديم دوراتك بسلاسة
as: আপোনাৰ পাঠ্যক্ৰম ষ্ট্ৰিমলাইন কৰক
az: İstiqamətlərinizi dəqiqləşdirin
be: Аптымізуйце свае кірункі
bn: আপনার কোর্স স্ট্রিমলাইন করুন
bs: Prilagodite svoje tokove
ca: Optimitza els teus cursos
da: Strømlining af dine kurser
es_ar: Optimiza los cursos
et: Muutke kursused sujuvamaks
eu: Sinplifikatu ikastaroen zerrendak
fa: خط جریان دوره‌ها
fil: I-streamline ang iyong mga kurso
fr_ca: Simplifier la gestion de vos cours
gl: Optimiza as túas accións
gu: તમારા કોર્સને સુવ્યવસ્થિત કરો
he: לפשט את הקורסים שלכם
hi: अपने कोर्स प्रबंधित करें
hu: A kurzusok észszerűsítése
hy: Կանոնակարգեք ձեր դասընթացները
id: Mempersingkat kursus Anda
it: Ottimizza i corsi
ja: コースの合理化
ka: მოახდინეთ თქვენი კურსების ოპტიმიზაცია
km: រៀបចំវគ្គ​សិក្សារបស់អ្នក​ឱ្យប្រសើរឡើង
kn: ನಿಮ್ಮ ಕೋರ್ಸ್‌ಗಳನ್ನು ಸುಗಮಗೊಳಿಸಿ
ko: 과정 간소화
ky: Курстарыңызды жөнөкөйлөтүңүз
lo: ເພີ່ມປະສິດທິພາບຫຼັກສູດຂອງທ່ານ
lt: Supaprastinti kursai
lv: Kursu efektivitātes uzlabošana
mk: Насочете ги вашите курсеви
ml: നിങ്ങളുടെ മുന്നോട്ട് പോകലിന് രൂപം നൽകൂ
mn: Курсээ оновчтой болгох
mr: तुमचे कोर्स सुलभ करा
ms: Selaraskan kursus anda
my: သင်၏သင်တန်းများ စနစ်တကျ ရှိပါစေ
nb: Effektiviser kursene dine
ne: आफ्ना कोर्सहरू सुव्यवस्थित बनाउनुहोस्
pa: ਆਪਣੇ ਕੋਰਸਾਂ ਨੂੰ ਆਸਾਨ ਬਣਾਓ
pl: Usprawnij swoje kursy
pt: Simplificar seus cursos
pt_pt: Otimize os seus cursos
ro: Optimizați traiectoriile
ru: Упорядочите курсы
si: ඔබේ පාඨමාලා ක්‍රමවත් කරන්න
sk: Zjednodušte svoje kurzy
sq: Përmirëso kurset e tua
sr: Побољшајте организацију курсева
sr_latn: Poboljšajte organizaciju kurseva
sv: Skräddarsy dina kurser
te: మీ కోర్సులను క్రమబద్ధీకరించండి
th: ปรับปรุงหลักสูตรของคุณให้มีประสิทธิภาพ
tr: Kurslarınızı düzenleme
uk: Оптимізуйте свої курси
ur: اپنے کورسز کو اسٹریم لائن کریں
uz: Kurslarni tartiblang
vi: Tinh giản các khóa học
zh_hk: 精簡課程
zu: Yenza umugqa oqondile izifundo zakho

# demoSharedZAxisCrabPlateRecipeTitle
source: Crab
af: Krap
am: ሸርጣን
ar_eg: سلطعون
as: কেঁকোৰা
az: Krab
be: Краб
bn: কাঁকড়া
bs: Rak
ca: Cranc
da: Krabbe
es_ar: Cangrejo
et: Krabi
eu: Karramarroa
fa: خرچنگ
fil: Alimango
fr_ca: Crabe
gl: Cangrexo
gu: કરચલા
he: סרטן
hi: केकड़ा
hu: Rák
hy: Խաչափառ
id: Kepiting
it: Granchio
ja: カニ
ka: კიბორჩხალა
km: ក្ដាម
kn: ಏಡಿ
ko: 게
ky: Краб
lo: ກະປູ
lt: Krabas
lv: Krabji
mk: Рак
ml: ഞണ്ട്
mn: Хавч
mr: खेकडा
ms: Ketam
my: ကဏန်း
nb: Krabbe
ne: गँगटो
pa: ਕੇਕੜਾ
pl: Krab
pt: Caranguejo
pt_pt: Caranguejo
ru: Краб
si: කකුළුවා
sk: Krab
sq: Gaforre
sr: Рак
sr_latn: Rak
sv: Krabba
te: పీత
th: ปู
tr: Yengeç
uk: Краб
ur: کیکڑا
uz: Qisqichbaqa
vi: Cua
zh_hk: 螃蟹
zu: Inkalankala

# demoSharedZAxisShrimpPlateRecipeDescription
source: Shrimp plate recipe
af: Garnaalbordresep
am: የሽሪምፕ ምግብ አሰራር
ar_eg: وصفة طبق الروبيان
as: মিছামাছৰ ৰন্ধনবিধি
az: Krevet yeməyi resepti
be: Рэцэпт асарці з крэветкамі
bn: চিংড়ি মাছের ডিশ বানানোর রেসিপি
bs: Recept za jelo od škampa
ca: Recepta de plat de gambes
da: Opskrift på ret med rejer
es_ar: Receta de bandeja de camarones
et: Krevetitaldriku retsept
eu: Izkira-plater baten errezeta
fa: دستور پخت بشقاب میگو
fil: Recipe ng putaheng hipon
fr_ca: Recette d'assiette de crevettes
gl: Receita de prato de camarón
gu: ઝીંગાની રૅસિપિ
he: מתכון לצלחת חסילונים
hi: झींगा बनाने की रेसिपी
hu: Garnélatál receptje
hy: Ծովախեցգետնով ուտեստի բաղադրատոմս
id: Resep hidangan berbahan udang
it: Ricetta a base di gamberi
ja: エビ料理のレシピ
ka: კრევეტის რეცეპტი
km: រូបមន្តធ្វើ​ម្ហូបដែល​ធ្វើពី​បង្គា
kn: ಸೀಗಡಿ ಪ್ಲೇಟ್ ರೆಸಿಪಿ
ko: 새우 요리 레시피
ky: Креветкадан жасалган тамактын рецепти
lo: ສູດອາຫານກຸ້ງ
lt: Krevečių patiekalo receptas
lv: Garneļu plates recepte
mk: Рецепт за порција ракчиња
ml: ചെമ്മീൻ കറി റെസിപ്പി
mn: Сам хорхойтой хоолны жор
mr: कोळंबीची पाककृती
ms: Resipi sepiring udang
my: ပုစွန်ဟင်းချက်နည်း
nb: Oppskrift på rekerett
ne: झिँगे माछाको परिकार बनाउने तरिका
pa: ਝੀਂਗਾ ਮੱਛੀ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na krewetki
pt: Receita de prato de camarão
pt_pt: Receita de prato de camarão
ro: Rețetă cu creveți
ru: Рецепт блюда с креветками
si: කූනිස්සන් වට්ටෝරුව
sk: Recept na krevetový tanier
sq: Recetë për gatim me karkaleca deti
sr: Рецепт за јело са шкампима
sr_latn: Recept za jelo sa škampima
sv: Recept på räktallrik
te: ష్రింప్ ప్లేట్ తయారీ విధానం
th: สูตรอาหารจานกุ้ง
tr: Karides tabağı tarifi
uk: Рецепт страви з креветками
ur: جھینگا بنانے کا نسخہ
uz: Krevetkali taom retsepti
vi: Công thức làm món tôm
zh_hk: 鮮蝦拼盤食譜
zu: Iresiphu yepuleti le-shrimp

# demoSharedZAxisShrimpPlateRecipeTitle
source: Shrimp
af: Garnaal
am: ሽሪምፕ
ar_eg: روبيان
as: মিছামাছ
az: Krevet
be: Крэветкі
bn: চিংড়ি মাছ
bs: Škampi
ca: Gamba
da: Rejer
es_ar: Camarón
et: Krevetid
eu: Izkira
fa: میگو
fil: Hipon
fr_ca: Crevettes
gl: Camarón
gu: ઝીંગા
he: חסילון
hi: झींगा
hu: Garnélarák
hy: Ծովախեցգետին
id: Udang
it: Gambero
ja: エビ
ka: კრევეტი
km: បង្គា
kn: ಸೀಗಡಿ
ko: 새우
ky: Креветка
lo: ກຸ້ງ
lt: Krevetė
lv: Garneles
mk: Ракчиња
ml: ചെമ്മീൻ
mn: Сам хорхой
mr: कोळंबी
ms: Udang
my: ပုစွန်
nb: Reke
ne: झिँगे माछा
pa: ਝੀਂਗਾ ਮੱਛੀ
pl: Krewetka
pt: Camarão
pt_pt: Camarão
ro: Creveți
ru: Креветка
si: කූනිස්සා
sk: Kreveta
sq: Karkaleca deti
sr: Шкамп
sr_latn: Škamp
sv: Räkor
te: ష్రింప్
th: กุ้ง
tr: Karides
uk: Креветка
ur: جھینگا
uz: Krevetka
vi: Tôm
zh_hk: 蝦
zu: I-Shrimp

# demoContainerTransformTypeFadeThrough
source: FADE THROUGH
af: DEURDOOF
am: በዚህ በኩል አደብዝዝ፦
ar_eg: التلاشي التدريجي
as: ফে’ড থ্ৰু
az: TƏDRİCƏN SOLĞUNLAŞMA
be: ПАСТУПОВАЕ ЗМЯНЕННЕ
bn: বরাবর অস্পষ্ট
bs: IŠČEZAVANJE S PRIJELAZOM
ca: ESVAÏMENT
da: FORTONING
es_ar: ATENUACIÓN RÁPIDA
et: LÄBIHAJUTUS
eu: AGERTZEA ETA DESAGERTZEA
fa: محو کردن گسترده
fr_ca: ATTÉNUATION GRADUELLE
gl: ESVAECER
gu: ફેડ થ્રૂ
he: להפוך לשקוף בהדרגה
hi: फ़ेड थ्रू
hu: ÁTTŰNÉS
hy: ՍԱՀՈՒՆ ԱՆՑՈՒՄ
id: MEMUDAR
it: DISSOLVENZA TRAMITE
ja: フェードスルー
ka: ჩაბნელება
km: លេចឡើង​ពីក្នុង
kn: ಫೇಡ್ ಥ್ರೂ
ko: 페이드 스루
ky: ОРТОСУНАН БАШТАП БОЗОРУУ
lo: ຈາງຫາຍ
lt: IŠBLUKIMAS
lv: PAKĀPENISKA IZZUŠANA UN PARĀDĪŠANĀS
mk: ИЗБЛЕДУВАЊЕ НИЗ СИТЕ
ml: ഫേഡ് ത്രൂ
mn: НЭВТ УУСАХ
mr: फेड थ्रू
ms: LENYAP
my: မှိန်သွားသည်
nb: TON GJENNOM
ne: फेड थ्रु
pa: ਫੇਡ ਥਰੂ
pl: PRZENIKANIE
pt: ESMAECER
pt_pt: DESVANECIMENTO
ro: ÎNLOCUIRE GRADATĂ
ru: ПЛАВНОЕ ПЕРЕКЛЮЧЕНИЕ
si: මැකී යාම
sk: POSTUPNÉ MIZNUTIE
sq: ZBEHJE GRADUALE
sr: ПОСТЕПЕНИ ПРЕЛАЗ
sr_latn: POSTEPENI PRELAZ
sv: TONA GENOM
te: ఫేడ్ త్రూ
th: จางผ่าน
tr: ŞEFFAFLAŞARAK GEÇİŞ
uk: ПЕРЕХІД ЗІ ЗНИКНЕННЯМ
ur: فیڈ تھرو
uz: SHAFFOF ALMASHINUV
vi: CHUYỂN MỜ
zh_hk: 交匯淡出
zu: FIPHALA UDLULELE

# demoSharedZAxisDessertRecipeTitle
source: Dessert
af: Nagereg
am: ጣፋጭ ምግብ
ar_eg: حلويات
as: ডির্জাট
az: Desert
be: Дэсерт
bn: ডেজার্ট
bs: Desert
ca: Postres
es_ar: Postre
et: Magustoit
eu: Postrea
fa: دسر
fil: Panghimagas
gl: Sobremesa
gu: ડેઝર્ટ
he: קינוח
hi: मिठाई
hu: Desszert
hy: Աղանդեր
id: Hidangan penutup
ja: デザート
ka: დესერტი
km: បង្អែម
kn: ಡೆಸರ್ಟ್
ko: 디저트
ky: Десерт
lo: ຂອງຫວານ
lt: Desertas
lv: Deserts
mk: Десерт
ml: ഡെസെർട്ട്
mn: Амттан
mr: डेझर्ट
ms: Pencuci mulut
my: အချိုပွဲ
ne: डेजर्ट
pa: ਮਿਠਿਆਈ
pl: Deser
pt: Sobremesa
pt_pt: Sobremesa
ro: Desert
ru: Десерт
si: අතුරුපස
sk: Dezert
sq: Ëmbëlsirë
sr: Дезерт
sr_latn: Dezert
sv: Efterrätt
te: డెజర్ట్
th: ของหวาน
tr: Tatlı
uk: Десерт
ur: میٹھا
uz: Desert
vi: Món tráng miệng
zh_hk: 甜品
zu: I-Dessert

# demoSharedZAxisSandwichRecipeDescription
source: Sandwich recipe
af: Toebroodjieresep
am: የበርገር አሰራር
ar_eg: وصفة الشطيرة
as: ছেণ্ডৱিচ্চৰ ৰন্ধনবিধি
az: Sendviç resepti
be: Рэцэпт сандвіча
bn: স্যান্ডউইচের রেসিপি
bs: Recept za sendvič
ca: Recepta d'entrepà
da: Opskrift på sandwich
es_ar: Receta de sándwich
et: Võileivaretsept
eu: Ogitarteko baten errezeta
fa: دستور تهیه ساندویچ
fil: Recipe ng sandwich
fr_ca: Recette de sandwich
gl: Receita de sándwich
gu: સૅન્ડવિચની રૅસિપિ
he: מתכון לסנדוויץ'
hi: सैंडविच बनाने की रेसिपी
hu: Szendvicsrecept
hy: Սենդվիչի բաղադրատոմս
id: Resep sandwich
it: Ricetta panino
ja: サンドイッチのレシピ
ka: სენდვიჩის რეცეპტი
km: រូបមន្ត​ធ្វើសាំងវិច
kn: ಸ್ಯಾಂಡ್‌ವಿಚ್ ರೆಸಿಪಿ
ko: 샌드위치 레시피
ky: Сэндвичтин рецепти
lo: ສູດແຊນວິດ
lt: Sumuštinio receptas
lv: Sviestmaizes recepte
mk: Рецепт за сендвич
ml: സാൻഡ്‌വിച്ച് റെസിപ്പി
mn: Хачиртай талхны жор
mr: सँडविचची पाककृती
ms: Resipi sandwic
my: အသားညှပ်ပေါင်မုန့်လုပ်နည်း
nb: Smørbrødoppskrift
ne: स्यान्डविच बनाउने तरिका
pa: ਸੈਂਡਵਿਚ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na kanapkę
pt: Receita de sanduíche
pt_pt: Receita de sanduíche
ro: Rețetă de sandviș
ru: Рецепт бутерброда
si: සැන්ඩ්විච් වට්ටෝරුව
sk: Recept na sendvič
sq: Recetë për sandviç
sr: Рецепт за сендвич
sr_latn: Recept za sendvič
sv: Recept på dubbelmacka
te: శాండ్విచ్ తయారీ విధానం
th: สูตรแซนด์วิช
tr: Sandviç tarifi
uk: Рецепт сендвіча
ur: سینڈوچ کا نسخہ
uz: Sendvich retsepti
vi: Công thức làm bánh sandwich
zh_hk: 三文治食譜
zu: Iresiphi yesemishi

# demoSharedZAxisSandwichRecipeTitle
source: Sandwich
af: Toebroodjie
am: ሳንድዊች
ar_eg: شطيرة
as: ছেণ্ডৱিচ্চ
az: Sendviç
be: Сандвіч
bn: স্যান্ডউইচ
bs: Sendvič
ca: Entrepà
es_ar: Sándwich
et: Võileib
eu: Ogitartekoa
fa: ساندویچ
gl: Sándwich
gu: સૅન્ડવિચ
he: סנדוויץ'
hi: सैंडविच
hu: Szendvics
hy: Սենդվիչ
it: Panino
ja: サンドイッチ
ka: სენდვიჩი
km: សាំងវិច
kn: ಸ್ಯಾಂಡ್‌ವಿಚ್
ko: 샌드위치
ky: Сэндвич
lo: ແຊນວິດ
lt: Sumuštinis
lv: Sviestmaize
mk: Сендвич
ml: സാൻഡ്‌വിച്ച്
mn: Хачиртай талх
mr: सँडविच
ms: Sandwic
my: အသားညှပ်ပေါင်မုန့်
nb: Smørbrød
ne: स्यान्डविच
pa: ਸੈਂਡਵਿਚ
pl: Kanapka
pt: Sanduíche
pt_pt: Sanduíche
ro: Sandviș
ru: Бутерброд
si: සැන්ඩ්විච්
sk: Sendvič
sq: Sandviç
sr: Сендвич
sr_latn: Sendvič
sv: Dubbelmacka
te: శాండ్విచ్
th: แซนด์วิช
tr: Sandviç
uk: Сендвіч
ur: سینڈوچ
uz: Sendvich
vi: Bánh sandwich
zh_hk: 三文治
zu: Isemishi

# demoSharedZAxisBurgerRecipeDescription
source: Burger recipe
af: Burgerresep
am: የበርገር አሰራር
ar_eg: وصفة البرغر
as: বার্গাৰৰ ৰন্ধনবিধি
az: Burger resepti
be: Рэцэпт бургера
bn: বার্গারের রেসিপি
bs: Recept za pljeskavicu
ca: Recepta d'hamburguesa
da: Opskrift på burger
es_ar: Receta de hamburguesa
et: Burgeriretsept
eu: Hanburgesa baten errezeta
fa: دستور پخت همبرگر
fil: Recipe ng burger
fr_ca: Recette de hamburger
gl: Receita de hamburguesa
gu: બર્ગરની રૅસિપિ
he: מתכון להמבורגר
hi: बर्गर बनाने की रेसिपी
hu: Hamburgerrecept
hy: Բուրգերի բաղադրատոմս
id: Resep burger
it: Ricetta hamburger
ja: ハンバーガーのレシピ
ka: ბურგერის რეცეპტი
km: រូបមន្ត​ធ្វើប៊ឺហ្គឺ
kn: ಬರ್ಗರ್ ರೆಸಿಪಿ
ko: 햄버거 레시피
ky: Бургердин рецепти
lo: ສູດເບີເກີ
lt: Mėsainio receptas
lv: Burgera recepte
mk: Рецепт за хамбургер
ml: ബർഗർ റെസിപ്പി
mn: Бургерын жор
mr: बर्गरची पाककृती
ms: Resipi burger
my: ဘာဂါလုပ်နည်း
nb: Hamburgeroppskrift
ne: बर्गर बनाउने तरिका
pa: ਬਰਗਰ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na burgera
pt: Receita de hambúrguer
pt_pt: Receita de hambúrguer
ro: Rețetă de burger
ru: Рецепт бургера
si: බර්ගර් වට්ටෝරුව
sk: Recept na hamburger
sq: Recetë për hamburger
sr: Рецепт за пљескавицу
sr_latn: Recept za pljeskavicu
sv: Recept på hamburgare
te: బర్గర్ తయారీ విధానం
th: สูตรเบอร์เกอร์
tr: Burger tarifi
uk: Рецепт бургера
ur: برگر کا نسخہ
uz: Burger retsepti
vi: Công thức làm bánh mì kẹp
zh_hk: 漢堡包食譜
zu: Iresiphi yebhega

# demoSharedZAxisBurgerRecipeTitle
source: Burger
am: በርገር
ar_eg: برغر
as: বার্গাৰ
be: Бургер
bn: বার্গার
bs: Pljeskavica
ca: Hamburguesa
es_ar: Hamburguesa
eu: Hanburgesa
fa: همبرگر
fr_ca: Hamburger
gl: Hamburguesa
gu: બર્ગર
he: המבורגר
hi: बर्गर
hu: Hamburger
hy: Բուրգեր
it: Hamburger
ja: ハンバーガー
ka: ბურგერი
km: ប៊ឺហ្គឺ
kn: ಬರ್ಗರ್
ko: 햄버거
ky: Бургер
lo: ເບີເກີ
lt: Mėsainis
lv: Burgers
mk: Хамбургер
ml: ബർഗർ
mn: Бургер
mr: बर्गर
my: ဘာဂါ
nb: Hamburger
ne: बर्गर
pa: ਬਰਗਰ
pt: Hambúrguer
pt_pt: Hambúrguer
ru: Бургер
si: බර්ගර්
sk: Hamburger
sq: Hamburger
sr: Пљескавица
sr_latn: Pljeskavica
sv: Hamburgare
te: బర్గర్
th: เบอร์เกอร์
uk: Бургер
ur: برگر
vi: Bánh mì kẹp
zh_hk: 漢堡包
zu: Ibhega

# demoSharedZAxisSettingsPageTitle
source: Settings
af: Instellings
am: ቅንብሮች
ar_eg: الإعدادات
as: ছেটিংসমূহ
az: Ayarlar
be: Налады
bn: সেটিংস
bs: Postavke
ca: Configuració
da: Indstillinger
es_ar: Configuración
et: Seaded
eu: Ezarpenak
fa: تنظیمات
fil: Mga Setting
fr_ca: Paramètres
gl: Configuración
gu: સેટિંગ
he: הגדרות
hi: सेटिंग
hu: Beállítás
hy: Կարգավորումներ
id: Setelan
it: Impostazioni
ja: 設定
ka: პარამეტრები
km: ការកំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 설정
ky: Параметрлер
lo: ການຕັ້ງຄ່າ
lt: Nustatymai
lv: Iestatījumi
mk: Поставки
ml: ക്രമീകരണം
mn: Тохиргоо
mr: सेटिंग्ज
ms: Tetapan
my: ဆက်တင်များ
nb: Innstillinger
ne: सेटिङ
pa: ਸੈਟਿੰਗਾਂ
pl: Ustawienia
pt: Configurações
pt_pt: Definições
ro: Setări
ru: Настройки
si: සැකසීම්
sk: Nastavenia
sq: Cilësimet
sr: Подешавања
sr_latn: Podešavanja
sv: Inställningar
te: సెట్టింగ్‌లు
th: การตั้งค่า
tr: Ayarlar
uk: Налаштування
ur: ترتیبات
uz: Sozlamalar
vi: Cài đặt
zh_hk: 設定
zu: Amasethingi

# demoSharedZAxisTitle
source: Shared z-axis
af: Gedeelde z-as
am: የተጋራ z-ዘንግ
ar_eg: محور "ع" المشترك
as: শ্বেয়াৰ কৰা z অক্ষ
az: Paylaşılan z oxu
be: Абагуленая вось z
bn: শেয়ার করা z-অ্যাক্সিস
bs: Dijeljena z osa
ca: Eix Z compartit
da: Delt z-akse
es_ar: Eje Z compartido
et: Jagatud Z-telg
eu: Partekatutako Z ardatza
fa: محور z مشترک
fil: Nakabahaging z-axis
fr_ca: Axe z partagé
gl: Eixe z compartido
gu: શેર કરેલા z-અક્ષ
he: ציר z משותף
hi: शेयर्ड ज़ेड-ऐक्सिस
hu: Megosztott z tengely
hy: Ընդհանուր Z առանցք
id: Sumbu z merata
it: Asse z condiviso
ja: z 軸共有
ka: საზიარო z-ღერძი
km: អ័ក្ស z រួម
kn: ಹಂಚಿದ z-ಅಕ್ಷ
ko: 공유된 z축
ky: Бөлүшүлгөн z-огу
lo: ແກນ z ທີ່ແບ່ງປັນ
lt: Bendrinama z ašis
lv: Kopīga z ass
mk: Споделена z-оска
ml: z-അക്ഷം പങ്കിട്ടു
mn: Хуваалцсан z-тэнхлэг
mr: शेअर केलेला z अक्ष
ms: Paksi z dikongsi
my: မျှဝေထားသော z ဝင်ရိုး
nb: Delt Z-akse
ne: साझा जेड-एक्सिस
pa: ਸਾਂਝਾ ਕੀਤਾ z-ਧੁਰਾ
pl: Wspólna oś z
pt: Eixo z compartilhado
pt_pt: Eixo z partilhado
ro: Axa z comună
ru: Общая ось Z
si: බෙදා ගත් z-අක්ෂය
sk: Zdieľaná os z
sq: Boshti z i ndarë
sr: Заједничка Z оса
sr_latn: Zajednička Z osa
sv: Delad z-axel
te: షేర్‌డ్ z-ఆక్సిస్
th: แกน Z ที่ใช้ร่วมกัน
tr: Paylaşılan z ekseni
uk: Спільна вісь Z
ur: مشترکہ z-axis
uz: Umumiy Z oʻqi
vi: Trục z chung
zh_hk: 共用 Z 軸
zu: I-z-axis eyabiwe

# demoSharedZAxisPrivacySettingLabel
source: Privacy
af: Privaatheid
am: ግላዊነት
ar_eg: الخصوصية
as: গোপনীয়তা
az: Məxfilik
be: Прыватнасць
bn: গোপনীয়তা
bs: Privatnost
ca: Privadesa
da: Privatliv
es_ar: Privacidad
et: Privaatsus
eu: Pribatutasuna
fa: حریم خصوصی
fr_ca: Confidentialité
gl: Privacidade
gu: પ્રાઇવસી
he: פרטיות
hi: निजता
hu: Adatvédelem
hy: Գաղտնիություն
id: Privasi
ja: プライバシー
ka: კონფიდენციალურობა
km: ឯកជនភាព
kn: ಗೌಪ್ಯತೆ
ko: 개인정보 보호
ky: Купуялык
lo: ຄວາມເປັນສ່ວນຕົວ
lt: Privatumas
lv: Konfidencialitāte
mk: Приватност
ml: സ്വകാര്യത
mn: Нууцлал
mr: गोपनीयता
ms: Privasi
my: ကန့်သတ်ဆက်တင်
nb: Personvern
ne: गोपनीयता
pa: ਪਰਦੇਦਾਰੀ
pl: Prywatność
pt: Privacidade
pt_pt: Privacidade
ro: Confidențialitate
ru: Конфиденциальность
si: රහස්‍යතාව
sk: Ochrana súkromia
sq: Privatësia
sr: Приватност
sr_latn: Privatnost
sv: Integritet
te: గోప్యత
th: ความเป็นส่วนตัว
tr: Gizlilik
uk: Конфіденційність
ur: رازداری
uz: Maxfiylik
vi: Quyền riêng tư
zh_hk: 私隱
zu: Ubumfihlo

# demoMotionTitle
source: Motion
af: Beweging
am: እንቅስቃሴ
ar_eg: الحركة
as: গতি
az: Hərəkət
be: Рух
bn: মোশন
bs: Pokret
ca: Moviment
da: Bevægelse
es_ar: Movimiento
et: Liikumine
eu: Mugimendua
fa: حرکت
fil: Paggalaw
fr_ca: Mouvement
gl: Movemento
gu: મોશન
he: צילום תנועה
hi: मोशन
hu: Mozgás
hy: Շարժում
id: Gerakan
it: Movimento
ja: モーション
ka: მოძრაობა
km: ចលនា
kn: ಮೋಷನ್
ko: 모션
ky: Кыймыл
lo: ໂມຊັນ
lt: Judėjimas
lv: Kustība
mk: Движење
ml: ചലനാത്മകത
mn: Хөдөлгөөнт
mr: मोशन
ms: Gerakan
nb: Bevegelse
ne: मोसन
pa: ਗਤੀਸ਼ੀਲਤਾ
pl: Animacja
pt: Movimento
pt_pt: Movimento
ro: Animație
ru: Движение
si: චලනය
sk: Pohyb
sq: Lëvizja
sr: Покрет
sr_latn: Pokret
sv: Rörelse
te: చలనం
th: การเคลื่อนไหว
tr: Hareket
uk: Анімація
ur: موشَن
uz: Harakat
vi: Chuyển động
zh_hk: 動態

# demoContainerTransformTitle
source: Container Transform
af: Houeromskepping
am: መያዣን መቀየር
ar_eg: تحويل الحاوية
as: কন্টেইনাৰৰ ৰূপান্তৰণ
az: Konteyner Transformasiyası
be: Пераўтварэнне кантэйнера
bn: কন্টেনার পরিবর্তন করা
bs: Transformiranje spremnika
ca: Transformació de contenidors
da: Containeromdannelse
es_ar: Transformación de contenedores
et: Konteineri üleminek
eu: Edukiontzien itxuraldaketa
fa: تبدیل محتوی
fil: Pag-iiba ng Anyo ng Container
fr_ca: Transformation de conteneur
gl: Transformación de contedores
gu: કન્ટેનર ટ્રાંસ્ફોર્મ
he: טרנספורמציה של קונטיינר
hi: कंटेनर ट्रांसफ़ॉर्म
hu: Tároló átalakulása
hy: Զետեղարանի փոխակերպում
id: Transformasi Container
it: Trasformazione del contenitore
ja: コンテナ変換
ka: კონტეინერის გარდაქმნა
km: ការប្រែក្លាយ​ទម្រង់ផ្ទុក
kn: ಕಂಟೈನರ್ ಪರಿವರ್ತನೆ
ko: 컨테이너 변환
ky: Контейнерди трансформациялоо
lo: ການປ່ຽນກ່ອງບັນຈຸ
lt: Sudėtinio rodinio transformavimas
lv: Konteinera pārveidošana
mk: Трансформирање контејнер
ml: കണ്ടെയ്‌നർ ട്രാൻസ്ഫോം
mn: Контейнерын хэлбэр өөрчлөх
mr: कंटेनर ट्रान्सफॉर्म
ms: Pengubahan Bekas
my: ကွန်တိန်နာ အသွင်ပြောင်းရန်
nb: Forvandling av beholder
ne: कन्टेनर ट्रान्सफर्म
pa: ਕੰਟੇਨਰ ਰੁਪਾਂਤਰਣ
pl: Przekształcenie kontenera
pt: Transformação de contêiner
pt_pt: Transformação do contentor
ro: Transformarea containerului
ru: Преобразование с контейнером
si: බහාලුම් පරිණාමනය
sk: Transformácia kontajnera
sq: Transformimi i kontejnerit
sr: Трансформисање контејнера
sr_latn: Transformisanje kontejnera
sv: Behållartransformering
te: కంటైనర్ పరివర్తన
th: เปลี่ยนรูปแบบคอนเทนเนอร์
tr: Kapsayıcı Dönüşümü
uk: Перетворення контейнера
ur: کنٹینر ٹرانسفارم
uz: Konteyner bilan oʻzgartirish
vi: Biến đổi vùng chứa
zh_hk: 容器變形
zu: Ukuguqulwa Kwesiqukathi
