Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# shrineLoginUsernameLabel
source: Username
af: Gebruikernaam
am: የተጠቃሚ ስም
ar_eg: اسم المستخدم
as: ব্যৱহাৰকাৰীৰ নাম
az: İstifadəçi adı
be: Імя карыстальніка
bn: ইউজারনেম
bs: Korisničko ime
ca: Nom d'usuari
da: Brugernavn
es_ar: Nombre de usuario
et: Kasutajanimi
eu: Erabiltzaile-izena
fa: نام کاربری
fr_ca: Nom d'utilisateur
gl: Nome de usuario
gu: વપરાશકર્તાનું નામ
he: שם משתמש
hi: उपयोगकर्ता नाम
hu: Felhasználónév
hy: Օգտանուն
id: Nama pengguna
it: Nome utente
ja: ユーザー名
ka: მომხმარებლის სახელი
km: ឈ្មោះអ្នក​ប្រើប្រាស់
kn: ಬಳಕೆದಾರರ ಹೆಸರು
ko: 사용자 이름
ky: Колдонуучунун аты
lo: ຊື່ຜູ້ໃຊ້
lt: Naudotojo vardas
lv: Lietotājvārds
mk: Корисничко име
ml: ഉപയോക്തൃനാമം
mn: Хэрэглэгчийн нэр
mr: वापरकर्ता नाव
ms: Nama Pengguna
my: အသုံးပြုသူအမည်
nb: Brukernavn
ne: युजरनेम
pa: ਵਰਤੋਂਕਾਰ ਨਾਮ
pl: Nazwa użytkownika
pt: Nome de usuário
pt_pt: Nome de utilizador
ro: Nume de utilizator
ru: Имя пользователя
si: පරිශීලක නම
sk: Používateľské meno
sq: Emri i përdoruesit
sr: Корисничко име
sr_latn: Korisničko ime
sv: Användarnamn
te: వినియోగదారు పేరు
th: ชื่อผู้ใช้
tr: Kullanıcı adı
uk: Ім'я користувача
ur: صارف نام
uz: Foydalanuvchi nomi
vi: Tên người dùng
zh_hk: 使用者名稱
zu: Igama lomsebenzisi

# shrineLoginPasswordLabel
source: Password
af: Wagwoord
am: የይለፍ ቃል
ar_eg: كلمة المرور
as: পাছৱৰ্ড
az: Parol
be: Пароль
bn: পাসওয়ার্ড
bs: Lozinka
ca: Contrasenya
da: Adgangskode
es_ar: Contraseña
et: Parool
eu: Pasahitza
fa: گذرواژه
fr_ca: Mot de passe
gl: Contrasinal
gu: પાસવર્ડ
he: סיסמה
hi: पासवर्ड
hu: Jelszó
hy: Գաղտնաբառ
id: Sandi
ja: パスワード
ka: პაროლი
km: ពាក្យសម្ងាត់
kn: ಪಾಸ್‌ವರ್ಡ್
ko: 비밀번호
ky: Сырсөз
lo: ລະຫັດຜ່ານ
lt: Slaptažodis
lv: Parole
mk: Лозинка
ml: പാസ്‌വേഡ്
mn: Нууц үг
mr: पासवर्ड
ms: Kata laluan
my: စကားဝှက်
nb: Passord
ne: पासवर्ड
pa: ਪਾਸਵਰਡ
pl: Hasło
pt: Senha
pt_pt: Palavra-passe
ro: Parolă
ru: Пароль
si: මුරපදය
sk: Heslo
sq: Fjalëkalimi
sr: Лозинка
sr_latn: Lozinka
sv: Lösenord
te: పాస్‌వర్డ్
th: รหัสผ่าน
tr: Şifre
uk: Пароль
ur: پاس ورڈ
uz: Parol
vi: Mật khẩu
zh_hk: 密碼
zu: Iphasiwedi

# shrineCancelButtonCaption
source: CANCEL
af: KANSELLEER
am: ይቅር
ar_eg: إلغاء
as: বাতিল কৰক
az: LƏĞV EDİN
be: СКАСАВАЦЬ
bn: বাতিল করুন
bs: OTKAŽI
ca: CANCEL·LA
da: ANNULLER
es_ar: CANCELAR
et: TÜHISTA
eu: UTZI
fa: لغو
fil: KANSELAHIN
fr_ca: ANNULER
gl: CANCELAR
gu: રદ કરો
he: ביטול
hi: अभी नहीं
hu: MÉGSE
hy: ՉԵՂԱՐԿԵԼ
id: BATAL
it: ANNULLA
ja: キャンセル
ka: გაუქმება
km: បោះបង់
kn: ರದ್ದುಗೊಳಿಸಿ
ko: 취소
ky: ЖОККО ЧЫГАРУУ
lo: ຍົກເລີກ
lt: ATŠAUKTI
lv: ATCELT
mk: ОТКАЖИ
ml: റദ്ദാക്കുക
mn: ЦУЦЛАХ
mr: रद्द करा
ms: BATAL
my: မလုပ်တော့
nb: AVBRYT
ne: रद्द गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: ANULUJ
pt: CANCELAR
pt_pt: CANCELAR
ro: ANULAȚI
ru: ОТМЕНА
si: අවලංගු කරන්න
sk: ZRUŠIŤ
sq: ANULO
sr: ОТКАЖИ
sr_latn: OTKAŽI
sv: AVBRYT
te: రద్దు చేయండి
th: ยกเลิก
tr: İPTAL
uk: СКАСУВАТИ
ur: منسوخ کریں
uz: BEKOR QILISH
vi: HỦY
zh_hk: 取消
zu: KHANSELA

# shrineCartTaxCaption
source: Tax:
af: Belasting:
am: ግብር፦
ar_eg: الضريبة:
as: কৰ:
az: Vergi:
be: Падатак:
bn: ট্যাক্স:
bs: Porez:
ca: Impostos:
da: Afgifter:
es_ar: Impuesto:
et: Maks:
eu: Zerga:
fa: مالیات:
fil: Buwis:
fr_ca: Taxes :
gl: Impostos:
gu: કર:
he: מס:
hi: टैक्स:
hu: Adó:
hy: Հարկ՝
id: Pajak:
it: Imposte:
ja: 税金:
ka: გადასახადი:
km: ពន្ធ៖
kn: ತೆರಿಗೆ:
ko: 세금:
ky: Салык:
lo: ພາສີ:
lt: Mokestis:
lv: Nodoklis:
mk: Данок:
ml: നികുതി:
mn: Татвар:
mr: कर:
ms: Cukai:
my: အခွန်-
nb: Avgifter:
ne: कर:
pa: ਟੈਕਸ:
pl: Podatek:
pt: Tributos:
pt_pt: Imposto:
ro: Taxe:
ru: Налог:
si: බදු:
sk: Daň:
sq: Taksa:
sr: Порез:
sr_latn: Porez:
sv: Skatt:
te: పన్ను:
th: ภาษี:
tr: Vergi:
uk: Податок:
ur: ٹیکس:
uz: Soliq:
vi: Thuế:
zh_hk: 稅項：
zu: Intela:

# shrineCartPageCaption
source: CART
af: MANDJIE
am: ጋሪ
ar_eg: سلة التسوّق
as: কাৰ্ট
az: SƏBƏT
be: КОШЫК
bn: কার্ট
bs: KORPA
ca: CARRETÓ
da: KURV
es_ar: CARRITO
et: OSTUKORV
eu: SASKIA
fa: سبد خرید
fr_ca: PANIER
gl: CESTA
gu: કાર્ટ
he: עגלת קניות
hi: कार्ट
hu: KOSÁR
hy: ԶԱՄԲՅՈՒՂ
id: KERANJANG
it: CARRELLO
ja: カート
ka: კალათა
km: រទេះ
kn: ಕಾರ್ಟ್
ko: 장바구니
ky: АРАБА
lo: ກະຕ່າ
lt: KREPŠELIS
lv: GROZS
mk: КОШНИЧКА
ml: കാർട്ട്
mn: САГС
mr: कार्ट
ms: TROLI
my: ဈေးခြင်းတောင်း
nb: HANDLEKURV
ne: कार्ट
pa: ਕਾਰਟ
pl: KOSZYK
pt: CARRINHO
pt_pt: CARRINHO
ro: COȘ DE CUMPĂRĂTURI
ru: КОРЗИНА
si: බහලුම
sk: KOŠÍK
sq: KARROCA
sr: КОРПА
sr_latn: KORPA
sv: KUNDVAGN
te: కార్ట్
th: รถเข็น
tr: ALIŞVERİŞ SEPETİ
uk: КОШИК
ur: کارٹ
uz: SAVATCHA
vi: GIỎ HÀNG
zh_hk: 購物車
zu: IKALISHI

# shrineProductQuantity
source: Quantity: {quantity}
af: Hoeveelheid: {quantity}
am: መጠን፦ {quantity}
ar_eg: الكمية: {quantity}
as: পৰিমাণ: {quantity}
az: Miqdar: {quantity}
be: Колькасць: {quantity}
bn: পরিমাণ: {quantity}
bs: Količina: {quantity}
ca: Quantitat: {quantity}
da: Antal: {quantity}
es_ar: Cantidad: {quantity}
et: Kogus: {quantity}
eu: Zenbatekoa: {quantity}
fa: کمیت: {quantity}
fil: Dami: {quantity}
fr_ca: Quantité : {quantity}
gl: Cantidade: {quantity}
gu: જથ્થો: {quantity}
he: כמות: {quantity}
hi: मात्रा: {quantity}
hu: Mennyiség: {quantity}
hy: Քանակը՝ {quantity}
id: Kuantitas: {quantity}
it: Quantità: {quantity}
ja: 数量: {quantity}
ka: რაოდენობა: {quantity}
km: បរិមាណ៖ {quantity}
kn: ಪ್ರಮಾಣ: {quantity}
ko: 수량: {quantity}
ky: Саны: {quantity}
lo: ຈຳນວນ: {quantity}
lt: Kiekis: {quantity}
lv: Daudzums: {quantity}
mk: Количина: {quantity}
ml: അളവ്: {quantity}
mn: Тоо хэмжээ: {quantity}
mr: प्रमाण: {quantity}
ms: Kuantiti: {quantity}
my: အရေအတွက်- {quantity}
nb: Antall: {quantity}
ne: परिमाण: {quantity}
pa: ਮਾਤਰਾ: {quantity}
pl: Ilość: {quantity}
pt: Quantidade: {quantity}
pt_pt: Quantidade: {quantity}
ro: Cantitate: {quantity}
ru: Количество: {quantity}
si: ප්‍රමාණය: {quantity}
sk: Množstvo: {quantity}
sq: Sasia: {quantity}
sr: Количина: {quantity}
sr_latn: Količina: {quantity}
sv: Kvantitet: {quantity}
te: సంఖ్య: {quantity}
th: จำนวน: {quantity}
tr: Miktar: {quantity}
uk: Кількість: {quantity}
ur: مقدار: {quantity}
uz: Soni: {quantity}
vi: Số lượng: {quantity}
zh_hk: 數量：{quantity}
zu: Ubuningi: {quantity}

# shrineCartItemCount
source: {quantity, plural, =0{NO ITEMS} =1{1 ITEM} other{{quantity} ITEMS}}
af: {quantity,plural,=0{GEEN ITEMS NIE}=1{1 ITEM}other{{quantity} ITEMS}}
am: {quantity,plural,=0{ምንም ንጥሎች የሉም}=1{1 ንጥል}other{{quantity} ንጥሎች}}
ar_eg: {quantity,plural,=0{ما مِن عناصر.}=1{عنصر واحد}two{عنصران ({quantity})}few{{quantity} عناصر}many{{quantity} عنصرًا}other{{quantity} عنصر}}
as: {quantity,plural,=0{কোনো বস্তু নাই}=1{১ টা বস্তু}other{{quantity} টা বস্তু}}
az: {quantity,plural,=0{ELEMENT YOXDUR}=1{1 ELEMENT}other{{quantity} ELEMENT}}
be: {quantity,plural,=0{НЯМА ЭЛЕМЕНТАЎ}=1{1 ЭЛЕМЕНТ}few{{quantity} ЭЛЕМЕНТЫ}many{{quantity} ЭЛЕМЕНТАЎ}other{{quantity} ЭЛЕМЕНТА}}
bn: {quantity,plural,=0{কোনও আইটেম নেই}=1{১টি আইটেম}other{{quantity}টি আইটেম}}
bs: {quantity,plural,=0{NEMA STAVKI}=1{1 STAVKA}few{{quantity} STAVKE}other{{quantity} STAVKI}}
ca: {quantity,plural,=0{CAP ARTICLE}=1{1 ARTICLE}other{{quantity} ARTICLES}}
da: {quantity,plural,=0{INGEN VARER}=1{1 VARE}other{{quantity} VARER}}
es_ar: {quantity,plural,=0{SIN ARTÍCULOS}=1{1 ARTÍCULO}other{{quantity} ARTÍCULOS}}
et: {quantity,plural,=0{ÜKSUSI POLE}=1{1 ÜKSUS}other{{quantity} ÜKSUST}}
eu: {quantity,plural,=0{EZ DAGO PRODUKTURIK}=1{1 PRODUKTU}other{{quantity} PRODUKTU}}
fa: {quantity,plural,=0{موردی وجود ندارد}=1{۱ مورد}other{{quantity} مورد}}
fil: {quantity,plural,=0{WALANG ITEM}=1{1 ITEM}other{{quantity} NA ITEM}}
fr_ca: {quantity,plural,=0{AUCUN ÉLÉMENT}=1{1 ÉLÉMENT}other{{quantity} ÉLÉMENTS}}
gl: {quantity,plural,=0{NON HAI ARTIGOS}=1{1 ARTIGO}other{{quantity} ARTIGOS}}
gu: {quantity,plural,=0{કોઈ આઇટમ નથી}=1{1 આઇટમ}other{{quantity} આઇટમ}}
he: {quantity,plural,=0{אין פריטים}=1{פריט אחד}two{{quantity} פריטים}other{{quantity} פריטים}}
hi: {quantity,plural,=0{कोई आइटम नहीं है}=1{1 आइटम}other{{quantity} आइटम}}
hu: {quantity,plural,=0{NINCSENEK TÉTELEK}=1{1 TÉTEL}other{{quantity} TÉTEL}}
hy: {quantity,plural,=0{ԱՊՐԱՆՔՆԵՐ ՉԿԱՆ}=1{1 ԱՊՐԱՆՔ}other{{quantity} ԱՊՐԱՆՔ}}
id: {quantity,plural,=0{TIDAK ADA ITEM}=1{1 ITEM}other{{quantity} ITEM}}
it: {quantity,plural,=0{NESSUN ARTICOLO}=1{1 ARTICOLO}other{{quantity} ARTICOLI}}
ja: {quantity,plural,=0{アイテムなし}=1{1 件のアイテム}other{{quantity} 件のアイテム}}
ka: {quantity,plural,=0{ერთეულები არ არის}=1{1 ერთეული}other{{quantity} ერთეული}}
km: {quantity,plural,=0{មិនមាន​ទំនិញ​ទេ}=1{ទំនិញ 1}other{ទំនិញ {quantity}}}
kn: {quantity,plural,=0{ಯಾವುದೇ ಐಟಂಗಳಿಲ್ಲ}=1{1 ಐಟಂ}other{{quantity} ಐಟಂಗಳು}}
ko: {quantity,plural,=0{항목 없음}=1{항목 1개}other{항목 {quantity}개}}
ky: {quantity,plural,=0{ЭЧ НЕРСЕ ЖОК}=1{1 НЕРСЕ}other{{quantity} НЕРСЕ}}
lo: {quantity,plural,=0{ບໍ່ມີລາຍການ}=1{1 ລາຍການ}other{{quantity} ລາຍການ}}
lt: {quantity,plural,=0{NĖRA JOKIŲ ELEMENTŲ}=1{1 ELEMENTAS}few{{quantity} ELEMENTAI}many{{quantity} ELEMENTO}other{{quantity} ELEMENTŲ}}
lv: {quantity,plural,=0{NAV VIENUMU}=1{1 VIENUMS}other{{quantity} VIENUMI}}
mk: {quantity,plural,=0{НЕМА СТАВКИ}=1{1 СТАВКА}other{{quantity} СТАВКИ}}
ml: {quantity,plural,=0{ഇനങ്ങളൊന്നുമില്ല}=1{ഒരിനം}other{{quantity} ഇനങ്ങൾ}}
mn: {quantity,plural,=0{ЗҮЙЛС АЛГА}=1{1 ЗҮЙЛ}other{{quantity} ЗҮЙЛ}}
mr: {quantity,plural,=0{कोणताही आयटम नाही}=1{एक आयटम}other{{quantity} आयटम}}
ms: {quantity,plural,=0{TIADA ITEM}=1{1 ITEM}other{{quantity} ITEM}}
my: {quantity,plural,=0{မည်သည့်ပစ္စည်းမျှ မရှိပါ}=1{ပစ္စည်း ၁ ခု}other{ပစ္စည်း {quantity} ခု}}
nb: {quantity,plural,=0{INGEN VARER}=1{1 VARE}other{{quantity} VARER}}
ne: {quantity,plural,=0{कुनै पनि वस्तु छैन}=1{१ वस्तु}other{{quantity} वस्तु}}
pa: {quantity,plural,=0{ਕੋਈ ਆਈਟਮ ਨਹੀਂ}=1{1 ਆਈਟਮ}other{{quantity} ਆਈਟਮਾਂ}}
pl: {quantity,plural,=0{Brak elementów}=1{1 ELEMENT}few{{quantity} ELEMENTY}many{{quantity} ELEMENTÓW}other{{quantity} ELEMENTU}}
pt: {quantity,plural,=0{NENHUM ITEM}=1{1 ITEM}other{{quantity} ITENS}}
pt_pt: {quantity,plural,=0{SEM ITENS}=1{1 ITEM}other{{quantity} ITENS}}
ro: {quantity,plural,=0{NICIUN ARTICOL}=1{UN ARTICOL}few{{quantity} ARTICOLE}other{{quantity} ARTICOLE}}
ru: {quantity,plural,=0{НЕТ ТОВАРОВ}=1{1 ТОВАР}few{{quantity} ТОВАРА}many{{quantity} ТОВАРОВ}other{{quantity} ТОВАРА}}
si: {quantity,plural,=0{අයිතම නැත}=1{අයිතම 1}other{අයිතම {quantity}}}
sk: {quantity,plural,=0{ŽIADNE POLOŽKY}=1{1 POLOŽKA}few{{quantity} POLOŽKY}many{{quantity} POLOŽKY}other{{quantity} POLOŽIEK}}
sq: {quantity,plural,=0{ASNJË ARTIKULL}=1{1 ARTIKULL}other{{quantity} ARTIKUJ}}
sr: {quantity,plural,=0{НЕМА СТАВКИ}=1{1 СТАВКА}few{{quantity} СТАВКЕ}other{{quantity} СТАВКИ}}
sr_latn: {quantity,plural,=0{NEMA STAVKI}=1{1 STAVKA}few{{quantity} STAVKE}other{{quantity} STAVKI}}
sv: {quantity,plural,=0{INGA OBJEKT}=1{1 OBJEKT}other{{quantity} OBJEKT}}
te: {quantity,plural,=0{అంశాలు లేవు}=1{1 అంశం}other{{quantity} అంశాలు}}
th: {quantity,plural,=0{ไม่มีสินค้า}=1{มีสินค้า 1 รายการ}other{มีสินค้า {quantity} รายการ}}
tr: {quantity,plural,=0{ÖĞE YOK}=1{1 ÖĞE}other{{quantity} ÖĞE}}
uk: {quantity,plural,=0{НЕМАЄ ТОВАРІВ}=1{1 ТОВАР}few{{quantity} ТОВАРИ}many{{quantity} ТОВАРІВ}other{{quantity} ТОВАРУ}}
ur: {quantity,plural,=0{کوئی آئٹمز نہیں ہیں}=1{1 آئٹم}other{{quantity} آئٹمز}}
uz: {quantity,plural,=0{HECH NIMA}=1{1 TA ELEMENT}other{{quantity} TA ELEMENT}}
vi: {quantity,plural,=0{KHÔNG CÓ MẶT HÀNG NÀO}=1{1 MẶT HÀNG}other{{quantity} MẶT HÀNG}}
zh_hk: {quantity,plural,=0{沒有項目}=1{1 個項目}other{{quantity} 個項目}}
zu: {quantity,plural,=0{AZIKHO IZINTO}=1{1 INTO}other{{quantity} IZINTO}}

# shrineCartClearButtonCaption
source: CLEAR CART
af: MAAK MANDJIE LEEG
am: ጋሪን አጽዳ
ar_eg: محو سلة التسوق
as: কাৰ্টত থকা সমল মচক
az: SƏBƏTİ TƏMİZLƏYİN
be: АЧЫСЦІЦЬ КОШЫК
bn: কার্ট মুছে দিন
bs: ISPRAZNI KORPU
ca: BUIDA EL CARRETÓ
da: RYD KURV
es_ar: VACIAR CARRITO
et: TÜHJENDA KORV
eu: GARBITU SASKIA
fa: پاک‌کردن سبد خرید
fil: I-CLEAR ANG CART
fr_ca: VIDER LE PANIER
gl: BALEIRAR CESTA
gu: કાર્ટ ખાલી કરો
he: ניקוי עגלת הקניות
hi: कार्ट में से आइटम हटाएं
hu: KOSÁR TÖRLÉSE
hy: ԴԱՏԱՐԿԵԼ ԶԱՄԲՅՈՒՂԸ
id: KOSONGKAN KERANJANG
it: SVUOTA CARRELLO
ja: カートをクリア
ka: კალათის გასუფთავება
km: សម្អាត​រទេះ
kn: ಕಾರ್ಟ್ ತೆರವುಗೊಳಿಸಿ
ko: 장바구니 비우기
ky: АРАБАНЫ ТАЗАЛОО
lo: ລ້າງລົດເຂັນ
lt: IŠVALYTI KREPŠELĮ
lv: NOTĪRĪT GROZU
mk: ИСПРАЗНИ КОШНИЧКА
ml: കാർട്ട് മായ്‌ക്കുക
mn: САГСЫГ ЦЭВЭРЛЭХ
mr: कार्ट साफ करा
ms: KOSONGKAN TROLI
my: စျေးခြင်းတောင်းကို ရှင်းလင်းရန်
nb: TØM HANDLEKURVEN
ne: कार्ट खाली गर्नुहोस्
pa: ਕਾਰਟ ਕਲੀਅਰ ਕਰੋ
pl: WYCZYŚĆ KOSZYK
pt: LIMPAR CARRINHO
pt_pt: LIMPAR CARRINHO
ro: GOLIȚI COȘUL
ru: ОЧИСТИТЬ КОРЗИНУ
si: කරත්තය හිස් කරන්න
sk: VYMAZAŤ KOŠÍK
sq: PASTRO KARROCËN
sr: ОБРИШИ СВЕ ИЗ КОРПЕ
sr_latn: OBRIŠI SVE IZ KORPE
sv: RENSA KUNDVAGNEN
te: కార్ట్ అంతా క్లియర్ చేయండి
th: ล้างรถเข็น
tr: ALIŞVERİŞ SEPETİNİ BOŞALT
uk: ВИДАЛИТИ ВСЕ З КОШИКА
ur: کارٹ کو صاف کریں
uz: SAVATCHANI TOZALASH
vi: XÓA GIỎ HÀNG
zh_hk: 清除購物車
zu: SULA INQOLA

# shrineCartTotalCaption
source: TOTAL
af: TOTAAL
am: ጠቅላላ
ar_eg: الإجمالي
as: সর্বমুঠ
az: CƏMİ
be: УСЯГО
bn: মোট
bs: UKUPNO
da: I ALT
et: KOKKU
eu: GUZTIRA
fa: مجموع
fil: KABUUAN
gu: કુલ
he: סה"כ
hi: कुल
hu: ÖSSZES
hy: ԸՆԴԱՄԵՆԸ
it: TOTALE
ja: 合計
ka: სულ
km: សរុប
kn: ಒಟ್ಟು
ko: 합계
ky: ЖАЛПЫ
lo: ຮວມ
lt: IŠ VISO
lv: KOPĀ
mk: ВКУПНО
ml: മൊത്തം
mn: НИЙТ
mr: एकूण
ms: JUMLAH
my: စုစုပေါင်း
nb: SUM
ne: कुल
pa: ਕੁੱਲ
pl: ŁĄCZNIE
ru: ВСЕГО
si: එකතුව
sk: CELKOVE
sq: TOTALI
sr: УКУПНО
sr_latn: UKUPNO
sv: TOTALT
te: మొత్తం
th: รวม
tr: TOPLAM
uk: УСЬОГО
ur: کل
uz: JAMI
vi: TỔNG
zh_hk: 總計
zu: ISAMBA

# shrineCartSubtotalCaption
source: Subtotal:
af: Subtotaal:
am: ንዑስ ድምር፦
ar_eg: الإجمالي الفرعي:
as: প্ৰাথমিক মুঠ:
az: Aralıq cəm:
be: Прамежкавы вынік:
bn: সাবটোটাল:
bs: Međuzbir:
et: Vahesumma:
eu: Guztizko partziala:
fa: زیرجمع:
fr_ca: Sous-total :
gu: પેટાસરવાળો:
he: סכום ביניים:
hi: कुल कीमत:
hu: Részösszeg:
hy: Ենթագումար՝
it: Subtotale:
ja: 小計:
ka: სულ:
km: សរុប​រង៖
kn: ಉಪಮೊತ್ತ:
ko: 소계:
ky: Орто-аралык сумма:
lo: ຍອດຮວມຍ່ອຍ:
lt: Tarpinė suma:
lv: Starpsumma:
mk: Подзбир:
ml: ആകെത്തുക:
mn: Нийлбэр дүн:
mr: उपबेरीज:
ms: Subjumlah:
my: စုစုပေါင်းတွင် ပါဝင်သော ကိန်းအပေါင်း-
nb: Delsum:
ne: उपयोगफल:
pa: ਉਪ-ਕੁੱਲ:
pl: Suma częściowa:
ru: Итого:
si: උප එකතුව:
sk: Medzisúčet:
sq: Nëntotali:
sr: Међузбир:
sr_latn: Međuzbir:
sv: Delsumma:
te: ఉప మొత్తం:
th: ยอดรวมย่อย:
tr: Alt toplam:
uk: Проміжний підсумок:
ur: سب ٹوٹل:
uz: Oraliq summa:
vi: Tổng phụ:
zh_hk: 小計：
zu: Inani elingaphansi:

# shrineCartShippingCaption
source: Shipping:
af: Versending:
am: መላኪያ፦
ar_eg: الشحن:
as: শ্বিপিং:
az: Göndərmə:
be: Дастаўка:
bn: শিপিং:
bs: Isporuka:
ca: Enviament:
da: Forsendelse:
es_ar: Envío:
et: Tarne:
eu: Bidalketa:
fa: ارسال کالا:
fil: Pagpapadala:
fr_ca: Livraison :
gl: Envío:
gu: શિપિંગ:
he: משלוח:
hi: शिपिंग:
hu: Szállítás:
hy: Առաքում՝
id: Pengiriman:
it: Spedizione:
ja: 送料:
ka: მიწოდება:
km: ការ​ដឹកជញ្ជូន៖
kn: ಶಿಪ್ಪಿಂಗ್:
ko: 배송:
ky: Жеткирүү
lo: ການສົ່ງ:
lt: Pristatymas:
lv: Piegāde:
mk: Испорака:
ml: ഷിപ്പിംഗ്:
mn: Тээвэрлэлт:
mr: शिपिंग:
ms: Penghantaran:
my: ကုန်ပစ္စည်းပေးပို့ခြင်း-
nb: Frakt:
ne: ढुवानी शुल्क:
pa: ਮਾਲ ਭੇਜਣ ਦੀ ਕੀਮਤ:
pl: Dostawa:
pt: Entrega:
pt_pt: Envio:
ro: Expediere:
ru: Доставка:
si: නැව්ගත කිරීම:
sk: Dopravné:
sq: Transporti:
sr: Испорука:
sr_latn: Isporuka:
sv: Frakt:
te: రవాణా ఖర్చు:
th: การจัดส่ง:
tr: Gönderim:
uk: Доставка:
ur: ترسیل:
uz: Yetkazib berish:
vi: Giao hàng:
zh_hk: 運費：
zu: Ukuthunyelwa:

# shrineProductGreySlouchTank
source: Grey slouch tank
af: Grys slenterhemp
am: ግራጫ የወረደ ጉርድ ቲሸርት
ar_eg: قميص رمادي اللون
az: Qolsuz boz kofta
be: Шэрая майка
bn: গ্রে স্লচ ট্যাঙ্ক
bs: Siva majica bez rukava
ca: Samarreta de tirants ampla grisa
da: Grå løstsiddende tanktop
es_ar: Camiseta gris holgada de tirantes
eu: Mahukarik gabeko elastiko gris zabala
fa: بلوز دوبندی گِری
fil: Grey na slouch tank
fr_ca: Débardeur gris
gl: Depósito curvado gris
he: גופייה אפורה רחבה
hi: स्लेटी रंग का स्लाउच टैंक
hu: Szürke ujjatlan póló
hy: Մոխրագույն շապիկ
id: Tank top jatuh warna abu-abu
it: Canottiera comoda grigia
ja: スラウチタンク（グレー）
ka: ნაცრისფერი უსახელო პერანგი
km: អាវវាលក្លៀក​ពណ៌ប្រផេះ
kn: ಗ್ರೇ ಸ್ಲೌಚ್ ಟ್ಯಾಂಕ್
ko: 회색 슬라우치 탱크톱
ky: Боз түстөгү майка
lo: ເສື້ອກ້າມສີເທົາ
lt: Pilki marškinėliai be rankovių
lv: Pelēkas krāsas tops
mk: Сива маица без ракави
ml: ഗ്രേ സ്ലൗച്ച് ടാങ്ക്
mn: Саарал сул мак
nb: Grå løstsittende ermeløs skjorte
ne: खैरो रङको टिसर्ट
pa: ਸਲੇਟੀ ਰੰਗ ਦਾ ਸਲਾਊਚ ਟੈਂਕ
pl: Szara bluzka na ramiączkach
pt: Regata larga cinza
pt_pt: Top largo cinzento
ro: Maiou lejer gri
ru: Серая майка
sk: Sivé tielko
sq: Kanotiere gri e varur
sr: Сива мајица без рукава
sr_latn: Siva majica bez rukava
sv: Grått linne
te: గ్రే స్లాచ్ ట్యాంక్
th: เสื้อกล้ามทรงย้วยสีเทา
tr: Gri bol kolsuz tişört
uk: Майка сірого кольору
ur: گرے سلیوچ ٹینک
uz: Kulrang mayka
vi: Áo ba lỗ dáng rộng màu xám
zh_hk: 灰色鬆身背心
zu: Ithanki ye-slouch empunga

# shrineProductStellaSunglasses
source: Stella sunglasses
af: Stella-sonbrille
am: ስቴላ የጸሐይ መነጽሮች
ar_eg: نظارات شمس من نوع "ستيلا"
az: Stella gün eynəkləri
be: Сонцаахоўныя акуляры Stella
bn: স্টেলা সানগ্লাস
bs: Sunčane naočale Stella
ca: Ulleres de sol Stella
da: Stella-solbriller
es_ar: Anteojos Stella
eu: Stella eguzkitako betaurrekoak
fa: عینک آفتابی اِستلا
fil: Stella na sunglasses
fr_ca: Lunettes de soleil Stella
gl: Lentes de sol Stella
he: משקפי שמש של Stella
hi: Stella ब्रैंड के चश्मे
hu: „Stella” napszemüveg
hy: Stella արևային ակնոց
id: Kacamata hitam Stella
it: Occhiali da sole Stella
ja: ステラ サングラス
ka: Stella-ს მზის სათვალე
km: វ៉ែនតាការពារ​ពន្លឺថ្ងៃ Stella
kn: ಸ್ಟೆಲ್ಲಾ ಸನ್‌ಗ್ಲಾಸ್‌ಗಳು
ko: 스텔라 선글라스
ky: Стелла көз айнеги
lo: ແວ່ນຕາກັນແດດ Stella
lt: Stellos McCartney akiniai nuo saulės
lv: Stella saulesbrilles
mk: Очила за сонце Stella
ml: സ്റ്റെല്ല സൺഗ്ലാസസ്
mn: Стелла нарны шил
nb: Stella-solbriller
ne: स्टेला सनग्लास
pa: ਸਟੈੱਲਾ ਐਨਕਾਂ
pl: Okulary przeciwsłoneczne Stella
pt: Óculos escuros Stella
pt_pt: Óculos de sol Stella
ro: Ochelari de soare Stella
ru: Солнцезащитные очки Stella
si: ස්ටෙලා අව් කණ්ණාඩි
sk: Slnečné okuliare Stella
sq: Syze Stella
sr: Наочаре за сунце Stella
sr_latn: Naočare za sunce Stella
sv: Solglasögon – Stella
te: స్టెల్లా సన్‌గ్లాసెస్
th: แว่นกันแดด Stella
tr: Stella güneş gözlüğü
uk: Окуляри Stella
ur: اسٹیلا دھوپ کے چشمے
uz: Stella quyosh koʻzoynaklari
vi: Kính râm Stella
zh_hk: Stella 太陽眼鏡
zu: Izibuko ze-Stella

# shrineProductWhitePinstripeShirt
source: White pinstripe shirt
af: Wit strepieshemp
am: ነጭ ባለቀጭን መስመር ሸሚዝ
ar_eg: قميص ذو خطوط بيضاء
az: Cızıqlı ağ köynək
be: Кашуля ў белую палоску
bn: সাদা পিনস্ট্রাইপ শার্ট
bs: Prugasta bijela košulja
ca: Camisa a ratlles blanca
da: Nålestribet skjorte i hvid
es_ar: Camisa de rayas finas
eu: Marra fineko alkandora zuria
fa: پیراهن راه‌راه سفید
fil: Puting pinstripe na t-shirt
fr_ca: Chemise blanche à fines rayures
gl: Camisa de raia diplomática branca
he: חולצת פסים לבנה
hi: सफ़ेद रंग की पिन्स्ट्राइप शर्ट
hu: Fehér csíkos ing
hy: Սպիտակ գծավոր վերնաշապիկ
id: Kaus pinstripe putih
it: Maglia gessata bianca
ja: ホワイト ピンストライプ シャツ
ka: თეთრი ზოლებიანი მაისური
km: អាវឆ្នូតពណ៌ស
kn: ವೈಟ್ ಪಿನ್‌ಸ್ಟ್ರೈಪ್ ಶರ್ಟ್
ko: 화이트 핀스트라이프 셔츠
ky: Ак сызыктуу көйнөк
lo: ເສື້ອເຊີດສີຂາວລາຍທາງລວງຕັ້ງ
lt: Balti dryžuoti marškiniai
lv: Balts svītrains krekls
mk: Бела кошула со риги
ml: വൈറ്റ് പിൻസ്ട്രൈപ്പ് ഷർട്ട്
mn: Босоо судалтай цагаан цамц
nb: Hvit nålestripet skjorte
ne: पातला धर्का भएको सेतो सर्ट
pa: ਚਿੱਟੀ ਪਿੰਨਸਟ੍ਰਾਈਪ ਕਮੀਜ਼
pl: Biała koszula w paski
pt: Camisa branca listrada
pt_pt: Camisa com riscas brancas
ro: Cămașă cu dungi fine albe
ru: Рубашка в белую полоску
sk: Biela pásiková košeľa
sq: Këmishë me vija të bardha
sr: Бела кошуља са пругама
sr_latn: Bela košulja sa prugama
sv: Kritstrecksrandig skjorta
te: తెల్లని పిన్‌స్ట్రైప్ చొక్కా
th: เสื้อเชิ้ตสีขาวลายทางแนวตั้ง
tr: İnce çizgili beyaz gömlek
uk: Біла сорочка в тонку смужку
ur: سفید پن اسٹراپ شرٹ
uz: Oq chiziqli koʻylak
vi: Áo sơ mi trắng sọc nhỏ
zh_hk: 白色細條紋恤衫
zu: Ishedi le-pinstripe elimhlophe

# demoTextFieldWhereCanWeReachYou
source: Where can we reach you?
af: Waar kan ons jou bereik?
am: የት ልናገኝዎ እንችላለን?
ar_eg: على أي رقم يمكننا التواصل معك؟
as: আপোনাৰ ফ’ন নম্বৰটো কি?
az: Sizinlə necə əlaqə saxlaya bilərik?
be: Па якім нумары з вамі можна звязацца?
bn: আমরা আপনার সাথে কীভাবে যোগাযোগ করব?
bs: Putem kojeg broja vas možemo kontaktirati?
ca: Com ens podem posar en contacte amb tu?
da: Hvordan kan vi kontakte dig?
es_ar: ¿Cómo podemos comunicarnos contigo?
et: Kuidas saame teiega ühendust võtta?
eu: Non aurki zaitzakegu?
fa: از کجا می‌توانیم به شما دسترسی داشته‌باشیم؟
fil: Paano kami makikipag-ugnayan sa iyo?
fr_ca: À quel numéro pouvons-nous vous joindre?
gl: En que número podemos contactar contigo?
gu: અમે ક્યાં તમારો સંપર્ક કરી શકીએ?
he: איך נוכל ליצור איתך קשר?
hi: हम आपसे किस नंबर पर संपर्क कर सकते हैं?
hu: Hol tudjuk elérni Önt?
hy: Ի՞նչ համարով կարելի է կապվել ձեզ հետ
id: Ke mana kami dapat menghubungi Anda?
it: Dove possiamo contattarti?
ja: 電話番号を入力してください
ka: სად დაგიკავშირდეთ?
km: តើយើងអាច​ទាក់ទងអ្នក​នៅទីណា?
kn: ನಾವು ನಿಮ್ಮನ್ನು ಹೇಗೆ ಸಂಪರ್ಕಿಸಬಹುದು?
ko: 연락 가능한 전화번호
ky: Сиз менен кантип байланыша алабыз?
lo: ພວກເຮົາຈະຕິດຕໍ່ຫາທ່ານຢູ່ເບີໃດ?
lt: Kaip galime su jumis susisiekti?
lv: Kā varam ar jums sazināties?
mk: Како може да стапиме во контакт со вас?
ml: നിങ്ങളെ എവിടെയാണ് ഞങ്ങൾക്ക് ബന്ധപ്പെടാനാവുക?
mn: Бид тантай ямар дугаараар холбогдох боломжтой вэ?
mr: आम्ही तुमच्याशी कुठे संपर्क साधू करू शकतो?
ms: Bagaimanakah cara menghubungi anda?
my: သင့်ကို မည်သို့ ဆက်သွယ်နိုင်ပါသလဲ။
nb: Hvor kan vi nå deg?
ne: हामी तपाईंलाई कुन नम्बरमा सम्पर्क गर्न सक्छौँ?
pa: ਅਸੀਂ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਸੰਪਰਕ ਕਰੀਏ?
pl: Jak możemy się z Tobą skontaktować?
pt: Como podemos falar com você?
pt_pt: Podemos entrar em contacto consigo através de que número?
ro: La ce număr de telefon vă putem contacta?
ru: По какому номеру с вами можно связаться?
si: අපට ඔබ වෙත ළඟා විය හැක්කේ කොතැනින්ද?
sk: Na akom čísle sa môžeme s vami spojiť?
sq: Ku mund të të kontaktojmë?
sr: Где можемо да вас контактирамо?
sr_latn: Gde možemo da vas kontaktiramo?
sv: På vilket nummer kan vi nå dig?
te: మేము మిమ్మల్ని ఎక్కడ సంప్రదించవచ్చు?
th: หมายเลขโทรศัพท์ของคุณ
tr: Size nereden ulaşabiliriz?
uk: Як з вами можна зв'язатися?
ur: ہم آپ سے کیسے رابطہ کر سکتے ہیں؟
uz: Qaysi raqamga telefon qilib sizni topamiz?
vi: Số điện thoại liên hệ của bạn?
zh_hk: 如何聯絡您？
zu: Singakuthola kuphi?

# settingsTextDirectionLTR
source: LTR
af: L.N.R.
am: ግራ-ወደ-ቀኝ
ar_eg: من اليسار إلى اليمين
as: বাওঁফালৰ পৰা সোঁফাললৈ
az: Soldan sağa
be: Злева направа
bs: Slijeva nadesno
ca: Text d'esquerra a dreta
da: VTH
es_ar: IZQ. a DER.
et: vasakult paremale
eu: Ezkerretik eskuinera
fa: چپ به راست
fr_ca: De gauche à droite
gl: De esquerda a dereita
he: משמאל לימין
hi: बाएं से दाएं
hu: Balról jobbra
hy: Ձախից աջ
it: Da sinistra a destra
ka: მარცხნიდან მარჯვნივ დამწერლობებისათვის
km: ពីឆ្វេង​ទៅស្ដាំ
kn: ಎಡದಿಂದ ಬಲಕ್ಕೆ
ko: 왼쪽에서 오른쪽으로
ky: СО
lt: Iš kairės į dešinę
mk: Лево кон десно
mn: Зүүнээс баруун
nb: VTH
ne: बायाँबाट दायाँ
pl: Od lewej do prawej
ro: De la stânga la dreapta
ru: Слева направо
sk: Ľ-P
sr: Слева надесно
sr_latn: Sleva nadesno
sv: Vänster till höger
uk: Зліва направо
uz: Chapdan oʻngga
vi: TRÁI SANG PHẢI
zh_hk: 由左至右顯示文字

# settingsTextScalingLarge
source: Large
af: Groot
am: ትልቅ
ar_eg: كبير
as: ডাঙৰ
az: Böyük
be: Вялікі
bn: বড়
bs: Veliko
ca: Gran
da: Stor
es_ar: Grande
et: Suur
eu: Handia
fa: بزرگ
fil: Malaki
fr_ca: Grande
gl: Grande
gu: મોટું
he: גדול
hi: बड़ा
hu: Nagy
hy: Մեծ
id: Besar
it: Grande
ja: 大
ka: დიდი
km: ធំ
kn: ದೊಡ್ಡದು
ko: 크게
ky: Чоң
lo: ໃຫຍ່
lt: Didelis
lv: Liels
mk: Голем
ml: വലുത്
mn: Том
mr: मोठे
ms: Besar
my: အကြီး
nb: Stor
ne: ठुलो
pa: ਵੱਡਾ
pl: Duży
pt: Grande
pt_pt: Grande
ro: Mare
ru: Крупный
si: විශාල
sk: Veľké
sq: E madhe
sr: Велики
sr_latn: Veliki
sv: Stor
te: పెద్దవిగా
th: ใหญ่
tr: Büyük
uk: Великий
ur: بڑا
uz: Yirik
vi: Lớn
zh_hk: 大
zu: Omkhulu
