Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoAlertTitleDialogTitle
source: Alert With Title
af: Opletberig met titel
am: ከአርእስት ጋር ማስጠንቀቂያ ስጥ
ar_eg: تنبيه مزوّد بعنوان
as: শিৰোনামৰ সৈতে সতর্কবার্তা
az: Başlıqlı Xəbərdarlıq
be: Абвестка з назвай
bn: সতর্ক বার্তার শীর্ষক
bs: Obavještenje s naslovom
ca: Alerta amb el títol
da: Underretning med titel
es_ar: Alerta con título
et: Hoiatus koos pealkirjaga
eu: Alerta izenburuduna
fa: هشدار دارای عنوان
fil: Alertong May Pamagat
fr_ca: Alerte avec titre
gl: Alerta con título
gu: શીર્ષકની સાથે અલર્ટ
he: התראה עם כותרת
hi: टाइटल की सुविधा वाली सूचना
hu: Értesítés címmel
hy: Ծանուցում վերնագրով
id: Notifikasi dengan Judul
it: Avviso con titolo
ja: タイトル付きアラート
ka: გაფრთხილება სათაურით
km: ជូនដំណឹង​រួមជាមួយ​ចំណងជើង
kn: ಶೀರ್ಷಿಕೆ ಜೊತೆಗೆ ಅಲರ್ಟ್ ಮಾಡಿ
ko: 제목이 있는 알림
ky: Аталышы бар билдирме
lo: ການແຈ້ງເຕືອນທີ່ມີຊື່
lt: Įspėjimas su pavadinimu
lv: Brīdinājums ar nosaukumu
mk: Предупредување со наслов
ml: പേര് ഉപയോഗിച്ച് മുന്നറിയിപ്പ്
mn: Гарчигтай сэрэмжлүүлэг
mr: शीर्षकाशी संबंधित सूचना
ms: Makluman Bertajuk
my: ခေါင်းစဉ်ပါသည့် သတိပေးချက်
nb: Varsel med tittel
ne: शीर्षकसहितको सतर्कता
pa: ਸਿਰਲੇਖ ਨਾਲ ਸੁਚੇਤਨਾ
pl: Alert z tytułem
pt: Alerta com título
pt_pt: Alerta com título
ro: Alertă cu titlu
ru: Оповещение с заголовком
si: මාතෘකාව සමග ඇඟවීම
sk: Upozornenie s názvom
sq: Sinjalizo me titullin
sr: Обавештење са насловом
sr_latn: Obaveštenje sa naslovom
sv: Varning med titel
te: శీర్షికతో అలర్ట్
th: การแจ้งเตือนที่มีชื่อ
tr: Başlıklı Uyarı
uk: Сповіщення з назвою
ur: عنوان کے ساتھ الرٹ
uz: Sarlavhali bildirishnoma
vi: Cảnh báo có tiêu đề
zh_hk: 具有標題的通知
zu: Isexwayiso esinesihloko

# demoSimpleDialogTitle
source: Simple
af: Eenvoudig
am: ቀላል
ar_eg: بسيط
as: সৰল
az: Sadə
be: Простае дыялогавае акно
bn: সাধারণ
bs: Jednostavno
ca: Senzill
da: Enkel
et: Lihtne
eu: Arrunta
fa: ساده
gu: સરળ
he: פשוטה
hi: सरल
hu: Egyszerű
hy: Պարզ
id: Sederhana
it: Semplice
ja: シンプル
ka: მარტივი
km: ធម្មតា
kn: ಸರಳ
ko: 단순함
ky: Жөнөкөй
lo: ງ່າຍໆ
lt: Paprastas
lv: Vienkāršs
mk: Едноставен
ml: ലളിതം
mn: Энгийн
mr: साधा
ms: Ringkas
my: ရိုးရှင်းသော
nb: Enkel
ne: सरल
pa: ਸਧਾਰਨ
pl: Proste
pt: Simples
pt_pt: Simples
ro: Simplă
ru: Обычное
si: සරල
sk: Jednoduché
sq: I thjeshtë
sr: Једноставан
sr_latn: Jednostavan
sv: Enkel
te: సాధారణ
th: แบบง่าย
tr: Basit
uk: Простий
ur: سادہ
uz: Oddiy
vi: Hộp thoại đơn giản
zh_hk: 簡單
zu: Kulula

# demoSimpleDialogDescription
source: A simple dialog offers the user a choice between several options. A simple dialog has an optional title that is displayed above the choices.
af: 'n Eenvoudige dialoog bied die gebruiker 'n keuse tussen verskeie opsies. 'n Eenvoudige dialoog het 'n opsionele titel wat bo die keuses gewys word.
am: ቀላል ንግግር ለተጠቃሚው በበርካታ አማራጮች መካከል ምርጫን ያቀርባል። ቀላል ንግግር ከምርጫዎ በላይ የሚታይ አማራጭ አርዕስት አለው።
ar_eg: يتيح مربع الحوار البسيط للمستخدم إمكانية الاختيار من بين عدة خيارات. ويشتمل مربع الحوار البسيط على عنوان اختياري يتم عرضه أعلى هذه الخيارات.
as: এটা সৰল ডায়ল'গে ব্যৱহাৰকাৰীক বিভিন্ন বিকল্পসমূহৰ পৰা বাছনি কৰাৰ সুবিধা দিয়ে। এটা সৰল ডায়ল'গৰ বাছনি কৰাৰ বাবে থকা বিকল্পসমূহৰ ওপৰত প্ৰদর্শন কৰা এটা ঐচ্ছিক শিৰোনাম থাকে।
az: Sadə dialoq istifadəçiyə bir neçə seçim təqdim edir. Sadə dialoqda seçimlərin yuxarısında göstərilən şərti başlıq olur.
be: Простае дыялогавае акно прапануе карыстальніку выбар паміж некалькімі варыянтамі. Простае дыялогавае акно можа мець назву, якая паказваецца над варыянтамі выбару.
bn: একটি সাধারণ ডায়ালগ ব্যবহারকারীদের কাছে একাধিক বিকল্পের মধ্যে একটি বেছে নেওয়ার সুযোগ করে দেয়। একটি সাধারণ ডায়ালগে একটি ঐচ্ছিক শীর্ষক থাকলে, তা বেছে নেওয়ার বিকল্পগুলি উপরে উল্লেখ করা আছে।
bs: Jednostavni dijaloški okvir korisniku nudi izbor između nekoliko opcija. Jednostavni dijaloški okvir ima neobavezni naslov koji se prikazuje iznad izbora.
ca: Un quadre de diàleg simple ofereix a l'usuari diverses opcions per triar-ne una. Pot tenir un títol opcional que es mostra a sobre dels resultats.
da: En enkel dialogboks giver brugeren et valg mellem flere muligheder. En enkel dialogboks har en valgfri titel, der vises oven over valgmulighederne.
es_ar: Un diálogo simple le ofrece al usuario la posibilidad de elegir entre varias opciones. Un diálogo simple tiene un título opcional que se muestra encima de las opciones.
et: Lihtne dialoog pakub kasutajale valikut mitme võimaluse vahel. Lihtsal dialoogil on valikuline pealkiri, mis kuvatakse valikute kohal.
eu: Leiho arruntek hainbat aukera eskaintzen dizkiote erabiltzaileari, nahi duena aukera dezan. Aukeren gainean bistaratzen den izenburu bat izan dezakete leiho arruntek.
fa: کادر گفتگو ساده، انتخاب بین گزینه‌های متفاوت را به کاربر ارائه می‌دهد. کادر گفتگو ساده، عنوانی اختیاری دارد که در بالای گزینه‌ها نمایش داده می‌شود.
fil: Isang simpleng dialog na nag-aalok sa user na pumili sa pagitan ng ilang opsyon. May opsyonal na pamagat ang simpleng dialog na ipinapakita sa itaas ng mga opsyon.
fr_ca: Une boîte de dialogue simple offre à un utilisateur le choix entre plusieurs options. Une boîte de dialogue simple a un titre optionnel affiché au-dessus des choix.
gl: Un cadro de diálogo simple ofrécelle ao usuario unha escolla entre varias opcións. Ten un título opcional que se mostra enriba das escollas.
gu: સરળ સંવાદ વપરાશકર્તાને ઘણા વિકલ્પો વચ્ચે પસંદગીની તક આપે છે. સરળ સંવાદમાં વૈકલ્પિક શીર્ષક હોય છે જે વિકલ્પોની ઉપર બતાવવામાં આવે છે.
he: תיבת דו-שיח פשוטה מציעה למשתמש בחירה מבין מספר אפשרויות. לתיבת דו-שיח יש כותרת אופציונלית שמוצגת מעל אפשרויות הבחירה.
hi: एक सादा डायलॉग, उपयोगकर्ता को कई विकल्पों में से किसी एक को चुनने की सुविधा देता है. एक सादे डायलॉग में दूसरा टाइटल होता है जो दिए गए विकल्पों के ऊपर होता है.
hu: Egy egyszerű párbeszédpanel választást kínál a felhasználónak több lehetőség közül. Az egyszerű párbeszédpanel nem kötelező címmel rendelkezik, amely a választási lehetőségek felett jelenik meg.
hy: Սովորական երկխոսության պատուհանում օգտատիրոջն առաջարկվում է ընտրության մի քանի տարբերակ։ Եթե պատուհանն ունի վերնագիր, այն ցուցադրվում է տարբերակների վերևում։
id: Dialog sederhana akan menawarkan pilihan di antara beberapa opsi kepada pengguna. Dialog sederhana memiliki judul opsional yang ditampilkan di atas pilihan tersebut.
it: Una finestra di dialogo semplice offre all'utente una scelta tra molte opzioni. Una finestra di dialogo semplice include un titolo facoltativo che viene mostrato sopra le scelte.
ja: シンプル ダイアログでは、ユーザーに複数の選択肢を提示できます。必要に応じて、選択肢の上に表示するタイトルを設定できます。
ka: მარტივი დიალოგი მომხმარებელს რამდენიმე ვარიანტს შორის არჩევანის გაკეთების საშუალებას აძლევს. სურვილისამებრ, მარტივ დიალოგს შეიძლება ჰქონდეს სათაური, რომელიც გამოჩნდება არჩევანის ზემოთ.
km: ប្រអប់ធម្មតា​ផ្ដល់ជូន​អ្នកប្រើប្រាស់​នូវជម្រើសមួយ​រវាង​ជម្រើស​មួយចំនួន។ ប្រអប់ធម្មតា​មាន​ចំណងជើង​ដែលជាជម្រើស ដែល​បង្ហាញនៅលើ​ជម្រើស។
kn: ಸರಳ ಡೈಲಾಗ್ ಬಳಕೆದಾರರಿಗೆ ಹಲವಾರು ಆಯ್ಕೆಗಳ ನಡುವೆ ಒಂದು ಆಯ್ಕೆಯನ್ನು ನೀಡುತ್ತದೆ. ಸರಳ ಡೈಲಾಗ್ ಐಚ್ಛಿಕ ಶೀರ್ಷಿಕೆಯನ್ನು ಹೊಂದಿದೆ, ಅದನ್ನು ಆಯ್ಕೆಗಳ ಮೇಲೆ ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಾಗುತ್ತದೆ.
ko: 단순 대화상자는 사용자가 택일할 몇 가지 옵션을 제공합니다. 단순 대화상자에는 옵션 위에 표시되는 제목이 선택사항으로 포함됩니다.
ky: Жөнөкөй диалог колдонуучуга бир нече варианттардын бирин тандоо мүмкүнчүлүгүн берет. Жөнөкөй диалогдо тандоолордун жогору жагында жайгашкан аталышы болушу мүмкүн.
lo: ກ່ອງໂຕ້ຕອບງ່າຍໆທີ່ສະເໜີຕົວເລືອກໃຫ້ຜູ້ໃຊ້ລະຫວ່າງຫຼາຍໆຕົວເລືອກ. ກ່ອງໂຕ້ຕອບແບບງ່າຍໆຈະມີຊື່ແບບບໍ່ບັງຄັບທີ່ສະແດງທາງເທິງຕົວເລືອກ.
lt: Rodant paprastą dialogo langą naudotojui galima rinktis iš kelių parinkčių. Nurodomas pasirenkamas paprasto dialogo lango pavadinimas, kuris pateikiamas virš pasirinkimo variantų.
lv: Vienkāršā dialoglodziņā lietotājam tiek piedāvāts izvēlēties starp vairākām opcijām. Vienkāršam dialoglodziņam ir neobligāts virsraksts, kas tiek attēlots virs izvēlēm.
mk: Едноставниот дијалог му нуди на корисникот избор помеѓу неколку опции. Едноставниот дијалог има изборен наслов прикажан над опциите.
ml: ഒരു ലളിതമായ ഡയലോഗ് ഉപയോക്താവിന് നിരവധി ഓപ്ഷനുകളിൽ ഒരു തിരഞ്ഞെടുക്കൽ ഓഫർ ചെയ്യുന്നു. ഒരു ലളിതമായ ഡയലോഗിന്റെ ഓപ്‌ഷണൽ പേര്, തിരഞ്ഞെടുത്തവയ്ക്ക് മുകളിൽ പ്രദർശിപ്പിക്കും.
mn: Энгийн харилцах цонх нь хэрэглэгчид хэд хэдэн сонголтыг санал болгодог. Энгийн харилцах цонх нь сонголтын дээр үзэгдэх сонгох боломжтой гарчигтай байна.
mr: एक साधा डायलॉग अनेक पर्यायांमधून निवडण्याची वापरकर्त्याला संधी देतो. साध्या डायलॉगमध्ये एक पर्यायी शीर्षक असते जे निवडींच्या वरती दाखवले जाते.
ms: Dialog ringkas menawarkan pengguna satu pilihan antara beberapa pilihan. Dialog ringkas mempunyai tajuk pilihan yang dipaparkan di bahagian atas pilihan itu.
my: ရိုးရှင်းသည့် ဒိုင်ယာလော့ဂ်သည် မတူညီသည့် ရွေးချယ်မှုများစွာမှ အသုံးပြုသူအား ရွေးခွင့်ပြုသည်။ ရိုးရှင်းသည့် ဒိုင်ယာလော့ဂ်တွင် ရွေးချယ်မှုများ၏ အပေါ်တွင် ဖော်ပြသော ချန်လှပ်ထားနိုင်သည့် ခေါင်းစဉ်ပါဝင်သည်။
nb: En enkel dialogboks gir brukeren et valg mellom flere alternativer. En enkel dialogboks har en valgfri tittel som vises over valgene.
ne: सामान्य संवादले प्रयोगकर्तालाई थुप्रै विकल्पहरूबाट चयन गर्ने सुविधा दिन्छ। सामान्य संवादमा रोज्ने विकल्पहरूमाथि देखाइएको एउटा वैकल्पिक शीर्षक हुन्छ।
pa: ਸਧਾਰਨ ਵਿੰਡੋ ਵਰਤੋਂਕਾਰ ਨੂੰ ਕਈ ਵਿਕਲਪਾਂ ਵਿਚਕਾਰ ਚੋਣ ਕਰਨ ਦੀ ਪੇਸ਼ਕਸ਼ ਕਰਦੀ ਹੈ। ਸਧਾਰਨ ਵਿੰਡੋ ਵਿੱਚ ਇੱਕ ਵਿਕਲਪਿਕ ਸਿਰਲੇਖ ਸ਼ਾਮਲ ਹੁੰਦਾ ਹੈ ਜੋ ਚੋਣਾਂ ਦੇ ਉੱਪਰ ਦਿਖਾਇਆ ਜਾਂਦਾ ਹੈ।
pl: Proste okno dające użytkownikowi kilka opcji do wyboru. Proste okno z opcjonalnym tytułem wyświetlanym nad opcjami.
pt: Uma caixa de diálogo simples oferece ao usuário uma escolha entre várias opções. A caixa de diálogo simples tem um título opcional que é exibido acima das opções.
pt_pt: Uma caixa de diálogo simples oferece ao utilizador uma escolha entre várias opções. Uma caixa de diálogo simples tem um título opcional que é apresentado acima das opções.
ro: Caseta de dialog simplă îi oferă utilizatorului posibilitatea de a alege dintre mai multe opțiuni. Caseta de dialog simplă are un titlu opțional, afișat deasupra opțiunilor.
ru: В обычном диалоговом окне пользователю предлагается несколько вариантов на выбор. Если у окна есть заголовок, он располагается над вариантами.
si: සරල සංවාදයක් විකල්ප කීපයක් අතර තෝරා ගැනීමක් පිරිනමයි. සරල සංවාදයක තෝරා ගැනීම් ඉහළ සංදර්ශනය වන විකල්ප මාතෘකාවක් ඇත.
sk: Jednoduché dialógové okno poskytuje používateľovi výber medzi viacerými možnosťami. Má voliteľný názov, ktorý sa zobrazuje nad možnosťami.
sq: Një dialog i thjeshtë i ofron përdoruesit një zgjedhje mes disa opsionesh. Një dialog i thjeshtë ka një titull opsional që afishohet mbi zgjedhjet.
sr: Једноставан дијалог кориснику нуди избор између неколико опција. Једноставан дијалог има опционални наслов који се приказује изнад тих избора.
sr_latn: Jednostavan dijalog korisniku nudi izbor između nekoliko opcija. Jednostavan dijalog ima opcionalni naslov koji se prikazuje iznad tih izbora.
sv: Med en enkel dialogruta får användaren välja mellan flera alternativ. En enkel dialogruta har en valfri titel som visas ovanför alternativen.
te: సరళమైన డైలాగ్ వినియోగదారుకు అనేక ఎంపికల మధ్య ఎంపికను అందిస్తుంది. సరళమైన డైలాగ్‌లో ఐచ్ఛిక శీర్షిక ఉంటుంది, అది ఎంపికల పైన ప్రదర్శించబడుతుంది.
th: กล่องโต้ตอบแบบง่ายจะนำเสนอทางเลือกระหว่างตัวเลือกหลายๆ อย่าง โดยกล่องโต้ตอบแบบง่ายจะมีชื่อที่ไม่บังคับซึ่งจะแสดงเหนือทางเลือกต่างๆ
tr: Basit iletişim kutusu, kullanıcıya birkaç seçenek arasından seçim yapma olanağı sunar. Basit iletişim kutusunun seçeneklerin üzerinde görüntülenen isteğe bağlı bir başlığı vardır.
uk: Просте діалогове вікно дає користувачу змогу обрати один із кількох варіантів. Воно може мати назву, яка відображається над варіантами (необов'язково).
ur: ایک سادہ ڈائیلاگ صارف کو کئی اختیارات کے درمیان انتخاب پیش کرتا ہے ایک سادہ ڈائیلاگ کا اختیاری عنوان ہوتا ہے جو انتخابات کے اوپر دکھایا جاتا ہے۔
uz: Oddiy muloqot oynasida foydalanuvchiga tanlash uchun bir nechta variant beriladi. Oynada sarlavha boʻlsa, u variantlar ustida joylashadi.
vi: Hộp thoại đơn giản đưa ra cho người dùng một lựa chọn trong số nhiều tùy chọn. Hộp thoại đơn giản không nhất thiết phải có tiêu đề ở phía trên các lựa chọn.
zh_hk: 簡單對話框讓使用者在幾個選項之間選擇。您可按需要為簡單對話框設定標題 (標題會在選項上方顯示)。
zu: Ibhokisi elilula linikeza umsebenzisi inketho ephakathi kwezinketho ezithile. Ibhokisi elilula linesihloko ongasikhetha esiboniswa ngaphezulu kwezinketho.

# demoFullscreenDialogTitle
source: Fullscreen
af: Volskerm
am: ሙሉ ማያ ገፅ
ar_eg: ملء الشاشة
as: সম্পূৰ্ণ স্ক্ৰীন
az: Tam ekran
be: Поўнаэкраннае дыялогавае акно
bn: ফুল-স্ক্রিন
bs: Preko cijelog ekrana
ca: Pantalla completa
da: Fuld skærm
es_ar: Pantalla completa
et: Täisekraan
eu: Pantaila osoa
fa: تمام‌صفحه
fr_ca: Plein écran
gl: Pantalla completa
gu: પૂર્ણસ્ક્રીન
he: מסך מלא
hi: फ़ुल-स्क्रीन
hu: Teljes képernyő
hy: Լիաէկրան
id: Layar Penuh
it: Schermo intero
ja: 全画面表示
ka: სრულ ეკრანზე
km: ពេញ​អេក្រង់
kn: ಫುಲ್‌ಸ್ಕ್ರೀನ್
ko: 전체 화면
ky: Толук экран
lo: ເຕັມຈໍ
lt: Visas ekranas
lv: Pilnekrāna režīms
mk: Цел екран
ml: പൂർണ്ണസ്ക്രീൻ
mn: Бүтэн дэлгэц
mr: फुलस्क्रीन
ms: Skrin penuh
my: မျက်နှာပြင်အပြည့်
nb: Fullskjerm
ne: फुल स्क्रिन
pa: ਪੂਰੀ-ਸਕ੍ਰੀਨ
pl: Pełny ekran
pt: Tela cheia
pt_pt: Ecrã inteiro
ro: Ecran complet
ru: Полноэкранный режим
si: පූර්ණ තිරය
sk: Celá obrazovka
sq: Ekrani i plotë
sr: Цео екран
sr_latn: Ceo ekran
sv: Helskärm
te: ఫుల్-స్క్రీన్‌
th: เต็มหน้าจอ
tr: Tam Ekran
uk: На весь екран
ur: پوری اسکرین
uz: Butun ekran
vi: Toàn màn hình
zh_hk: 全螢幕
zu: Isikrini esigcwele

# demoCupertinoButtonsTitle
source: Buttons
af: Knoppies
am: አዝራሮች
ar_eg: الأزرار
as: বুটামসমূহ
az: Düymələr
be: Кнопкі
bn: বোতাম
bs: Dugmad
ca: Botons
da: Knapper
es_ar: Botones
et: Nupud
eu: Botoiak
fa: دکمه‌ها
fil: Mga Button
fr_ca: Boutons
gl: Botóns
gu: બટન
he: לחצנים
hi: बटन
hu: Gombok
hy: Կոճակներ
id: Tombol
it: Pulsanti
ja: ボタン
ka: ღილაკები
km: ប៊ូតុង
kn: ಬಟನ್‌ಗಳು
ko: 버튼
ky: Баскычтар
lo: ປຸ່ມ
lt: Mygtukai
lv: Pogas
mk: Копчиња
ml: ബട്ടണുകൾ
mn: Товчлуур
mr: बटणे
ms: Butang
my: ခလုတ်များ
nb: Knapper
ne: बटनहरू
pa: ਬਟਨ
pl: Przyciski
pt: Botões
pt_pt: Botões
ro: Butoane
ru: Кнопки
si: බොත්තම්
sk: Tlačidlá
sq: Butonat
sr: Дугмад
sr_latn: Dugmad
sv: Knappar
te: బటన్‌లు
th: ปุ่ม
tr: Düğmeler
uk: Кнопки
ur: بٹنز
uz: Tugmalar
vi: Nút
zh_hk: 按鈕
zu: Izinkinobho

# demoCupertinoButtonsSubtitle
source: iOS-style buttons
af: Knoppies in iOS-styl
am: iOS-ቅጥ አዝራሮች
ar_eg: أزرار مستوحاة من نظام التشغيل iOS
as: iOS-শৈলীৰ বুটামসমূহ
az: iOS üslublu düymələr
be: Кнопкі ў стылі iOS
bn: iOS-স্টাইল বোতাম
bs: Dugmad u stilu iOS-a
ca: Botons d'estil iOS
da: Knapper i stil med iOS
es_ar: Botones con estilo de iOS
et: iOS-i stiilis nupud
eu: iOS estiloko botoiak
fa: دکمه‌های سبک iOS
fil: Mga button na may istilong pang-iOS
fr_ca: Boutons de style iOS
gl: Botóns de tipo iOS
gu: iOS-શૈલીના બટન
he: לחצנים בסגנון iOS
hi: iOS की शैली वाला बटन
hu: iOS-stílusú gombok
hy: iOS-ի ոճով կոճակներ
id: Tombol gaya iOS
it: Pulsanti dello stile iOS
ja: iOS スタイルのボタン
ka: iOS-ის სტილის ღილაკები
km: ប៊ូតុង​ដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿ ಬಟನ್‌ಗಳು
ko: iOS 스타일 버튼
ky: iOS стилиндеги баскычтар
lo: ປຸ່ມແບບ iOS
lt: „iOS“ stiliaus mygtukai
lv: iOS stila pogas
mk: Копчиња во iOS-стил
ml: iOS-സ്റ്റൈലിലുള്ള ബട്ടണുകൾ
mn: iOS загварын товчлуурууд
mr: iOS शैली बटण
ms: Butang gaya iOS
my: iOS-ပုံစံ ခလုတ်များ
nb: Knapper i iOS-stil
ne: iOS शैलीका बटनहरू
pa: iOS-ਸਟਾਈਲ ਬਟਨ
pl: Przyciski w stylu iOS
pt: Botões no estilo iOS
pt_pt: Botões ao estilo do iOS
ro: Butoane în stil iOS
ru: Кнопки в стиле iOS
si: iOS-විලාස බොත්තම්
sk: Tlačidlá v štýle systému iOS
sq: Butonat në stilin e iOS
sr: Дугмад у iOS стилу
sr_latn: Dugmad u iOS stilu
sv: Knappar i iOS-stil
te: iOS-శైలి బటన్‌లు
th: ปุ่มแบบ iOS
tr: iOS tarzı düğmeler
uk: Кнопки в стилі iOS
ur: iOS طرز کے بٹن
uz: iOS uslubidagi tugmalar
vi: Nút theo kiểu iOS
zh_hk: iOS 樣式按鈕
zu: izinkinobho zesitayela se-iOS
