Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# fortnightlyHeadlineFabrics
source: Designers Use Tech To Make Futuristic Fabrics
af: Ontwerpers gebruik tegnologie om futuristiese materiale te maak
am: የወደፊት ጨርቆችን ለማምረት ነዳፊዎች ቴክኖሎጂን ይጠቀማሉ
ar_eg: مصمِّمون يستخدمون التكنولوجيا لصنع ملابس تستلهم المستقبل
as: অত্যাধুনিক বস্ত্ৰ তৈয়াৰ কৰিবলৈ ডিজাইনাৰসকলে কৰিছে প্ৰযুক্তিবিদ্যাৰ ব্যৱহাৰ
az: Dizaynerlər müasir parçalar hazırlamaq üçün texnologiyadan istifadə edir
be: Як сучасныя тэхналогіі дазваляюць дызайнерам ствараць футурыстычныя тканіны
bn: স্মার্ট ফেব্রিক তৈরিতে প্রযুক্তির ছোঁয়া ডিজাইনারদের
bs: Dizajneri koriste tehnologiju za izradu materijala budućnosti
ca: Uns dissenyadors creen teixits futuristes utilitzant tecnologia
da: Designere fremstiller futuristisk stof ved hjælp af teknologi
es_ar: Diseñadores usan la tecnología para crear telas futuristas
et: Disainerid loovad tehnoloogia abil futuristlikke kangaid
eu: Diseinatzaileek teknologia erabiltzen dute ehun futuristak sortzeko
fa: طراحان برای تولید پارچه‌های نسل آینده از فناوری بهره می‌برند
fil: Gumagamit ng Teknolohiya ang Mga Designer para Gumawa ng Mga Napakamodernong Tela
fr_ca: Les développeurs de mode s'appuient sur les technologies pour créer les tissus de l'avenir
gl: Os deseñadores utilizan a tecnoloxía para crear tecidos futuristas
gu: ભવિષ્યના વસ્ત્રો માટે ડિઝાઇનરોએ લીધો ટેકનો સહારો
he: מעצבים יוצרים בדים עתידניים באמצעות טכנולוגיה
hi: बेहतर फ़ैब्रिक बनाने के लिए डिज़ाइनर ले रहे हैं टेक्नोलॉजी की मदद
hu: A tervezők a technológiát hívják segítségül futurisztikus anyagok megalkotásához
hy: Դիզայներներն օգտագործում են նոր տեխնոլոգիաները՝ ֆուտուրիստական գործվածքներ ստեղծելու համար
id: Desainer Menggunakan Teknologi untuk Membuat Kain Futuristis
it: I designer usano la tecnologia per realizzare tessuti futuristici
ja: デザイナーがテクノロジーを活用して未来の生地を作り出す
ka: დიზაინერები იყენებენ ტექნოლოგიებს ფუტურისტული ქსოვილების დასამზადებლად
km: អ្នករចនា​ប្រើ​បច្ចេកវិទ្យា ដើម្បី​បង្កើត​ក្រណាត់​ដែលមានលក្ខណៈ​ទំនើបបំផុត
kn: ಫ್ಯೂಚರಿಸ್ಟಿಕ್ ಬಟ್ಟೆ ರಚನೆಗೆ ತಂತ್ರಜ್ಞಾನ ಬಳಸುವ ಸ್ಟೈಲಿಸ್ಟ್‌ಗಳು
ko: 기술로 미래지향적인 원단을 만드는 디자이너들
ky: Футуристтик кездемелерди даярдоодо дизайнерлер жаңы технологияларды колдонушат
lo: ນັກອອກແບບໃຊ້ເທັກໂນໂລຢີໃນການສ້າງຜ້າແຫ່ງອະນາຄົດ
lt: Dizaineriai kuria futuristinius audinius pasitelkę technologijas
lv: Dizaineri izmanto tehnoloģijas, lai radītu futūristiskus audumus
mk: Дизајнерите ја користат технологијата за да изработат футуристички платна
ml: അത്യാധുനിക ഫാബ്രിക്കുകൾ നിർമ്മിക്കാൻ സാങ്കേതികവിദ്യകൾ ഉപയോഗിച്ച് ഡിസെെനർമാർ
mn: Загвар зохион бүтээгчид футурист даавуу хийхдээ технологи ашиглаж байна
mr: सर्वोत्तम कपडे बनवण्यासाठी डिझाइनर घेतात तंत्रज्ञानाची मदत
my: ခေတ်လွန်ပိတ်စများပြုလုပ်ရန် ဒီဇိုင်နာများသည် နည်းပညာကို အသုံးပြုသည်
nb: Designere bruker teknologi til å lage futuristisk stoff
ne: डिजाइनरहरूले नवीनतम शैलीको कपडा बनाउन प्रविधिको प्रयोग गर्छन्
pa: ਡਿਜ਼ਾਈਨਰ ਭਵਿੱਖ ਦੇ ਫੈਬਰਿਕਸ ਬਣਾਉਣ ਲਈ ਤਕਨੀਕ ਦੀ ਕਰਦੇ ਹਨ ਵਰਤੋਂ
pl: Projektanci tworzą futurystyczne materiały za pomocą technologii
pt: Designers usam a tecnologia para criar tecidos futuristas
pt_pt: Designers utilizam a tecnologia para criar tecidos futuristas
ro: Designerii creează materiale futuriste cu ajutorul tehnologiei
ru: Дизайнеры используют новые технологии для производства футуристичных тканей
si: සැලසුම්කරුවන් අනාගතයට ගැළපෙන රෙදිපිළි සෑදීමට තාක්ෂණය භාවිත කරයි
sk: Pomocou technológií vyrábajú návrhári futuristické látky
sq: Stilistët përdorin teknologjinë për të krijuar pëlhura futuriste
sr: Дизајнери користе технологију да би правили футуристичке тканине
sr_latn: Dizajneri koriste tehnologiju da bi pravili futurističke tkanine
sv: Formgivare skapar futuristiska tyger med hjälp av teknik
te: రేపటి తరం ఫ్యాబ్రిక్‌లు - టెక్నాలజీతో ఈ తరం డిజైనర్ల ఆవిష్కరణలు
th: นักออกแบบใช้เทคโนโลยีในการสร้างผ้าแห่งอนาคต
tr: Tasarımcılar Modern Fabrikalar İnşa Etmek için Teknolojiden Yararlanıyorlar
uk: Завдяки технологіям з'являється тканини майбутнього
ur: مستقبل کے کپڑے تیار کرنے کے لیے ڈیزائنرز ٹیکنالوجی کا استعمال کرتے ہے
uz: Dizaynerlar futuristik liboslar yaratishda foydalanadigan texnologiyalar
vi: Nhiều nhà thiết kế dùng công nghệ để tạo ra loại vải thế hệ mới
zh_hk: 設計師以科技創造劃時代布料
zu: Abadizayinayo Basebenzisa Ubuchwepheshe Ukuze Benze Izindwangu Ezizayo

# fortnightlyHeadlineStocks
source: As Stocks Stagnate, Many Look To Currency
af: Terwyl aandele stagneer, bekyk baie mense valuta
am: አክሲዮኖች ባሉበት ሲቆሙ ብዙዎች ምንዛሬን ያያሉ
ar_eg: مع ركود الأسهم، يتجه الكثيرون إلى العملة
as: স্থবিৰ ষ্টক মাৰ্কেট, মুদ্ৰাই এতিয়া বহুতৰ ভৰসা
az: Səhmlərdə hərəkət olmadıqda, əksər insanlar valyutaya yönəlir
be: Застой у акцыях зрушвае фокус на валюту
bn: কারও পৌষমাস কারও সর্বনাশ
bs: Dok berze stagniraju, mnogi se uzdaju u valutu
ca: Les accions s'estanquen i les mirades se centren en la moneda
da: Matte aktier får mange til at vende sig mod valuta
es_ar: A medida que se estanca el mercado de acciones, muchos apuestan a las divisas
et: Aktsiate stagneerumise tõttu investeerivad paljud valuutasse
eu: Akzioak igotzen ez direnez, dibisak dituzte askok ikusmiran
fa: با راکد شدن سهام، اکثر نگاه‌ها متوجه ارز است
fil: Habang Hindi Umuunlad ang Mga Stock, Marami ang Umaasa sa Currency
fr_ca: Alors que la Bourse stagne, beaucoup d'investisseurs se tournent vers l'échange de devises
gl: A medida que se estancan as accións, moitos miran a moeda
gu: સ્ટૉકમાં સ્થિરતા પછી લોકોનો ચલણ તરફી ઝુકાવ
he: אין שינוי בערכי המניות, ורבים מעדיפים לבדוק השקעות במטבע
hi: अटका शेयर बाज़ार, अब मुद्रा पर टिकी लोगों की आस
hu: A tőzsde stagnálásával minden szempár a valutára szegeződik
hy: Բաժնետոմսերի փոխարժեքի ստագնացիայի պատճառով շատերը նախընտրությունը տալիս են արժույթին
id: Saham Stagnan, Mata Uang Diawasi
it: Con il ristagno delle azioni, tanti guardano alla valuta
ja: 株価低迷の中で通貨に注目が集まる
ka: აქციების სტაგნაციის პერიოდში ბევრი ვალუტას უბრუნდება
km: ដោយសារតែ​ភាគហ៊ុន​នៅទ្រឹងដដែល មនុស្សជាច្រើន​ផ្ដោតលើ​រូបិយបណ្ណ​វិញ
kn: ಷೇರುಗಳು ಬೆಲೆ ಕುಸಿತ, ಕರೆನ್ಸಿಗಳತ್ತ ಮುಖ ಮಾಡಿದ ಜನಸಾಮಾನ್ಯ
ko: 주식 침체에 따른 외환 투자
ky: Акциялардын стагнациясы учурунда көп адамдар валютага көз салышат
lo: ເມື່ອຮຸ້ນຊົບເຊົາ, ຫຼາຍຄົນກໍສົນໃຈສະກຸນເງິນ
lt: Įvykus akcijų stagnacijai dauguma griebiasi valiutos
lv: Akciju vērtības stagnācijas dēļ daudzi vēlas izmantot valūtu
mk: Со стагнирањето на акциите, многумина се вртат кон валутата
ml: ഓഹരികളുടെ സ്‌തംഭനം, എല്ലാവരുടെയും കണ്ണ് കറൻസിയിൽ
mn: Хувьцааны ханш зогсонги байдалд орсноор олон хүн мөнгөн гүйлгээ рүү хийж байна
mr: शेअर मार्केटचा विकास थांबल्यावर अनेकजण चलन बाजारावर आशा ठेवतात
my: စတော့ရှယ်ယာများ ရပ်တန့်နေသည့်အတွက် လူအများသည် ငွေကြေးဘက်သို့ ပြောင်းနေကြသည်
nb: Når aksjer stagnerer, ser mange til valutaer
ne: स्टकको वृद्धि नभएकाले धेरै मान्छेले मुद्रामा लगानी गर्न खोज्दैछन्
pa: ਸਟਾਕ ਮਾਰਕੀਟ ਵਿੱਚ ਖੜੋਤ ਕਾਰਨ, ਬਹੁਤਿਆਂ ਦਾ ਧਿਆਨ ਮੁਦਰਾ ਵੱਲ
pl: Przez stagnację na giełdzie rośnie popularność pieniądza
pt: Com a estagnação das ações, muitos se voltam às moedas
pt_pt: À medida que as ações ficam estagnadas, muitos olham para a moeda
ro: Întrucât cotațiile bursiere stagnează, mulți se orientează spre cursul valutar
ru: Из-за стагнации курса акций инвесторы присматриваются к валюте
si: කොටස් එක තැන තිබෙන නිසා, බොහෝ අය ව්‍යවහාර මුදල් දෙස බලයි
sk: V čase stagnácie akcií sa mnohí sústreďujú na menu
sq: Me ngadalësimin e aksioneve, shumë u drejtohen valutave
sr: Док акције стагнирају, многи се окрећу валути
sr_latn: Dok akcije stagniraju, mnogi se okreću valuti
sv: När aktiemarknaden stagnerar vänder sig många till valutor i stället
te: నిలిచిపోయిన స్టాక్స్, కరెన్సీపైకి మరలిన పలువురి దృష్టి
th: คนจำนวนมากหวังพึ่งการแลกเปลี่ยนสกุลเงินขณะที่หุ้นซบเซา
tr: Hisse Senetleri Piyasası Durgunlaştıkça Çoğu Yatırımcı Dövize Yöneliyor
uk: Застій акцій зміщує фокус на валюту
ur: اسٹاکس کے ساکن ہونے پر، بہت سے لوگوں کا رحجان کرنسی کی طرف
uz: Aksiya stagnatsiyalari, valyutalar narxi
vi: Khi cổ phiếu chứng khoán đình trệ, nhiều người chuyển sang dự trữ tiền tệ
zh_hk: 股票市場停滯不前，貨幣市場成為新貴
zu: Njengoba Izitoko Zihamba Kancane, Iningi Labantu Libheka Uhlobo Lwemali

# fortnightlyTrendingReform
source: Reform
af: Hervorming
am: ለውጥ
ar_eg: إصلاح
az: İslahat
bs: Reforma
ca: Reforma
eu: Eraldaketa
fil: Reporma
fr_ca: Réforme
gl: Reforma
id: Perubahan
it: Riforma
ja: 改革
km: កំណែទម្រង់
ko: 개혁
ky: Реформа
lo: ປະຕິຮູບ
lt: Reforma
lv: Reforma
mn: Шинэчлэл
my: ပြုပြင်ပြောင်းလဲမှု
pt: Reforma
ro: Reformă
si: ප්‍රතිසංස්කරණය
sk: Reforma
sq: Reformë
te: కొత్త పథం
th: การปฏิรูป
ur: اصلاح
uz: Islohatlar
zu: Okulungisiwe

# fortnightlyMenuTech
source: Tech
af: Tegnologie
am: ቴክኖሎጂ
ar_eg: تكنولوجيا
as: প্রযুক্তিবিদ্যা
az: Texnologiya
be: Тэхналогіі
bn: প্রযুক্তি
bs: Tehnologija
ca: Tecnologia
da: Teknologi
es_ar: Tecnología
et: Tehnoloogia
eu: Teknologia
fa: فناوری
fil: Teknolohiya
fr_ca: Technologies
gl: Tecnoloxía
gu: ટૅક
he: טכנולוגיה
hi: टेक्नोलॉजी
hu: Technológia
hy: Տեխնոլոգիաներ
id: Teknologi
it: Tecnologia
ja: テクノロジー
ka: ტექნოლოგია
km: បច្ចេកវិទ្យា
kn: ಟೆಕ್
ko: 기술
ky: Техника
lo: ເທັກໂນໂລຢີ
lt: Technologijos
lv: Tehnoloģijas
mk: Техника
ml: സാങ്കേതികവിദ്യ
mn: Технологи
mr: तंत्रज्ञान
ms: Teknologi
my: နည်းပညာ
nb: Teknologi
ne: प्रविधि
pa: ਤਕਨੀਕੀ
pl: Technologie
pt: Tecnologia
pt_pt: Tecnologia
ro: Tehnologie
ru: Технологии
si: තාක්ෂණ
sk: Technológie
sq: Teknologji
sr: Технологија
sr_latn: Tehnologija
sv: Teknik
te: సాంకేతికం
th: เทคโนโลยี
tr: Teknoloji
uk: Техніка
ur: ٹیکنالوجی
uz: Texnologiya
vi: Công nghệ
zh_hk: 科技
zu: Ubuchwepheshe

# fortnightlyHeadlineWar
source: Divided American Lives During War
af: Verdeelde Amerikaanse lewens tydens oorlog
am: በጦርነት ጊዜ የተከፋፈሉ የአሜሪካ ሕይወቶች
ar_eg: الأمريكيون المنقسمون أثناء الحرب
as: যুদ্ধৰ সময়ত বিধ্বস্ত হোৱা আমেৰিকাৰ জনজীৱন
az: Müharibə zamanı bölünmüş Amerika həyatları
be: Як вайна раскалола Амерыку
bn: যুদ্ধের সময় ছন্নছাড়া মার্কিন জনজীবন
bs: Podijeljeni životi Amerikanaca za vrijeme rata
ca: Vides separades als EUA durant la guerra
da: Adskilte amerikanske liv i krigstid
es_ar: Estadounidenses que viven separados durante la guerra
et: Ameeriklaste elud, mis sõja tõttu rikuti
eu: Estatubatuarren bizitza zatituak gerran zehar
fa: زندگی آمریکایی‌های جداافتاده درطول جنگ
fil: Watak-watak na Buhay ng Mga Amerikano sa Panahon ng Digmaan
fr_ca: Comment la guerre a séparé des vies d'Américains
gl: Vidas estadounidenses divididas durante a guerra
gu: યુદ્ધે અમેરિકન લોકોને બે પક્ષમાં વહેંચી દીધા
he: החיים החצויים של אמריקאים במהלך המלחמה
hi: युद्ध के दौरान अपनों से बिछड़े अमेरिकी लाेगाें का दर्द
hu: Háború során szétválasztott amerikai életek
hy: Պատերազմի հետևանքով բաժանված ամերիկացիների կյանքը
id: Kehidupan Orang Amerika yang Terbagi Selama Perang
it: Vite di americani divise durante la guerra
ja: 戦時中に分断された米国民の生活
ka: ამერიკელების გახლეჩილი ცხოვრება ომის პერიოდში
km: ជីវិត​ប្រជាជន​អាមេរិក​ដែលមាន​ការបែងចែកវណ្ណៈ​ក្នុងអំឡុង​សង្គ្រាម
kn: ಯುದ್ಧದ ಸಮಯದಲ್ಲಿ ಅಮೆರಿಕಾದ ಜೀವನ ಛಿದ್ರ
ko: 전쟁 중 이별을 겪은 미국인
ky: Согуш учурунда бөлүнүп калган америкалык адамдардын тагдырлары
lo: ຊາວອະເມຣິກັນທີ່ຖືກແບ່ງແຍກໃນຊ່ວງສົງຄາມ
lt: Padalytų amerikiečių gyvenimas per karą
lv: Kara dēļ sadalītās amerikāņu dzīves
mk: Разделени животи на Американците за време на војната
ml: യുദ്ധകാലത്ത് വിഭജിക്കപ്പെട്ട അമേരിക്കൻ ജീവിതങ്ങൾ
mn: Дайны үед хуваагдсан Америкийн амьдрал
mr: युद्धाच्या वेळी विभाजित झालेल्या अमेरिकन लोकांचे जीवन
my: စစ်ကာလအတွင်း ကွဲကွာသွားသော အမေရိကန်ပြည်သူပြည်သားများ
nb: Atskilte amerikanske liv i krig
ne: लडाईंका समयमा विभाजित अमेरिकी जीवन
pa: ਜੰਗ ਦੌਰਾਨ ਵੰਡੇ ਹੋਏ ਅਮਰੀਕੀਆਂ ਦੀ ਜ਼ਿੰਦਗੀ
pl: Podzieleni Amerykanie podczas wojny
pt: Vidas norte-americanas divididas durante a guerra
pt_pt: Vidas americanas divididas durante a guerra
ro: Poporul american divizat în timpul războiului
ru: Жизни американцев, разделенные войной
si: යුද්ධය අතරතුර ඇමෙරිකානු ජීවිත වෙන් කරන ලදී
sk: Rozdelené životy američanov počas vojny
sq: Jetët amerikane të ndara gjatë luftës
sr: Раздвојени амерички животи током рата
sr_latn: Razdvojeni američki životi tokom rata
sv: Amerikaners skilda livsöden i krigstid
te: యుద్ధ సమయంలో ఆప్తులకు దూరమైన అమెరికా వాసుల వ్యథ
th: ชีวิตที่มีการแบ่งแยกของชาวอเมริกันในช่วงสงคราม
tr: Amerikalıların Savaş Sırasında Bölünmüş Yaşamları
uk: Розділене життя американців під час війни
ur: جنگ کے دوران منقسم امریکیوں کی زندگیاں
uz: Urush vaqtidagi amerika boʻlinmalari
vi: Những người Mỹ phải chia ly trong thời chiến
zh_hk: 戰爭讓美國人踏上異路
zu: Owasemelika Ohlukanisiwe Ophila Ngesikhathi Sempi

# fortnightlyHeadlineHealthcare
source: The Quiet, Yet Powerful Healthcare Revolution
af: Die stil dog kragtige gesondheidsorgrevolusie
am: ጸጥተኛው፣ ግን ኃይለኛው የጤና እንክብካቤ አብዮት
ar_eg: ثورة الرعاية الصحية الهادئة والفعالة في الوقت نفسه
as: নিঃশব্দ অথচ শক্তিশালী স্বাস্থ্যসেৱা বিপ্লৱটো
az: Sakit, Lakin Güclü Səhiyyə İnqilabı
be: "Ціхая рэвалюцыя" ў галіне аховы здароўя
bn: নিঃশব্দ চিকিৎসা বিপ্লবে জীবনের জয়ধ্বনি
bs: Mirna, ali moćna revolucija u zdravstvu
ca: La revolució sanitària: silenciosa, però poderosa
da: Den stille revolution, der ryster sundhedssektoren
es_ar: La revolución silenciosa, pero importante, del sector sanitario
et: Vaikne, kuid võimas tervishoiurevolutsioon
eu: Osasun-zerbitzuen iraultza isil eta boteretsua
fa: انقلاب بی‌صدا، اما قدرتمند خدمات درمانی
fil: Ang Tahimik Pero Makapangyarihang Rebolusyon sa Pangangalaga sa Kalusugan
fr_ca: La révolution discrète mais efficace du système de santé
gl: A revolución silenciosa e firme da sanidade
gu: આરોગ્યસંભાળની સશક્ત ક્રાંતિ, તે પણ કશા શોરબકોર વિના
he: המהפכה השקטה והחזקה בשירותי הבריאות
hi: स्वास्थ्य के क्षेत्र में छाेटे-छाेटे कदमाें से हुई बड़ी क्रांति
hu: A csendes, mégis erőteljes egészségügyi forradalom
hy: Առողջապահության համակարգի հանգիստ, բայց լուրջ հետևանքներով հեղափոխություն
id: Revolusi Perawatan Kesehatan yang Diam-Diam Semakin Canggih
it: La pacata ma potente rivoluzione sanitaria
ja: 静かに力強く進む医療改革
ka: წყნარი, მაგრამ მნიშვნელოვანი რევოლუცია ჯანდაცვაში
km: បដិវត្តន៍​នៃ​ការថែទាំ​សុខភាព​ក្នុងសភាព​ស្ងប់ស្ងាត់ ប៉ុន្តែ​មានសន្ទុះ​ខ្លាំងក្លា
kn: ಶಾಂತಿಯುತ ಮತ್ತು ಶಕ್ತಿಯುತ ಆರೋಗ್ಯ ಕ್ರಾಂತಿ
ko: 단계적으로, 혁신적으로 진행되는 건강보험 개혁
ky: Тынч, бирок күчтүү Саламаттыкты сактоодогу революция
lo: ວິວັດທະນາການທີ່ງຽບແຕ່ຊົງພະລັງດ້ານສຸຂະພາບ
lt: Tylus, bet galingas sveikatos priežiūros perversmas
lv: Kluss, bet iespaidīgs apvērsums veselības aprūpes jomā
mk: Тивката, но моќна револуција во здравството
ml: ശാന്തവും എന്നാൽ ശക്തവുമായ ആരോഗ്യ പരിപാലന വിപ്ലവം
mn: Чимээгүй боловч хүчирхэг эрүүл мэндийн хувьсгал
mr: आरोग्य क्षेत्रामधील छोटे पण महत्त्वपूर्ण बदल
my: တိတ်ဆိပ်သော်လည်း အားပြင်းသော ကျန်းမာရေးစောင့်ရှောက်မှု ပြောင်းလဲခြင်း
nb: Den stille, men kraftige revolusjonen inne helsetjenester
ne: स्वास्थ्य स्याहारसम्बन्धी शान्त तर शक्तिशाली क्रान्ति
pa: ਸ਼ਾਂਤ, ਪਰ ਫਿਰ ਵੀ ਸ਼ਕਤੀਸ਼ਾਲੀ ਸਿਹਤ ਸੰਭਾਲ ਕ੍ਰਾਂਤੀ
pl: Cicha, ale skuteczna rewolucja w opiece zdrowotnej
pt: A revolução silenciosa, mas poderosa, dos serviços de saúde
pt_pt: A revolução discreta, porém poderosa, dos cuidados de saúde
ro: Revoluția silențioasă, dar remarcabilă, din domeniul sănătății
ru: Тихая революция с большими последствиями в сфере здравоохранения
si: නිහඬ එහෙත් ප්‍රබල සෞඛ්‍ය ආරක්ෂණ විප්ලවය
sk: Tichá, ale zároveň účinná revolúcia v zdravotníctve
sq: Revolucioni i qetë, por i fuqishëm në kujdesin shëndetësor
sr: Тиха, али моћна револуција здравственог система
sr_latn: Tiha, ali moćna revolucija zdravstvenog sistema
sv: En sjukvårdsrevolution i det tysta
te: ఆరోగ్య రంగంలో ప్రశంసకు నోచుకోని నిశ్శబ్ద విప్లవం
th: การปฏิวัติสาธารณสุขที่เงียบแต่ทรงพลัง
tr: Sessiz, Ancak Güçlü Bir Sağlık Reformu
uk: Тиха але потужна революція в області охорони здоров'я
ur: صحت کی دیکھ ریکھ میں پرسکون لیکن طاقتور انقلاب
uz: Urushlarsiz, sogʻliqni saqlashdagi yutuqlar
vi: Cuộc cải cách y tế âm thầm mà bền bỉ
zh_hk: 靜悄無聲的醫療大改革
zu: Ukuphenduka Okuthulile, Kodwa Okunamandla Kokunakekelwa Kwezempilo

# fortnightlyLatestUpdates
source: Latest Updates
af: Jongste opdaterings
am: የቅርብ ጊዜ ዝማኔዎች
ar_eg: آخر المستجدّات
as: শেহতীয়া আপডে’টসমূহ
az: Ən son güncəlləmələr
be: Апошнія навіны
bn: লেটেস্ট আপডেট
bs: Najnovije vijesti
ca: Últimes novetats
da: Seneste opdateringer
es_ar: Novedades más recientes
et: Viimased värskendused
eu: Informazio eguneratuena
fa: جدیدترین به‌روزرسانی‌ها
fil: Mga Pinakabagong Update
fr_ca: Dernières mises à jour
gl: Últimas novidades
gu: તાજેતરના અપડેટ
he: העדכונים האחרונים
hi: ताज़ा खबरें
hu: Legújabb frissítések
hy: Վերջին թարմացումները
id: Kabar Terbaru
it: Ultimi aggiornamenti
ja: 最新情報
ka: ბოლო განახლებები
km: ព័ត៌មាន​ថ្មី​បំផុត
kn: ಇತ್ತೀಚಿನ ಅಪ್‌ಡೇಟ್‌ಗಳು
ko: 최신 소식
ky: Эң акыркы жаңылыктар
lo: ອັບເດດຫຼ້າສຸດ
lt: Karščiausios naujienos
lv: Pēdējie jaunumi
mk: Најнови вести
ml: ഏറ്റവും പുതിയ അപ്‌ഡേറ്റുകൾ
mn: Хамгийн сүүлийн шинэчлэлт
mr: नवीनतम अपडेट
ms: Kemas Kini Terkini
my: နောက်ဆုံးအပ်ဒိတ်များ
nb: De siste oppdateringene
ne: नवीनतम अद्यावधिकहरू
pa: ਨਵੀਨਤਮ ਅੱਪਡੇਟ
pl: Najnowsze informacje
pt: Atualizações mais recentes
pt_pt: Atualizações mais recentes
ro: Cele mai recente actualizări
ru: Последние новости
si: නවතම යාවත්කාලීන
sk: Posledné novinky
sq: Përditësimet më të fundit
sr: Најновије вести
sr_latn: Najnovije vesti
sv: De senaste uppdateringarna
te: తాజా అప్‌డేట్‌లు
th: ข้อมูลอัปเดตล่าสุด
tr: Son Güncellemeler
uk: Останні новини
ur: تازہ ترین اپ ڈیٹس
uz: Soʻngi xabarlar
vi: Thông tin cập nhật mới nhất
zh_hk: 最新動態
zu: Izibuyekezo Zakamuva

# fortnightlyTrendingStocks
source: Stocks
af: Aandele
am: አክሲዮኖች
ar_eg: الأسهم
az: Səhmlər
be: Акцыі
bs: Berza
ca: Accions
eu: Akzioak
fil: Mga Stock
fr_ca: Cours boursiers
gl: Accións
id: Saham
it: Azioni
ja: 株価
km: ភាគហ៊ុន
kn: ಸ್ಟಾಕ್‌ಗಳು
ko: 주식
ky: Акциялар
lo: ຮຸ້ນ
lt: Akcijos
lv: Akcijas
ml: ഓഹരികൾ
mn: Хувьцаа
my: စတော့ရှယ်ယာများ
ne: स्टकहरू
pt: Ações
ro: Acțiuni
si: කොටස්
sk: Akcie
sq: Aksione
te: స్టాక్‌లు
th: หุ้น
tr: Hisse senetleri
ur: اسٹاکس
uz: Aksiyalar
zu: Izitoko

# rallyBillDetailTotalAmount
source: Total Amount
af: Totale bedrag
am: ጠቅላላ መጠን
ar_eg: المبلغ الإجمالي
as: মুঠ পৰিমাণ
az: Cəmi Məbləğ
be: Агульная сума
bn: মোট পরিমাণ
bs: Ukupan iznos
ca: Import total
da: Samlet beløb
es_ar: Importe total
et: Kogusumma
eu: Zenbatekoa, guztira
fa: مبلغ کل
fil: Kabuuang Halaga
fr_ca: Montant total
gl: Importe total
gu: કુલ રકમ
he: הסכום הכולל
hi: कुल रकम
hu: Teljes összeg
hy: Ընդհանուր գումարը
id: Jumlah Total
it: Importo totale
ja: 合計金額
ka: ჯამური თანხა
km: ចំនួន​ទឹកប្រាក់​សរុប
kn: ಒಟ್ಟು ಮೊತ್ತ
ko: 총액
ky: Жалпы сумма
lo: ຈຳນວນຮວມ
lt: Visa suma
lv: Kopsumma
mk: Вкупен износ
ml: മൊത്തം തുക
mn: Нийт дүн
mr: एकूण रक्कम
ms: Jumlah Keseluruhan
my: စုစုပေါင်းပမာဏ
nb: Totalbeløp
ne: कुल रकम
pa: ਕੁੱਲ ਰਕਮ
pl: Łączna kwota
pt: Valor total
pt_pt: Valor total
ro: Suma totală
ru: Общая сумма
si: මුළු මුදල
sk: Celková suma
sq: Shuma totale
sr: Укупан износ
sr_latn: Ukupan iznos
sv: Totalt belopp
te: మొత్తం సొమ్ము
th: จำนวนรวม
tr: Toplam Tutar
uk: Загальна сума
ur: کل تعداد
uz: Jami miqdori
vi: Tổng số tiền
zh_hk: 總金額
zu: Inani lesamba

# demoCupertinoPickerDateTime
source: Date and Time
af: Datum en tyd
am: ቀን እና ሰዓት
ar_eg: التاريخ والوقت
as: তাৰিখ আৰু সময়
az: Tarix və Vaxt
be: Дата і час
bn: তারিখ ও সময়
bs: Datum i vrijeme
ca: Data i hora
da: Dato og tid
es_ar: Fecha y hora
et: Kuupäev ja kellaaeg
eu: Data eta ordua
fa: تاریخ و زمان
fil: Petsa at Oras
fr_ca: Date et heure
gl: Data e hora
gu: તારીખ અને સમય
he: תאריך ושעה
hi: तारीख और समय
hu: Dátum és idő
hy: Ամսաթիվ և ժամ
id: Tanggal dan Waktu
it: Data e ora
ja: 日付と時刻
ka: თარიღი და დრო
km: កាលបរិច្ឆេទ និងម៉ោង
kn: ದಿನಾಂಕ ಮತ್ತು ಸಮಯ
ko: 날짜 및 시간
ky: Күнү жана убакыты
lo: ​ວັນ​ທີ​ແລະ​ເວ​ລາ
lt: Data ir laikas
lv: Datums un laiks
mk: Датум и време
ml: തീയതിയും സമയവും
mn: Огноо ба цаг
mr: तारीख आणि वेळ
ms: Tarikh dan Masa
my: ရက်စွဲနှင့် အချိန်
nb: Dato og klokkeslett
ne: मिति र समय
pa: ਤਾਰੀਖ ਅਤੇ ਸਮਾਂ
pl: Data i godzina
pt: Data e hora
pt_pt: Data e hora
ro: Data și ora
ru: Дата и время
si: දිනය සහ වේලාව
sk: Dátum a čas
sq: Data dhe ora
sr: Датум и време
sr_latn: Datum i vreme
sv: Datum och tid
te: తేదీ మరియు సమయం
th: วันที่และเวลา
tr: Tarih ve Saat
uk: Дата й час
ur: تاریخ اور وقت
uz: Sana va vaqt
vi: Ngày và giờ
zh_hk: 日期和時間
zu: Idethi nesikhathi

source: SIGN IN
af: MELD AAN
am: ግባ
ar_eg: تسجيل الدخول
as: ছাইন ইন কৰক
az: GİRİŞ
be: УВАЙСЦІ
bn: সাইন-ইন করুন
bs: PRIJAVA
ca: INICIA LA SESSIÓ
da: LOG IND
es_ar: ACCEDER
et: LOGI SISSE
eu: HASI SAIOA
fa: ورود به سیستم
fil: MAG-SIGN IN
fr_ca: CONNEXION
gl: INICIAR SESIÓN
gu: સાઇન ઇન કરો
he: כניסה
hi: साइन इन करें
hu: BEJELENTKEZÉS
hy: ՄՈՒՏՔ
id: LOGIN
it: ACCEDI
ja: ログイン
ka: შესვლა
km: ចូល
kn: ಸೈನ್ ಇನ್
ko: 로그인
ky: КИРҮҮ
lo: ເຂົ້າສູ່ລະບົບ
lt: PRISIJUNGTI
lv: PIERAKSTĪTIES
mk: НАЈАВИ СЕ
ml: സൈൻ ഇൻ ചെയ്യുക
mn: НЭВТРЭХ
mr: साइन इन करा
ms: LOG MASUK
my: လက်မှတ်ထိုးဝင်ရန်
nb: LOGG PÅ
ne: साइन इन गर्नुहोस्
pa: ਸਾਈਨ-ਇਨ ਕਰੋ
pl: ZALOGUJ SIĘ
pt: FAZER LOGIN
pt_pt: INICIAR SESSÃO
ro: CONECTAȚI-VĂ
ru: ВОЙТИ
si: පුරන්න
sk: PRIHLÁSIŤ SA
sq: IDENTIFIKOHU
sr: ПРИЈАВИТЕ СЕ
sr_latn: PRIJAVITE SE
sv: LOGGA IN
te: సైన్ ఇన్ చేయండి
th: ลงชื่อเข้าใช้
tr: OTURUM AÇ
uk: УВІЙТИ
ur: سائن ان کریں
uz: KIRISH
vi: ĐĂNG NHẬP
zh_hk: 登入
zu: NGENA NGEMVUME

# dataTableRowWithSugar
source: {value} with sugar
af: {value} met suiker
am: {value} ከስኳር ጋር
ar_eg: {value} بالسكر
as: চেনিযুক্ত {value}
az: Şəkərli {value}
be: {value} з цукрам
bn: চিনি সহ {value}
bs: {value} sa šećerom
ca: {value} amb sucre
da: {value} med sukker
es_ar: {value} con azúcar
et: {value} koos suhkruga
eu: {value} azukrearekin
fa: {value} با شکر
fil: {value} na may asukal
fr_ca: {value} avec du sucre
gl: {value} con azucre
gu: ખાંડની સાથે {value}
he: {value} עם סוכר
hi: {value} चीनी के साथ
hu: {value} cukorral
hy: {value} շաքարով
id: {value} dengan gula
it: {value} con zucchero
ja: {value}（砂糖使用）
ka: {value} შაქრით
km: {value} មានស្ករ
kn: {value} ಸಕ್ಕರೆ ಹೊಂದಿದೆ
ko: 설탕이 든 {value}
ky: Кант кошулган {value}
lo: {value} ໃສ່ນ້ຳຕານ
lt: {value} su cukrumi
lv: {value} ar cukuru
mk: {value} со шеќер
ml: {value} പഞ്ചസാര ചേർത്തത്
mn: Чихэртэй {value}
mr: साखरेचा समावेश असलेले {value}
ms: {value} bergula
my: သကြားနှင့် {value}
nb: {value} med sukker
ne: चिनीसहितको {value}
pa: ਖੰਡ ਨਾਲ {value}
pl: {value} z cukrem
pt: {value} com açúcar
pt_pt: {value} com açúcar
ro: {value} cu zahăr
ru: {value} с сахаром
si: සීනි සහිත {value}
sk: {value} s cukrom
sq: {value} me sheqer
sr: {value} са шећером
sr_latn: {value} sa šećerom
sv: {value} med socker
te: చెక్కెరతో {value}
th: {value} ใส่น้ำตาล
tr: Şekerli {value}
uk: {value} з цукром
ur: شکر کے ساتھ {value}
uz: {value} shakar bilan
vi: {value} phủ đường
zh_hk: {value} 伴糖
zu: {value} enoshukela

# dataTableRowApplePie
source: Apple pie
af: Appeltert
am: የፖም ፓይ
ar_eg: فطيرة التفاح
as: এপল পাই
az: Alma piroqu
be: Яблычны пірог
bn: আপেল পাই
bs: Pita od jabuka
ca: Pastís de poma
da: Æbletærte
es_ar: Pastel de manzana
et: Õunakook
eu: Sagar-tarta
fa: پای سیب
fr_ca: Pie
gl: Torta de mazá
gu: એપલ પાઇ
he: עוגת תפוחים
hy: Խնձորի կարկանդակ
id: Pai apel
it: Torta di mele
ja: アップルパイ
ka: ვაშლის ღვეზელი
km: នំ​ប៉ោម
kn: ಆಪಲ್ ಪೈ
ko: 애플파이
ky: Алма пирогу
lo: ພາຍໝາກໂປ່ມ
lv: Ābolu pīrāgs
mk: Пита со јаболка
mn: Алимны бялуу
mr: अ‍ॅपल पाय
ms: Pai epal
my: ပန်းသီးပိုင်မုန့်
nb: Eplekake
ne: एप्पल पाई
pa: ਐਪਲ ਪਾਈ
pl: Szarlotka
pt: Torta de maçã
pt_pt: Tarte de maçã
ro: Plăcintă cu mere
ru: Яблочный пирог
si: ඇපල් පයි
sq: Ëmbëlsirë me mollë
sr: Пита од јабука
sr_latn: Pita od jabuka
sv: Äppelpaj
te: యాపిల్ పై
th: พายแอปเปิล
tr: Elmalı turta
uk: Яблучний пиріг
uz: Olmali pirog
vi: Bánh táo
zh_hk: 蘋果批
zu: Uphaya we-apula

# dataTableRowDonut
source: Donut
af: Oliebol
am: ዶናት
as: ড’নাট
az: Ponçik
be: Пончык
bs: Krofna
ca: Dònut
es_ar: Dona
et: Sõõrik
eu: Donuta
fa: دونات
gl: Rosca
gu: ડૉનટ
he: דונאט (סופגנית חישוק)
hy: Օղաբլիթ
id: Donat
it: Ciambella
ja: ドーナッツ
ka: დონატი
km: នំដូណាត់
kn: ಡೋನಟ್
ko: 도넛
ky: Пончик
lo: ໂດນັດ
lv: Virtulis
mk: Крофна
mn: Цагираган боов
mr: डोनट
my: ဒိုးနတ်
nb: Smultring
ne: डोनट
pa: ਡੋਨਟ
pl: Pączek
ro: Gogoașă
ru: Пончик
si: ඩෝනට්
sq: Petull
sr: Крофна
sr_latn: Krofna
sv: Ring
te: డోనట్
th: โดนัท
tr: Simit
uk: Пончик
uz: Yogʻli kulcha
zh_hk: 冬甩
zu: Idonadi
