Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSharedXAxisIllustrationCourseTitle
source: Illustration
af: Illustrasie
am: ስዕላዊ ማብራሪያ
ar_eg: صور توضيحية
as: চিত্ৰসহ ব্যখ্যামূলক বৰ্ণনা
az: İllüstrasiya
be: Ілюстрацыя
bn: ছবি
bs: Ilustracija
ca: Il·lustració
es_ar: Ilustración
et: Illustratsioon
eu: Ilustrazioa
fa: مصورسازی
fil: Pagguhit
gl: Ilustración
gu: ઉદાહરણ
he: איור
hi: चित्रकला
hu: Illusztráció
hy: Պատկերազարդում
id: Ilustrasi
it: Illustrazione
ja: イラスト
ka: ილუსტრაცია
km: រូបភាព
kn: ಉದಾಹರಣೆ
ko: 일러스트레이션
ky: Иллюстрация
lo: ຮູບປະກອບ
lt: Iliustracija
lv: Ilustrācija
mk: Илустрација
ml: ചിത്രീകരണം
mn: Зурагт тайлбар
mr: इलस्ट्रेशन
ms: Ilustrasi
my: သရုပ်ဖော်ပုံ
nb: Illustrasjon
ne: चित्रण
pa: ਉਦਾਹਰਨ
pl: Ilustracja
pt: Ilustração
pt_pt: Ilustração
ro: Ilustrații
ru: Иллюстрация
si: රූප සටහන
sk: Ilustrácia
sq: Ilustrim
sr: Илустрација
sr_latn: Ilustracija
sv: Bild
te: దృష్టాంత చిత్రం
th: ภาพ
tr: Resim
uk: Ілюстрація
ur: خاکہ
uz: Tasvir
vi: Minh họa
zh_hk: 插圖
zu: Umfanekiso

# demoSharedXAxisBusinessCourseTitle
source: Business
af: Besigheid
am: ንግድ
ar_eg: أنشطة تجارية
as: ব্যৱসায়
az: Biznes
be: Бізнес
bn: ব্যবসা
bs: Biznis
ca: Negocis
da: Erhverv
es_ar: Empresa
et: Äri
eu: Enpresa
fa: کسب‌وکار
fil: Negosyo
fr_ca: Affaires
gl: Empresa
gu: વ્યવસાય
he: עסקים
hi: कारोबार
hu: Üzlet
hy: Բիզնես
id: Bisnis
it: Aziende
ja: ビジネス
ka: ბიზნესი
km: អាជីវកម្ម
kn: ವ್ಯಾಪಾರ
ko: 비즈니스
ky: Ишкердик
lo: ທຸລະກິດ
lt: Verslas
lv: Uzņēmējdarbība
mk: Бизнис
ml: ബിസിനസ്
mn: Бизнес
mr: व्यवसाय
ms: Perniagaan
my: လုပ်ငန်း
nb: Bedrift
ne: व्यवसाय
pa: ਕਾਰੋਬਾਰ
pl: Firma
pt: Negócios
pt_pt: Negócios
ro: Afaceri
ru: Бизнес
si: ව්‍යාපාරය
sk: Firma
sq: Biznes
sr: Пословање
sr_latn: Poslovanje
sv: Ekonomi
te: బిజినెస్
th: ธุรกิจ
tr: İş
uk: Бізнес
ur: کاروبار
uz: Biznes
vi: Kinh doanh
zh_hk: 商業
zu: Ibhizinisi

# demoSharedXAxisArtsAndCraftsCourseTitle
source: Arts & Crafts
af: Kuns en kunsvlyt
am: ስነ ጥበባት እና ዕደ ጥበባት
ar_eg: فنون وأعمال حِرَفية
as: কলা আৰু হস্তশিল্প
az: İncəsənət və Sənətkarlıq
be: Мастацтва і рамёствы
bn: আর্ট অ্যান্ড ক্র্যাফট
bs: Umjetnost i zanati
ca: Arts i treballs manuals
da: Kunsthåndværk
es_ar: Artes y manualidades
et: Kunst ja käsitöö
eu: Eskulanak
fa: هنر و صنایع‌دستی
fil: Sining at Craft
fr_ca: Arts et artisanat
gl: Artesanía
gu: કળા અને હસ્તકળા
he: יצירה ומלאכה
hi: कला और शिल्प
hu: Kézművesség
hy: Արվեստ և արհեստներ
id: Seni & Kerajinan
it: Arti e artigianato
ja: 美術工芸
ka: ხელოვნება და ხელობა
km: សិល្បៈ និងសិប្បកម្ម
kn: ಕಲೆ ಮತ್ತು ಕರಕುಶಲತೆ
ko: 예술 및 공예
ky: Өнөр жана устачылык
lo: ສິນລະປະ ແລະ ງານສີມື
lt: Menai ir amatai
lv: Māksla un amatniecība
mk: Уметност и ракотворби
ml: കരകൗശല വിദ്യകൾ
mn: Урлаг, гар урлал
mr: कला आणि हस्तकला
ms: Seni & Pertukangan
my: အနုပညာနှင့် လက်မှုပညာများ
nb: Kunst og håndverk
ne: कला र शिल्पकला
pa: ਕਲਾ ਅਤੇ ਸ਼ਿਲਪਕਾਰੀ
pl: Sztuka i rzemiosło
pt: Artes e artesanatos
pt_pt: Artesanato
ro: Artă și artizanat
ru: Искусство и ремесла
si: කලා ශිල්ප
sk: Umenie a remeslá
sq: Vepra arti dhe artizanati
sr: Уметност и занати
sr_latn: Umetnost i zanati
sv: Konst och hantverk
te: కళలు & నైపుణ్యాలు
th: ศิลปะและหัตถกรรม
tr: Sanat ve El Sanatları
uk: Мистецтво та ремесла
ur: آرٹس اور کرافٹس
uz: Sanʼat va hunarmandchilik
vi: Thủ công và mỹ nghệ
zh_hk: 藝術與手工藝
zu: Ubuciko nokwakha

# demoMotionPlaceholderSubtitle
source: Secondary text
af: Sekondêre teks
am: ሁለተኛ ጽሁፍ
ar_eg: نص ثانوي
as: গৌণ পাঠ
az: İkinci dərəcəli mətn
be: Другасны тэкст
bn: সেকেন্ডারি টেক্সট
bs: Sekundarni tekst
ca: Text secundari
da: Sekundær tekst
es_ar: Texto secundario
et: Teisene tekst
eu: Bigarren lerroko testua
fa: متن ثانویه
fil: Pangalawang text
fr_ca: Texte secondaire
gl: Texto secundario
gu: ગૌણ ટેક્સ્ટ
he: טקסט משני
hi: सबटाइटल टेक्स्ट
hu: Másodlagos szöveg
hy: Լրացուցիչ տեքստ
id: Teks sekunder
it: Testo secondario
ja: サブテキスト
ka: დამხმარე ტექსტი
km: អក្សររត់
kn: ದ್ವಿತೀಯ ಹಂತದ ಪಠ್ಯ
ko: 보조 텍스트
ky: Кошумча текст
lo: ຂໍ້ຄວາມສຳຮອງ
lt: Antrinis tekstas
lv: Sekundārais teksts
mk: Секундарен текст
ml: ദ്വിതീയ ടെക്‌സ്‌റ്റ്
mn: Хоёр дахь мөрний текст
mr: दुय्यम मजकूर
ms: Teks sekunder
my: ဒုတိယစာသား
nb: Sekundær tekst
ne: सबटाइटलको पाठ
pa: ਸੈਕੰਡਰੀ ਲਿਖਤ
pl: Tekst dodatkowy
pt: Texto secundário
pt_pt: Texto secundário
ro: Text secundar
ru: Дополнительный текст
si: ද්විතියික පෙළ
sk: Sekundárny text
sq: Teksti dytësor
sr: Секундарни текст
sr_latn: Sekundarni tekst
sv: Sekundär text
te: రెండవ టెక్స్ట్
th: ข้อความรอง
tr: İkincil metin
uk: Другорядний текст
ur: ثانوی ٹیکسٹ
uz: Qoʻshimcha matn
vi: Văn bản thứ cấp
zh_hk: 次行文字
zu: Umbhalo wesibili

# demoFadeScaleAlertDialogCancelButton
source: CANCEL
af: KANSELLEER
am: ይቅር
ar_eg: إلغاء
as: বাতিল কৰক
az: LƏĞV EDİN
be: СКАСАВАЦЬ
bn: বাতিল করুন
bs: OTKAŽI
ca: CANCEL·LA
da: ANNULLER
es_ar: CANCELAR
et: TÜHISTA
eu: UTZI
fa: لغو
fil: KANSELAHIN
fr_ca: ANNULER
gl: CANCELAR
gu: રદ કરો
he: ביטול
hi: रद्द करें
hu: MÉGSE
hy: ՉԵՂԱՐԿԵԼ
id: BATAL
it: ANNULLA
ja: キャンセル
ka: გაუქმება
km: បោះបង់
kn: ರದ್ದುಮಾಡಿ
ko: 취소
ky: ЖОККО ЧЫГАРУУ
lo: ຍົກເລີກ
lt: ATŠAUKTI
lv: ATCELT
mk: ОТКАЖИ
ml: റദ്ദാക്കുക
mn: ЦУЦЛАХ
mr: रद्द करा
ms: BATAL
my: ပယ်ရန်
nb: AVBRYT
ne: रद्द गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: ANULUJ
pt: CANCELAR
pt_pt: CANCELAR
ro: ANULAȚI
ru: ОТМЕНА
si: අවලංගු කරන්න
sk: ZRUŠIŤ
sq: ANULO
sr: ОТКАЖИ
sr_latn: OTKAŽI
sv: AVBRYT
te: రద్దు చేయండి
th: ยกเลิก
tr: İPTAL
uk: СКАСУВАТИ
ur: منسوخ کریں
uz: BEKOR QILISH
vi: HỦY
zh_hk: 取消
zu: KHANSELA

# demoFadeScaleAlertDialogHeader
source: Alert Dialog
af: Waarskuwingdialoog
am: የማንቂያ ንግግር
ar_eg: مربّع حوار تنبيه
as: সতৰ্কতা সম্পৰ্কীয় ডায়লগ
az: Xəbərdarlıq dialoqu
be: Дыялогавае акно абвесткі
bn: সতর্কতা ডায়ালগ
bs: Dijaloški okvir upozorenja
ca: Quadre de diàleg d'alerta
da: Underretningsdialogboks
es_ar: Cuadro de diálogo de alerta
et: Märguande dialoogiaken
eu: Alerta-leihoa
fa: گفتگوی هشدار
fil: Dialog ng Alerto
fr_ca: Boîte de dialogue d'alerte
gl: Diálogo da alerta
gu: ચેતવણી સંવાદ
he: תיבת דו-שיח של התראה
hi: अलर्ट डायलॉग
hu: Értesítés párbeszédpanele
hy: Երկխոսության պատուհան՝ ծանուցումով
id: Dialog Notifikasi
it: Finestra di avviso
ja: アラート ダイアログ
ka: გაფრთხილების დიალოგური ფანჯარა
km: ប្រអប់​ជូនដំណឹង
kn: ಎಚ್ಚರಿಕೆ ಸಂವಾದ
ko: 알림 대화상자
ky: Шашылыш билдирүү диалогу
lo: ກ່ອງໂຕ້ຕອບການແຈ້ງເຕືອນ
lt: Įspėjimo dialogo langas
lv: Brīdinājuma dialoglodziņš
mk: Дијалог на предупредување
ml: മുന്നറിയിപ്പ് ഡയലോഗ്
mn: Сэрэмжлүүлгийн харилцах цонх
mr: सूचना डायलॉग
ms: Dialog Makluman
my: သတိပေး ဒိုင်ယာလော့
nb: Varseldialog
ne: अलर्टसम्बन्धी डायलग
pa: ਸੁਚੇਤਨਾ ਵਿੰਡੋ
pl: Okno alertu
pt: Caixa de diálogo de alerta
pt_pt: Caixa de diálogo de alerta
ro: Casetă de dialog de tip alertă
ru: Диалоговое окно с оповещением
si: ඇඟවීමේ සංවාදය
sk: Dialógové okno upozornenia
sq: Dialogu i alarmit
sr: Дијалог обавештења
sr_latn: Dijalog obaveštenja
sv: Varningsdialogruta
te: అలర్ట్ డైలాగ్
th: กล่องโต้ตอบการแจ้งเตือน
tr: Uyarı İletişim Kutusu
uk: Діалогове вікно сповіщення
ur: الرٹ ڈائیلاگ
uz: Ogohlantiruvchi muloqot oynasi
vi: Hộp thoại thông báo
zh_hk: 警示對話框
zu: Xwayisa Ibhokisi

# demoFadeScaleHideFabButton
source: HIDE FAB
af: VERSTEEK FAB
am: FAB ደብቅ
ar_eg: إخفاء زر الإجراء الرئيسي (FAB)
as: FAB লুকুৱাওক
az: FAB GİZLƏDİLSİN
be: СХАВАЦЬ РУХОМУЮ КНОПКУ ДЗЕЯННЯ
bn: ফ্যাব লুকান
bs: SAKRIJ FAB
ca: AMAGA EL BAF
da: SKJUL FAB
es_ar: OCULTAR BAF
et: PEIDA FAB
eu: EZKUTATU EKINTZA-BOTOI GAINERAKORRA
fa: پنهان کردن دکمه کنش شناور
fil: ITAGO ANG FAB
fr_ca: MASQUER LE BOUTON FLOTTANT D'ACTION
gl: OCULTAR BOTÓN DE ACCIÓN FLOTANTE
gu: ફેબ છુપાવો
he: הסתרת FAB
hi: एफ़एबी छिपाएं
hu: LEBEGŐ MŰVELETGOMB ELREJTÉSE
hy: ԹԱՔՑՆԵԼ ԳՈՐԾՈՂՈՒԹՅԱՆ ԼՈՂԱՑՈՂ ԿՈՃԱԿԸ
id: SEMBUNYIKAN FAB
it: NASCONDI FAB
ja: FAB を非表示
ka: მოქმედების მოლივლივე ღილაკის დამალვა
km: លាក់ FAB
kn: FAB ಅನ್ನು ಮರೆಮಾಡಿ
ko: FAB 숨기기
ky: КАБ'ДЫ ЖАШЫРУУ
lo: ເຊື່ອງ FAB
lt: SLĖPTI „FAB“
lv: PASLĒPT PELDOŠO DARBĪBAS POGU
mk: СОКРИЈ ЛЕБДЕЧКО КОПЧЕ ЗА ДЕЈСТВО
ml: FAB മറയ്ക്കുക
mn: FAB-Г НУУХ
mr: फॅब लपवा
ms: SEMBUNYIKAN FAB
my: FAB ဖျောက်ရန်
nb: SKJUL SVEVENDE HANDLINGSKNAPP
ne: FAB लुकाउनुहोस्
pa: FAB ਲੁਕਾਓ
pl: UKRYJ FAB
pt: OCULTAR FAB
pt_pt: OCULTAR BAF
ro: ASCUNDEȚI FAB
ru: СКРЫТЬ ПЛАВАЮЩУЮ КНОПКУ ДЕЙСТВИЯ
si: FAB සඟවන්න
sk: SKRYŤ PLÁVAJÚCE TLAČIDLO AKCIE
sq: FSHIH FAB
sr: САКРИЈ ПЛУТАЈУЋЕ ДУГМЕ ЗА РАДЊУ
sr_latn: SAKRIJ PLUTAJUĆE DUGME ZA RADNJU
sv: DÖLJ FLYTANDE ÅTGÄRDSKNAPP
te: FABని దాచు
th: ซ่อน FAB
tr: FAB'I GİZLE
uk: СХОВАТИ ПЛАВАЮЧУ КОМАНДНУ КНОПКУ
ur: FAB چھپائیں
uz: SUZUVCHI HARAKAT TUGMASINI BERKITISH
vi: ẨN NÚT HÀNH ĐỘNG NỔI
zh_hk: 隱藏懸浮動作
zu: FIHLA I-FAB

# demoFadeScaleShowFabButton
source: SHOW FAB
af: WYS FAB
am: FAB አሳይ
ar_eg: إظهار زر الإجراء الرئيسي (FAB)
as: FAB দেখুৱাওক
az: FAB GÖSTƏRİLSİN
be: ПАКАЗАЦЬ РУХОМУЮ КНОПКУ ДЗЕЯННЯ
bn: ফ্যাব দেখুন
bs: PRIKAŽI FAB
ca: MOSTRA EL BAF
da: VIS FAB
es_ar: MOSTRAR BAF
et: KUVA FAB
eu: ERAKUTSI EKINTZA-BOTOI GAINERAKORRA
fa: نمایش دکمه کنش شناور
fil: IPAKITA ANG FAB
fr_ca: AFFICHER LE BOUTON FLOTTANT D'ACTION
gl: MOSTRAR BOTÓN DE ACCIÓN FLOTANTE
gu: ફેબ બતાવો
he: הצגת FAB
hi: एफ़एबी दिखाएं
hu: LEBEGŐ MŰVELETGOMB MEGJELENÍTÉSE
hy: ՑՈՒՑԱԴՐԵԼ ԳՈՐԾՈՂՈՒԹՅԱՆ ԼՈՂԱՑՈՂ ԿՈՃԱԿԸ
id: TAMPILKAN FAB
it: MOSTRA FAB
ja: FAB を表示
ka: მოქმედების მოლივლივე ღილაკის ჩვენება
km: បង្ហាញ FAB
kn: FAB ತೋರಿಸಿ
ko: FAB 표시
ky: КАБ'ДЫ КӨРСӨТҮҮ
lo: ສະແດງ FAB
lt: RODYTI „FAB“
lv: RĀDĪT PELDOŠO DARBĪBAS POGU
mk: ПРИКАЖИ ЛЕБДЕЧКО КОПЧЕ ЗА ДЕЈСТВО
ml: FAB കാണിക്കുക
mn: FAB-Г ХАРУУЛАХ
mr: फॅब दाखवा
ms: TUNJUKKAN FAB
my: FAB ပြရန်
nb: VIS SVEVENDE HANDLINGSKNAPP
ne: FAB देखाउनुहोस्
pa: FAB ਦਿਖਾਓ
pl: POKAŻ FAB
pt: MOSTRAR FAB
pt_pt: MOSTRAR BAF
ro: AFIȘAȚI FAB
ru: ПОКАЗАТЬ ПЛАВАЮЩУЮ КНОПКУ ДЕЙСТВИЯ
si: FAB පෙන්වන්න
sk: ZOBRAZIŤ PLÁVAJÚCE TLAČIDLO AKCIE
sq: SHFAQ FAB
sr: ПРИКАЖИ ПЛУТАЈУЋЕ ДУГМЕ ЗА РАДЊУ
sr_latn: PRIKAŽI PLUTAJUĆE DUGME ZA RADNJU
sv: VISA FLYTANDE ÅTGÄRDSKNAPP
te: FABని చూపించు
th: แสดง FAB
tr: FAB'I GÖSTER
uk: ПОКАЗАТИ ПЛАВАЮЧУ КОМАНДНУ КНОПКУ
ur: FAB دکھائیں
uz: SUZUVCHI HARAKAT TUGMASINI CHIQARISH
vi: HIỆN NÚT HÀNH ĐỘNG NỔI
zh_hk: 顯示懸浮動作
zu: BONISA I-FAB

# demoFadeScaleShowAlertDialogButton
source: SHOW MODAL
af: WYS MODAAL
am: ሞዳል አሳይ
ar_eg: إظهار مربّع حوار مشروط
as: মডেল দেখুৱাওক
az: MODAL GÖSTƏRİLSİN
be: ПАКАЗАЦЬ МАДАЛЬНАЕ АКНО
bn: মোডাল দেখুন
bs: PRIKAŽI MODAL
ca: MOSTRA EL MODAL
da: VIS MODAL
es_ar: MOSTRAR CUADRO
et: KUVA MODAALNE
eu: ERAKUTSI LEIHO GAINERAKORRA
fa: نمایش مودال
fil: IPAKITA ANG MODAL
fr_ca: AFFICHER LA BOÎTE DE DIALOGUE MODALE
gl: MOSTRAR MODAL
gu: મોડલ બતાવો
he: הצגת מודאל
hi: अलर्ट दिखाएं
hu: MODÁLIS ABLAK MEGJELENÍTÉSE
hy: ՑՈՒՑԱԴՐԵԼ ՄՈԴԱԼ ՊԱՏՈՒՀԱՆԸ
id: TAMPILKAN MODAL
it: MOSTRA MODALITÀ
ja: モーダルを表示
ka: მოდალურის ჩვენება
km: បង្ហាញ​ម៉ូដល
kn: ಮೋಡಲ್ ತೋರಿಸಿ
ko: 모달 표시
ky: МОДАЛДЫК ДИАЛОГДУ КӨРСӨТҮҮ
lo: ສະແດງ
lt: RODYTI MODALINĮ
lv: RĀDĪT MODĀLO LODZIŅU
mk: ПРИКАЖИ МОДАЛНИ
ml: മോഡൽ കാണിക്കുക
mn: ЗАЙЛШГҮЙ ХАРИЛЦАХ ЦОНХЫГ ХАРУУЛАХ
mr: मोडल दाखवा
ms: TUNJUKKAN MODAL
my: MODAL ပြရန်
nb: VIS MODAL
ne: अलर्ट देखाउनुहोस्
pa: ਮਾਡਲ ਦਿਖਾਓ
pl: POKAŻ MODALNE
pt: MOSTRAR MODAL
pt_pt: MOSTRAR MODAL
ro: AFIȘAȚI MODALUL
ru: ПОКАЗАТЬ МОДАЛЬНОЕ ОКНО
si: MODAL පෙන්වන්න
sk: ZOBRAZIŤ MODÁLNE DIALÓGOVÉ OKNO
sq: SHFAQ MODAL
sr: ПРИКАЖИ ИСКАЧУЋИ ПРОЗОР
sr_latn: PRIKAŽI ISKAČUĆI PROZOR
sv: VISA MODALT ARK
te: మోడల్‌ను చూపించు
th: แสดงรูปแบบ
tr: KALICI İLETİŞİM KUTUSUNU GÖSTER
uk: ПОКАЗАТИ МОДАЛЬНЕ ВІКНО
ur: ماڈل دکھائیں
uz: MODAL OYNANI CHIQARISH
vi: HIỆN HỘP THOẠI
zh_hk: 顯示模態框
zu: BONISA I-MODAL

# demoFadeScaleDescription
source: The fade pattern is used for UI elements that enter or exit within the bounds of the screen, such as a dialog that fades in the center of the screen.
af: Die doofpatroon word gebruik vir UI-elemente wat binne die grense van die skerm inkom of uitgaan, soos 'n dialoog wat in die middel van die skerm verdof.
am: የአደብዝዝ ስርዓተ-ጥለት እንደ ወደ የማያ ገጹ መሃል የሚደበዝዝ መገናኛ ላሉ በማያ ገጹ ወሰን ውስጥ ለሚገቡ ወይም ለሚወጡት ዩአይ ክፍለ-አካላት ያገለግላል።
ar_eg: يتم استخدام نمط التلاشي مع عناصر واجهة المستخدم التي تدخل في حدود الشاشة أو تخرج منها، مثلاً مربّع حوار يتلاشى في مركز الشاشة.
as: অনুজ্জ্বল আৰ্হিটো স্ক্ৰীনখনৰ মাজভাগত অনুজ্জ্বল হৈ পৰা এটা ডায়লগৰ দৰে স্ক্ৰীনৰ সীমাৰ ভিতৰত ওলোৱা সোমোৱা কৰা ইউআই উপাদানসমূহৰ বাবে ব্যৱহাৰ কৰা হয়।
az: Solğunlaşma modeli ekranın mərkəzində solğunlaşan dialoq kimi ekran hüdudlarına daxil olan və ya çıxan UI elementləri üçün istifadə edilir.
be: Шаблон затухання выкарыстоўваецца для элементаў карыстальніцкага інтэрфейсу, якія з'яўляюцца ці знікаюць у межах экрана, напрыклад для дыялогавага акна, якое затухае ў цэнтры экрана.
bn: UI এলিমেন্টের জন্য 'বরাবর অস্পষ্ট' প্যাটার্ন ব্যবহার করা হয় সেটি স্ক্রিনের ডিসপ্লের মধ্যে প্রবেশ করে অথবা বেরিয়ে যায়, যেমন একটি ডায়লগ যেটি স্ক্রিনের মাঝখানে অস্পষ্ট হয়ে যায়।
bs: Obrazac iščezavanja se koristi za elemente korisničkog interfejsa koji ulaze unutar granica ekrana ili izlaze izvan njih, kao što je dijaloški okvir koji iščezava na sredini ekrana.
ca: El patró d'atenuació s'utilitza en elements de la IU que s'obren o es tanquen dins dels límits de la pantalla, com ara un quadre de diàleg que s'atenua al centre de la pantalla.
da: Mønsteret for fortoning anvendes til brugerfladeelementer, der åbner eller lukker inden for skærmen, f.eks. en dialogboks der fortones midt på skærmen.
es_ar: El patrón de atenuación se usa para los elementos de la IU que entran o salen dentro de los límites de la pantalla, como un diálogo que se atenúa en el centro de ella.
et: Hajutusmustrit kasutatakse kasutajaliidese elementide puhul, mis ilmuvad või kaovad ekraanikuva piires, nagu dialoog, mis hajub ekraanikuva keskosas sisse.
eu: Pantailaren ertzean sartzen edo ertzetik ateratzen diren erabiltzaile-interfazeko elementuetarako erabiltzen da apurka desagertzearen eredua; adibidez, pantailaren erdialdean apurka desagertzen den leiho bat.
fa: الگوی محو کردن برای عناصر رابط کاربری‌ای استفاده می‌شود که در محدوده صفحه‌نمایش وارد یا از آن خارج می‌شوند، مثل کادر گفتگویی که در مرکز صفحه محو می‌شود.
fil: Ginagamit ang fade pattern para sa mga element ng UI na pumapasok o lumalabas sa mga hangganan ng screen, gaya ng dialog na nagfe-fade sa gitna ng screen.
fr_ca: Le motif d'atténuation est utilisé pour les éléments d'IU qui apparaissent et disparaissent dans limites de l'écran, comme une boîte de dialogue au centre de l'écran.
gl: O padrón de atenuación utilízase para elementos da IU que entran ou saen do límite da pantalla, como un cadro de diálogo que se atenúa no centro da pantalla.
gu: ફેડ પૅટર્નનો ઉપયોગ તેવા UI ઘટકો માટે થાય છે કે જે સ્ક્રીનની સીમામાં અંદર જાય છે અથવા બહાર નીકળે છે, જેમ કે એક સંવાદ જે સ્ક્રીનના કેંદ્રમાં ફેડ થાય છે.
he: הדפוס 'להפוך לשקוף בהדרגה' משמש לרכיבי ממשק משתמש שנכנסים ממסגרת גבולות המסך או נכנסים אליהם, למשל תיבת דו-שיח שמתעמעמת במרכז המסך.
hi: फ़ेड वाला पैटर्न, उन यूज़र इंटरफ़ेस (यूआई) एलिमेंट के लिए इस्तेमाल किया जाता है जो स्क्रीन की सीमाओं के अंदर ही दिखते हैं और फिर गायब हो जाते हैं. जैसे कि एक डायलॉग जो स्क्रीन के बीचों-बीच दिखता है और फिर गायब हो जाता है.
hu: A halványítás mintát olyan UI-elemek esetén használja a rendszer, amelyek a képernyő határain belül lépnek be vagy ki (például a képernyő közepén elhalványuló párbeszédablak esetén).
hy: Այս էֆեկտն օգտագործվում է միջերեսի այն տարրերի համար, որոնք հայտնվում կամ անհետանում են էկրանի սահմաններում։ Օրինակ՝ երկխոսության պատուհանը, որը հայտնվում, այնուհետև անհետանում է էկրանի կենտրոնում։
id: Pola memperjelas digunakan untuk elemen UI yang masuk atau keluar dan masih dalam garis batas layar, misalnya dialog yang memperjelas di tengah layar.
it: Il pattern di dissolvenza viene utilizzato per gli elementi UI che entrano o escono dalle estremità della schermata, ad esempio una finestra di dialogo che si dissolve nel centro dello schermo.
ja: フェード パターンは、画面の中央でフェードするダイアログなど、画面の境界内で出入りする UI 要素に使用します。
ka: მილევის ნიმუში გამოიყენება UI-ის იმ ელემენტებს შორის გადასვლისთვის, რომლებიც შემოდის ან გადის ეკრანის კიდეების ფარგლებში, მაგალითად, დიალოგური ფანჯარა, რომელიც ეკრანის ცენტრში მიილევა.
km: លំនាំ​លេចឡើង​ត្រូវបានប្រើ​សម្រាប់ធាតុ UI ដែល​លេចឡើង ឬរសាត់បាត់​នៅក្នុងព្រំដែននៃ​អេក្រង់ដូចជា ប្រអប់ដែល​លេចឡើង​នៅកណ្ដាល​អេក្រង់ជាដើម។
kn: ಸ್ಕ್ರೀನ್ ಪರಿಧಿಯಲ್ಲಿ ಪ್ರವೇಶಿಸುವ ಅಥವಾ ನಿರ್ಗಮಿಸುವ UI ಅಂಶಗಳಿಗೆ ಫೇಡ್ ಪ್ಯಾಟರ್ನ್ ಅನ್ನು ಬಳಸಲಾಗುತ್ತದೆ, ಉದಾಹರಣೆಗೆ ಸ್ಕ್ರೀನ್‌ನ ಮಧ್ಯದಲ್ಲಿ ಮಸುಕಾಗುವ ಡೈಲಾಗ್.
ko: 페이드 패턴은 화면 중앙에서 점점 뚜렷해지며 나타나는 대화상자와 같이 화면 경계 내에서 나타나거나 사라지는 UI 요소에 사용됩니다.
ky: Бозоруу шаблону экрандын чегинин ичиндеги колдонуучу интерфейсинин кирүүчү же чыгуучу элементтери үчүн колдонулат. Мисалы, экрандын борборундагы өңү бозоруп барып көрүнбөй калган диалог.
lo: ຮູບແບບຈາງແມ່ນໃຊ້ສຳລັບອົງປະກອບສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ທີ່ເຂົ້າ ຫຼື ອອກພາຍໃນຂອບຂອງໜ້າຈໍ ເຊັ່ນ: ກ່ອງໂຕ້ຕອບທີ່ຈາງເຂົ້າໄປທາງກາງຂອງຈໍ.
lt: Išblukimo šablonas naudojamas NS elementams, kurie patenka į ekrano ribas ar už jų, pvz., dialogo langui, kuris išblunka ekrano centre.
lv: Pakāpeniskas parādīšanās/izzušanas formu izmanto lietotāja saskarnes elementiem, kas parādās vai pazūd ekrāna robežās, piemēram, dialoglodziņam, kas pakāpeniski parādās ekrāna vidū.
mk: Шемата на избледување се користи за елементи на корисничкиот интерфејс што влегуваат или излегуваат од границите на екранот, како дијалог што избледува во центарот на екранот.
ml: സ്ക്രീനിന്റെ മധ്യത്തിൽ വന്ന് ക്രമേണ മങ്ങിപ്പോകുന്ന ഡയലോഗ് ബോക്‌സ് പോലെ, സ്ക്രീൻ പരിധിക്കുള്ളിൽ ചേരുകയും പുറത്ത് പോകുകയും ചെയ്യുന്ന UI ഘടകങ്ങൾക്കായാണ് ഫേഡ് പാറ്റേൺ ഉപയോഗിക്കുന്നത്.
mn: Уусах загварыг дэлгэцийн төвд уусдаг харилцах цонх зэрэг дэлгэцийн хүрээ хооронд орж, гардаг UI элементүүдэд ашигладаг.
mr: फेड पॅटर्न हा स्क्रीनच्या सीमेमध्ये येणाऱ्या किंवा त्याच्या बाहेर जाणाऱ्या UI घटकांसाठी वापरला जातो जसे की, स्क्रीनच्या मध्यभागी फेड होणारा डायलॉग.
ms: Corak lenyap digunakan untuk elemen UI yang masuk atau keluar dalam sempadan skrin, seperti dialog yang lenyap di tengah-tengah skrin.
my: မှိန်သွားသောပုံစံကို ဖန်သားပြင်အလယ်တွင် မှိန်သွားသော ဒိုင်ယာလော့ဂ်တစ်ခုကဲ့သို့ ဖန်သားပြင်၏ဘောင်များအတွင်း ဝင်သော သို့မဟုတ် ထွက်သော UI အစိတ်အပိုင်းများအတွက် အသုံးပြုသည်။
nb: Uttoningsmønsteret brukes for elementer i brukergrensesnittet som går inn eller ut innenfor grensene på skjermen, for eksempel dialoger som toner ut midt på skjermen.
ne: फेड प्याटर्न स्क्रिनको फ्रेमभित्र देखा पर्ने तथा बिलाउने UI एलिमेन्टहरूका लागि प्रयोग गरिन्छ। स्क्रिनको मध्य भागमा देखा परी आफै बिलाउने डायलग त्यस्तो UI एलिमेन्टको एउटा उदाहरण हो।
pa: ਫੇਡ ਪੈਟਰਨ ਨੂੰ ਅਜਿਹੇ UI ਤੱਤਾਂ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਸਕ੍ਰੀਨ ਦੀਆਂ ਸੀਮਾਵਾਂ ਵਿੱਚ ਦਾਖਲ ਜਾਂ ਬਾਹਰ ਨਿਕਲਦੇ ਹਨ, ਜਿਵੇਂ ਕਿ ਅਜਿਹੀ ਵਿੰਡੋ ਜੋ ਸਕ੍ਰੀਨ ਦੇ ਵਿਚਕਾਰ ਫੇਡ ਹੁੰਦੀ ਹੈ।
pl: Wzorzec Zanikanie jest przeznaczony dla elementów interfejsu, które pojawiają się lub znikają na ekranie, na przykład okien dialogowych pojawiających się na środku ekranu.
pt: O padrão de esmaecimento é usado para elementos da IU dentro ou fora dos limites da tela, como uma caixa de diálogo que é esmaecida no centro da visualização.
pt_pt: O padrão desvanecer é utilizado para elementos da IU que entram ou saem dos limites do ecrã, como uma caixa de diálogo que se desvanece no centro do ecrã.
ro: Modelul de afișare gradată/estompare este folosit pentru elemente IU care se afișează sau dispar în limitele ecranului, de exemplu, o casetă de dialog care dispare treptat în centrul ecranului.
ru: Этот эффект используется для элементов пользовательского интерфейса, которые появляются или исчезают в пределах экрана. Пример: диалоговое окно, которое возникает, а затем пропадает в центре экрана.
si: මැකී යාමේ රටාව භාවිතා කරනුයේ තිරයේ මායිම් තුළට ඇතුළු වන හෝ පිටවන UI මූලාංග සඳහාය, එනම් තිරය මධ්‍යයේ මැකී යන සංවාදයක් වැනි ඒවාය.
sk: Vzor miznutia sa používa v prípade prvkov používateľského rozhrania, ktoré sa zobrazujú alebo miznú niekde na obrazovke. Môže to byť napríklad dialógové okno, ktoré postupne zmizne v strede obrazovky.
sq: Motivi i zbehjes përdoret për elementet e ndërfaqes së përdoruesit që hyjnë ose dalin brenda kufijve të ekranit, si p.sh. një dialog që zbehet në qendër të ekranit.
sr: Шаблон постепеног појављивања и нестајања се користи за елементе корисничког система који се појављују или нестају унутар граница екрана, попут дијалога који се постепено појављује и нестаје у центру екрана.
sr_latn: Šablon postepenog pojavljivanja i nestajanja se koristi za elemente korisničkog sistema koji se pojavljuju ili nestaju unutar granica ekrana, poput dijaloga koji se postepeno pojavljuje i nestaje u centru ekrana.
sv: Mönstret med objekt som tonar in/ut används för element i användargränssnittet som kommer in på eller lämnar skärmen, t.ex. en dialogruta som tonar in mitt på skärmen.
te: స్క్రీన్ మధ్యలో మసకబారే డైలాగ్ వంటి, స్క్రీన్ యొక్క బౌండ్‌లలోకి ప్రవేశించే లేదా నిష్క్రమించే UI మూలకాల కోసం ఫేడ్ ఆకృతి ఉపయోగించబడుతుంది.
th: รูปแบบ "จางลง" ใช้กับองค์ประกอบ UI ที่เข้าหรือออกภายในขอบเขตหน้าจอ เช่นกล่องโต้ตอบที่จางลงตรงกลางของหน้าจอ
tr: Şeffaflaşan desen, ekranın ortasında kararan iletişim kutusu gibi ekran sınırları içine giren veya dışına çıkan kullanıcı arayüzü öğeleri için kullanılır.
uk: Стиль "Поява та зникнення" призначений для елементів інтерфейсу, які з'являються або зникають у межах екрана (наприклад, для діалогового вікна, яке з'являється в центрі екрана).
ur: فیڈ پیٹرن کا استعمال UI عناصر کے لیے کیا جاتا ہے جو اسکرین کی حدود کے اندر داخل یا خارج ہوتا ہے جیسے کہ ایک ڈائیلاگ جو اسکرین کے بیچ میں فیڈ ہو جاتا ہے۔
uz: Bu effekt ekran chetlarida paydo boʻladigan yoki yoʻqoladigan foydalanuvchi interfeysi elementlari uchun ishlatiladi.
vi: Mẫu làm mờ được dùng cho các thành phần giao diện người dùng đi vào hoặc thoát ra trong phạm vi màn hình, chẳng hạn như một hộp thoại mờ dần ở giữa màn hình.
zh_hk: 淡出模式用於進入或離開螢幕範圍的使用者介面元素，如在螢幕正中淡入的對話框。
zu: Iphethini yokufiphala isetshenziselwa ama-elementi e-UI angena noma aphuma ngaphakathi kwemikhawulo yesikrini, njengebhokisi elifiphala phakathi nendawo kusikrini.

# demoFadeScaleTitle
source: Fade
af: Doof
am: አደብዝዝ
ar_eg: التلاشي
as: অনুজ্জ্বল
az: Solğunlaşma
be: Затуханне
bn: অস্পষ্ট
bs: Iščezavanje
ca: Atenuació
da: Fortoning
es_ar: Atenuación
et: Hajutus
eu: Apurka desagertzea
fa: محو کردن
fr_ca: Atténuation
gl: Atenuar
gu: ઝાંખો
he: להפוך לשקוף בהדרגה
hi: फ़ेड
hu: Halványítás
hy: Սահուն հայտնվում կամ անհետացում
id: Memperjelas
it: Dissolvenza
ja: フェード
ka: მილევა
km: លេច​ឡើង
kn: ಫೇಡ್
ko: 페이드
ky: Бозоруу
lo: ຈາງ
lt: Išblukimas
lv: Pakāpeniska parādīšanās/izzušana
mk: Избледување
ml: ഫേഡ്
mn: Уусах
mr: फेड
ms: Lenyap
my: မှိန်ရန်
nb: Ton ut
ne: फेड
pa: ਫੇਡ
pl: Zanikanie
pt: Esmaecer
pt_pt: Desvanecer
ro: Afișare gradată/Estompare
ru: Плавное появление или исчезновение
si: මැකී යාම
sk: Miznutie
sq: Zbehje
sr: Постепено појављивање и нестајање
sr_latn: Postepeno pojavljivanje i nestajanje
sv: Tona in/ut
te: ఫేడ్
th: จางลง
tr: Şeffaflaştırma
uk: Поява та зникнення
ur: فیڈ
uz: Shaffoflashuv
vi: Làm mờ
zh_hk: 淡出
zu: Ukufiphala

# demoFadeThroughTextPlaceholder
source: 123 photos
af: 123 foto's
am: 123 ፎቶዎች
ar_eg: 123 صورة
as: ১২৩ খন ফট’
az: 123 foto
be: 123 фота
bn: ১২৩টি ফটো
bs: 123 fotografije
ca: 123 fotos
da: 123 billeder
es_ar: 123 fotos
et: 123 fotot
eu: 123 argazki
fa: ۱۲۳ عکس
fil: 123 larawan
gl: 123 fotos
gu: 123 ફોટા
he: 123 תמונות
hi: 123 फ़ोटो
hu: 123 fotó
hy: 123 լուսանկար
id: 123 foto
it: 123 foto
ja: 123 枚の写真
ka: 123 ფოტო
km: រូបថត 123 សន្លឹក
kn: 123 ಫೋಟೋಗಳು
ko: 사진 123장
ky: 123 сүрөттөр
lo: 123 ຮູບ
lt: 123 nuotraukos
lv: 123 fotoattēli
mk: 123 фотографии
ml: 123 ഫോട്ടോകൾ
mn: 123 зураг
mr: १२३ फोटो
ms: 123 foto
my: ဓာတ်ပုံ ၁၂၃ ပုံ
nb: 123 bilder
ne: १२३ वटा फोटो
pa: 123 ਫ਼ੋਟੋਆਂ
pl: 123 zdjęcia
pt: 123 fotos
pt_pt: 123 fotos
ro: 123 de fotografii
ru: 123 фотографии
si: ඡායාරූප 123
sk: 123 fotiek
sq: 123 fotografi
sr: 123 слике
sr_latn: 123 slike
sv: 123 foton
te: 123 ఫోటోలు
th: 123 รูปภาพ
tr: 123 fotoğraf
uk: 123 фотографії
ur: 123 تصاویر
uz: 123 ta surat
vi: 123 ảnh
zh_hk: 123 張相片
zu: izithombe eziyi-123
