Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoBottomNavigationDescription
source: Bottom navigation bars display three to five destinations at the bottom of a screen. Each destination is represented by an icon and an optional text label. When a bottom navigation icon is tapped, the user is taken to the top-level navigation destination associated with that icon.
af: Navigasiebalke aan die onderkant van die skerm wys drie tot vyf bestemmings. Elke bestemming word deur 'n ikoon en 'n opsionele teksetiket verteenwoordig. Wanneer 'n gebruiker op 'n onderste navigasie-ikoon tik, word hulle geneem na die topvlak-navigasiebestemming wat met daardie ikoon geassosieer word.
am: የግርጌ ዳሰሳ አሞሌዎች በአንድ ማያ ግርጌ ላይ ከሶስት እስከ አምስት መድረሻዎች ድረስ ያሳያሉ። እያንዳንዱ መድረሻ በአዶ እና በአማራጭ የጽሑፍ መሰየሚያ ይወከላል። የግርጌ ዳሰሳ አዶ መታ ሲደረግ ተጠቃሚው ከዚያ አዶ ጋር የተጎዳኘ የከፍተኛ ደረጃ የዳሰሳ መድረሻ ይወሰዳል።
ar_eg: تعرض أشرطة التنقل السفلية بين ثلاث وخمس وجهات في الجزء السفلي من الشاشة. ويتم تمثيل كل وجهة برمز ووسم نصي اختياري. عند النقر على رمز التنقل السفلي، يتم نقل المستخدم إلى وجهة التنقل ذات المستوى الأعلى المرتبطة بذلك الرمز.
as: একেবাৰে নিম্নাংশৰ নেভিগেশ্বন বাৰসমূহে স্ক্ৰীনখনৰ একেবাৰে নিম্নাংশত তিনিৰ পৰা পাঁচটা লক্ষ্যস্থান প্ৰদর্শন কৰে। প্ৰতিটো লক্ষ্যস্থানক এটা চিহ্ন আৰু এটা ঐচ্ছিক পাঠ লেবেলেৰে প্ৰতিনিধিত্ব কৰা হয়। একেবাৰে নিম্নাংশৰ এটা নেভিগেশ্বন চিহ্ন টিপিলে ব্যৱহাৰকাৰীজনক সেই চিহ্নটোৰ সৈতে জড়িত উচ্চ-স্তৰৰ নেভিগেশ্বনৰ লক্ষ্যস্থানটোলৈ লৈ যোৱা হয়।
az: Alt naviqasiya panelləri ekranın aşağısında üç-beş təyinat yeri göstərir. Hər bir təyinat yeri ikona və şərti mətn nişanı ilə təqdim edilir. Alt naviqasiya ikonasına toxunulduqda istifadəçi həmin ikona ilə əlaqələndirilən üst səviyyə naviqasiya təyinatına yönləndirilir.
be: На панэлях навігацыі ў ніжняй частцы экрана могуць змяшчацца ад трох да пяці элементаў. Кожны з іх мае значок і (неабавязкова) тэкставую метку. Націснуўшы значок на ніжняй панэлі, карыстальнік пяройдзе на элемент вышэйшага ўзроўню навігацыі, звязаны з гэтым значком.
bn: নিচের নেভিগেশন বার কোনও স্ক্রিনের নীচের দিকে তিন থেকে পাঁচটি গন্তব্য দেখায়। প্রতিটি গন্তব্য একটি আইকন এবং একটি এচ্ছিক টেক্সট লেবেল দিয়ে দেখানো হয়। নিচের নেভিগেশন আইকন ট্যাপ করা হলে, ব্যবহারকারীকে সেই আইকনের সাথে জড়িত একেবারে উপরের নেভিগেশন গন্তব্যে নিয়ে যাওয়া হয়।
bs: Donje navigacijske trake prikazuju tri do pet odredišta na dnu ekrana. Svako odredište predstavlja ikona i tekstualna oznaka koja nije obavezna. Kada korisnik dodirne ikonu donje navigacije, otvorit će se odredište navigacije na najvišem nivou povezano s tom ikonom.
ca: A les barres de navegació inferior es mostren entre tres i cinc destinacions. Cada destinació es representa amb una icona i una etiqueta de text opcional. En tocar una icona de la navegació inferior, es redirigirà l'usuari a la destinació de navegació de nivell superior associada amb la icona.
da: Navigationslinjer i bunden viser tre til fem destinationer nederst på en skærm. Hver destination er angivet med et ikon og en valgfri tekstetiket. Når der trykkes på et navigationsikon nederst på en skærm, føres brugeren til den overordnede navigationsdestination, der er knyttet til det pågældende ikon.
es_ar: Las barras de navegación inferiores muestran entre tres y cinco destinos en la parte inferior de la pantalla. Cada destino se representa con un ícono y una etiqueta de texto opcional. Cuando el usuario presiona un ícono de navegación inferior, se lo redirecciona al destino de navegación de nivel superior que está asociado con el ícono.
et: Alumisel navigeerimisribal kuvatakse ekraanikuva allservas 3–5 sihtkohta. Iga sihtkohta esindab ikoon ja valikuline tekstisilt. Alumise navigeerimisikooni puudutamisel suunatakse kasutaja selle ikooniga seotud ülatasemel navigeerimise sihtkohta.
eu: Beheko nabigazioak hiru eta bost helmuga artean bistaratzen ditu pantailaren beheko aldean. Ikono eta aukerako testu-etiketa bana ageri dira helmuga bakoitzeko. Beheko nabigazioko ikono bat sakatzean, ikono horri loturiko nabigazio-helmuga nagusira eramango da erabiltzailea.
fa: نوارهای پیمایش پایینی، سه تا پنج مقصد را در پایین صفحه‌نمایش نشان می‌دهند. هر مقصد با یک نماد و یک برچسب نوشتاری اختیاری نمایش داده می شود. هنگامی که روی نماد پیمایش پایانی ضربه می‌زنید، کاربر به مقصد پیمایش سطح بالایی که با آن نماد مرتبط است منتقل می‌شود.
fil: Nagpapakita ang mga navigation bar sa ibaba ng tatlo hanggang limang patutunguhan sa ibaba ng screen. Ang bawat patutunguhan ay kinakatawan ng isang icon at ng isang opsyonal na text na label. Kapag na-tap ang icon ng navigation sa ibaba, mapupunta ang user sa pinakamataas na antas na patutunguhan ng navigation na nauugnay sa icon na iyon.
fr_ca: Les barres de navigation inférieures affichent trois à cinq destinations au bas de l'écran. Chaque destination est représentée par une icône et une étiquette facultative. Lorsque l'utilisateur touche l'une de ces icônes, il est redirigé vers la destination de premier niveau associée à cette icône.
gl: As barras de navegación da parte inferior mostran entre tres e cinco destinos na parte inferior da pantalla. Cada destino represéntase mediante unha icona e unha etiqueta de texto opcional. Ao tocar unha icona de navegación da parte inferior, diríxese ao usuario ao destino de navegación de nivel superior asociado con esa icona.
gu: બોટમ નૅવિગેશન બાર સ્ક્રીનના તળિયે ત્રણથી પાંચ સ્થાન બતાવે છે. દરેક સ્થાન આઇકન અને વૈકલ્પિક ટેક્સ્ટ લેબલ દ્વારા દર્શાવાય છે. બોટમ નૅવિગેશન આઇકન પર ટૅપ કરવામાં આવે, ત્યારે વપરાશકર્તાને તે આઇકન સાથે સંકળાયેલા ટોચના સ્તરના નૅવિગેશન સ્થાન પર લઈ જવામાં આવે છે.
he: סרגלי ניווט תחתונים מציגים שלושה עד חמישה יעדים בחלק התחתון של מסך כלשהו. כל יעד מיוצג על ידי סמל ותווית טקסט אופציונלית. כשמשתמש מקיש על סמל ניווט תחתון, המשתמש מועבר ליעד הניווט ברמה העליונה שמשויך לסמל הזה.
hi: बॉटम नेविगेशन बार, ऐप्लिकेशन की तीन से पांच सुविधाओं के लिए स्क्रीन के निचले हिस्से पर शॉर्टकट दिखाता है. हर सुविधा को एक आइकॉन से दिखाया जाता है. इसके साथ टेक्स्ट लेबल भी हो सकता है. बॉटम नेविगेशन आइकॉन पर टैप करने से, उपयोगकर्ता उस आइकॉन की टॉप-लेवल नेविगेशन सुविधा पर पहुंच जाता है.
hu: Az alsó navigációs sávon három-öt célhely jelenik meg a képernyő alján. Minden egyes célhelyet egy ikon és egy nem kötelező szöveges címke jelöl. Amikor rákoppint egy alsó navigációs ikonra, a felhasználó az adott ikonhoz kapcsolódó legfelső szintű navigációs célhelyre kerül.
hy: Էկրանի ներքևի հատվածի նավիգացիայի գոտում կարող է տեղավորվել ծառայության երեքից հինգ բաժին։ Ընդ որում դրանցից յուրաքանչյուրը կունենա առանձին պատկերակ և տեքստ (պարտադիր չէ)։ Եթե օգտատերը սեղմի պատկերակներից որևէ մեկի վրա, ապա կանցնի համապատասխան բաժին։
id: Menu navigasi bawah menampilkan tiga hingga lima tujuan di bagian bawah layar. Tiap tujuan direpresentasikan dengan ikon dan label teks opsional. Jika ikon navigasi bawah diketuk, pengguna akan dialihkan ke tujuan navigasi tingkat teratas yang terkait dengan ikon tersebut.
it: Le barre di navigazione in basso mostrano da tre a cinque destinazioni nella parte inferiore dello schermo. Ogni destinazione è rappresentata da un'icona e da un'etichetta di testo facoltativa. Quando viene toccata un'icona di navigazione in basso, l'utente viene indirizzato alla destinazione di navigazione principale associata all'icona.
ja: 画面の下部には、ボトム ナビゲーション バーに 3～5 件の移動先が表示されます。各移動先はアイコンとテキストラベル（省略可）で表されます。ボトム ナビゲーション アイコンをタップすると、そのアイコンに関連付けられた移動先のトップレベルに移動します。
ka: ნავიგაციის ქვედა ზოლები ეკრანის ქვედა ნაწილში აჩვენებს სამიდან ხუთ დანიშნულების ადგილამდე. დანიშნულების თითოეული ადგილი წარმოდგენილია ხატულათი და არასვალდებულო ტექსტური ლეიბლით. ქვედა ნავიგაციის ხატულაზე შეხებისას მომხმარებელი გადადის ხატულასთან დაკავშირებულ ზედა დონის სამიზნე ნავიგაციაზე.
km: របាររុករក​ខាងក្រោម​បង្ហាញគោលដៅបីទៅប្រាំ​នៅខាងក្រោម​អេក្រង់។ គោលដៅនីមួយៗ​ត្រូវបានតំណាង​ដោយរូបតំណាង និងស្លាកអក្សរ​ជាជម្រើស។ នៅពេលចុច​រូបរុករកខាងក្រោម អ្នកប្រើប្រាស់ត្រូវបាន​នាំទៅគោលដៅ​រុករកផ្នែកខាងលើ ដែលពាក់ព័ន្ធ​នឹងរូបតំណាងនោះ។
kn: ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್ ಬಾರ್‌ಗಳು ಸ್ಕ್ರೀನ್‌ನ ಕೆಳಭಾಗದಲ್ಲಿ ಮೂರರಿಂದ ಐದು ತಲುಪಬೇಕಾದ ಸ್ಥಳಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತವೆ. ಪ್ರತಿಯೊಂದು ತಲುಪಬೇಕಾದ ಸ್ಥಳವನ್ನು ಐಕಾನ್ ಮತ್ತು ಐಚ್ಛಿಕ ಪಠ್ಯ ಲೇಬಲ್ ಪ್ರತಿನಿಧಿಸುತ್ತದೆ. ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್ ಐಕಾನ್ ಅನ್ನು ಟ್ಯಾಪ್ ಮಾಡಿದಾಗ, ಆ ಐಕಾನ್ ಜೊತೆಗೆ ಸಂಯೋಜಿತವಾಗಿರುವ ಉನ್ನತ ಮಟ್ಟದ ನ್ಯಾವಿಗೇಶನ್ ತಲುಪಬೇಕಾದ ಸ್ಥಳಕ್ಕೆ ಬಳಕೆದಾರರನ್ನು ಕರೆದೊಯ್ಯಲಾಗುತ್ತದೆ.
ko: 하단 탐색 메뉴는 화면 하단에 3~5개의 대상을 표시합니다. 각 대상은 아이콘과 텍스트 라벨(선택사항)로 표현됩니다. 하단 탐색 아이콘을 탭하면 아이콘과 연결된 최상위 탐색 대상으로 이동합니다.
ky: Ылдый жакта жайгашкан чабыттоо тилкелеринде экрандын ылдый жагында үчтөн бешке чейинки бара турган жерлер көрүнөт. Ар бир бара турган жердин сүрөтчөсү жана энбелгиде текст көрүнөт. Ылдый жактагы чабыттоо сүрөтчөсүн басканда колдонуучу ал сүрөтчө менен байланышкан жогорку деңгээлдеги бара турган жерге чабытталат.
lo: ແຖບນຳທາງທາງລຸ່ມສະແດງປາຍທາງ 3-5 ບ່ອນຢູ່ລຸ່ມຂອງໜ້າຈໍ. ປາຍທາງແຕ່ລະບ່ອນຈະສະແດງດ້ວຍໄອຄອນ ແລະ ປ້າຍກຳກັບແບບຂໍ້ຄວາມທີ່ບໍ່ບັງຄັບ. ເມື່ອຜູ້ໃຊ້ແຕະໃສ່ໄອຄອນນຳທາງທາງລຸ່ມແລ້ວ, ລະບົບຈະພາໄປຫາປາຍທາງຂອງການນຳທາງລະດັບເທິງສຸດທີ່ເຊື່ອມໂຍງກັບໄອຄອນນັ້ນ.
lt: Apatinėse naršymo juostose ekrano apačioje pateikiama nuo trijų iki penkių paskirties vietų. Kiekvieną paskirties vietą nurodo piktograma ir pasirenkama teksto etiketė. Palietęs apatinės naršymo juostos piktogramą, naudotojas patenka į pagrindinę su piktograma susietą naršymo paskirties vietą.
lv: Apakšējās navigācijas joslās ekrāna apakšdaļā tiek rādīti 3–5 galamērķi. Katrs galamērķis ir attēlots ar ikonu un papildu teksta iezīmi. Pieskaroties apakšējai navigācijas ikonai, lietotājs tiek novirzīts uz augšējā līmeņa navigācijas galamērķi, kas ir saistīts ar attiecīgo ikonu.
mk: Долните ленти за навигација прикажуваат три до пет дестинации најдолу на екранот. Секоја дестинација е прикажана со икона и со изборна текстуална етикета. Кога ќе допре долна икона за навигација, тоа го води корисникот до дестинацијата за навигација од највисоко ниво поврзана со таа икона.
ml: സ്‌ക്രീനിന്റെ ചുവടെ മൂന്ന് മുതൽ അഞ്ച് വരെ ലക്ഷ്യസ്ഥാനങ്ങൾ ബോട്ടം നാവിഗേഷൻ ബാറുകൾ പ്രദർശിപ്പിക്കുന്നു. ഓരോ ലക്ഷ്യസ്ഥാനവും ഐക്കൺ, ഓപ്ഷണൽ ടെക്സ്റ്റ് ലേബൽ എന്നിവയിലൂടെ പ്രതിനിധീകരിക്കപ്പെടുന്നു. ബോട്ടം നാവിഗേഷൻ ഐക്കൺ ടാപ്പ് ചെയ്യുമ്പോൾ, ഉപയോക്താവിനെ ആ ഐക്കണുമായി ബന്ധപ്പെട്ട ഉയർന്ന ലെവൽ നാവിഗേഷൻ ലക്ഷ്യസ്ഥാനത്തേക്ക് കൊണ്ടുപോകും.
mn: Доод навигацын самбар нь дэлгэцийн доод хэсэгт 3-5 очих газар үзүүлдэг. Очих газар бүрийг дүрс тэмдэг болон нэмэлт текстэн шошгоор илэрхийлдэг. Доод навигацын дүрс тэмдэг дээр товшсон үед хэрэглэгчийг тухайн дүрс тэмдэгтэй холбоотой дээд түвшний навигацын очих газарт аваачна.
mr: तळाचे नेव्हिगेशन बार स्क्रीनच्या तळाशी तीन ते पाच गंतव्यस्थाने दाखवतात. प्रत्येक गंतव्यस्थान आयकन आणि पर्यायी मजकूर लेबलने दर्शवलेले असते. तळाच्या नेव्हिगेशन आयकनवर टॅप केल्यावर, वापरकर्त्याला त्या आयकनशी संबद्ध असलेल्या उच्च स्तराच्या नेव्हिगेशन गंतव्यस्थानावर नेले जाते.
ms: Bar navigasi bawah menunjukkan tiga hingga lima destinasi di bahagian bawah skrin. Setiap destinasi diwakili oleh ikon dan label teks pilihan. Apabila ikon navigasi bawah diketik, pengguna dibawa ke destinasi navigasi tahap tinggi yang dikaitkan dengan ikon tersebut.
my: အောက်ခြေမီနူးပါ လမ်းညွှန်ဘားသည် သွားရောက်ရန်နေရာ သုံးခုမှ ငါးခုအထိ မျက်နှာပြင်၏ အောက်ခြေတွင် ဖော်ပြပေးသည်။ သွားရောက်ရန်နေရာတစ်ခုစီတွင် သင်္ကေတတစ်ခုစီရှိပြီး အညွှန်းပါနိုင်ပါသည်။ အောက်ခြေမီနူးပါ လမ်းညွှန်သင်္ကေတကို တို့လိုက်သည့်အခါ ၎င်းသင်္ကေတနှင့် ဆက်စပ်နေသည့် ထိပ်တန်းအဆင့် သွားရောက်ရန်နေရာတစ်ခုကို ဖွင့်ပေးပါသည်။
nb: Navigasjonsrader nederst viser tre til fem destinasjoner nederst på en skjerm. Hver destinasjon representeres av et ikon og en valgfri tekstetikett. Når brukeren trykker på et ikon i navigeringen nederst, kommer vedkommende til navigeringsmålet på toppnivå som er knyttet til ikonet.
ne: फेदका नेभिगेसन पट्टीहरूले स्क्रिनको फेदमा तीनदेखि पाँचवटा गन्तव्यहरू देखाउँछन्। प्रत्येक गन्तव्यलाई कुनै आइकन वा पाठका ऐच्छिक लेबलले इङ्गित गरिएको हुन्छ। प्रयोगकर्ताले फेदको कुनै नेभिगेसन आइकनमा ट्याप गर्दा उनलाई उक्त आइकनसँग सम्बद्ध शीर्ष स्तरको नेभिगेसन गन्तव्यमा लगिन्छ।
pa: ਹੇਠਲੀਆਂ ਦਿਸ਼ਾ-ਨਿਰਦੇਸ਼ ਪੱਟੀਆਂ ਤਿੰਨ ਤੋਂ ਪੰਜ ਮੰਜ਼ਿਲਾਂ ਨੂੰ ਸਕ੍ਰੀਨ ਦੇ ਹੇਠਾਂ ਦਿਖਾਉਂਦੀਆਂ ਹਨ। ਹਰੇਕ ਮੰਜ਼ਿਲ ਕਿਸੇ ਪ੍ਰਤੀਕ ਅਤੇ ਵਿਕਲਪਿਕ ਲਿਖਤ ਲੇਬਲ ਦੁਆਰਾ ਦਰਸਾਈ ਜਾਂਦੀ ਹੈ। ਜਦੋਂ ਹੇਠਲੇ ਨੈਵੀਗੇਸ਼ਨ ਪ੍ਰਤੀਕ 'ਤੇ ਕਲਿੱਕ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, ਤਾਂ ਵਰਤੋਂਕਾਰ ਨੂੰ ਉੱਚ-ਪੱਧਰ ਨੈਵੀਗੇਸ਼ਨ ਮੰਜ਼ਿਲ 'ਤੇ ਲਿਜਾਇਆ ਜਾਂਦਾ ਹੈ ਜੋ ਉਸ ਪ੍ਰਤੀਕ ਨਾਲ ਸੰਬੰਧਿਤ ਹੁੰਦਾ ਹੈ।
pl: Na paskach dolnej nawigacji u dołu ekranu może wyświetlać się od trzech do pięciu miejsc docelowych. Każde miejsce docelowe jest oznaczone ikoną i opcjonalną etykietą tekstową. Po kliknięciu ikony w dolnej nawigacji użytkownik jest przenoszony do związanego z tą ikoną miejsca docelowego w nawigacji głównego poziomu.
pt: As barras de navegação inferiores exibem de três a cinco destinos na parte inferior da tela. Cada destino é representado por um ícone e uma etiqueta de texto opcional. Quando um ícone de navegação da parte inferior é tocado, o usuário é levado para o nível superior do destino de navegação associado a esse ícone.
pt_pt: As barras de navegação inferiores apresentam três a cinco destinos na parte inferior de um ecrã. Cada destino é representado por um ícone e uma etiqueta de texto opcional. Ao tocar num ícone de navegação inferior, o utilizador é direcionado para o destino de navegação de nível superior associado a esse ícone.
ro: Barele de navigare din partea de jos afișează între trei și cinci destinații în partea de jos a ecranului. Fiecare destinație este reprezentată de o pictogramă și o etichetă cu text opțională. Când atinge o pictogramă de navigare din partea de jos, utilizatorul este direcționat la destinația de navigare principală asociată pictogramei respective.
ru: На панели навигации в нижней части экрана можно разместить от трех до пяти разделов. Каждый раздел представлен значком и может иметь текстовую надпись. Если пользователь нажмет на один из значков, то перейдет в соответствующий раздел верхнего уровня.
si: පහළ සංචාලන තීරු තිරයක පහළින්ම ගමනාන්ත තුනක් හෝ පහක් පෙන්වයි. එක් එක් ගමනාන්තය නිරූපකයක් සහ විකල්ප පෙළ ලේබලයක් මගින් නියෝජනය කෙරේ. පහළ සංචාලන නිරූපකයක් තට්ටු කළ විට, පරිශීලකයා එම නිරූපකය හා සම්බන්ධ ඉහළම මට්ටමේ සංචාලන ගමනාන්තයට ගෙන යනු ලැබේ.
sk: Dolné navigačné panely zobrazujú v dolnej časti obrazovky tri až päť cieľov. Každý cieľ prestavuje ikona a nepovinný textový štítok. Používateľ, ktorý klepne na ikonu dolnej navigácie, prejde do cieľa navigácie najvyššej úrovne, ktorá je s touto ikonou spojená.
sq: Shiritat e poshtëm të navigimit shfaqin tre deri në pesë destinacione në fund të një ekrani. Secili destinacion paraqitet nga një ikonë dhe një etiketë opsionale me tekst. Kur trokitet mbi një ikonë navigimi poshtë, përdoruesi dërgohet te destinacioni i navigimit të nivelit të lartë i shoqëruar me atë ikonë.
sr: Доња трака за навигацију приказује три до пет одредишта у дну екрана. Свако одредиште представљају икона и опционална текстуална ознака. Када корисник додирне доњу икону за навигацију, отвара се одредиште за дестинацију највишег нивоа које је повезано са том иконом.
sr_latn: Donja traka za navigaciju prikazuje tri do pet odredišta u dnu ekrana. Svako odredište predstavljaju ikona i opcionalna tekstualna oznaka. Kada korisnik dodirne donju ikonu za navigaciju, otvara se odredište za destinaciju najvišeg nivoa koje je povezano sa tom ikonom.
sv: I navigeringsfält på nedre delen av skärmen visas tre till fem destinationer. Varje destination motsvaras av en ikon och en valfri textetikett. När användare trycker på en navigeringsikon på nedre delen av skärmen dirigeras de till det navigeringsmål på toppnivå som är kopplad till ikonen.
te: కిందికి ఉండే నావిగేషన్ బార్‌లు స్క్రీన్ దిగువున మూడు నుండి ఐదు గమ్యస్థానాలను ప్రదర్శిస్తాయి. ప్రతి గమ్యస్థానం ఒక చిహ్నం, అలాగే ఐచ్ఛిక వచన లేబుల్ ఆధారంగా సూచించబడ్డాయి. కిందికి ఉండే నావిగేషన్ చిహ్నాన్ని నొక్కినప్పుడు, యూజర్ ఆ చిహ్నంతో అనుబంధితమైన అత్యంత ప్రధానమైన గమ్యస్థానం ఉన్న నావిగేషన్‌కు తీసుకెళ్లబడతారు.
th: แถบ Bottom Navigation จะแสดงปลายทาง 3-5 แห่งที่ด้านล่างของหน้าจอ ปลายทางแต่ละแห่งจะแสดงด้วยไอคอนและป้ายกำกับแบบข้อความที่ไม่บังคับ เมื่อผู้ใช้แตะไอคอน Bottom Navigation ระบบจะนำไปที่ปลายทางของการนำทางระดับบนสุดที่เชื่อมโยงกับไอคอนนั้น
tr: Alt gezinme çubukları, ekranın altında 3 ila beş arasında varış noktası görüntüler. Her bir varış noktası bir simge ve tercihe bağlı olarak metin etiketiyle temsil edilir. Kullanıcı, bir alt gezinme simgesine dokunduğunda, bu simge ile ilişkilendirilmiş üst düzey gezinme varış noktasına gider.
uk: На нижній панелі навігації відображається від трьох до п'яти розділів у нижній частині екрана. Кожен розділ має значок і текстові мітку (необов'язково). Коли користувач натискає значок на нижній панелі навігації, він переходить на вищий рівень розділу навігації, зв'язаний із цим значком.
ur: باٹم نیویگیشن بارز ایک اسکرین کے نیچے تین سے پانچ منازل کو ڈسپلے کرتا ہے۔ ہر منزل کی نمائندگی ایک آئیکن اور ایک اختیاری ٹیکسٹ لیبل کے ذریعے کی جاتی ہے۔ جب نیچے میں نیویگیشن آئیکن ٹیپ ہوجاتا ہے، تو صارف کو اس آئیکن سے وابستہ اعلی سطحی نیویگیشن منزل تک لے جایا جاتا ہے۔
uz: Ekranning pastki qismidagi navigatsiya panelida xizmatning uchdan beshtagacha qismini joylashtirish mumkin. Ularning har biriga alohida belgi va matn (ixtiyoriy) kiritiladi. Foydalanuvchi belgilardan biriga bossa, kerakli qism ochiladi.
vi: Thanh điều hướng dưới cùng hiển thị từ 3 đến 5 điểm đến ở cuối màn hình. Mỗi điểm đến được biểu thị bằng một biểu tượng và nhãn văn bản tùy chọn. Khi nhấn vào biểu tượng trên thanh điều hướng dưới cùng, người dùng sẽ được chuyển tới điểm đến phần điều hướng cấp cao nhất liên kết với biểu tượng đó.
zh_hk: 底部的導覽列會在螢幕底部顯示 3 至 5 個目的地。每個目的地均以圖示和選擇性的文字標籤標示。當使用者輕按底部導覽列的圖示時，畫面將會顯示與圖示相關的頂層導覽目的地。
zu: Amabha wokuzula aphansi abonisa ubukhulu obuthathu bezindawo ezinhlanu phansi kwesikrini. Indawo ngayinye imelwe isithonjana kanye nelebuli yombhalo ekhethekayo. Uma isithonjana sokuzula sithephiwa, umsebenzisi uyiswa endaweni yokuzula ephathelene naleso sithonjana.

# demoBottomNavigationSelectedLabel
source: Selected label
af: Gekose etiket
am: መሰየሚያ ተመርጧል
ar_eg: الملصق المُختار
as: বাছনি কৰা লেবেল
az: Seçilmiş nişan
be: Выбраная метка
bn: বেছে নেওয়া লেবেল
bs: Odabrana oznaka
ca: Etiqueta seleccionada
da: Valgt etiket
es_ar: Etiqueta seleccionada
et: Valitud silt
eu: Hautatutako etiketa
fa: برچسب انتخاب شد
fil: Napiling label
fr_ca: Étiquette sélectionnée
gl: Etiqueta seleccionada
gu: પસંદ કરેલું લેબલ
he: תווית שנבחרה
hi: चुना गया लेबल
hu: Kiválasztott címke
hy: Ընտրված պիտակ
id: Label terpilih
it: Etichetta selezionata
ja: 選択済みのラベル
ka: არჩეული ლეიბლი
km: ស្លាកដែល​បានជ្រើសរើស
kn: ಆಯ್ಕೆ ಮಾಡಿದ ಲೇಬಲ್
ko: 선택한 라벨
ky: Тандалган энбелги
lo: ປ້າຍກຳກັບທີ່ເລືອກ
lt: Pasirinkta etiketė
lv: Atlasīta iezīme
mk: Избрана етикета
ml: തിരഞ്ഞെടുത്ത ലേബൽ
mn: Сонгосон шошго
mr: लेबल निवडले
ms: Label yang dipilih
my: ရွေးချယ်ထားသော အညွှန်း
nb: Valgt etikett
ne: चयन गरिएको लेबल
pa: ਚੁਣਿਆ ਗਿਆ ਲੇਬਲ
pl: Wybrana etykieta
pt: Etiqueta selecionada
pt_pt: Etiqueta selecionada
ro: Etichetă selectată
ru: Выбранный ярлык
si: තෝරා ගත් ලේබලය
sk: Vybraný štítok
sq: Etiketa e zgjedhur
sr: Изабрана ознака
sr_latn: Izabrana oznaka
sv: Vald etikett
te: లేబుల్ ఎంచుకోబడింది
th: ป้ายกำกับที่เลือก
tr: Seçilen etiket
uk: Вибрана мітка
ur: منتخب کردہ لیول
uz: Tanlangan yorliq
vi: Nhãn đã chọn
zh_hk: 已選取標籤
zu: Ilebuli ekhethiwe

# demoBottomNavigationPersistentLabels
source: Persistent labels
af: Blywende etikette
am: ጽኑ መሰየሚያዎች
ar_eg: التصنيفات المستمرة
as: অবিৰত লেবেলসমূহ
az: Sabit nişanlar
be: Пастаянныя меткі
bn: সব সময় দেখা যাবে এমন লেবেল
bs: Fiksne oznake
ca: Etiquetes persistents
da: Faste etiketter
es_ar: Etiquetas persistentes
et: Püsivad sildid
eu: Etiketa finkoak
fa: برچسب‌های پایدار
fil: Mga persistent na label
fr_ca: Étiquettes persistantes
gl: Etiquetas persistentes
gu: પર્સીસ્ટન્ટ લેબલ
he: תוויות קבועות
hi: हमेशा दिखने वाले लेबल
hu: Állandó címkék
hy: Ստատիկ պիտակներ
id: Label persisten
it: Etichette permanenti
ja: 永続ラベル
ka: მუდმივი წარწერები
km: ស្លាក​ជាអចិន្ត្រៃយ៍
kn: ಪರ್ಸಿಸ್ಟಂಟ್ ಲೇಬಲ್‌ಗಳು
ko: 지속적 라벨
ky: Туруктуу энбелгилер
lo: ປ້າຍກຳກັບທີ່ສະແດງຕະຫຼອດ
lt: Nuolatinės etiketės
lv: Pastāvīgas iezīmes
mk: Постојани етикети
ml: സ്ഥിരമായ ലേബലുകൾ
mn: Тогтмол шошго
mr: सातत्यपूर्ण लेबले
ms: Label berterusan
my: မပြောင်းလဲသည့် အညွှန်းများ
nb: Vedvarende etiketter
ne: सधैँ देखिइरहने लेबलहरू
pa: ਸਥਾਈ ਲੇਬਲ
pl: Trwałe etykiety
pt: Etiquetas persistentes
pt_pt: Etiquetas persistentes
ro: Etichete persistente
ru: Постоянные ярлыки
si: අඛණ්ඩව පවතින ලේබල
sk: Trvalé štítky
sq: Etiketat e vazhdueshme
sr: Трајне ознаке
sr_latn: Trajne oznake
sv: Permanenta etiketter
te: స్థిరమైన లేబుళ్లు
th: ป้ายกำกับที่แสดงเสมอ
tr: Sürekli etiketler
uk: Постійні мітки
ur: مستقل لیبلز
uz: Doimiy yorliqlar
vi: Nhãn cố định
zh_hk: 固定標籤
zu: Amalebuli aphoqelelayo

# starterAppDrawerItem
source: Item {value}
am: ንጥል {value}
ar_eg: السلعة {value}
as: বস্তু {value}
az: Element {value}
be: Элемент {value}
bn: আইটেম {value}
bs: Stavka {value}
ca: Article {value}
da: Vare {value}
es_ar: Artículo {value}
et: Üksus {value}
eu: Elementua: {value}
fa: مورد {value}
fr_ca: Élément {value}
gl: Artigo {value}
gu: આઇટમ {value}
he: פריט {value}
hi: आइटम {value}
hu: {value} elem
hy: {value}
it: Articolo {value}
ja: 項目 {value}
ka: ერთეული {value}
km: ធាតុទី {value}
kn: ಐಟಂ {value}
ko: 항목 {value}
ky: Нерсе {value}
lo: ລາຍການ {value}
lt: Prekė {value}
lv: Vienums {value}
mk: Ставка {value}
ml: ഇനം {value}
mn: Зүйл {value}
mr: आयटम {value}
my: ပစ္စည်း {value}
nb: Vare {value}
ne: वस्तु {value}
pa: ਆਈਟਮ {value}
pl: Element {value}
ro: Articol {value}
ru: Пункт {value}
si: අයිතමය {value}
sk: Položka {value}
sq: Artikulli {value}
sr: Ставка: {value}
sr_latn: Stavka: {value}
sv: Artikel {value}
te: వస్తువు {value}
th: รายการ {value}
tr: Ürün {value}
uk: Позиція {value}
ur: آئٹم {value}
uz: {value}-band
vi: Mặt hàng số {value}
zh_hk: 項目 {value}
zu: Into {value}
