Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoFloatingButtonDescription
source: A floating action button is a circular icon button that hovers over content to promote a primary action in the application.
af: 'n Swewende handelingknoppie is 'n ronde ikoonknoppie wat oor inhoud hang om 'n primêre handeling in die program te bevorder.
am: ተንሳፋፊ የድርጊት አዝራር በመተግበሪያው ላይ ተቀዳሚ ድርጊትን ለማበረታታት በይዘት ላይ የሚያንዣብብ ክብ አዶ አዝራር ነው።
ar_eg: زر الإجراء العائم هو زر على شكل رمز دائري يتم تمريره فوق المحتوى للترويج لاتخاذ إجراء أساسي في التطبيق.
as: এটা ওপঙা কার্যৰ বুটাম হৈছে এটা বৃত্তাকাৰ আইকন বুটাম, যি এপ্লিকেশ্বনটোত এটা প্ৰাথমিক কার্য প্ৰচাৰ কৰিবলৈ সমলৰ ওপৰত ওপঙি থাকে।
az: Üzən əməliyyat düyməsi tətbiqdə əsas əməliyyatı önə çıxarmaq üçün məzmun üzərində hərəkət edən dairəvi ikona düyməsidir.
be: Рухомая кнопка дзеяння – гэта круглы значок, які рухаецца над змесцівам для выканання асноўнага дзеяння ў праграме.
bn: ফ্লোটিং অ্যাকশন বোতাম হল একটি সার্কুলার আইকন বোতাম যা কন্টেন্টের উপরে থাকে, অ্যাপ্লিকেশনের প্রাথমিক অ্যাকশন দেখানোর জন্য।
bs: Plutajuće dugme za radnju je okrugla ikona dugmeta koja se nalazi iznad sadržaja kako bi istakla primarnu radnju u aplikaciji.
ca: Un botó d'acció flotant és un botó d'icona circular que passa per sobre de contingut per promoure una acció principal a l'aplicació.
da: En svævende handlingsknap er en rund ikonknap, der svæver over indholdet for at fremhæve en primær handling i appen.
es_ar: Un botón de acción flotante es un botón de ícono circular que se coloca sobre el contenido para propiciar una acción principal en la aplicación.
et: Hõljuv toimingunupp on ümmargune ikooninupp, mis hõljub sisu kohal, et pakkuda rakenduses peamist toimingut.
eu: Aplikazioko edukiaren gainean ekintza nagusia sustatzeko agertzen diren botoi-itxurako ikono biribilak dira ekintza-botoi gainerakorrak.
fa: دکمه عمل شناور، دکمه نمادی مدور است که روی محتوا نگه‌داشته می‌شود تا کنش ابتدایی را در برنامه موردنظر ارتقا دهد.
fil: Ang floating na action button ay isang bilog na button na may icon na nasa ibabaw ng content na nagpo-promote ng pangunahing pagkilos sa application.
fr_ca: Un bouton d'action flottant est un bouton d'icône circulaire qui pointe sur du contenu pour promouvoir une action principale dans l'application.
gl: Un botón de acción flotante é un botón de icona circular pasa por enriba do contido para promover unha acción principal na aplicación.
gu: ફ્લોટિંગ ઍક્શન બટન એ એક સર્ક્યુલર આઇકન બટન છે જે ઍપમાં મુખ્ય ક્રિયાનો પ્રચાર કરવા માટે કન્ટેન્ટ પર હૉવર કરે છે.
he: לחצן פעולה צף הוא לחצן סמל מעגלי שמוצג מעל תוכן, כדי לקדם פעולה ראשית באפליקציה.
hi: फ़्लोटिंग कार्रवाई बटन, गोल आकार वाला वह आइकॉन बटन होता है जो सामग्री के ऊपर माउस घुमाने पर ऐप्लिकेशन में प्राथमिक कार्रवाई करता है.
hu: A lebegő műveletgomb egy olyan kerek ikongomb, amely a tartalom fölött előugorva bemutat egy elsődleges műveletet az alkalmazásban.
hy: Լողացող գործողության կոճակը շրճանաձև պատկերակով կոճակ է, որը ցուցադրվում է բովանդակության վրա և թույլ է տալիս ընդգծել ամենակարևոր գործողությունը հավելվածում։
id: Tombol tindakan mengambang adalah tombol dengan ikon lingkaran yang mengarahkan kursor ke atas konten untuk melakukan tindakan utama dalam aplikasi.
it: Un pulsante di azione sovrapposto è un'icona circolare che viene mostrata sui contenuti per promuovere un'azione principale dell'applicazione.
ja: フローティング アクション ボタンは円形のアイコンボタンで、コンテンツにカーソルを合わせると、アプリのメイン アクションが表示されます。
ka: მოქმედების მოლივლივე ღილაკი არის ღილაკი წრიული ხატულით, რომელიც მდებარეობს კონტენტის ზემოდან და აპლიკაციაში ყველაზე მნიშვნელოვანი ქმედების გამოყოფის საშუალებას იძლევა.
km: ប៊ូតុង​សកម្មភាព​អណ្តែត​គឺជា​ប៊ូតុងរូបរង្វង់ដែលស្ថិត​នៅលើ​ខ្លឹមសារ ដើម្បីរំលេច​សកម្មភាពចម្បង​នៅក្នុង​កម្មវិធី។
kn: ಫ್ಲೋಟಿಂಗ್ ಆ್ಯಕ್ಷನ್ ಬಟನ್ ಎನ್ನುವುದು ವೃತ್ತಾಕಾರದ ಐಕಾನ್ ಬಟನ್ ಆಗಿದ್ದು ಅದು ಆ್ಯಪ್ನಲ್ಲಿ ಮುಖ್ಯ ಕ್ರಿಯೆಯನ್ನು ಉತ್ತೇಜಿಸಲು ವಿಷಯದ ಮೇಲೆ ಸುಳಿದಾಡುತ್ತದೆ.
ko: 플로팅 작업 버튼은 콘텐츠 위에 마우스를 가져가면 애플리케이션의 기본 작업을 알려주는 원형 아이콘 버튼입니다.
ky: Аракеттердин калкыма баскычы бул колдонмодогу негизги аракетти жүргүзүү үчүн курсорду мазмундун үстүнө алып келген сүрөтчөсү бар тегерек баскыч.
lo: ປຸ່ມການເຮັດວຽກແບບລອຍເປັນປຸ່ມໄອຄອນຮູບວົງມົນທີ່ລອຍຢູ່ເທິງເນື້ອຫາເພື່ອໂປຣໂໝດການດຳເນີນການຫຼັກໃນແອັບພລິເຄຊັນ.
lt: Slankusis veiksmo mygtukas – tai apskritas piktogramos mygtukas, pateikiamas virš turinio, raginant atlikti pagrindinį veiksmą programoje.
lv: Peldoša darbības poga ir apaļa ikonas poga, kas norāda uz saturu, lai veicinātu primāru darbību lietojumprogrammā.
mk: Лебдечкото копче за дејство е копче во вид на кружна икона што лебди над содржините за да поттикне примарно дејство во апликацијата.
ml: ആപ്പിൽ ഒരു പ്രാഥമിക പ്രവർത്തനം പ്രമോട്ട് ചെയ്യുന്നതിനായി ഉള്ളടക്കത്തിന് മുകളിലൂടെ സഞ്ചരിക്കുന്ന ഒരു വൃത്താകൃതിയിലുള്ള ഐക്കൺ ബട്ടണാണ് ഫ്ലോട്ടിംഗ് പ്രവർത്തന ബട്ടൺ.
mn: Үйлдлийн хөвөгч товчлуур нь аппын үндсэн үйлдлийг дэмжих зорилгоор контентын дээр гүйх тойрог хэлбэрийн дүрс тэмдэг бүхий товчлуур юм.
mr: ॲप्लिकेशनमध्ये प्राथमिक क्रिया करण्याचे सूचित करण्यासाठी आशयावर फिरणारे फ्लोटिंग ॲक्शन बटण हे गोलाकार आयकन बटण आहे.
ms: Butang tindakan terapung ialah butang ikon bulat yang menuding pada kandungan untuk mempromosikan tindakan utama dalam aplikasi.
my: မျောနေသည့် လုပ်ဆောင်ချက်ခလုတ်ဆိုသည်မှာ အပလီကေးရှင်းတစ်ခုအတွင်း ပင်မလုပ်ဆောင်ချက်တစ်ခု အထောက်အကူပြုရန် အကြောင်းအရာ၏ အပေါ်တွင် ရစ်ဝဲနေသော စက်ဝိုင်းသင်္ကေတ ခလုတ်တစ်ခုဖြစ်သည်။
nb: En svevende handlingsknapp er en knapp med rundt ikon som ligger over innhold og gir enkel tilgang til en hovedhandling i appen.
ne: फ्लोटिङ कार्य बटन भनेको एपमा कुनै प्राथमिक कार्यलाई प्रवर्धन गर्न सामग्रीमाथि होभर गर्ने वृत्ताकार आइकन भएको बटन हो।
pa: ਫਲੋਟਿੰਗ ਕਾਰਵਾਈ ਬਟਨ ਗੋਲ ਪ੍ਰਤੀਕ ਬਟਨ ਹੁੰਦਾ ਹੈ ਜੋ ਐਪਲੀਕੇਸ਼ਨ ਵਿੱਚ ਮੁੱਖ ਕਾਰਵਾਈ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਲਈ ਸਮੱਗਰੀ ਉੱਤੇ ਘੁੰਮਦਾ ਹੈ।
pl: Pływający przycisk polecenia to okrągły przycisk z ikoną wyświetlany nad treścią, by promować główne działanie w aplikacji.
pt: Um botão de ação flutuante é um botão de ícone circular que paira sobre o conteúdo para promover uma ação principal no aplicativo.
pt_pt: Um botão de ação flutuante é um botão de ícone circular que flutua sobre o conteúdo para promover uma ação principal na aplicação.
ro: Butonul de acțiune flotant este un buton cu pictogramă circulară plasat deasupra conținutului, care promovează o acțiune principală în aplicație.
ru: Плавающая командная кнопка – круглая кнопка, которая располагается над остальным контентом и позволяет выделить самое важное действие в приложении.
si: පාවෙන ක්‍රියා බොත්තමක් යනු යෙදුමෙහි මූලික ක්‍රියාවක් ප්‍රවර්ධනය කිරීමට අන්තර්ගතය උඩින් තබා ගන්නා බොත්තමකි.
sk: Plávajúce tlačidlo akcie je okrúhla ikona vznášajúca sa nad obsahom propagujúca primárnu akciu v aplikácii.
sq: Një buton pluskues veprimi është një buton me ikonë rrethore që lëviz mbi përmbajtjen për të promovuar një veprim parësor në aplikacion.
sr: Плутајуће дугме за радњу је кружна икона дугмета које се приказује изнад садржаја ради истицања примарне радње у апликацији.
sr_latn: Plutajuće dugme za radnju je kružna ikona dugmeta koje se prikazuje iznad sadržaja radi isticanja primarne radnje u aplikaciji.
sv: En flytande åtgärdsknapp är en rund ikonknapp som flyter ovanpå innehållet för att främja en primär åtgärd i appen.
te: ఫ్లోటింగ్ యాక్షన్ బటన్ అనేది వృత్తాకార ఐకాన్ బటన్. కంటెంట్‌పై మౌస్ కర్సర్‌ను ఉంచినప్పుడు ఇది కనపడుతుంది, యాప్‌లో ప్రాథమిక చర్యను ప్రోత్సహించడానికి ఈ బటన్ ఉద్దేశించబడింది.
th: ปุ่มการทำงานแบบลอยเป็นปุ่มไอคอนรูปวงกลมที่ลอยเหนือเนื้อหาเพื่อโปรโมตการดำเนินการหลักในแอปพลิเคชัน
tr: Kayan işlem düğmesi, uygulamadaki birincil işlemi öne çıkarmak için içeriğin üzerine gelen dairesel bir simge düğmesidir.
uk: Плаваюча командна кнопка – це круглий значок, який накладається на контент, щоб привернути увагу до основних дій у додатку.
ur: فلوٹنگ کارروائی کا بٹن ایک گردشی آئیکن بٹن ہوتا ہے جو ایپلیکیشن میں کسی بنیادی کارروائی کو فروغ دینے کے لیے مواد پر گھومتا ہے۔
uz: Erkin harakatlanuvchi amal tugmasi halqa shaklidagi tugma boʻlib, u boshqa kontentlarning tagida joylashadi va ilovadagi eng muhim harakatlarni belgilash imkonini beradi.
zh_hk: 懸浮動作按鈕是個圓形圖示按鈕，會懸停在內容上，可用來在應用程式中執行一項主要動作。
zu: Inkinobho yesenzo esintantayo inkinobho esandingiliza yesithonjana ehamba ngaphezulu kokuqukethwe ukuze kuphromothwe isenzo esiyinhloko kuhlelo lokusebenza.

# demoDialogTitle
source: Dialogs
af: Dialoë
am: ንግግሮች
ar_eg: مربعات الحوار
as: ডায়ল’গসমূহ
az: Dialoqlar
be: Дыялогавыя вокны
bn: ডায়ালগ
bs: Dijaloški okviri
ca: Quadres de diàleg
da: Dialogbokse
es_ar: Diálogos
et: Dialoogid
eu: Leihoak
fa: کادرهای گفتگو
fil: Mga Dialog
fr_ca: Boîtes de dialogue
gl: Cadros de diálogo
gu: સંવાદો
he: תיבות דו-שיח
hi: डायलॉग
hu: Párbeszédpanelek
hy: Երկխոսության պատուհաններ
id: Dialog
it: Finestre di dialogo
ja: ダイアログ
ka: დიალოგები
km: ប្រអប់
kn: ಡೈಲಾಗ್‌ಗಳು
ko: 대화상자
ky: Диалогдор
lo: ກ່ອງໂຕ້ຕອບ
lt: Dialogų langai
lv: Dialoglodziņi
mk: Дијалози
ml: ഡയലോഗുകൾ
mn: Харилцах цонх
mr: डायलॉग
ms: Dialog
my: ဒိုင်ယာလော့ဂ်များ
nb: Dialogbokser
ne: संवादहरू
pa: ਵਿੰਡੋਆਂ
pl: Okna
pt: Caixas de diálogo
pt_pt: Caixas de diálogo
ro: Casete de dialog
ru: Диалоговые окна
si: සංවාද
sk: Dialógové okná
sq: Dialogët
sr: Дијалози
sr_latn: Dijalozi
sv: Dialogruta
te: డైలాగ్‌లు
th: กล่องโต้ตอบ
tr: İletişim kutuları
uk: Діалогові вікна
ur: ڈائیلاگز
uz: Muloqot oynalari
vi: Hộp thoại
zh_hk: 對話框
zu: Amabhokisi

# demoDialogSubtitle
source: Simple, alert, and fullscreen
af: Eenvoudig, opletberig, en volskerm
am: ቀላል፣ ማንቂያ እና ሙሉ ማያ ገፅ
ar_eg: مربعات حوار بسيطة ومخصّصة للتنبيهات وبملء الشاشة
as: সৰল, সতর্কবার্তা আৰু সম্পূর্ণ স্ক্ৰীন
az: Sadə, xəbərdarlıq və tam ekran
be: Простае дыялогавае акно, абвестка і поўнаэкраннае акно
bn: সাধারণ, সতর্কতা, ফুল-স্ক্রিন
bs: Jednostavno, obavještenje i preko cijelog ekrana
ca: Simple, alerta i pantalla completa
da: Enkel, underretning og fuld skærm
es_ar: Simple, de alerta y de pantalla completa
et: Lihtne, hoiatus ja täisekraan
eu: Arrunta, alerta eta pantaila osoa
fa: ساده، هشدار، و تمام‌صفحه
fil: Simple, alerto, at fullscreen
fr_ca: Simple, alerte et plein écran
gl: Simple, alerta e pantalla completa
gu: સરળ, અલર્ટ અને પૂર્ણસ્ક્રીન
he: פשוטה, עם התראה ובמסך מלא
hi: सादा, सूचनाएं, और फ़ुल स्क्रीन
hu: Egyszerű, értesítő és teljes képernyős
hy: Պարզ, ծանուցումներով և լիաէկրան
id: Sederhana, notifikasi, dan layar penuh
it: Semplice, di avviso e a schermo intero
ja: シンプル、アラート、全画面表示
ka: მარტივი, გამაფრთხილებელი და სრულეკრანიანი
km: ធម្មតា ការជូនដំណឹង និងពេញ​អេក្រង់
kn: ಸರಳ, ಅಲರ್ಟ್ ಮತ್ತು ಫುಲ್‌ಸ್ಕ್ರೀನ್
ko: 단순함, 알림, 전체 화면
ky: Жөнөкөй, шашылыш жана толук экран
lo: ງ່າຍໆ, ການແຈ້ງເຕືອນ ແລະ ເຕັມຈໍ
lt: Paprasti, įspėjimo ir viso ekrano
lv: Vienkārši, brīdinājuma un pilnekrāna režīma
mk: Едноставен, за предупредување и на цел екран
ml: ലളിതം, മുന്നറിയിപ്പ്, പൂർണ്ണസ്‌ക്രീൻ എന്നിവ
mn: Энгийн, сэрэмжлүүлэг болон бүтэн дэлгэц
mr: साधा, सूचना आणि फुलस्क्रीन
ms: Ringkas, makluman dan skrin penuh
my: ရိုးရှင်းသော၊ သတိပေးချက်နှင့် မျက်နှာပြင်အပြည့်
nb: Enkel, varsel og fullskjerm
ne: सामान्य, सतर्कता र फुल स्क्रिन
pa: ਸਰਲ, ਸੁਚੇਤਨਾ ਅਤੇ ਪੂਰੀ-ਸਕ੍ਰੀਨ
pl: Proste, alertu i pełnoekranowe
pt: Simples, alerta e tela cheia
pt_pt: Simples, alerta e ecrã inteiro
ro: Simple, pentru alerte și pe ecran complet
ru: Обычные, с оповещением и полноэкранные
si: සරල, ඇඟවීම සහ පූර්ණ තිරය
sk: Jednoduché, upozornenie a celá obrazovka
sq: I thjeshtë, sinjalizim dhe ekran i plotë
sr: Једноставан, са обавештењем и преко целог екрана
sr_latn: Jednostavan, sa obaveštenjem i preko celog ekrana
sv: Enkel, avisering och helskärm
te: సాధారణ, అలర్ట్ మరియు ఫుల్-స్క్రీన్‌
th: แบบง่าย การแจ้งเตือน และเต็มหน้าจอ
tr: Basit, uyarı ve tam ekran
uk: Просте, зі сповіщенням і на весь екран
ur: سادہ الرٹ اور پوری اسکرین
uz: Oddiy, bildirishnoma va butun ekran
vi: Hộp thoại đơn giản, cảnh báo và toàn màn hình
zh_hk: 簡單、通知和全螢幕
zu: Ilula, isexwayiso, nesikrini esigcwele

# demoAlertDialogTitle
source: Alert
af: Opletberig
am: ማንቂያ
ar_eg: التنبيه
as: সতৰ্কবাৰ্তা
az: Xəbərdarlıq
be: Абвестка
bn: সতর্কতা
bs: Obavještenje
ca: Alerta
da: Underretning
es_ar: Alerta
et: Hoiatus
eu: Alerta
fa: هشدار
fil: Alerto
fr_ca: Alerte
gl: Alerta
gu: અલર્ટ
he: התראה
hi: सूचना
hu: Értesítés
hy: Ծանուցում
id: Notifikasi
it: Avviso
ja: アラート
ka: გაფრთხილება
km: ការជូនដំណឹង
kn: ಅಲರ್ಟ್
ko: 알림
ky: Билдирме
lo: ການແຈ້ງເຕືອນ
lt: Įspėjimas
lv: Brīdinājums
mk: Предупредување
ml: മുന്നറിയിപ്പ്
mn: Сэрэмжлүүлэг
mr: सूचना
ms: Makluman
my: သတိပေးချက်
nb: Varsel
ne: अलर्ट
pa: ਸੁਚੇਤਨਾ
pt: Alerta
pt_pt: Alerta
ro: Alertă
ru: Оповещение
si: ඇඟවීම
sk: Upozornenie
sq: Sinjalizim
sr: Обавештење
sr_latn: Obaveštenje
sv: Varning
te: అలర్ట్
th: การแจ้งเตือน
tr: Uyarı
uk: Сповіщення
ur: الرٹ
uz: Bildirishnoma
vi: Cảnh báo
zh_hk: 通知
zu: Isexwayiso

# demoAlertDialogDescription
source: An alert dialog informs the user about situations that require acknowledgement. An alert dialog has an optional title and an optional list of actions.
af: 'n Opletberigdialoog lig die gebruiker in oor situasies wat erkenning nodig het. 'n Opletberigdialoog het 'n opsionele titel en 'n opsionele lys handelinge.
am: የማንቂያ ንግግር ተጠቃሚውን ስለ ዕውቅና መስጠት የሚያስፈልጋቸው ሁኔታዎች በተመለከተ መረጃ ይሰጣል። የማንቂያ ንግግር አማራጭ አርዕስት እና የድርጊቶች አማራጭ ዝርዝር አለው።
ar_eg: يخبر مربع حوار التنبيهات المستخدم بالحالات التي تتطلب تأكيد الاستلام. ويشتمل مربع حوار التنبيهات على عنوان اختياري وقائمة إجراءات اختيارية.
as: এটা সতর্কবার্তাৰ ডায়ল'গে ব্যৱহাৰকাৰীক স্বীকৃতি আৱশ্যক হোৱা পৰিস্থিতিসমূহৰ বিষয়ে জনায়। এটা সতর্কবার্তাৰ ডায়ল'গত এটা ঐচ্ছিক শিৰোনাম আৰু এখন কার্যসমূহৰ ঐচ্ছিক সূচী থাকে।
az: Xəbərdarlıq dialoqu istifadəçiyə razılıq tələb edən məqamlar barədə bildirir. Xəbərdarlıq dialoqunda şərti başlıq və əməliyyatların şərti siyahısı olur.
be: Дыялогавае акно абвесткі інфармуе карыстальніка пра сітуацыі, для якіх патрабуецца пацвярджэнне. Дыялогавае акно абвесткі можа мець назву і спіс дзеянняў.
bn: সতর্কতা সংক্রান্ত ডায়ালগ পরিস্থিতি সম্পর্কে ব্যবহারকারীকে জানায়, যা খেয়াল রাখতে হয়। সতর্কতা সংক্রান্ত ডায়ালগে ঐচ্ছিক শীর্ষক এবং ঐচ্ছিক অ্যাকশনের তালিকা দেওয়া থাকে।
bs: Dijaloški okvir za obavještenje informira korisnika o situacijama koje zahtijevaju potvrdu. Dijaloški okvir za obavještenje ima neobavezni naslov i neobavezni spisak radnji.
ca: Un quadre de diàleg d'alerta informa l'usuari sobre situacions que requereixen la seva aprovació. Inclou un títol i una llista opcional d'accions.
da: En underretningsdialogboks oplyser brugeren om situationer, der kræver handling. En underretningsdialogboks har en valgfri titel og en valgfri liste med handlinger.
es_ar: Un diálogo de alerta informa al usuario sobre situaciones que debe conocer para poder seguir usando la app. Un diálogo de alerta tiene un título y una lista de acciones que son opcionales.
et: Hoiatusdialoog teavitab kasutajat olukordadest, mis nõuavad tähelepanu. Hoiatusdialoogil on valikuline pealkiri ja valikuline toimingute loend.
eu: Kontuan hartu beharreko egoeren berri ematen diote alerta-leihoek erabiltzaileari. Aukeran, izenburua eta ekintza-zerrendak izan ditzakete alerta-leihoek.
fa: کادر گفتگوی هشدار، کاربر را از موقعیت‌هایی که نیاز به تصدیق دارند مطلع می‌کند. کادر گفتگوی هشدار، عنوانی اختیاری و فهرستی اختیاری از کنش‌ها دارد.
fil: Ipinapaalam ng dialog ng alerto sa user ang tungkol sa mga sitwasyong nangangailangan ng pagkilala. May opsyonal na pamagat at opsyonal na listahan ng mga pagkilos ang dialog ng alerto.
fr_ca: Un dialogue d'alerte informe l'utilisateur à propos de situations qui nécessitent qu'on y porte attention. Un dialogue d'alerte a un titre optionnel et une liste d'actions optionnelle.
gl: Un cadro de diálogo de alerta informa ao usuario das situacións que requiren unha confirmación. Un cadro de diálogo de alerta ten un título opcional e unha lista opcional de accións.
gu: અલર્ટ સંવાદ વપરાશકર્તાને જ્યાં સંમતિ જરૂરી હોય એવી સ્થિતિઓ વિશે સૂચિત કરે છે. અલર્ટ સંવાદમાં વૈકલ્પિક શીર્ષક અને ક્રિયાઓની વૈકલ્પિક સૂચિ હોય છે.
he: תיבת דו-שיח של התראה נועדה ליידע את המשתמש לגבי מצבים שדורשים אישור. לתיבת דו-שיח של התראה יש כותרת אופציונלית ורשימה אופציונלית של פעולות.
hi: सूचना वाला डायलॉग उपयोगकर्ताओं को ऐसी स्थितियों के बारे में जानकारी देता है जिनके लिए अनुमति की ज़रूरत होती है. सूचना वाले डायलॉग में दूसरा टाइटल और कार्रवाइयों की दूसरी सूची होती है.
hu: Egy párbeszédpanel tájékoztatja a felhasználót a figyelmét igénylő helyzetekről. Az értesítési párbeszédpanel nem kötelező címmel és nem kötelező műveletlistával rendelkezik.
hy: Ծանուցումների երկխոսության պատուհանը տեղեկացնում է օգտատիրոջը ուշադրության արժանի իրադարձությունների մասին։ Այն կարող է ունենալ վերնագիր, ինչպես նաև հասանելի գործողությունների ցանկ։
id: Dialog notifikasi akan memberitahukan situasi yang memerlukan konfirmasi kepada pengguna. Dialog notifikasi memiliki judul opsional dan daftar tindakan opsional.
it: Una finestra di dialogo di avviso segnala all'utente situazioni che richiedono l'accettazione. Una finestra di dialogo include un titolo facoltativo e un elenco di azioni tra cui scegliere.
ja: アラート ダイアログでは、確認を要する状況をユーザーに伝えることができます。必要に応じて、タイトルとアクション リストを設定できます。
ka: გამაფრთხილებელი დიალოგი აცნობებს მომხმარებელს ისეთი სიტუაციების შესახებ, რომლებიც ყურადღების მიქცევას საჭიროებს. სურვილისამებრ, გამაფრთხილებელ დიალოგს შეიძლება ჰქონდეს სათაური და ქმედებათა სია.
km: ប្រអប់​ជូនដំណឹង​ជូនដំណឹង​ដល់អ្នកប្រើប្រាស់​អំពី​ស្ថានភាព ដែលតម្រូវឱ្យមាន​ការទទួលស្គាល់។ ប្រអប់​ជូនដំណឹង​មានចំណងជើង និង​បញ្ជី​សកម្មភាព​ដែលជាជម្រើស។
kn: ಅಲರ್ಟ್ ಡೈಲಾಗ್ ಸ್ವೀಕೃತಿ ಅಗತ್ಯವಿರುವ ಸಂದರ್ಭಗಳ ಬಗ್ಗೆ ಬಳಕೆದಾರರಿಗೆ ತಿಳಿಸುತ್ತದೆ. ಅಲರ್ಟ್ ಡೈಲಾಗ್ ಐಚ್ಛಿಕ ಶೀರ್ಷಿಕೆ ಮತ್ತು ಐಚ್ಛಿಕ ಆ್ಯಕ್ಷನ್‌ಗಳ ಪಟ್ಟಿಯನ್ನು ಹೊಂದಿದೆ.
ko: 알림 대화상자는 사용자에게 인지가 필요한 상황을 알려줍니다. 알림 대화상자에는 제목과 작업 목록이 선택사항으로 포함됩니다.
ky: Билдирме диалогу колдонуучуга анын ырастоосун талап кылган кырдаалдар тууралуу кабар берет. Билдирме диалогунун аталышы жана аракеттер тизмеси болушу мүмкүн.
lo: ກ່ອງໂຕ້ຕອບການແຈ້ງເຕືອນເພື່ອບອກໃຫ້ຜູ້ໃຊ້ຮູ້ກ່ຽວກັບສະຖານະການທີ່ຕ້ອງຮັບຮູ້. ກ່ອງໂຕ້ຕອບການແຈ້ງເຕືອນທີ່ມີຊື່ ແລະ ລາຍຊື່ຄຳສັ່ງແບບບໍ່ບັງຄັບ.
lt: Įspėjimo dialogo lange naudotojas informuojamas apie situacijas, kurias reikia patvirtinti. Nurodomi įspėjimo dialogo lango pasirenkamas pavadinimas ir pasirenkamas veiksmų sąrašas.
lv: Brīdinājumu dialoglodziņš informē lietotāju par situācijām, kam nepieciešams pievērst uzmanību. Brīdinājumu dialoglodziņam ir neobligāts nosaukums un neobligātu darbību saraksts.
mk: Дијалогот за предупредување го информира корисникот за ситуациите што бараат потврда. Дијалогот за предупредување има изборен наслов и изборен список со дејства.
ml: മുന്നറിയിപ്പ് ഡയലോഗ്, അംഗീകാരം ആവശ്യമുള്ള സാഹചര്യങ്ങളെക്കുറിച്ച് ഉപയോക്താവിനെ അറിയിക്കുന്നു. മുന്നറിയിപ്പ് ഡയലോഗിന് ഒരു ഓപ്‌ഷണൽ പേരും പ്രവർത്തനങ്ങളുടെ ഓപ്‌ഷണൽ പട്ടികയും ഉണ്ട്.
mn: Сэрэмжлүүлгийн харилцах цонх нь хэрэглэгчид батламж шаардлагатай нөхцөл байдлын талаар мэдээлдэг. Сэрэмжлүүлгийн харилцах цонхонд сонгох боломжтой гарчиг болон үйлдлийн жагсаалт байдаг.
mr: सूचना डायलॉग हा वापरकर्त्यांना कबुली आवश्यक असलेल्या गोष्टींबद्दल सूचित करतो. सूचना डायलॉगमध्ये एक पर्यायी शीर्षक आणि एक पर्यायी क्रिया सूची असते
ms: Dialog makluman memberitahu pengguna tentang situasi yang memerlukan perakuan. Dialog makluman mempunyai tajuk pilihan dan senarai tindakan pilihan.
my: သတိပေးချက် ဒိုင်ယာလော့ဂ်သည် အသိအမှတ်ပြုရန် လိုအပ်သည့် အခြေအနေများအကြောင်း အသုံးပြုသူထံ အသိပေးသည်။ သတိပေးချက် ဒိုင်ယာလော့ဂ်တွင် ချန်လှပ်ထားနိုင်သည့် ခေါင်းစဉ်နှင့် ချန်လှပ်ထားနိုင်သည့် လုပ်ဆောင်ချက်စာရင်းပါဝင်သည်။
nb: En varseldialogboks som informerer brukeren om situasjoner som krever bekreftelse. Varseldialogbokser har en valgfri tittel og en valgfri liste over handlinger.
ne: सतर्कता संवादले प्रयोगकर्तालाई प्राप्तिको सूचना आवश्यक पर्ने अवस्थाहरूका बारेमा जानकारी दिन्छ। सतर्कता संवादमा वैकल्पिक शीर्षक र वैकल्पिक कार्यहरूको सूची हुन्छ।
pa: ਸੁਚੇਤਨਾ ਵਿੰਡੋ ਵਰਤੋਂਕਾਰ ਨੂੰ ਉਹਨਾਂ ਸਥਿਤੀਆਂ ਬਾਰੇ ਸੂਚਿਤ ਕਰਦੀ ਹੈ ਜਿਨ੍ਹਾਂ ਨੂੰ ਸਵੀਕ੍ਰਿਤੀ ਦੀ ਲੋੜ ਹੈ। ਸੁਚੇਤਨਾ ਵਿੰਡੋ ਵਿੱਚ ਵਿਕਲਪਿਕ ਸਿਰਲੇਖ ਅਤੇ ਕਾਰਵਾਈਆਂ ਦੀ ਵਿਕਲਪਿਕ ਸੂਚੀ ਸ਼ਾਮਲ ਹੁੰਦੀ ਹੈ।
pl: Okno alertu informuje użytkownika o sytuacjach wymagających potwierdzenia. Okno alertu ma opcjonalny tytuł i opcjonalną listę działań.
pt: Uma caixa de diálogo de alerta informa o usuário sobre situações que precisam ser confirmadas. A caixa de diálogo de alerta tem uma lista de ações e um título opcionais.
pt_pt: Uma caixa de diálogo de alerta informa o utilizador acerca de situações que requerem confirmação. Uma caixa de diálogo de alerta tem um título opcional e uma lista de ações opcional.
ro: Caseta de dialog pentru alerte informează utilizatorul despre situații care necesită confirmare. Caseta de dialog pentru alerte are un titlu opțional și o listă de acțiuni opțională.
ru: Диалоговое окно с оповещением сообщает пользователю о событиях, требующих внимания. Оно может иметь заголовок, а также список доступных действий.
si: ඇඟවීම් සංවාදයක් පිළිගැනීම අවශ්‍ය තත්ත්වයන් පිළිබඳ පරිශීලකට දැනුම් දෙයි. ඇඟවීම් සංවාදයකට විකල්ප මාතෘකාවක් සහ විකල්ප ක්‍රියා ලැයිස්තුවක් තිබේ.
sk: Dialógové okno upozornenia informuje používateľa o situáciách, ktoré vyžadujú potvrdenie. Má voliteľný názov a voliteľný zoznam akcií.
sq: Një dialog sinjalizues informon përdoruesin rreth situatave që kërkojnë konfirmim. Një dialog sinjalizues ka një titull opsional dhe një listë opsionale veprimesh.
sr: Дијалог обавештења информише кориснике о ситуацијама које захтевају њихову пажњу. Дијалог обавештења има опционални наслов и опционалну листу радњи.
sr_latn: Dijalog obaveštenja informiše korisnike o situacijama koje zahtevaju njihovu pažnju. Dijalog obaveštenja ima opcionalni naslov i opcionalnu listu radnji.
sv: Med en varningsruta uppmärksammas användaren på saker som behöver bekräftas. Titeln och listan på åtgärder i varningsrutan är valfria.
te: అందినట్టుగా నిర్ధారణ అవసరమయ్యే పరిస్థితుల గురించి అలర్ట్ డైలాగ్ యూజర్‌కు తెలియజేస్తుంది. అలర్ట్ డైలాగ్‌లో ఐచ్ఛిక శీర్షిక, ఐచ్ఛిక చర్యలకు సంబంధించిన లిస్ట్‌ ఉంటాయి.
th: กล่องโต้ตอบการแจ้งเตือนจะแจ้งผู้ใช้เกี่ยวกับสถานการณ์ที่ต้องการการตอบรับ กล่องโต้ตอบการแจ้งเตือนมีชื่อที่ไม่บังคับและรายการที่ไม่บังคับของการดำเนินการ
tr: Uyarı iletişim kutusu, kullanıcıyı onay gerektiren durumlar hakkında bilgilendirir. Uyarı iletişim kutusunun isteğe bağlı başlığı ve isteğe bağlı işlemler listesi vardır.
uk: Діалогове вікно сповіщення повідомляє користувачів про ситуації, про які вони мають знати. Воно може мати назву та список дій (необов'язково).
ur: الرٹ ڈائیلاگ صارف کو ایسی صورتحال سے آگاہ کرتا ہے جہاں اقرار درکار ہوتا ہے۔ الرٹ ڈائیلاگ میں اختیاری عنوان اور کارروائیوں کی اختیاری فہرست ہوتی ہے۔
uz: Ogohlantiruvchi muloqot oynasi foydalanuvchini u eʼtibor qaratishi lozim boʻlgan voqealar yuz berganda ogohlantiradi. Unda sarlavha va mavjud harakatlar roʻyxati boʻlishi mumkin.
vi: Hộp thoại cảnh báo thông báo cho người dùng về các tình huống cần xác nhận. Hộp thoại cảnh báo không nhất thiết phải có tiêu đề cũng như danh sách các hành động.
zh_hk: 通知對話框會通知使用者目前發生要確認的情況。您可按需要為這類對話框設定標題和動作清單。
zu: Ibhokisi lesexwayiso lazisa umsebenzisi mayelana nezimo ezidinga ukuvunywa. Ibhokisi lesexwayiso linesihloko ongasikhetha kanye nohlu ongalukhetha lwezenzo.
