Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCodeViewerCopyAll
source: COPY ALL
af: KOPIEER ALLES
am: ሁሉንም ቅዳ
ar_eg: نسخ الكل
as: সকলো প্ৰতিলিপি কৰক
az: HAMISINI KOPYALAYIN
be: КАПІРАВАЦЬ УСЁ
bn: সব কিছু কপি করুন
bs: KOPIRAJ SVE
ca: COPIA-HO TOT
da: KOPIER ALT
es_ar: COPIAR TODO
et: KOPEERI KÕIK
eu: KOPIATU DENA
fa: کپی همه موارد
fil: KOPYAHIN LAHAT
fr_ca: TOUT COPIER
gl: COPIAR TODO
gu: બધા કૉપિ કરો
he: העתקת הכול
hi: सभी को कॉपी करें
hu: ÖSSZES MÁSOLÁSA
hy: ՊԱՏՃԵՆԵԼ ԱՄԲՈՂՋԸ
id: SALIN SEMUA
it: COPIA TUTTO
ja: すべてコピー
ka: ყველას კოპირება
km: ចម្លង​ទាំងអស់
kn: ಎಲ್ಲವನ್ನೂ ನಕಲಿಸಿ
ko: 모두 복사
ky: БААРЫН КӨЧҮРҮҮ
lo: ສຳເນົາທັງໝົດ
lt: KOPIJUOTI VISKĄ
lv: KOPĒT VISU
mk: КОПИРАЈ ГИ СИТЕ
ml: എല്ലാം പകർത്തുക
mn: БҮГДИЙГ ХУУЛАХ
mr: सर्व कॉपी करा
ms: SALIN SEMUA
my: အားလုံး မိတ္တူကူးရန်
nb: KOPIÉR ALT
ne: सबै प्रतिलिपि गर्नुहोस्
pa: ਸਭ ਕਾਪੀ ਕਰੋ
pl: KOPIUJ WSZYSTKO
pt: COPIAR TUDO
pt_pt: COPIAR TUDO
ro: COPIAȚI TOT
ru: КОПИРОВАТЬ ВСЕ
si: සියල්ල පිටපත් කරන්න
sk: KOPÍROVAŤ VŠETKO
sq: KOPJO TË GJITHA
sr: КОПИРАЈ СВЕ
sr_latn: KOPIRAJ SVE
sv: KOPIERA ALLT
te: మొత్తం వచనాన్ని కాపీ చేయి
th: คัดลอกทั้งหมด
tr: TÜMÜNÜ KOPYALA
uk: КОПІЮВАТИ ВСЕ
ur: سبھی کاپی کریں
uz: HAMMASINI NUSXALASH
vi: SAO CHÉP TOÀN BỘ
zh_hk: 全部複製
zu: KOPISHA KONKE

# shrineScreenReaderRemoveProductButton
source: Remove {product}
af: Verwyder {product}
am: {product} አስወግድ
ar_eg: إزالة {product}
as: {product} আঁতৰাওক
az: {product} məhsulunu silin
be: Выдаліць прадукт: {product}
bn: সরান {product}
bs: Uklonite proizvod {product}
ca: Suprimeix {product}
da: Fjern {product}
es_ar: Quitar {product}
et: Eemalda {product}
eu: Kendu {product}
fa: برداشتن {product}
fil: Alisin ang {product}
fr_ca: Supprimer {product}
gl: Quitar {product}
gu: {product} કાઢી નાખો
he: הסרת {product}
hi: {product} हटाएं
hu: {product} eltávolítása
hy: {product}՝ հեռացնել
id: Hapus {product}
it: Rimuovi {product}
ja: {product}を削除
ka: ამოიშალოს {product}
km: ដក {product} ចេញ
kn: {product} ತೆಗೆದುಹಾಕಿ
ko: {product} 삭제
ky: {product} алып салуу
lo: ລຶບ {product} ອອກ
lt: Pašalinti produktą: {product}
lv: Noņemt produktu: {product}
mk: Отстранете {product}
ml: {product} നീക്കുക
mn: Хасах {product}
mr: {product} काढून टाका
ms: Alih keluar {product}
my: {product} ကို ဖယ်ရှားရန်
nb: Fjern {product}
ne: हटाउनुहोस् {product}
pa: ਹਟਾਓ {product}
pl: Usuń {product}
pt: Remover {product}
pt_pt: Remover {product}
ro: Eliminați {product}
ru: {product}: удалить товар
si: ඉවත් කරන්න {product}
sk: Odstrániť výrobok {product}
sq: Hiq {product}
sr: Уклони производ {product}
sr_latn: Ukloni proizvod {product}
sv: Ta bort {product}
te: {product}ను తీసివేయండి
th: นำ {product} ออก
tr: {product} ürününü kaldır
uk: Вилучити товар "{product}"
ur: {product} ہٹائیں
uz: Olib tashlash: {product}
vi: Xóa {product}
zh_hk: 移除{product}
zu: Susa i-{product}

# shrineScreenReaderProductAddToCart
source: Add to cart
af: Voeg by mandjie
am: ወደ ጋሪ አክል
ar_eg: إضافة إلى سلة التسوق
as: কাৰ্টত যোগ কৰক
az: Səbətə əlavə edin
be: Дадаць у кошык
bn: কার্টে যোগ করুন
bs: Dodavanje u korpu
ca: Afegeix al carretó
da: Læg i kurven
es_ar: Agregar al carrito
et: Lisa ostukorvi
eu: Gehitu saskian
fa: افزودن به سبد خرید
fil: Idagdag sa cart
fr_ca: Ajouter au panier
gl: Engadir á cesta
gu: કાર્ટમાં ઉમેરો
he: הוספה לעגלת הקניות
hi: कार्ट में जोड़ें
hu: Hozzáadás a kosárhoz
hy: Ավելացնել զամբյուղում
id: Tambahkan ke keranjang
it: Aggiungi al carrello
ja: カートに追加
ka: კალათაში დამატება
km: បញ្ចូលទៅរទេះ
kn: ಕಾರ್ಟ್‌ಗೆ ಸೇರಿಸಿ
ko: 장바구니에 추가
ky: Арабага кошуу
lo: ເພີ່ມໃສ່​ກະຕ່າ
lt: Pridėti į krepšelį
lv: Pievienot grozam
mk: Додајте во кошничката
ml: കാർട്ടിലേക്ക് ചേർക്കുക
mn: Сагсанд нэмэх
mr: कार्टमध्ये जोडा
ms: Tambahkan ke troli
my: ဈေးခြင်းတောင်းသို့ ပေါင်းထည့်မည်
nb: Legg i handlekurven
ne: किनमेल गर्ने कार्टमा राख्नुहोस्
pa: ਕਾਰਟ ਵਿੱਚ ਸ਼ਾਮਲ ਕਰੋ
pl: Dodaj do koszyka
pt: Adicionar ao carrinho
pt_pt: Adicionar ao carrinho
ro: Adăugați în coșul de cumpărături
ru: Добавить в корзину
si: කරත්තයට එක් කරන්න
sk: Pridať do košíka
sq: Shto në karrocë
sr: Додај у корпу
sr_latn: Dodaj u korpu
sv: Lägg i kundvagnen
te: కార్ట్‌కు జోడించండి
th: เพิ่มในรถเข็น
tr: Sepete ekle
uk: Додати в кошик
ur: کارٹ میں شامل کریں
uz: Savatga joylash
vi: Thêm vào giỏ hàng
zh_hk: 加入購物車
zu: Engeza kukalishi

# shrineScreenReaderCart
source: {quantity, plural, =0{Shopping cart, no items} =1{Shopping cart, 1 item} other{Shopping cart, {quantity} items}}
af: {quantity,plural,=0{Inkopiemandjie, geen items nie}=1{Inkopiemandjie, 1 item}other{Inkopiemandjie, {quantity} items}}
am: {quantity,plural,=0{የግዢ ዕቃዎች ጋሪ፣ ምንም ንጥሎች የሉም}=1{የግዢ ዕቃዎች ጋሪ፣ 1 ንጥል}other{የግዢ ዕቃዎች ጋሪ፣ {quantity} ንጥሎች}}
ar_eg: {quantity,plural,=0{سلة التسوق، ما مِن عناصر}=1{سلة التسوق، عنصر واحد}two{سلة التسوق، عنصران ({quantity})}few{سلة التسوق، {quantity} عناصر}many{سلة التسوق، {quantity} عنصرًا}other{سلة التسوق، {quantity} عنصر}}
as: {quantity,plural,=0{শ্বপিং কাৰ্ট, কোনো বস্তু নাই}=1{শ্বপিং কাৰ্ট, ১ টা বস্তু}other{শ্বপিং কার্ট, {quantity} টা বস্তু}}
az: {quantity,plural,=0{Alış-veriş səbəti, element yoxdur}=1{Alış-veriş səbəti, 1 element}other{Alış-veriş səbəti, {quantity} element}}
be: {quantity,plural,=0{Кошык, няма прадуктаў}=1{Кошык, 1 прадукт}few{Кошык, {quantity} прадукты}many{Кошык, {quantity} прадуктаў}other{Кошык, {quantity} прадукту}}
bn: {quantity,plural,=0{শপিং কার্ট, কোনও আইটেম নেই}=1{শপিং কার্ট, ১টি আইটেম আছে}other{শপিং কার্ট, {quantity}টি আইটেম আছে}}
bs: {quantity,plural,=0{Kolica za kupovinu bez artikala}=1{Kolica za kupovinu s 1 artiklom}few{Kolica za kupovinu sa {quantity} artikla}other{Kolica za kupovinu sa {quantity} artikala}}
ca: {quantity,plural,=0{Carretó electrònic, cap article}=1{Carretó electrònic, 1 article}other{Carretó electrònic, {quantity} articles}}
da: {quantity,plural,=0{Indkøbskurv, ingen varer}=1{Indkøbskurv, 1 vare}other{Indkøbskurv, {quantity} varer}}
es_ar: {quantity,plural,=0{Carrito de compras sin artículos}=1{Carrito de compras con 1 artículo}other{Carrito de compras con {quantity} artículos}}
et: {quantity,plural,=0{Ostukorv, üksusi pole}=1{Ostukorv, 1 üksus}other{Ostukorv, {quantity} üksust}}
eu: {quantity,plural,=0{Erosketa-saskia. Hutsik dago.}=1{Erosketa-saskia. Produktu bat dauka.}other{Erosketa-saskia. {quantity} produktu dauzka.}}
fa: {quantity,plural,=0{سبد خرید، بدون مورد}=1{سبد خرید، ۱ مورد}other{سبد خرید، {quantity} مورد}}
fil: {quantity,plural,=0{Shopping cart, walang item}=1{Shopping cart, 1 item}other{Shopping cart, {quantity} na item}}
fr_ca: {quantity,plural,=0{Panier, aucun élément}=1{Panier, 1 élément}other{Panier, {quantity} éléments}}
gl: {quantity,plural,=0{Cesta da compra (sen artigos)}=1{Cesta da compra (1 artigo)}other{Cesta da compra ({quantity} artigos)}}
gu: {quantity,plural,=0{શોપિંગ કાર્ટ, કોઈ આઇટમ નથી}=1{શોપિંગ કાર્ટ, 1 આઇટમ}other{શોપિંગ કાર્ટ, {quantity} આઇટમ}}
he: {quantity,plural,=0{עגלת קניות, אין פריטים}=1{עגלת קניות, פריט אחד}two{עגלת קניות, {quantity} פריטים}other{עגלת קניות, {quantity} פריטים}}
hi: {quantity,plural,=0{शॉपिंग कार्ट, इसमें कोई आइटम नहीं है}=1{शॉपिंग कार्ट, इसमें 1 आइटम है}other{शॉपिंग कार्ट, इसमें {quantity} आइटम हैं}}
hu: {quantity,plural,=0{Kosár, üres}=1{Kosár, 1 tétel}other{Kosár, {quantity} tétel}}
hy: {quantity,plural,=0{Զամբյուղը դատարկ է}=1{Զամբյուղում 1 ապրանք կա}other{Զամբյուղում {quantity} ապրանք կա}}
id: {quantity,plural,=0{Keranjang belanja, tidak ada item}=1{Keranjang belanja, 1 item}other{Keranjang belanja, {quantity} item}}
it: {quantity,plural,=0{Carrello, nessun articolo}=1{Carrello, 1 articolo}other{Carrello, {quantity} articoli}}
ja: {quantity,plural,=0{ショッピングカートにアイテムはありません}=1{ショッピングカートに1件のアイテムがあります}other{ショッピングカートに{quantity}件のアイテムがあります}}
ka: {quantity,plural,=0{საყიდლების კალათა, ერთეულები არ არის}=1{საყიდლების კალათა, 1 ერთეული}other{საყიდლების კალათა, {quantity} ერთეული}}
km: {quantity,plural,=0{រទេះទិញទំនិញ គ្មានទំនិញ}=1{រទេះទិញទំនិញ ទំនិញ 1}other{រទេះទិញទំនិញ ទំនិញ {quantity}}}
kn: {quantity,plural,=0{ಶಾಪಿಂಗ್ ಕಾರ್ಟ್, ಯಾವುದೇ ಐಟಂಗಳಿಲ್ಲ}=1{ಶಾಪಿಂಗ್ ಕಾರ್ಟ್, 1 ಐಟಂ}other{ಶಾಪಿಂಗ್ ಕಾರ್ಟ್, {quantity} ಐಟಂಗಳು}}
ko: {quantity,plural,=0{장바구니, 상품 없음}=1{장바구니, 상품 1개}other{장바구니, 상품 {quantity}개}}
ky: {quantity,plural,=0{Арабада эч нерсе жок}=1{Арабада 1 нерсе бар}other{Арабада {quantity} нерсе бар}}
lo: {quantity,plural,=0{ກະຕ່າຊື້ເຄື່ອງ, ບໍ່ມີລາຍການ}=1{ກະຕ່າຊື້ເຄື່ອງ, 1 ລາຍການ}other{ກະຕ່າຊື້ເຄື່ອງ, {quantity} ລາຍການ}}
lt: {quantity,plural,=0{Pirkinių krepšelis, nėra jokių prekių}=1{Pirkinių krepšelis, 1 prekė}few{Pirkinių krepšelis, {quantity} prekės}many{Pirkinių krepšelis, {quantity} prekės}other{Pirkinių krepšelis, {quantity} prekių}}
lv: {quantity,plural,=0{Iepirkumu grozs, nav preču}=1{Iepirkumu grozs, 1 prece}other{Iepirkumu grozs, {quantity} preces}}
mk: {quantity,plural,=0{Кошничка за купување, нема ставки}=1{Кошничка за купување, 1 ставка}other{Кошничка за купување, {quantity} ставки}}
ml: {quantity,plural,=0{ഷോപ്പിംഗ് കാർട്ട്, ഇനങ്ങളൊന്നുമില്ല}=1{ഷോപ്പിംഗ് കാർട്ട്, ഒരു ഇനം}other{ഷോപ്പിംഗ് കാർട്ട്, {quantity} ഇനങ്ങൾ}}
mn: {quantity,plural,=0{Худалдан авах сагс, зүйлс алга}=1{Худалдан авах сагс, 1 зүйл}other{Худалдан авах сагс, {quantity} зүйл}}
mr: {quantity,plural,=0{खरेदीचा कार्ट, कोणतेही आयटम नाहीत}=1{खरेदीचा कार्ट, एक आयटम आहे}other{खरेदीचा कार्ट, {quantity} आयटम आहेत}}
ms: {quantity,plural,=0{Troli Beli-belah, tiada item}=1{Troli Beli-belah, 1 item}other{Troli Beli-belah, {quantity} item}}
my: {quantity,plural,=0{ဈေးခြင်းတောင်း၊ ပစ္စည်းမရှိပါ}=1{ဈေးခြင်းတောင်း၊ ပစ္စည်း ၁ ခု}other{ဈေးခြင်းတောင်း၊ ပစ္စည်း {quantity} ခု}}
nb: {quantity,plural,=0{Handlekurv, ingen varer}=1{Handlekurv, 1 vare}other{Handlekurv, {quantity} varer}}
ne: {quantity,plural,=0{किनमेल गर्ने कार्ट, कुनै पनि वस्तु छैन}=1{किनमेल गर्ने कार्ट, १ वस्तु छ}other{किनमेल गर्ने कार्ट, {quantity} वस्तु छन्}}
pa: {quantity,plural,=0{ਖਰੀਦਦਾਰੀ ਕਾਰਟ, ਕੋਈ ਆਈਟਮ ਨਹੀਂ}=1{ਖਰੀਦਦਾਰੀ ਕਾਰਟ, 1 ਆਈਟਮ}other{ਖਰੀਦਦਾਰੀ ਕਾਰਟ, {quantity} ਆਈਟਮਾਂ}}
pl: {quantity,plural,=0{Koszyk, pusty}=1{Koszyk, 1 produkt}few{Koszyk, {quantity} produkty}many{Koszyk, {quantity} produktów}other{Koszyk, {quantity} produktu}}
pt: {quantity,plural,=0{Carrinho de compras, nenhum item}=1{Carrinho de compras, 1 item}other{Carrinho de compras, {quantity} itens}}
pt_pt: {quantity,plural,=0{Carrinho de compras, nenhum artigo}=1{Carrinho de compras, 1 artigo}other{Carrinho de compras, {quantity} artigos}}
ro: {quantity,plural,=0{Coș de cumpărături, niciun articol}=1{Coș de cumpărături, un articol}few{Coș de cumpărături, {quantity} articole}other{Coș de cumpărături, {quantity} de articole}}
ru: {quantity,plural,=0{Нет товаров в корзине}=1{1 товар в корзине}few{{quantity} товара в корзине}many{{quantity} товаров в корзине}other{{quantity} товара в корзине}}
si: {quantity,plural,=0{සාප්පු යාමේ කරත්තය, අයිතම නැත}=1{සාප්පු යාමේ කරත්තය, අයිතම 1}other{සාප්පු යාමේ කරත්තය, අයිතම {quantity}}}
sk: {quantity,plural,=0{Nákupný košík, žiadne položky}=1{Nákupný košík, 1 položka}few{Nákupný košík, {quantity} položky}many{Shopping cart, {quantity} items}other{Nákupný košík, {quantity} položiek}}
sq: {quantity,plural,=0{Karroca e blerjeve, asnjë artikull}=1{Karroca e blerjeve, 1 artikull}other{Karroca e blerjeve, {quantity} artikuj}}
sr: {quantity,plural,=0{Корпа за куповину, нема артикала}=1{Корпа за куповину, 1 артикал}few{Корпа за куповину, {quantity} артикла}other{Корпа за куповину, {quantity} артикала}}
sr_latn: {quantity,plural,=0{Korpa za kupovinu, nema artikala}=1{Korpa za kupovinu, 1 artikal}few{Korpa za kupovinu, {quantity} artikla}other{Korpa za kupovinu, {quantity} artikala}}
sv: {quantity,plural,=0{Kundvagnen. Den är tom}=1{Kundvagnen. Den innehåller 1 vara}other{Kundvagnen. Den innehåller {quantity} varor}}
te: {quantity,plural,=0{షాపింగ్ కార్ట్, అంశాలు లేవు}=1{షాపింగ్ కార్ట్, 1 అంశం}other{షాపింగ్ కార్ట్, {quantity} అంశాలు}}
th: {quantity,plural,=0{รถเข็นช็อปปิ้งไม่มีสินค้า}=1{รถเข็นช็อปปิ้งมีสินค้า 1 รายการ}other{รถเข็นช็อปปิ้งมีสินค้า {quantity} รายการ}}
tr: {quantity,plural,=0{Alışveriş sepeti, ürün yok}=1{Alışveriş sepeti, 1 ürün}other{Alışveriş sepeti, {quantity} ürün}}
uk: {quantity,plural,=0{Кошик без товарів}=1{Кошик з 1 товаром}few{Кошик із {quantity} товарами}many{Кошик з {quantity} товарами}other{Кошик з {quantity} товару}}
ur: {quantity,plural,=0{شاپنگ کارٹ، کوئی آئٹم نہیں}=1{شاپنگ کارٹ، 1 آئٹم}other{شاپنگ کارٹ، {quantity} آئٹمز}}
uz: {quantity,plural,=0{Savatchaga hech nima joylanmagan}=1{Savatchada 1 ta mahsulot}other{Savatchada {quantity} ta mahsulot}}
vi: {quantity,plural,=0{Giỏ hàng, không có mặt hàng nào}=1{Giỏ hàng, có 1 mặt hàng}other{Giỏ hàng, có {quantity} mặt hàng}}
zh_hk: {quantity,plural,=0{購物車，冇產品}=1{購物車，1 件產品}other{購物車，{quantity} 件產品}}
zu: {quantity,plural,=0{Ikalishi lokuthenga, azikho izinto}=1{Ikalishi lokuthenga, 1 into}other{Ikalishi lokuthenga, {quantity} izinto}}

# demoCodeViewerFailedToCopyToClipboardMessage
source: Failed to copy to clipboard: {error}
af: Kon nie na knipbord kopieer nie: {error}
am: ወደ ቅንጥብ ሰሌዳ መቅዳት አልተሳካም፦ {error}
ar_eg: تعذّر نسخ النص إلى الحافظة: {error}
as: ক্লিপব'ৰ্ডলৈ প্ৰতিলিপি কৰিব পৰা নগ'ল: {error}
az: Mübadilə buferinə kopyalamaq alınmadı: {error}
be: Не ўдалося скапіраваць у буфер абмену: {error}
bn: ক্লিপবোর্ডে কপি করা যায়নি: {error}
bs: Kopiranje u međumemoriju nije uspjelo: {error}
ca: No s'ha pogut copiar al porta-retalls: {error}
da: Kunne ikke kopieres til udklipsholderen: {error}
es_ar: No se pudo copiar al portapapeles: {error}
et: Lõikelauale kopeerimine ebaõnnestus: {error}
eu: Ezin izan da kopiatu arbelean: {error}
fa: در بریده‌دان کپی نشد: {error}
fil: Hindi nakopya sa clipboard: {error}
fr_ca: Échec de la copie dans le presse-papiers : {error}
gl: Produciuse un erro ao copiar o contido no portapapeis: {error}
gu: ક્લિપબોર્ડ પર કૉપિ કરવામાં નિષ્ફળ રહ્યાં: {error}
he: ניסיון ההעתקה ללוח נכשל: {error}
hi: क्लिपबोर्ड पर कॉपी नहीं हुआ: {error}
hu: Nem sikerült a vágólapra másolni: {error}
hy: Չհաջողվեց պատճենել սեղմատախտակին՝ {error}
id: Gagal menyalin ke papan klip: {error}
it: Impossibile copiare negli appunti: {error}
ja: クリップボードにコピーできませんでした。{error}
ka: გაცვლის ბუფერში კოპირება ვერ მოხერხდა: {error}
km: មិនអាច​ចម្លងទៅឃ្លីបបត​បានទេ៖ {error}
kn: ಫ್ಲಿಪ್‌ಬೋರ್ಡ್‌ಗೆ ನಕಲಿಸಲು ವಿಫಲವಾಗಿದೆ: {error}
ko: 클립보드에 복사할 수 없습니다. {error}
ky: Алмашуу буферине көчүрүлгөн жок: {error}
lo: ສຳເນົາໄປໃສ່ຄລິບບອດບໍ່ສຳເລັດ: {error}
lt: Nepavyko nukopijuoti į iškarpinę: {error}
lv: Neizdevās kopēt starpliktuvē: {error}
mk: Не успеа да се копира во привремената меморија: {error}
ml: ക്ലിപ്പ്ബോർഡിലേക്ക് പകർത്താനായില്ല: {error}
mn: Түр санах ойд хуулж чадсанүй: {error}
mr: क्लिपबोर्डवर कॉपी करता आला नाही: {error}
ms: Gagal menyalin ke papan keratan: {error}
my: ကလစ်ဘုတ်သို့ မိတ္တူကူး၍မရပါ− {error}
nb: Kunne ikke kopiere til utklippstavlen: {error}
ne: क्लिपबोर्डमा प्रतिलिपि गर्न सकिएन: {error}
pa: ਕਲਿੱਪਬੋਰਡ 'ਤੇ ਕਾਪੀ ਕਰਨਾ ਅਸਫਲ ਰਿਹਾ: {error}
pl: Nie udało się skopiować do schowka: {error}
pt: Falha ao copiar para a área de transferência: {error}
pt_pt: Falha ao copiar para a área de transferência: {error}.
ro: Nu s-a copiat în clipboard: {error}
ru: Не удалось скопировать текст: {error}
si: පසුරු පුවරුවට පිටපත් කිරීමට අසමත් විය: {error}
sk: Kopírovanie do schránky sa nepodarilo: {error}
sq: Kopjimi në kujtesën e fragmenteve dështoi: {error}
sr: Копирање у привремену меморију није успело: {error}
sr_latn: Kopiranje u privremenu memoriju nije uspelo: {error}
sv: Det gick inte att kopiera till urklipp: {error}
te: క్లిప్‌బోర్డ్‌కు కాపీ చేయడం విఫలమైంది: {error}
th: คัดลอกไปยังคลิปบอร์ดไม่สำเร็จ: {error}
tr: Panoya kopyalanamadı: {error}
uk: Не вдалося скопіювати в буфер обміну: {error}
ur: کلپ بورڈ پر کاپی کرنے میں ناکام: {error}
uz: Klipbordga nusxalanmadi: {error}
vi: Không sao chép được vào bảng nhớ tạm: {error}
zh_hk: 無法複製到剪貼簿：{error}
zu: Yehlulekile ukukopishela kubhodi lokunamathisela: {error}

# demoCodeViewerCopiedToClipboardMessage
source: Copied to clipboard.
af: Gekopieer na knipbord.
am: ወደ ቅንጥብ ሰሌዳ ተገልብጧል።
ar_eg: تم نسخ النص إلى الحافظة.
as: ক্লিপব’ৰ্ডলৈ প্ৰতিলিপি কৰা হ’ল।
az: Mübadilə buferinə kopyalandı.
be: Скапіравана ў буфер абмену.
bn: ক্লিপবোর্ডে কপি করা হয়েছে।
bs: Kopirano u međumemoriju.
ca: S'ha copiat al porta-retalls.
da: Kopieret til udklipsholderen.
es_ar: Se copió el contenido en el portapapeles.
et: Kopeeritud lõikelauale.
eu: Kopiatu da arbelean.
fa: در بریده‌دان کپی شد.
fil: Kinopya sa clipboard.
fr_ca: Copié dans le presse-papiers.
gl: Copiouse o contido no portapapeis.
gu: ક્લિપબોર્ડ પર કૉપિ કર્યા.
he: התוכן הועתק ללוח.
hi: क्लिपबोर्ड पर कॉपी हो गया.
hu: A vágólapra másolva.
hy: Պատճենվեց սեղմատախտակին։
id: Disalin ke papan klip.
it: Copiato negli appunti.
ja: クリップボードにコピーしました。
ka: კოპირებულია გაცვლის ბუფერში.
km: បានចម្លង​ទៅ​ឃ្លីបបត។
kn: ಕ್ಲಿಪ್‌ಬೋರ್ಡ್‌ಗೆ ನಕಲಿಸಲಾಗಿದೆ.
ko: 클립보드에 복사되었습니다.
ky: Алмашуу буферине көчүрүлдү.
lo: ສຳເນົາໃສ່ຄລິບບອດແລ້ວ.
lt: Nukopijuota į iškarpinę.
lv: Kopēts starpliktuvē.
mk: Копирано во привремената меморија.
ml: ക്ലിപ്പ്‌ബോർഡിലേക്ക് പകർത്തി.
mn: Түр санах ойд хуулсан.
mr: क्लिपबोर्डवर कॉपी केला.
ms: Disalin ke papan keratan.
my: ကလစ်ဘုတ်သို့ မိတ္တူကူးပြီးပါပြီ။
nb: Kopiert til utklippstavlen.
ne: क्लिपबोर्डमा प्रतिलिपि गरियो।
pa: ਕਲਿੱਪਬੋਰਡ 'ਤੇ ਕਾਪੀ ਕੀਤਾ ਗਿਆ।
pl: Skopiowano do schowka.
pt: Copiado para a área de transferência.
pt_pt: Copiado para a área de transferência.
ro: S-a copiat în clipboard.
ru: Текст скопирован в буфер обмена.
si: පසුරු පුවරුවට පිටපත් කරන ලදි.
sk: Skopírované do schránky.
sq: U kopjua në kujtesën e fragmenteve
sr: Копирано је у привремену меморију.
sr_latn: Kopirano je u privremenu memoriju.
sv: Kopierat till urklipp.
te: క్లిప్‌బోర్డ్‌కు కాపీ అయింది.
th: คัดลอกไปยังคลิปบอร์ดแล้ว
tr: Panoya kopyalandı.
uk: Скопійовано в буфер обміну.
ur: کلپ بورڈ پر کاپی ہو گیا۔
uz: Klipbordga nusxalandi.
vi: Đã sao chép vào bảng nhớ tạm.
zh_hk: 已複製到剪貼簿。
zu: Kukopishwe kubhodi lokunamathisela.

# craneSleep8SemanticLabel
source: Mayan ruins on a cliff above a beach
af: Maja-ruïnes op 'n krans bo 'n strand
am: ከባህር ዳርቻ በላይ ባለ አምባ ላይ ያሉ የማያውያን ፍርስራሾች
ar_eg: أطلال "المايا" على جُرْف يطِلّ على الشاطئ
as: এটা উপকূলৰ ওপৰত মায়া সভ্যতাৰ ধ্বংসাৱশেষ
az: Çimərlikdəki qayalıqlarda Maya xarabalığı
be: Руіны цывілізацыі мая на ўцёсе над пляжам
bn: সমুদ্র সৈকতের কোনও একটি পাহাড়ে মায়ান সভ্যতার ধ্বংসাবশেষ
bs: Majanske ruševine na litici iznad plaže
ca: Ruïnes maies en un cingle a la platja
da: Mayaruiner på en klippeskrænt ved en strand
es_ar: Ruinas mayas en un acantilado sobre una playa
et: Maiade ehitiste varemed kaljuserval ranna kohal
eu: Maiar hondarrak itsaslabar baten ertzean
fa: خرابه‌های تمدن مایا بر صخره‌ای بالای ساحل
fil: Mga Mayan na guho sa isang talampas sa itaas ng beach
fr_ca: Ruines mayas sur une falaise surplombant une plage
gl: Ruínas maias no alto dun cantil xunto a unha praia
gu: મય બીચના ખડક પર ખંડેર
he: הריסות מבנים של בני המאיה על צוק מעל חוף ים
hi: समुद्र तट पर स्थित एक चट्टान पर माया सभ्यता के खंडहर
hu: Maja romok egy tengerparti sziklán
hy: Մայաների ավերակները լողափից վեր՝ ժայռի վրա
id: Reruntuhan kota suku Maya di tebing di atas pantai
it: Rovine maya su una scogliera sopra una spiaggia
ja: 海岸の断崖の上にあるマヤ遺跡
ka: მაიას ნანგრევები ზღვისპირა კლიფზე
km: សំណង់​បាក់បែក​នៃទីក្រុងម៉ាយ៉ាន​នៅលើ​ចំណោតច្រាំង​ពីលើឆ្នេរខ្សាច់
kn: ಸಮುದ್ರತೀರದ ಮೇಲಿರುವ ಬಂಡೆಯ ಮೇಲೆ ಮಾಯನ್ ಅವಶೇಷಗಳು
ko: 해안가 절벽 위 마야 문명 유적지
ky: Жээктеги асканын үстүндөгү Майя цивилизациясынын урандылары
lo: ຊາກເປ່ເພຂອງສິ່ງກໍ່ສ້າງຊາວມາຢັນຢູ່ໜ້າຜາເໜືອຫາດຊາຍ
lt: Majų griuvėsiai paplūdimyje ant uolos
lv: Maiju celtņu drupas uz klints virs pludmales
mk: Урнатини на Маите на карпа над плажа
ml: കടൽത്തീരത്തുള്ള മലഞ്ചെരുവിൽ മായൻ അവശിഷ്‌ടങ്ങൾ
mn: Далайн эрэг дээрх хадан цохионы Майягийн балгас туурь
mr: समुद्रकिनाऱ्याच्याबाजूला उंच डोंगरावर असलेले मायन संस्कृतीतील अवशेष
ms: Runtuhan maya pada cenuram di atas pantai
my: ကမ်းခြေထက် ကျောက်ကမ်းပါးတစ်ခုပေါ်ရှိ Mayan ဘုရားပျက်
nb: Maya-ruiner på en klippe over en strand
ne: समुद्र किनाराको माथि उठेको चट्टानमा माया सभ्यताका खण्डहरहरू
pa: ਬੀਚ 'ਤੇ ਚਟਾਨ ਉੱਪਰ ਮਾਇਆ ਸੱਭਿਅਤਾ ਦੇ ਖੰਡਰ
pl: Ruiny budowli Majów na klifie przy plaży
pt: Ruínas maias em um penhasco acima da praia
pt_pt: Ruínas maias num penhasco sobre uma praia
ro: Ruine mayașe pe o stâncă, deasupra unei plaje
ru: Руины майя на утесе над пляжем
si: වෙරළක් ඉහළින් කඳු ශිඛරයක මේයන් නටබුන්
sk: Mayské ruiny na útese nad plážou
sq: Rrënojat e fiseve maja në një shkëmb mbi një plazh
sr: Мајанске рушевине на литици изнад плаже
sr_latn: Majanske ruševine na litici iznad plaže
sv: Mayaruiner på en klippa ovanför en strand
te: బీచ్‌కి పైన కొండ శిఖరం మీద 'మాయన్' శిథిలాలు
th: ซากปรักหักพังของอารยธรรมมายันบนหน้าผาเหนือชายหาด
tr: Sahilin üst tarafında falezdeki Maya kalıntıları
uk: Руїни Майя на кручі над берегом
ur: بیچ کے اوپر پہاڑ پر مایا تہذیب کے کھنڈرات
uz: Sohil tepasidagi Maya vayronalari
vi: Những vết tích của nền văn minh Maya ở một vách đá phía trên bãi biển
zh_hk: 座落在懸崖上遙望海灘的馬雅遺跡
zu: Ukonakala kwase-Mayan eweni ngaphezulu kwebhishi

# craneSleep4SemanticLabel
source: Lake-side hotel in front of mountains
af: Hotel aan die oewer van 'n meer voor berge
am: ከተራራዎች ፊት ያለ የሐይቅ ዳርቻ ሆቴል
ar_eg: فندق يطِلّ على بحيرة قُبالة سلسلة من الجبال
as: পৰ্বতৰ সন্মুখত থকা এটা হ্ৰদৰ কাষৰীয়া হোটেল
az: Dağların qarşısında göl kənarı otel
be: Гасцініца на беразе возера пад гарой
bn: পাহাড়ের সামনে লেক সাইড হোটেল
bs: Hotel pored jezera ispred planina
ca: Hotel vora un llac i davant d'unes muntanyes
da: Hotel ved søen foran bjerge
es_ar: Hotel a orillas de un lago frente a las montañas
et: Mägihotell järve kaldal
eu: Mendialdeko hotel bat, laku baten ertzean
fa: هتل ساحلی رو به کوهستان
fil: Hotel sa tabi ng lawa sa harap ng mga bundok
fr_ca: Hôtel au bord du lac face aux montagnes
gl: Hotel á beira dun lago e fronte ás montañas
gu: પર્વતોની સામે તળાવ બાજુ હોટલ
he: מלון לחוף אגם על רקע הרים
hi: पहाड़ों के सामने, झील के किनारे बना होटल
hu: Hegyek előtt, tó partján álló szálloda
hy: Լճամերձ հյուրանոց՝ լեռների ֆոնի վրա
id: Hotel tepi danau yang menghadap pegunungan
it: Hotel sul lago di fronte alle montagne
ja: 後ろに山が広がる湖畔のホテル
ka: ტბისპირა სასტუმრო მთების ფონზე
km: សណ្ឋាគារ​ជាប់មាត់បឹង​នៅពី​មុខភ្នំ
kn: ಪರ್ವತಗಳ ಮುಂದೆ ನದಿ ತೀರದಲ್ಲಿನ ಹೋಟೆಲ್
ko: 산을 배경으로 한 호숫가 호텔
ky: Тоолордун этегиндеги көлдүн жеегинде жайгашкан мейманкана
lo: ໂຮງແຮມຮິມທະເລສາບທີ່ຢູ່ໜ້າພູ
lt: Viešbutis ežero pakrantėje su kalnais
lv: Viesnīca pie kalnu ezera
mk: Хотел крај езеро пред планини
ml: മലനിരകൾക്ക് മുന്നിലുള്ള തടാകതീരത്തെ ഹോട്ടൽ
mn: Уулын урдах нуурын эргийн зочид буудал
mr: डोंगरांसमोर वसलेले तलावाशेजारचे हॉटेल
ms: Hotel tepi tasik berhadapan gunung
my: တောင်တန်းများရှေ့ရှိ ကမ်းစပ်ဟိုတယ်
nb: Hotell ved en innsjø foran fjell
ne: पहाडका नजिकमा रहेको झील छेउको होटेल
pa: ਪਹਾੜਾਂ ਸਾਹਮਣੇ ਝੀਲ ਦੇ ਕਿਨਾਰੇ ਹੋਟਲ
pl: Hotel nad jeziorem z górami w tle
pt: Hotel às margens de um lago em frente às montanhas
pt_pt: Hotel voltado para o lago em frente a montanhas
ro: Hotel pe malul unui lac, în fața munților
ru: Гостиница у озера на фоне гор
si: කඳු වැටියක ඉදිරිපස ඇති වැව ඉස්මත්තේ හෝටලය
sk: Hotel na brehu jazera s horami v pozadí
sq: Hotel buzë liqenit përballë maleve
sr: Хотел на обали језера испред планина
sr_latn: Hotel na obali jezera ispred planina
sv: Hotell vid en sjö med berg i bakgrunden
te: పర్వతాల ముందు సరస్సు పక్కన ఉన్న హోటల్
th: โรงแรมริมทะเลสาบที่อยู่หน้าภูเขา
tr: Dağların yamacında, göl kenarında otel
uk: Готель біля озера на гірському тлі
ur: پہاڑوں کے سامنے جھیل کے کنارے ہوٹل
uz: Togʻlar bilan oʻralgan soy boʻyidagi mehmonxona
vi: Khách sạn bên hồ phía trước những ngọn núi
zh_hk: 背山而建的湖邊酒店
zu: Ihhotela elikuhlangothi lwechibi ngaphambi kwezintaba
