Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSelectionControlsCheckboxDescription
source: Checkboxes allow the user to select multiple options from a set. A normal checkbox's value is true or false and a tristate checkbox's value can also be null.
af: Merkblokkies maak dit vir die gebruiker moontlik om veelvuldige opsies uit 'n stel te kies. 'n Normale merkblokkie se waarde is waar of vals, en 'n driestaatmerkblokkie se waarde kan ook nul wees.
am: አመልካች ሳጥኖች ተጠቃሚው ከአንድ ስብስብ በርካታ አማራጮችን እንዲሰበስብ ያስችለዋል። የአንድ መደበኛ አመልካች ሳጥኑ እሴት እውነት ወይም ሐሰት ነው፣ እና የአንድ ባለሶስት-ሁኔታ እሴት እንዲሁም አልቦ መሆን ይችላል።
ar_eg: تسمح مربّعات الاختيار للمستخدمين باختيار عدة خيارات من مجموعة من الخيارات. القيمة المعتادة لمربّع الاختيار هي "صحيح" أو "غير صحيح" ويمكن أيضًا إضافة حالة ثالثة وهي "خالية".
as: চেকবাকচসমূহে এটা ছেটৰ পৰা একাধিক বিকল্প বাছনি কৰিবলৈ ব্যৱহাৰকাৰীক অনুমতি দিয়ে। এটা সাধাৰণ চেকবাকচৰ মান সঁচা অথবা মিছা হ’ব পাৰে আৰু এটা ট্ৰাইষ্টেট চেকবাকচৰ কোনো মান নাথাকিবও পাৰে।
az: Qeyd xanaları istifadəçiyə dəstdən bir neçə seçim etmək imkanı verir. Adi qeyd xanasındakı dəyər doğru və ya yanlış olur, üç vəziyyətli qeyd xanasındakı dəyər isə boş da ola bilər.
be: Палі для птушак дазваляюць карыстальніку выбраць з набору некалькі параметраў. Звычайнае значэнне ў полі для птушак – гэта "true" або "false", а значэнне поля для птушак з трыма станамі можа быць роўным нулю.
bn: চেকবক্স ব্যবহারকারীকে একটি সেট থেকে একাধিক বিকল্প বেছে নিতে দেয়। একটি সাধারণ চেকবক্সের মান সত্য বা মিথ্যা এবং একটি ট্রাইস্টেট চেকবক্সের মানটিও শূন্য হতে পারে।
bs: Polja za potvrdu omogućavaju korisniku da odabere više opcija iz skupa. Normalna vrijednost polja za potvrdu je tačno ili netačno, a treća vrijednost polja za potvrdu može biti i nula.
ca: Les caselles de selecció permeten que l'usuari seleccioni diverses opcions d'un conjunt. Normalment, el valor d'una casella de selecció és vertader o fals; en cas d'una casella de selecció amb tres estats, el tercer valor també pot ser nul.
da: Afkrydsningsfelter giver brugerne mulighed for at vælge flere valgmuligheder fra et sæt. Et normalt afkrydsningsfelt kan angives til værdierne sand eller falsk, og et afkrydsningsfelt med tre værdier kan også angives til nul.
es_ar: Las casillas de verificación permiten que el usuario seleccione varias opciones de un conjunto. El valor de una casilla de verificación normal es verdadero o falso y el valor de una casilla de verificación de triestado también puede ser nulo.
et: Märkeruudud võimaldavad kasutajal teha komplektis mitu valikut. Tavapärane märkeruudu väärtus on Tõene või Väär. Kolme valikuga märkeruudu üks väärtustest võib olla ka Null.
eu: Koadroei esker, multzo bereko aukera bat baino gehiago hauta ditzake erabiltzaileak. Koadroek Egia eta Gezurra balioak izan ohi dituzte. Hiru aukerakoak badira, aldiz, balio nulua izan ohi dute bi horiez gain.
fa: چارگوش انتخاب به کاربر اجازه می‌دهد چندین گزینه را از یک مجموعه انتخاب کند. ارزش عادی چارگوش انتخاب درست یا نادرست است و ممکن است چارگوش انتخاب سه‌حالته فاقد ارزش باشد.
fil: Nagbibigay-daan sa user ang mga checkbox na pumili ng maraming opsyon sa isang hanay. True o false ang value ng isang normal na checkbox at puwede ring null ang value ng isang tristate checkbox.
fr_ca: Les cases à cocher permettent à l'utilisateur de sélectionner de multiples options dans un ensemble. Une valeur normale d'une case à cocher est vraie ou fausse, et la valeur d'une case à cocher à trois états peut aussi être nulle.
gl: As caixas de verificación permiten que os usuarios seleccionen varias opcións dun conxunto e adoitan ter dous valores (verdadeiro ou falso), pero tamén poden incluír un terceiro (nulo).
gu: ચેકબૉક્સ વપરાશકર્તાને સેટમાંથી એકથી વધુ વિકલ્પો પસંદ કરવાની મંજૂરી આપે છે. સામાન્ય ચેકબૉક્સનું મૂલ્ય સાચું અથવા ખોટું છે અને ત્રણ સ્ટેટના ચેકબોક્સનું મૂલ્ય શૂન્ય પણ હોઈ શકે છે.
he: תיבות סימון מאפשרות למשתמש לבחור אפשרויות מרובות מתוך מבחר אפשרויות. ערך רגיל של תיבת סימון הוא 'נכון' או 'לא נכון' וערך שלישי בתיבת סימון יכול להיות גם 'חסר תוקף'.
hi: चेकबॉक्स से उपयोगकर्ता किसी सेट के एक से ज़्यादा विकल्प चुन सकते हैं. सामान्य चेकबॉक्स का मान सही या गलत होता है. साथ ही, तीन स्थिति वाले चेकबॉक्स का मान खाली भी छोड़ा जा सकता है.
hu: A jelölőnégyzetek lehetővé teszik a felhasználó számára, hogy egy adott csoportból több lehetőséget is kiválasszon. A normál jelölőnégyzetek értéke igaz vagy hamis lehet, míg a háromállapotú jelölőnégyzetek a null értéket is felvehetik.
hy: Նշավանդակների միջոցով օգտատերը կարող է ցանկից ընտրել մի քանի կարգավորումներ։ Նշավանդակը սովորաբար ունենում է true կամ false կարգավիճակը, և որոշ դեպքերում երրորդ արժեքը՝ null։
id: Kotak centang memungkinkan pengguna memilih beberapa opsi dari suatu kumpulan. Nilai kotak centang normal adalah true atau false dan nilai kotak centang tristate juga dapat null.
it: Le caselle di controllo consentono all'utente di selezionare diverse opzioni da un gruppo di opzioni. Il valore di una casella di controllo standard è true o false, mentre il valore di una casella di controllo a tre stati può essere anche null.
ja: チェックボックスでは、ユーザーが選択肢のセットから複数の項目を選択できます。通常のチェックボックスの値は True または False で、3 状態のチェックボックスの値は Null になることもあります。
ka: მოსანიშნი ველები მომხმარებელს საშუალებას აძლევს, აირჩიოს რამდენიმე ვარიანტი ნაკრებიდან. ჩვეულებრივი მოსანიშნი ველის მნიშვნელობებია სწორი ან არასწორი, ხოლო სამმდგომარეობიანი მოსანიშნი ველის მნიშვნელობა შეიძლება იყოს ნულიც.
km: ប្រអប់​ធីក​អនុញ្ញាតឱ្យ​អ្នកប្រើប្រាស់​ជ្រើសរើស​ជម្រើសច្រើន​ពីបណ្ដុំ​មួយ។ តម្លៃរបស់​ប្រអប់​ធីកធម្មតា​គឺពិត ឬមិនពិត ហើយតម្លៃ​របស់ប្រអប់ធីក​ដែលមាន​បីស្ថានភាពក៏អាច​ទទេ​បានផងដែរ។
kn: ಒಂದು ಸೆಟ್‌ನಿಂದ ಅನೇಕ ಆಯ್ಕೆಗಳನ್ನು ಆರಿಸಲು ಚೆಕ್ ಬಾಕ್ಸ್‌ಗಳು ಬಳಕೆದಾರರನ್ನು ಅನುಮತಿಸುತ್ತವೆ. ಸಾಮಾನ್ಯ ಚೆಕ್‌ಬಾಕ್ಸ್‌ನ ಮೌಲ್ಯವು ಸರಿ ಅಥವಾ ತಪ್ಪಾಗಿರಬಹುದು ಮತ್ತು ಟ್ರೈಸ್ಟೇಟ್ ಚೆಕ್‌ಬಾಕ್ಸ್‌ನ ಮೌಲ್ಯವೂ ಶೂನ್ಯವಾಗಿರಬಹುದು.
ko: 체크박스를 사용하면 집합에서 여러 옵션을 선택할 수 있습니다. 체크박스의 값은 보통 true 또는 false이며, 3상 체크박스의 경우 null 값도 가질 수 있습니다.
ky: Белгилөө кутучалары колдонуучуга топтомдогу бир нече параметрди тандоо үчүн керек. Кадимки белгилөө кутучасынын мааниси "true" же "false", ал эми үч абалды көрсөтүүчү белгилөө кутучасынын мааниси "null" болушу мүмкүн.
lo: ກ່ອງໝາຍຈະເຮັດໃຫ້ຜູ້ໃຊ້ສາມາດເລືອກຫຼາຍຕົວເລືອກຈາກຊຸດໃດໜຶ່ງໄດ້. ຄ່າຂອງກ່ອງໝາຍປົກກະຕິທີ່ເປັນ true ຫຼື false ແລະ ຄ່າຂອງກ່ອງໝາຍທີ່ມີສາມຄ່າສາມາດເປັນຄ່າ null ໄດ້ນຳ.
lt: Naudotojas žymimaisiais laukeliais gali pasirinkti kelias parinktis iš rinkinio. Įprasto žymimojo laukelio vertė yra „true“ (tiesa) arba „false“ (netiesa), o trijų parinkčių žymimojo laukelio vertė bė minėtųjų gali būti ir nulis.
lv: Izmantojot izvēles rūtiņas, lietotājs var atlasīt vairākas opcijas grupā. Parastas izvēles rūtiņas vērtība ir “true” vai “false”. Triju statusu izvēles rūtiņas vērtība var būt arī “null”.
mk: Полињата за избор му овозможуваат на корисникот да избере повеќе опции од еден збир. Вредноста на обичното поле за избор е „точно“ или „неточно“, а вредноста на полето со три избори може да биде и нула.
ml: ഒരു സെറ്റിൽ നിന്ന് ഒന്നിലധികം ഓപ്ഷനുകൾ തിരഞ്ഞെടുക്കാൻ ചെക്ക്‌ ബോക്‌സുകൾ ഉപയോക്താവിനെ അനുവദിക്കുന്നു. ഒരു സാധാരണ ചെക്ക്ബോക്‌സിന്റെ മൂല്യം ശരിയോ തെറ്റോ ആണ്, കൂടാതെ ഒരു ട്രൈസ്‌റ്റേറ്റ് ചെക്ക്ബോക്‌സിന്റെ മൂല്യവും അസാധുവാണ്.
mn: Checkboxes нь хэрэглэгчид багцаас олон сонголт сонгохыг зөвшөөрдөг. Энгийн тэмдэглэх нүдний утга нь үнэн эсвэл худал, tristate тэмдэглэх нүдний утга нь мөн тэг байж болно.
mr: चेकबॉक्स हे संचामधून एकाहून अधिक पर्याय निवडण्याची अनुमती देतात. सामान्य चेकबॉक्सचे मूल्य खरे किंवा खोटे असते आणि ट्रायस्टेट चेकबॉक्सचे मूल्य शून्यदेखील असू शकते.
ms: Kotak pilihan membenarkan pengguna memilih beberapa pilihan daripada satu set. Nilai kotak pilihan biasa adalah benar atau salah dan nilai kotak pilihan tiga keadaan juga boleh menjadi sifar.
my: အမှန်ခြစ်ရန်နေရာများသည် အုပ်စုတစ်ခုမှ တစ်ခုထက်ပို၍ ရွေးချယ်ခွင့်ပေးသည်။ ပုံမှန်အမှန်ခြစ်ရန်နေရာ၏ တန်ဖိုးသည် အမှန် သို့မဟုတ် အမှားဖြစ်ပြီး အခြေအနေသုံးမျိုးပါ အမှန်ခြစ်ရန်နေရာ၏ တန်ဖိုးသည် ဗလာလည်း ဖြစ်နိုင်သည်။
nb: Brukere kan bruke avmerkingsbokser til å velge flere alternativer fra et sett. Verdien til en normal avmerkingsboks er sann eller usann, og verdien til en avmerkingsboks med tre tilstander kan også være null.
ne: जाँच बाकसहरूले प्रयोगकर्तालाई कुनै सेटबाट बहु विकल्पहरूको चयन गर्न अनुमति दिन्छन्। साधारण जाँच बाकसको मान सही वा गलत हुन्छ र तीन स्थिति भएको जाँच बाकसको मान पनि रिक्त हुन सक्छ।
pa: ਚੈੱਕ-ਬਾਕਸ ਵਰਤੋਂਕਾਰ ਨੂੰ ਕਿਸੇ ਸੈੱਟ ਵਿੱਚੋਂ ਕਈ ਵਿਕਲਪਾਂ ਨੂੰ ਚੁਣਨ ਦਿੰਦਾ ਹੈ। ਕਿਸੇ ਸਧਾਰਨ ਚੈੱਕ-ਬਾਕਸ ਦਾ ਮੁੱਲ ਸਹੀ ਜਾਂ ਗਲਤ ਹੁੰਦਾ ਹੈ ਅਤੇ ਕਿਸੇ ਤੀਹਰੇ ਚੈੱਕ-ਬਾਕਸ ਦਾ ਮੁੱਲ ਖਾਲੀ ਵੀ ਹੋ ਸਕਦਾ ਹੈ।
pl: Pola wyboru pozwalają użytkownikowi na wybranie jednej lub kilku opcji z wielu dostępnych. Zazwyczaj pole wyboru ma wartość „prawda” i „fałsz”. Pole trójstanowe może mieć też wartość zerową (null).
pt: As caixas de seleção permitem que o usuário escolha várias opções de um conjunto. O valor normal de uma caixa de seleção é verdadeiro ou falso, e uma com três estados também pode ter seu valor como nulo.
pt_pt: As caixas de verificação permitem que o utilizador selecione várias opções num conjunto. O valor de uma caixa de verificação normal é verdadeiro ou falso e o valor de uma caixa de verificação de três estados também pode ser nulo.
ro: Cu ajutorul casetelor de selectare, utilizatorii pot să aleagă mai multe opțiuni dintr-un set. Valoarea normală a unei casete este true sau false. O casetă cu trei stări poate avea și valoarea null.
ru: С помощью флажка пользователь может выбрать несколько параметров из списка. Чаще всего у флажка есть два состояния. В некоторых случаях предусмотрено третье.
si: තේරීම් කොටු පරිශීලකයන්ට කට්ටලයකින් විකල්ප කීපයක් තේරීමට ඉඩ දෙයි. සාමාන්‍ය තේරීම් කොටුවක අගය සත්‍ය හෝ අසත්‍ය වන අතර ත්‍රිවිධාකාර තේරීම් කොටුවක අගය ද ශුන්‍ය විය හැකිය.
sk: Začiarkavacie políčka umožňujú používateľovi vybrať viacero možností zo skupiny možností. Hodnota bežného začiarkavacieho políčka je pravda alebo nepravda. Hodnota začiarkavacieho políčka s troma stavmi môže byť tiež nulová.
sq: Kutitë e kontrollit e lejojnë përdoruesin të zgjedhë shumë opsione nga një grup. Vlera e një kutie normale kontrolli është "E vërtetë" ose "E gabuar" dhe vlera e një kutie zgjedhjeje me tre gjendje mund të jetë edhe "Zero".
sr: Поља за потврду омогућавају кориснику да изабере више опција из скупа. Вредност уобичајеног поља за потврду је Тачно или Нетачно, а вредност троструког поља за потврду може да буде и Ништа.
sr_latn: Polja za potvrdu omogućavaju korisniku da izabere više opcija iz skupa. Vrednost uobičajenog polja za potvrdu je Tačno ili Netačno, a vrednost trostrukog polja za potvrdu može da bude i Ništa.
sv: Med kryssrutor kan användaren välja mellan flera alternativ från en uppsättning. Värdet för en normal kryssruta är sant eller falskt. För en kryssruta med tre lägen kan värdet även vara tomt.
te: చెక్‌బాక్స్‌లు అనేవి ఒక సెట్ నుండి బహుళ ఎంపికలను ఎంచుకోవడానికి యూజర్‌ను అనుమతిస్తాయి. ఒక సాధారణ చెక్‌బాక్స్ విలువ ఒప్పు లేదా తప్పు కావొచ్చు. మూడు స్థితుల చెక్‌బాక్స్‌లో ఒక విలువ 'శూన్యం' కూడా కావచ్చు.
th: ช่องทำเครื่องหมายให้ผู้ใช้เลือกตัวเลือกจากชุดตัวเลือกได้หลายรายการ ค่าปกติของช่องทำเครื่องหมายคือ "จริง" หรือ "เท็จ" และค่า 3 สถานะของช่องทำเครื่องหมายอาจเป็น "ว่าง" ได้ด้วย
tr: Onay kutuları, kullanıcıya bir dizi seçenek arasından birden fazlasını belirlemesine olanak sağlar. Normal bir onay kutusunun değeri true (doğru) veya false (yanlış) olur. Üç durumlu onay kutusunun değeri boş da olabilir.
uk: Прапорці дають користувачам змогу вибирати кілька параметрів із набору. Звичайний прапорець обмежується значеннями true або false, тоді як трьохпозиційний також може мати значення null.
ur: چیک باکسز صارف کو سیٹ سے متعدد اختیارات کو منتخب کرنے کی اجازت دیتا ہے۔ عام چیک باکس کی قدر صحیح یا غلط ہوتی ہے اور تین حالتوں والے چیک باکس کو خالی بھی چھوڑا جا سکتا ہے۔
uz: Belgilash katakchasi bilan foydalanuvchi roʻyxatdagi bir nechta elementni tanlay oladi. Katakchalar ikki qiymatda boʻladi, ayrim vaqtlarda uchinchi qiymat ham ishlatiladi.
vi: Các hộp kiểm cho phép người dùng chọn nhiều tùy chọn trong một tập hợp. Giá trị thông thường của hộp kiểm là true hoặc false và giá trị 3 trạng thái của hộp kiểm cũng có thể là null.
zh_hk: 選框讓使用者從一組選項中選擇多個選項。一般選框的數值為 true 或 false，而三值選框則可包括空白值。
zu: Amabhokisi okuhlola avumela umsebenzisi ukuthi akhethe okunye okungakhethwa kusukela kusethi. Inani elijwayelekile lebhokisi lokuhlola liyiqiniso noma lingamanga futhi inani lebhokisi lokuhlola le-tristate nalo lingaba ngelingavumelekile.

# settingsButtonLabel
source: Settings
af: Instellings
am: ቅንብሮች
ar_eg: الإعدادات
as: ছেটিংসমূহ
az: Ayarlar
be: Налады
bn: সেটিংস
bs: Postavke
ca: Configuració
da: Indstillinger
es_ar: Configuración
et: Seaded
eu: Ezarpenak
fa: تنظیمات
fil: Mga Setting
fr_ca: Paramètres
gl: Configuración
gu: સેટિંગ
he: הגדרות
hi: सेटिंग
hu: Beállítások
hy: Կարգավորումներ
id: Setelan
it: Impostazioni
ja: 設定
ka: პარამეტრები
km: ការកំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 설정
ky: Параметрлер
lo: ການຕັ້ງຄ່າ
lt: Nustatymai
lv: Iestatījumi
mk: Поставки
ml: ക്രമീകരണം
mn: Тохиргоо
mr: सेटिंग्ज
ms: Tetapan
my: ဆက်တင်များ
nb: Innstillinger
ne: सेटिङ
pa: ਸੈਟਿੰਗਾਂ
pl: Ustawienia
pt: Configurações
pt_pt: Definições
ro: Setări
ru: Настройки
si: සැකසීම්
sk: Nastavenia
sq: Cilësimet
sr: Подешавања
sr_latn: Podešavanja
sv: Inställningar
te: సెట్టింగ్‌లు
th: การตั้งค่า
tr: Ayarlar
uk: Налаштування
ur: ترتیبات
uz: Sozlamalar
vi: Phần cài đặt
zh_hk: 設定
zu: Izilungiselelo

# demoListsTitle
source: Lists
af: Lyste
am: ዝርዝሮች
ar_eg: القوائم
as: সূচীসমূহ
az: Siyahılar
be: Спісы
bn: তালিকা
bs: Liste
ca: Llistes
da: Lister
es_ar: Listas
et: Loendid
eu: Zerrendak
fa: فهرست‌ها
fil: Mga Listahan
fr_ca: Listes
gl: Listas
gu: સૂચિઓ
he: רשימות
hi: सूचियां
hu: Listák
hy: Ցանկեր
id: Daftar
it: Elenchi
ja: リスト
ka: სიები
km: បញ្ជី
kn: ಪಟ್ಟಿಗಳು
ko: 목록
ky: Тизмелер
lo: ລາຍຊື່
lt: Sąrašai
lv: Saraksti
mk: Списоци
ml: ലിസ്റ്റുകൾ
mn: Жагсаалтууд
mr: सूची
ms: Senarai
my: စာရင်းများ
nb: Lister
ne: सूचीहरू
pa: ਸੂਚੀਆਂ
pl: Listy
pt: Listas
pt_pt: Listas
ro: Liste
ru: Списки
si: ලැයිස්තු
sk: Zoznamy
sq: Listat
sr: Листе
sr_latn: Liste
sv: Listor
te: లిస్ట్‌లు
th: รายการ
tr: Listeler
uk: Списки
ur: فہرستیں
uz: Roʻyxatlar
vi: Danh sách
zh_hk: 清單
zu: Uhlu

# demoListsSubtitle
source: Scrolling list layouts
af: Rollysuitlegte
am: የዝርዝር አቀማመጦችን በመሸብለል ላይ
ar_eg: التمرير خلال تنسيقات القوائم
as: স্ক্ৰ’লিং সূচীৰ লে’আউটসমূহ
az: Sürüşən siyahı düzənləri
be: Макеты спісаў, якія прагортваюцца
bn: তালিকার লে-আউট স্ক্রল করা হচ্ছে
bs: Izgledi liste koju je moguće klizati
ca: Desplaçar-se per dissenys de llistes
da: Layout for rullelister
es_ar: Diseños de lista que se puede desplazar
et: Loendi paigutuste kerimine
eu: Zerrenda lerrakorren diseinuak
fa: طرح‌بندی‌های فهرست پیمایشی
fil: Mga layout ng nagso-scroll na listahan
fr_ca: Dispositions de liste défilante
gl: Desprazando deseños de listas
gu: સ્ક્રોલિંગ સૂચિ લેઆઉટ
he: פריסות של רשימת גלילה
hi: ऐसी सूची के लेआउट जिसे स्क्रोल किया जा सकता है
hu: Görgethető lista elrendezései
hy: Ոլորման ցանկի դասավորություններ
id: Tata letak daftar scroll
it: Layout elenchi scorrevoli
ja: リスト レイアウトのスクロール
ka: განლაგებების სიაში გადაადგილება
km: ប្លង់​បញ្ជី​រំកិល
kn: ಸ್ಕ್ರೋಲಿಂಗ್ ಪಟ್ಟಿ ಲೇಔಟ್‌ಗಳು
ko: 스크롤 목록 레이아웃
ky: Тизме калыптарын сыдыруу
lo: ໂຄງຮ່າງລາຍຊື່ແບບເລື່ອນໄດ້
lt: Slenkamojo sąrašo išdėstymai
lv: Ritināmo sarakstu izkārtojumi
mk: Распореди на подвижен список
ml: സ്ക്രോൾ ചെയ്യുന്ന ലിസ്റ്റിന്റെ ലേഔട്ടുകൾ
mn: Жагсаалтын бүдүүвчийг гүйлгэх
mr: सूची स्क्रोल करण्याचा लेआउट
ms: Reka letak senarai penatalan
my: လှိမ့်ခြင်းစာရင်း အပြင်အဆင်များ
nb: Layout for rullelister
ne: स्क्रोल गर्ने सूचीका लेआउटहरू
pa: ਸਕ੍ਰੋਲਿੰਗ ਸੂਚੀ ਖਾਕੇ
pl: Przewijanie układów list
pt: Layouts de lista rolável
pt_pt: Esquemas de listas de deslocamento
ro: Aspecte de liste derulante
ru: Макеты прокручиваемых списков
si: අනුචලනය කිරීමේ ලැයිස්තු පිරිසැලසුම්
sk: Rozloženia posúvacích zoznamov
sq: Lëvizja e strukturave të listës
sr: Изгледи покретних листа
sr_latn: Izgledi pokretnih lista
sv: Layouter med scrollningslista
te: స్క్రోల్ చేయదగిన లిస్ట్‌ లేఅవుట్‌లు
th: เลย์เอาต์รายการแบบเลื่อน
tr: Kayan liste düzenleri
uk: Макети списків із прокруткою
ur: اسکرولنگ فہرست کا لے آؤٹس
uz: Skrollanuvchi roʻyxat maketlari
vi: Bố cục của danh sách cuộn
zh_hk: 可捲動清單的版面配置
zu: Izendlalelo zohlu lokuskrola

# demoListsDescription
source: A single fixed-height row that typically contains some text as well as a leading or trailing icon.
af: 'n Enkele ry met vaste hoogte wat gewoonlik 'n bietjie teks bevat, asook 'n ikoon vooraan of agteraan.
am: በተለምዶ የተወሰነ ጽሑፍና እንዲሁም መሪ ወይም ተከታይ አዶ የያዘ አንድ ባለነጠላ ቋሚ ረድፍ።
ar_eg: صف بارتفاع واحد ثابت يحتوي عادةً على نص ورمز سابق أو لاحق.
as: এটা একক স্থিৰ উচ্চতাৰ শাৰী য’ত সচৰাচৰ কিছুমান পাঠ তথা লীডিং অথবা ট্ৰেইলিং আইকন থাকে।
az: Adətən mətn, öndə və sonda ikona daxil olan hündürlüyü sabit olan bir sətir.
be: Адзіны фіксаваны па вышыні радок, які звычайна ўтрымлівае тэкст, а таксама пачатковы і канцавы значкі.
bn: একক নির্দিষ্ট উচ্চতাসম্পন্ন সারি যেখানে কিছু টেক্সট সহ লিডিং অথবা ট্রেলিং আইকন রয়েছে।
bs: Jedan red fiksne visine koji uglavnom sadrži tekst te ikonu na početku ili na kraju.
ca: Una fila d'alçada fixa que normalment conté text i una icona al principi o al final.
da: En enkelt række med fast højde, som typisk indeholder tekst samt et foranstillet eller efterstillet ikon.
es_ar: Una fila de altura única y fija que suele tener texto y un ícono al principio o al final
et: Üks fikseeritud kõrgusega rida, mis sisaldab tavaliselt teksti ja ikooni rea alguses või lõpus.
eu: Altuera finkoko lerro bakarra; testua eta haren atzean edo aurrean ikono bat izan ohi ditu.
fa: یک ردیف واحد با ارتفاع ثابت که معمولاً حاوی مقداری نوشتار و نمادی در ابتدا یا انتها است.
fil: Isang row na nakapirmi ang taas na karaniwang naglalaman ng ilang text pati na rin isang icon na leading o trailing.
fr_ca: Ligne unique à hauteur fixe qui contient généralement du texte ainsi qu'une icône au début ou à la fin.
gl: Unha única liña de altura fixa que normalmente contén texto así como unha icona ao principio ou ao final.
gu: એક નિશ્ચિત-ઊંચાઈની પંક્તિમાં સામાન્ય રીતે અમુક ટેક્સ્ટ તેમજ તેની આગળ કે પાછળ આઇકન શામેલ હોય છે.
he: שורה יחידה בגובה קבוע, שלרוב מכילה טקסט כלשהו וכן סמל בתחילתה או בסופה.
hi: एक ऐसी पंक्ति जिसकी लंबाई बदली नहीं जा सकती और जिसमें कुछ टेक्स्ट होता है. साथ ही, इसकी शुरुआत या आखिर में एक आइकॉन भी होता है.
hu: Egyetlen, fix magasságú sor, amely általában szöveget tartalmaz, és az elején vagy végén ikon található.
hy: Ֆիքսված բարձրությամբ մեկ տող, որը սովորաբար պարունակում է տեքստ, ինչպես նաև պատկերակ՝ տեքստի սկզբում կամ վերջում։
id: Baris tunggal dengan ketinggian tetap yang biasanya berisi teks serta ikon di awal atau akhir.
it: Una singola riga con altezza fissa che generalmente contiene del testo e un'icona iniziale o finale.
ja: 通常、高さが固定された 1 行には、テキストとその前後のアイコンが含まれます。
ka: ფიქსირებული სიმაღლის ერთი მწკრივი, რომელიც, ჩვეულებრივ, შეიცავს ტექსტს, ასევე ხატულას თავში ან ბოლოში.
km: ជួរដេកតែមួយដែលមានកម្ពស់ថេរ ដែលជាទូទៅមានអក្សរមួយចំនួន ក៏ដូចជារូបតំណាងនៅពីមុខ ឬពីក្រោយ។
kn: ಸ್ಥಿರ-ಎತ್ತರದ ಒಂದು ಸಾಲು ಸಾಮಾನ್ಯವಾಗಿ ಕೆಲವು ಪಠ್ಯ, ಜೊತೆಗೆ ಲೀಡಿಂಗ್ ಅಥವಾ ಟ್ರೇಲಿಂಗ್ ಐಕಾನ್ ಅನ್ನು ಹೊಂದಿರುತ್ತದೆ.
ko: 목록은 고정된 높이의 단일 행으로 구성되어 있으며 각 행에는 일반적으로 일부 텍스트와 선행 및 후행 들여쓰기 아이콘이 포함됩니다.
ky: Адатта текст жана сүрөтчө камтылган, бийиктиги бекитилген жалгыз сап.
lo: ແຖບທີ່ມີຄວາມສູງແບບຕາຍຕົວແຖວດ່ຽວທີ່ປົກກະຕິຈະມີຂໍ້ຄວາມຈຳນວນໜຶ່ງຮວມທັງໄອຄອນນຳໜ້າ ຫຼື ຕໍ່ທ້າຍ
lt: Viena fiksuoto aukščio eilutė, kurioje paprastai yra teksto bei piktograma pradžioje ar pabaigoje.
lv: Viena fiksēta augstuma rindiņa, kas parasti ietver tekstu, kā arī ikonu pirms vai pēc teksta.
mk: Еден ред со фиксна висина што обично содржи текст, како и икона на почетокот или на крајот.
ml: സാധാരണയായി ചില ടെക്സ്റ്റുകളും ഒപ്പം ലീഡിംഗ് അല്ലെങ്കിൽ ട്രെയിലിംഗ് ഐക്കണും അടങ്ങുന്ന, നിശ്ചിത ഉയരമുള്ള ഒറ്റ വരി.
mn: Тогтмол өндөртэй ганц мөр нь ихэвчлэн зарим текст болон эхлэх эсвэл төгсгөх дүрс тэмдэг агуулдаг.
mr: एका निश्चित केलेल्या उंच पंक्तीमध्ये सामान्यतः थोड्या मजकुराचा तसेच एखादा लीडिंग किंवा ट्रेलिंग आयकनचा समावेश असतो.
ms: Baris tunggal ketinggian tetap yang biasanya mengandungi beberapa teks serta ikon mendulu atau mengekor.
my: ယေဘုယျအားဖြင့် စာသားအချို့အပြင် ထိပ်ပိုင်း သို့မဟုတ် နောက်ပိုင်းတွင် သင်္ကေတများ ပါဝင်သည့် တိကျသောအမြင့်ရှိသော စာကြောင်းတစ်ကြောင်း။
nb: Én enkelt rad med fast høyde som vanligvis inneholder tekst samt et innledende eller etterfølgende ikon.
ne: सामान्य रूपमा केही पाठका साथै अगाडि वा पछाडि आइकन समावेश हुने स्थिर उचाइ भएको एकल पङ्क्ति।
pa: ਸਥਿਰ-ਉਚਾਈ ਵਾਲੀ ਇਕਹਿਰੀ ਕਤਾਰ ਜਿਸ ਵਿੱਚ ਆਮ ਤੌਰ 'ਤੇ ਸ਼ੁਰੂਆਤ ਜਾਂ ਪਿਛੋਕੜ ਵਾਲੇ ਪ੍ਰਤੀਕ ਦੇ ਨਾਲ ਕੁਝ ਲਿਖਤ ਵੀ ਸ਼ਾਮਲ ਹੁੰਦੀ ਹੈ।
pl: Jeden wiersz o stałej wysokości, który zwykle zawiera tekst i ikonę na początku lub na końcu.
pt: Uma única linha com altura fixa e que normalmente contém algum texto, assim como um ícone à direita ou esquerda.
pt_pt: Uma linha única de altura fixa que, normalmente, contém algum texto, bem como um ícone à esquerda ou à direita.
ro: Un singur rând cu înălțime fixă, care conține de obicei text și o pictogramă la început sau la sfârșit.
ru: Одна строка с фиксированным размером, которая обычно содержит текст и значок.
si: සාමාන්‍යයෙන් සමහර පෙළ මෙන්ම ඉදිරිපස හෝ පසුපස අයිකනයක් අඩංගු වන තනි ස්ථීර උසක් ඇති පේළියකි.
sk: Jeden riadok s pevnou výškou, ktorý obvykle obsahuje text a ikonu na začiatku alebo na konci.
sq: Një rresht i njëfishtë me lartësi fikse që përmban normalisht tekst si edhe një ikonë pararendëse ose vijuese.
sr: Један ред фиксне висине који обично садржи неки текст, као и икону на почетку или на крају.
sr_latn: Jedan red fiksne visine koji obično sadrži neki tekst, kao i ikonu na početku ili na kraju.
sv: En enkelrad med fast höjd som vanligtvis innehåller text och en ikon före eller efter texten.
te: ఒక స్థిరమైన వరుస సాధారణంగా కొంత వచనంతో పాటు ప్రారంభంలో లేదా చివరిలో చిహ్నాన్ని కలిగి ఉంటుంది.
th: แถวเดี่ยวความสูงคงที่ซึ่งมักจะมีข้อความบางอย่างรวมถึงไอคอนนำหน้าหรือต่อท้าย
tr: Tipik olarak biraz metnin yanı sıra başında veya sonunda simge olan sabit yükseklikli tek satır.
uk: Один рядок фіксованої висоти, який зазвичай містить текст і значок на початку або в кінці.
ur: ایک واحد مقررہ اونچائی والی قطار جس میں عام طور پر کچھ متن کے ساتھ ساتھ آگے یا پیچھے کرنے والا ایک آئیکن ہوتا ہے۔
uz: Balandligi mahkamlangan va odatda boshida yoki oxirida rasm aks etuvchi matnlardan iborat boʻladi.
vi: Một hàng có chiều cao cố định thường chứa một số văn bản cũng như biểu tượng ở đầu hoặc ở cuối.
zh_hk: 這種固定高度的單列一般載有文字和在開頭或結尾載有圖示。
zu: Umugqa wokuphakama okulungisiwe oqukethe umbhalo kanye nesithonjana esilandelayo noma esiholayo.

# demoOneLineListsTitle
source: One Line
af: Een reël
am: አንድ መስመር
ar_eg: سطر واحد
as: এটা শাৰী
az: Bir sətir
be: Адзін радок
bn: প্রতি সারিতে একটি লাইন
bs: Jedan red
ca: Una línia
da: Én linje
es_ar: Una línea
et: Üks rida
eu: Lerro bat
fa: یک خط
fil: Isang Linya
fr_ca: Une ligne
gl: Unha liña
gu: એક લાઇન
he: שורה אחת
hi: एक लाइन
hu: Egysoros
hy: Մեկ գիծ
id: Satu Baris
it: Una riga
ja: 1 行
ka: ერთი ხაზი
km: មួយជួរ
kn: ಒಂದು ಸಾಲು
ko: 한 줄
ky: Бир сап
lo: ແຖວດຽວ
lt: Viena eilutė
lv: Viena rindiņa
mk: Една линија
ml: ഒറ്റ വരി
mn: Нэг шугам
mr: एक ओळ
ms: Satu Baris
my: တစ်ကြောင်း
nb: Én linje
ne: एक पङ्क्ति
pa: ਇੱਕ ਲਾਈਨ
pl: Jeden wiersz
pt: Uma linha
pt_pt: Uma linha
ro: Un rând
ru: Одна строка
si: පේළි එකයි
sk: Jeden riadok
sq: Një rresht
sr: Један ред
sr_latn: Jedan red
sv: En rad
te: ఒక పంక్తి
th: หนึ่งบรรทัด
tr: Tek Satır
uk: Один рядок
ur: ایک لائن
uz: Bir qator
vi: 1 dòng
zh_hk: 單行
zu: Umugqa owodwa
