Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoActionSheetDescription
source: An action sheet is a specific style of alert that presents the user with a set of two or more choices related to the current context. An action sheet can have a title, an additional message, and a list of actions.
af: 'n Handelingelys is 'n spesifieke styl opletberig wat 'n stel van twee of meer keuses wat met die huidige konteks verband hou, aan die gebruiker bied. 'n Handelingelys kan 'n titel, 'n bykomende boodskap en 'n lys handelinge hê.
am: የእርምጃ ሉህ ከሁለት ወይም ከዚያ በላይ አሁን ካለው ዓውድ ጋር ግንኙነት ያላቸው ምርጫዎች ጋር የምርጫ ስብስብ ለተጠቃሚው የሚያቀርብ የተወሰነ የማንቂያ ቅጥ ነው። የእርምጃ ሉህ አርዕስት፣ ተጨማሪ መልዕክት፣ እና የእርምጃዎች ዝርዝር ሊኖረው ይችላል።
ar_eg: ورقة الإجراءات هي ورقة أنماط معيّنة للتنبيهات تقدّم للمستخدم مجموعة مكوّنة من خيارين أو أكثر مرتبطة بالسياق الحالي. ويمكن أن تتضمّن ورقة الإجراءات عنوانًا ورسالة إضافية وقائمة إجراءات.
as: এখন কার্যৰ শ্বীট হৈছে সতর্কবার্তাৰ এক নির্দিষ্ট শৈলী, যি ব্যৱহাৰকাৰীক প্ৰাসংগিক দুটা ছেট অথবা তাতকৈ অধিক বাছনি কৰিব পৰা বিকল্পৰ সৈতে আগবঢ়ায়। এখন কার্য শ্বীটৰ এটা শিৰোনাম, এটা অতিৰিক্ত বার্তা আৰু এখন কার্যসমূহৰ সূচী থাকিব পাৰে।
az: Əməliyyat cədvəli istifadəçiyə cari kontekstlə əlaqəli iki və ya daha çox seçim dəsti təqdim edən xüsusi xəbərdarlıq üslubudur. Əməliyyat cədvəlində başlıq, əlavə mesaj və əməliyyatların siyahısı ola bilər.
be: Аркуш дзеяння – гэта асаблівы стыль абвесткі, калі карыстальніку ў сувязі з пэўным змесцівам прапануецца на выбар больш за адзін варыянт. Аркуш дзеяння можа мець назву, дадатковае паведамленне і спіс дзеянняў.
bn: একটি অ্যাকশন শিট হল নির্দিষ্ট ধরনের অ্যালার্ট যা ব্যবহারকারীদের কাছে বর্তমান প্রসঙ্গ সম্পর্কিত দুটি বা তারও বেশি সেট তুলে ধরে. অ্যাকশন শিটে শীর্ষক, অতিরিক্ত মেসেজ এবং অ্যাকশনের তালিকা থাকতে পারে।
bs: Tabela radnji je posebna vrsta obavještenja koja korisniku daje dva ili više izbora u vezi s trenutnim kontekstom. Tabela radnji može imati naslov, dodatnu poruku i spisak radnji.
ca: Un full d'accions és un estil específic d'alertes que ofereix a l'usuari dues o més opcions relacionades amb el context actual. Pot incloure un títol, un missatge addicional i una llista d'accions.
da: Et handlingsark angiver, hvilken slags underretning der vises for brugeren med to eller flere valg, der er relevante i sammenhængen. Et handlingsark kan have en titel, en ekstra meddelelse og en liste med handlinger.
es_ar: Una hoja de acciones es un estilo específico de alerta que brinda al usuario un conjunto de dos o más opciones relacionadas con el contexto actual. Una hoja de acciones puede tener un título, un mensaje adicional y una lista de acciones.
et: Toiminguleht on teatud tüüpi hoiatus, mis pakub kasutajale vähemalt kahte valikut, mis on seotud praeguse kontekstiga. Toimingulehel võib olla pealkiri, lisasõnum ja toimingute loend.
eu: Ekintza-orria alerta-estilo bat da, eta bi aukera edo gehiago ematen dizkio erabiltzaileari oraingo testuingurua kontuan hartuta. Ekintza-orriek izenburu bat, mezu gehigarri bat eta ekintza-zerrenda bat izan ditzakete.
fa: «برگ کنش»، سبک خاصی از هشدار است که مجموعه‌ای از دو یا چند انتخاب مرتبط با محتوای کنونی را به کاربر ارائه می‌دهد. «برگ کنش» می‌تواند عنوان، پیامی اضافی، و فهرستی از کنش‌ها را داشته باشد.
fil: Ang sheet ng pagkilos ay isang partikular na istilo ng alerto na nagpapakita sa user ng isang hanay ng dalawa o higit pang opsyong nauugnay sa kasalukuyang konteksto. Puwedeng may pamagat, karagdagang mensahe, at listahan ng mga pagkilos ang sheet ng pagkilos.
fr_ca: Une feuille d'action est un type d'alerte précis qui présente à l'utilisateur deux choix ou plus à propos de la situation actuelle. Une feuille d'action peut comprendre un titre, un message supplémentaire et une liste d'actions.
gl: Unha folla de acción é un tipo de alerta que lle ofrece ao usuario un conxunto de dúas ou máis escollas relacionadas co contexto actual. Pode ter un título, unha mensaxe adicional e unha lista de accións.
gu: ઍક્શન શીટ એ અલર્ટની એક ચોક્કસ શૈલી છે જે વપરાશકર્તા સમક્ષ વર્તમાન સંદર્ભથી સંબંધિત બે કે તેથી વધુ વિકલ્પોનો સેટ પ્રસ્તુત કરે છે. ઍક્શન શીટમાં શીર્ષક, વૈકલ્પિક સંદેશ અને ક્રિયાઓની સૂચિ હોય શકે છે.
he: גיליון פעולות הוא סגנון ספציפי של התראה, שבה מוצגות למשתמש שתי אפשרויות או יותר בהקשר הנוכחי. גיליון פעולות יכול לכלול כותרת, הודעה נוספת ורשימת פעולות.
hi: कार्रवाई शीट, सूचनाओं की एक खास शैली है जिसमें उपयोगकर्ता को मौजूदा संदर्भ से जुड़े दो या उससे ज़्यादा विकल्पों वाले सेट की सुविधा मिलती है. किसी कार्रवाई शीट में एक टाइटल, अन्य मैसेज, और कार्रवाइयों की सूची हो सकती है.
hu: A műveleti lapok olyan speciális stílusú értesítések, amelyek két vagy több választást biztosítanak a felhasználónak az adott kontextusban. A műveleti lapnak lehet címe, további üzenete és műveleti listája.
hy: Գործողությունների ցանկը ծանուցման հատուկ տեսակ է, որում օգտատիրոջն առաջարկվում է գործողությունների առնվազն երկու տարբերակ՝ կախված կոնտեքստից։ Ցանկը կարող է ունենալ վերնագիր, լրացուցիչ հաղորդագրություն, ինչպես նաև հասանելի գործողությունների ցանկ։
id: Sheet tindakan adalah gaya khusus notifikasi yang menghadirkan serangkaian dua atau beberapa pilihan terkait dengan konteks saat ini kepada pengguna. Sheet tindakan dapat memiliki judul, pesan tambahan, dan daftar tindakan.
it: Un foglio azioni è un avviso con uno stile specifico che presenta all'utente un insieme di due o più scelte relative al contesto corrente. Un foglio azioni può avere un titolo, un messaggio aggiuntivo e un elenco di azioni.
ja: アクション シートは、現在のコンテキストに関連する 2 つ以上の選択肢の集合をユーザーに提示する特定のスタイルのアラートです。タイトル、追加メッセージ、アクション リストを設定できます。
ka: ქმედებათა ფურცელი არის გაფრთხილების კონკრეტული სტილი, რომელიც მომხმარებელს სთავაზობს მიმდინარე კონტექსტთან დაკავშირებულ ორ ან მეტ არჩევანს. ქმედებათა ფურცელს შეიძლება ჰქონდეს სათაური, დამატებითი შეტყობინება და ქმედებათა სია.
km: បញ្ជីសកម្មភាព​គឺជា​រចនាប័ទ្មនៃ​ការជូនដំណឹង​ជាក់លាក់ ដែល​បង្ហាញ​អ្នកប្រើប្រាស់​នូវបណ្ដុំ​ជម្រើសពីរ ឬច្រើនដែល​ពាក់ព័ន្ធនឹង​បរិបទ​បច្ចុប្បន្ន។ បញ្ជី​សកម្មភាព​អាចមាន​ចំណងជើង សារបន្ថែម និង​បញ្ជី​សកម្មភាព។
kn: ಆ್ಯಕ್ಷನ್ ಶೀಟ್ ಒಂದು ನಿರ್ದಿಷ್ಟ ಶೈಲಿಯ ಅಲರ್ಟ್ ಆಗಿದ್ದು, ಅದು ಪ್ರಸ್ತುತ ಸಂದರ್ಭಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಎರಡು ಅಥವಾ ಹೆಚ್ಚಿನ ಆಯ್ಕೆಗಳ ಗುಂಪನ್ನು ಬಳಕೆದಾರರಿಗೆ ಒದಗಿಸುತ್ತದೆ. ಆ್ಯಕ್ಷನ್ ಶೀಟ್‌ನಲ್ಲಿ ಶೀರ್ಷಿಕೆ, ಹೆಚ್ಚುವರಿ ಸಂದೇಶ ಮತ್ತು ಆ್ಯಕ್ಷನ್‌ಗಳ ಪಟ್ಟಿಯನ್ನು ಹೊಂದಿರಬಹುದು.
ko: 작업 시트는 현재 컨텍스트와 관련하여 사용자에게 2개 이상의 선택지를 제시하는 섹션별 스타일 알림입니다. 작업 시트에는 제목, 추가 메시지, 작업 목록이 포함될 수 있습니다.
ky: Аракеттер барагы бул учурдагы мазмунга тиешелүү эки же андан көп тандоолордун топтомун көрсөткөн билдирмелердин белгилүү бир стили. Аракеттер барагынын аталышы болуп, кошумча билдирүү менен аракеттер тизмеси камтылышы мүмкүн.
lo: ຊີດຄຳສັ່ງເປັນຮູບແບບການແຈ້ງເຕືອນທີ່ເຈາະຈົງເຊິ່ງນຳສະເໜີຊຸດຕົວເລືອກຢ່າງໜ້ອຍສອງຢ່າງທີ່ກ່ຽວຂ້ອງກັບບໍລິບົດປັດຈຸບັນໃຫ້ກັບຜູ້ໃຊ້. ຊີດຄຳສັ່ງສາມາດມີຊື່, ຂໍ້ຄວາມເພີ່ມເຕີມ ແລະ ລາຍຊື່ຄຳສັ່ງໄດ້.
lt: Veiksmų lapas – tai konkretaus stiliaus įspėjimas, kai naudotojui rodomas dviejų ar daugiau pasirinkimo variantų, susijusių su dabartiniu kontekstu, rinkinys. Galima nurodyti veiksmų lapo pavadinimą, papildomą pranešimą ir veiksmų sąrašą.
lv: Darbību izklājlapa ir konkrēta stila brīdinājums, kas parāda lietotājam ar konkrēto kontekstu saistītu divu vai vairāku izvēļu kopumu. Darbību izklājlapai var būt virsraksts, papildu ziņa, kā arī darbību saraksts.
mk: Листот со дејства е посебен стил на предупредување со кое пред корисникот се претставува група од две или повеќе опции поврзани со тековниот контекст. Листот со дејства може да има наслов, дополнителна порака и список со дејства.
ml: നിലവിലെ സന്ദർഭവുമായി ബന്ധപ്പെട്ട രണ്ടോ അതിലധികമോ തിരഞ്ഞെടുക്കലുകളുടെ ഒരു കൂട്ടം, ഉപയോക്താവിനെ അവതരിപ്പിക്കുന്ന ഒരു നിർദ്ദിഷ്ട ശൈലിയിലുള്ള മുന്നറിയിപ്പാണ് ആക്ഷൻ ഷീറ്റ്. ആക്ഷൻ ഷീറ്റിന് ഒരു പേര്, ഒരു അധിക സന്ദേശം, പ്രവർത്തനങ്ങളുടെ പട്ടിക എന്നിവ ഉണ്ടാകാവുന്നതാണ്.
mn: Үйлдлийн хүснэгт нь хэрэглэгчид одоогийн хам сэдэвтэй холбоотой хоёр эсвэл түүнээс дээш сонголтын багцыг харуулах тодорхой загварын сэрэмжлүүлэг юм. Үйлдлийн хүснэгт нь гарчиг, нэмэлт мессеж болон үйлдлийн жагсаалттай байж болно.
mr: क्रिया शीट हा सूचनेचा एक विशिष्ट प्रकार आहे जो वापरकर्त्याला सध्याच्या संदर्भाशी संबंधित दोन किंवा त्याहून जास्त निवडी देतो. एका क्रिया शीटामध्ये शीर्षक, एक अतिरिक्त मेसेज आणि क्रियांची सूची असते.
ms: Helaian tindakan ialah gaya makluman tertentu yang mengemukakan kepada pengguna set dua atau lebih pilihan yang berkaitan dengan konteks semasa. Helaian tindakan boleh mempunyai tajuk, mesej tambahan dan senarai tindakan.
my: လုပ်ဆောင်ချက် စာမျက်နှာတစ်ခုသည် တိကျသည့် သတိပေးချက်ပုံစံဖြစ်ပြီး လက်ရှိအကြောင်းအရာနှင့် သက်ဆိုင်သည့် ရွေးချယ်မှု နှစ်ခု သို့မဟုတ် ၎င်းအထက်ကို အသုံးပြုသူအား ဖော်ပြပါသည်။ လုပ်ဆောင်ချက် စာမျက်နှာတွင် ခေါင်းစဉ်၊ နောက်ထပ်မက်ဆေ့ဂျ်နှင့် လုပ်ဆောင်ချက်စာရင်း ပါရှိနိုင်သည်။
nb: Et handlingsark er en spesifikk varseltype som gir brukeren et sett med to eller flere valg knyttet til nåværende kontekst. Et handlingsark kan ha en tittel, en ekstra melding og en liste over handlinger.
ne: कार्य पाना प्रयोगकर्तालाई वर्तमान सन्दर्भसँग सम्बन्धित दुई वा दुईभन्दा बढी विकल्पहरूको सेट प्रदान गर्ने सतर्कताको एक विशेष शैली हो। कार्य पानामा शीर्षक, एक अतिरिक्त सन्देश र कार्यहरूको सूची हुन सक्छन्।
pa: ਕਾਰਵਾਈ ਸ਼ੀਟ ਸੁਚੇਤਨਾ ਦਾ ਇੱਕ ਖਾਸ ਸਟਾਈਲ ਹੈ ਜੋ ਵਰਤੋਂਕਾਰ ਨੂੰ ਵਰਤਮਾਨ ਸੰਦਰਭ ਨਾਲ ਸੰਬੰਧਿਤ ਦੋ ਜਾਂ ਵੱਧ ਚੋਣਾਂ ਦੇ ਸੈੱਟ ਪੇਸ਼ ਕਰਦੀ ਹੈ। ਕਾਰਵਾਈ ਸ਼ੀਟ ਵਿੱਚ ਸਿਰਲੇਖ, ਵਧੀਕ ਸੁਨੇਹਾ ਅਤੇ ਕਾਰਵਾਈਆਂ ਦੀ ਸੂਚੀ ਸ਼ਾਮਲ ਹੋ ਸਕਦੀ ਹੈ।
pl: Arkusz działań to styl alertu, który prezentuje użytkownikowi co najmniej dwie opcje związane z bieżącym kontekstem. Arkusz działań może mieć tytuł, dodatkowy komunikat i listę działań.
pt: Uma página de ações é um estilo específico de alerta que apresenta ao usuário um conjunto de duas ou mais opções relacionadas ao contexto atual. A página de ações pode ter um título, uma mensagem adicional e uma lista de ações.
pt_pt: Uma página de ações é um estilo específico de alerta que apresenta ao utilizador um conjunto de duas ou mais opções relacionadas com o contexto atual. Uma página de ações pode ter um título, uma mensagem adicional e uma lista de ações.
ro: Foaia de acțiune este un tip de alertă care îi oferă utilizatorului două sau mai multe opțiuni asociate contextului actual. Foaia de acțiune poate să conțină un titlu, un mesaj suplimentar și o listă de acțiuni.
ru: Окно действия – тип оповещения, в котором пользователю предлагается как минимум два варианта действий в зависимости от контекста. Окно может иметь заголовок, дополнительное сообщение, а также список действий.
si: ක්‍රියා පත්‍රයක් යනු වත්මන් සංදර්භයට සම්බන්ධිත තෝරා ගැනීම් දෙකක හෝ වැඩි ගණනක කුලකයක් සහිත පරිශීලකට ඉදිරිපත් කරන විශේෂිත ඇඟවීමේ විලාසයකි. ක්‍රියා පත්‍රයක මාතෘකාවක්, අමතර පණිවිඩයක් සහ ක්‍රියා ලැයිස්තුවක් තිබිය හැකිය.
sk: Hárok s akciami je špecifický štýl upozornenia ponúkajúceho používateľovi dve alebo viac možností, ktoré sa týkajú aktuálneho kontextu. Má názov, dodatočnú správu a zoznam akcií.
sq: Një fletë veprimesh është një stil specifik sinjalizimi që e përball përdoruesin me një set prej dy ose më shumë zgjedhjesh që lidhen me kontekstin aktual. Një fletë veprimesh mund të ketë një titull, një mesazh shtesë dhe një listë veprimesh.
sr: Табела радњи је посебан стил обавештења којим се корисницима нуде два или више избора у вези са актуелним контекстом. Табела радњи може да има наслов, додатну поруку и листу радњи.
sr_latn: Tabela radnji je poseban stil obaveštenja kojim se korisnicima nude dva ili više izbora u vezi sa aktuelnim kontekstom. Tabela radnji može da ima naslov, dodatnu poruku i listu radnji.
sv: Ett åtgärdsblad är ett typ av aviseringar där användaren får två eller fler val som är relaterade till den aktuella kontexten. Ett åtgärdsblad kan ha en titel, ett ytterligare meddelande eller en lista över åtgärder.
te: చర్య షీట్ అనేది ఒక నిర్దిష్ట శైలి అలర్ట్, ఇది ప్రస్తుత సందర్భానికి సంబంధించిన రెండు లేదా అంతకంటే ఎక్కువ ఎంపికల సమితిని యూజర్‌కు అందిస్తుంది. చర్య షీట్‌లో శీర్షిక, అదనపు మెసేజ్‌ మరియు చర్యల లిస్ట్‌ ఉండవచ్చు.
th: แผ่นงานการดำเนินการเป็นการแจ้งเตือนรูปแบบหนึ่งที่นำเสนอชุดทางเลือกตั้งแต่ 2 รายการขึ้นไปเกี่ยวกับบริบทปัจจุบันให้แก่ผู้ใช้ แผ่นงานการดำเนินการอาจมีชื่อ ข้อความเพิ่มเติม และรายการของการดำเนินการ
tr: İşlem sayfası, kullanıcıya geçerli bağlamla ilgili iki veya daha fazla seçenek sunan belirli bir uyarı tarzıdır. Bir işlem sayfasının başlığı, ek mesajı ve işlemler listesi olabilir.
uk: Аркуш дій – це особливий вид сповіщення, який показує користувачу набір із двох або більше варіантів вибору, пов'язаних із поточною ситуацією. Він може мати назву, додаткове повідомлення та список дій.
ur: کارروائی شیٹ الرٹ کا ایک مخصوص طرز ہے جو صارف کو موجودہ سیاق و سباق سے متعلق دو یا اس سے زائد انتخابات کا ایک مجموعہ پیش کرتا ہے۔ کارروائی شیٹ میں ایک عنوان، ایک اضافی پیغام اور کارروائیوں کی فہرست ہو سکتی ہے۔
uz: Harakatlar sahifasi bildirishnomalarning maxsus uslubi boʻlib, unda foydalanuvchining joriy matnga aloqador ikki yoki undan ortiq tanlovlari majmuasi koʻrsatiladi. Harakatlar sahifasida sarlavha, qoʻshimcha xabar va harakatlar roʻyxati boʻlishi mumkin.
vi: Trang tính hành động là một kiểu cảnh báo cụ thể cung cấp cho người dùng 2 hoặc nhiều lựa chọn liên quan đến ngữ cảnh hiện tại. Trang tính hành động có thể có một tiêu đề, thông báo bổ sung và danh sách các hành động.
zh_hk: 動作表是一種特定樣式的通知，根據目前情況向使用者提供兩個或以上的相關選項。您可按需要為動作表設定標題、額外訊息和動作清單。
zu: Ishidi lesenzo uhlobo oluthile lwesexwayiso oluphrezenta umsebenzisi ngesethi yezinketho ezimbili noma ngaphezulu ezihambisana nokuqukethwe kwamanje. Ishidi lesenzo lingaba nesihloko, umlayezo ongeziwe, kanye nohlu lwezenzo.

# demoColorsTitle
source: Colors
af: Kleure
am: ቀለማት
ar_eg: الألوان
as: ৰঙবোৰ
az: Rənglər
be: Колеры
bn: রঙ
bs: Boje
da: Farver
es_ar: Colores
et: Värvid
eu: Koloreak
fa: رنگ‌ها
fil: Mga Kulay
fr_ca: Couleurs
gl: Cores
gu: રંગો
he: צבעים
hi: रंग
hu: Színek
hy: Գույներ
id: Warna
it: Colori
ja: カラー
ka: ფერები
km: ពណ៌
kn: ಬಣ್ಣಗಳು
ko: 색상
ky: Түстөр
lo: ສີ
lt: Spalvos
lv: Krāsas
mk: Бои
ml: വർണ്ണങ്ങൾ
mn: Өнгө
mr: रंग
ms: Warna
my: အရောင်များ
nb: Farger
ne: रङ्गहरू
pa: ਰੰਗ
pl: Kolory
pt: Cores
pt_pt: Cores
ro: Culori
ru: Цвета
si: වර්ණ
sk: Farby
sq: Ngjyrat
sr: Боје
sr_latn: Boje
sv: Färger
te: రంగులు
th: สี
tr: Renkler
uk: Кольори
ur: رنگ
uz: Ranglar
vi: Màu
zh_hk: 顏色
zu: Imibala

# demoColorsSubtitle
source: All of the predefined colors
af: Al die vooraf gedefinieerde kleure
am: ሁሉም አስቀድመው የተገለጹ ቀለማት
ar_eg: جميع الألوان المحدّدة مسبقًا
as: পূৰ্বনিৰ্ধাৰিত সকলোবোৰ ৰং
az: Əvvəlcədən təyin edilmiş rənglərin hamısı
be: Усе тыповыя колеры
bn: আগে থেকে যেসব দেখানো রঙ
bs: Sve unaprijed definirane boje
ca: Tots els colors predefinits
da: Alle de foruddefinerede farver
es_ar: Todos los colores predefinidos
et: Kõik eelmääratud värvid
eu: Kolore lehenetsi guztiak
fa: همه رنگ‌های ازپیش تعیین‌شده
fil: Lahat ng naka-predefine na kulay
fr_ca: Toutes les couleurs prédéfinies
gl: Todas as cores predefinidas
gu: તમામ પૂર્વનિર્ધારિત રંગ
he: כל הצבעים שמוגדרים מראש
hi: पहले से तय किए गए सभी रंग
hu: Az összes előre definiált szín
hy: Բոլոր նախասահմանված գույները
id: Semua warna yang telah ditentukan
it: Tutti i colori predefiniti
ja: 定義済みのすべてのカラー
ka: წინასწარ განსაზღვრული ყველა ფერი
km: ពណ៌ដែល​បានកំណត់​ជាមុន​ទាំងអស់
kn: ಎಲ್ಲಾ ಪೂರ್ವನಿರ್ಧರಿತ ಬಣ್ಣಗಳು
ko: 사전 정의된 모든 색상
ky: Бардык алдын ала аныкталган түстөр
lo: ສີທີ່ລະບຸໄວ້ລ່ວງໜ້າທັງໝົດ
lt: Visos iš anksto nustatytos spalvos
lv: Visas iepriekš definētās krāsas
mk: Сите однапред дефинирани бои
ml: എല്ലാ മുൻനിശ്ചയിച്ച വർണ്ണങ്ങളും
mn: Урьдчилан тодорхойлсон бүх өнгө
mr: पूर्वानिर्धारित केलेले सर्व रंग
ms: Semua warna yang dipratakrif
my: ကြိုတင်သတ်မှတ်ထားသည့် အရောင်အားလုံး
nb: Alle de forhåndsdefinerte fargene
ne: पूर्वपरिभाषित सबै रङ्गहरू
pa: ਸਾਰੇ ਪੂਰਵ ਨਿਰਧਾਰਤ ਰੰਗ
pl: Wszystkie predefiniowane kolory
pt: Todas as cores predefinidas
pt_pt: Todas as cores predefinidas
ro: Toate culorile predefinite
ru: Все стандартные цвета
si: පූර්ව නිශ්චිත වර්ණ සියල්ල
sk: Všetky vopred definované farby
sq: Të gjitha ngjyrat e paracaktuara
sr: Све унапред одређене боје
sr_latn: Sve unapred određene boje
sv: Alla förhandsfärger
te: అన్నీ ముందుగా నిర్వచించిన రంగులు
th: สีที่กำหนดไว้ล่วงหน้าทั้งหมด
tr: Önceden tanımlanmış renklerin tümü
uk: Усі стандартні кольори
ur: پیشگی متعین کردہ سبھی رنگ
uz: Barcha standart ranglar
vi: Tất cả các màu xác định trước
zh_hk: 所有預先定義的顏色
zu: Yonke imibala echazwe ngaphambilini

# demoColorsDescription
source: Color and color swatch constants which represent Material Design's color palette.
af: Kleur en kleurmonsterkonstantes wat Materiaalontwerp se kleurpalet verteenwoordig.
am: የቁስ ንድፍ ቀለም ቤተ ሥዕልን የሚወክሉ የቀለም እና የቀለም መደብ ቋሚዎች።
ar_eg: ثوابت اللون وعينات الألوان التي تُمثل لوحة ألوان التصميم المتعدد الأبعاد
as: Material Designৰ ৰঙৰ পেলেট প্ৰতিনিধিত্ব কৰা ৰং আৰু ৰঙৰ অপৰিৱর্তিত কণিকাসমূহ।
az: Material Dizaynının rəng palitrasını əks etdirən rəng və rəng nümunəsi konstantları.
be: Колеры і ўзоры колераў, якія прадстаўляюць палітру колераў матэрыялу.
bn: রঙ এবং গ্রেডিয়েন্টের জন্য ধ্রুবক যা মেটেরিয়াল ডিজাইনের রঙের প্যালেট তুলে ধরে।
bs: Boja i uzorci boja koji predstavljaju paletu boja materijalnog dizajna.
ca: Constants de mostres i colors que representen la paleta de colors de Material Design.
da: Faste farver og farveskemaer, som repræsenterer farvepaletten for Material Design.
es_ar: Son las constantes de colores y de muestras de color que representan la paleta de material design.
et: Värvide ja värvipaletti püsiväärtused, mis esindavad materiaalse disaini värvipaletti.
eu: Material izeneko diseinuaren kolore-paleta irudikatzen duten koloreen eta kolore-aldaketen konstanteak.
fa: ثابت‌های رنگ و تغییر رنگ که پالت رنگ «طراحی مواد» را نمایش می‌دهند.
fil: Mga constant na kulay at swatch ng kulay na kumakatawan sa palette ng kulay ng Material Design.
fr_ca: Constantes de couleur et d'échantillons de couleur qui représentent la palette de couleurs de Material Design.
gl: Constantes de cores e de coleccións de cores que representan a paleta de cores de Material Design.
gu: સામગ્રીની ડિઝાઇનના વિવિધ રંગનું પ્રતિનિધિત્વ કરતા રંગ અને રંગ સ્વૉચ કૉન્સ્ટન્ટ.
he: קבועים של דוגמיות צבע וצבעים שמייצגים את לוח הצבעים של עיצוב חדשני תלת-ממדי.
hi: रंग और एक जैसे बने रहने वाले मिलते-जुलते रंगों की छोटी टेबल जो 'मटीरियल डिज़ाइन' के रंग पटल को दिखाती है.
hu: Színek és állandó színkorongok, amelyek az anyagszerű megjelenés színpalettáját képviselik.
hy: Գույների և երանգների հաստատուն պարամետրեր, որոնք ներկայացնում են Material Design-ի գունապնակը։
id: Warna dan konstanta model warna yang merepresentasikan palet warna Desain Material.
it: Costanti di colore e di campioni di colore che rappresentano la tavolozza dei colori di material design.
ja: マテリアル デザインのカラーパレットを表す、カラーとカラー スウォッチの定数です。
ka: კონსტანტები ფერებისა და გრადიენტებისთვის, რომლებიც წარმოადგენს Material Design-ის ფერთა პალიტრას.
km: តម្លៃថេរនៃ​គំរូពណ៌ និងពណ៌​ដែលតំណាងឱ្យ​ក្ដារលាយពណ៌​របស់​រចនាប័ទ្ម​សម្ភារ។
kn: ವಸ್ತು ವಿನ್ಯಾಸದ ಬಣ್ಣ ಫಲಕವನ್ನು ಪ್ರತಿನಿಧಿಸುವ ಬಣ್ಣ ಮತ್ತು ಬಣ್ಣದ ಸ್ಥಿರಾಂಕಗಳು.
ko: 머티리얼 디자인의 색상 팔레트를 나타내는 색상 및 색상 견본 상수입니다.
ky: Material Design кызматынын түстөр топтомун аныктаган түс жана түс үлгүлөрү.
lo: ສີ ຫຼື ແຜງສີຄົງທີ່ເຊິ່ງເປັນຕົວແທນຊຸດສີຂອງ Material Design.
lt: Spalvų ir spalvų pavyzdžio konstantos, nurodančios trimačių objektų dizaino spalvų gamą.
lv: Krāsas un krāsas izvēles konstantes, kas atspoguļo materiālu dizaina krāsu paleti.
mk: Константи за бои и мостри што ја претставуваат палетата на бои на Material Design.
ml: മെറ്റീരിയൽ രൂപകൽപ്പനയുടെ വർണ്ണ പാലെറ്റിനെ പ്രതിനിധീകരിക്കുന്ന വർണ്ണ, വർണ്ണ സ്വാച്ച് കോൺസ്‌റ്റന്റുകൾ.
mn: Материалын загварын өнгөний нийлүүрийг төлөөлдөг өнгө болон өнгөний цуглуулгын хэмжигдэхүүн.
mr: मटेरिअल डिझाइनचे कलर पॅलेट दर्शवणारे रंग आणि कलर स्वॅच स्थिरांक.
ms: Warna dan malar reja warna yang mewakili palet warna Reka Bentuk Bahan.
my: အရောင်နှင့် အရောင်နမူနာ ပုံသေများသည် ပစ္စည်းဒီဇိုင်း၏ အရောင်အစုအဖွဲ့ကို ကိုယ်စားပြုသည်။
nb: Konstante farger og fargekart som representerer fargepaletten for «material design».
ne: सामग्री डिजाइनको रङ्गको प्यालेटको प्रतिनिधित्व गर्ने रङ्ग तथा रङ्गको नमुनाका अचलराशिहरू।
pa: ਰੰਗ ਅਤੇ ਰੰਗ ਨਮੂਨੇ ਦੇ ਸਥਾਈ ਮੁੱਲ ਜੋ ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਦੇ ਰੰਗ ਪਟਲ ਨੂੰ ਪ੍ਰਦਰਸ਼ਿਤ ਕਰਦੇ ਹਨ।
pl: Stałe kolorów i próbek kolorów, które reprezentują paletę interfejsu Material Design.
pt: Constantes de cores e de amostras de cores que representam a paleta do Material Design.
pt_pt: A cor e a amostra de cores constantes que representam a paleta de cores do material design.
ro: Constante pentru culori și mostre de culori care reprezintă paleta de culori pentru Design material.
ru: Константы для цветов и градиентов, которые представляют цветовую палитру Material Design.
si: ද්‍රව්‍ය සැලසුමෙහි වර්ණ තැටිය නියෝජනය කරන වර්ණය සහ වර්ණ සාම්පල නියත.
sk: Konštantné farby a vzorka farieb, ktoré predstavujú paletu farieb vzhľadu Material Design.
sq: Konstantet e ngjyrave dhe demonstrimeve të ngjyrave që paraqesin paletën e ngjyrave të dizajnit të materialit.
sr: Боје и шема боја које представљају палету боја материјалног дизајна.
sr_latn: Boje i šema boja koje predstavljaju paletu boja materijalnog dizajna.
sv: Färger och färgrutor som representerar färgpaletten i Material Design.
te: మెటీరియల్ డిజైన్ రంగుల పాలెట్‌ను సూచించే రంగు మరియు రంగు స్వాచ్ కాన్‌స్టెంట్స్.
th: สีหรือแผงสีคงที่ซึ่งเป็นตัวแทนชุดสีของดีไซน์ Material
tr: Materyal Tasarımın renk paletini temsil eden renk ve renk örneği sabitleri.
uk: Колір і зразок кольору, які представляють палітру кольорів матеріального дизайну.
ur: رنگ اور رنگ کے نمونے مستقل رہتے ہیں جو مٹیریل ڈیزائن کے رنگ کے پیلیٹ کی نمائندگی کرتے ہیں۔
uz: Material Design ranglar majmuasini taqdim qiluvchi rang va gradiyentlar uchun konstantalar
zh_hk: 代表質感設計調色碟的顏色和色板常數。
zu: Umbala nokuhambisana kahle kwe-swatch yombala okumele i-palette yombala yedizayini yokubalulekile.

# buttonTextCreate
source: Create
af: Skep
am: ይፍጠሩ
ar_eg: إنشاء
as: সৃষ্টি কৰক
az: Yaradın
be: Стварыць
bn: তৈরি করুন
bs: Kreirajte
ca: Crea
da: Opret
es_ar: Crear
et: Loo
eu: Sortu
fa: ایجاد
fil: Gumawa
fr_ca: Créer
gl: Crear
gu: બનાવો
he: יצירה
hi: बनाएं
hu: Létrehozás
hy: Ստեղծել
id: Buat
it: Crea
ja: 作成
ka: შექმნა
km: បង្កើត
kn: ರಚಿಸಿ
ko: 만들기
ky: Түзүү
lo: ສ້າງ
lt: Kurti
lv: Izveidot
mk: Создајте
ml: സൃഷ്‌ടിക്കുക
mn: Үүсгэх
mr: तयार करा
ms: Buat
my: ပြုလုပ်ရန်
nb: Opprett
ne: सिर्जना गर्नुहोस्
pa: ਬਣਾਓ
pl: Utwórz
pt: Criar
pt_pt: Criar
ro: Creați
ru: Создать
si: තනන්න
sk: Vytvoriť
sq: Krijo
sr: Направите
sr_latn: Napravite
sv: Skapa
te: క్రియేట్ చేయండి
th: สร้าง
tr: Oluştur
uk: Створити
ur: تخلیق کریں
uz: Yaratish
vi: Tạo
zh_hk: 建立
zu: Dala
