Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSlidersDescription
source: Sliders reflect a range of values along a bar, from which users may select a single value. They are ideal for adjusting settings such as volume, brightness, or applying image filters.
af: Glyers weerspieël 'n reeks waardes langs 'n balk, waarop gebruikers 'n enkelwaarde kan kies. Hulle is ideaal daarvoor om instellings soos volume of helderheid te verstel, of om prentfilters toe te pas.
am: ተጠቃሚዎች አንድን ነጠላ እሴት ሊመርጡ የሚችሉበት አሞሌ ላይ ያሉትን የእሴቶች ክልል ተንሸራታቾች ያንጸባርቃሉ። እንደ ድምፅ፣ ብሩህነት የመሳሰሉ ቅንብሮችን ለማስተካከል ወይም የምስል ማጣሪያዎችን ተፈጻሚ ለማድረግ ተመራጭ ናቸው።
ar_eg: تعكس شرائط التمرير نطاقًا من القيم بطول شريط، ويمكن للمستخدمين اختيار قيمة واحدة من ذلك الشريط. وهي مثالية لتعديل الإعدادات، مثلاً مستوى الصوت أو السطوع أو تطبيق فلاتر الصور.
as: শ্লাইডাৰসমূহে এডাল বাৰত মানৰ এক পৰিসৰ দেখুৱায় য’ৰ পৰা ব্যৱহাৰকাৰীসকলে এটা একক মান বাছনি কৰিব পাৰে। সেইবিলাক ভলিউম, উজ্জ্বলতা আদিৰ দৰে ছেটিংসমূহ মিলোৱা অথবা প্ৰতিচ্ছবিৰ ফিল্টাৰ প্ৰয়োগ কৰাৰ বাবে উপযোগী।
az: Slayderlər panel boyunca dəyərlər silsiləsini göstərir, istifadəçilər bu dəyərlərdən birini seçə bilər. Onlar səs səviyyəsi, parlaqlıq kimi ayarları tənzimləməyə və ya şəkil filtrlərini tətbiq etməyə imkan verir.
be: Паўзункі адлюстроўваюць на панэлі дыяпазон значэнняў, з якіх карыстальнікі могуць выбраць адно. Паўзункі ідэальна падыходзяць для карэкцыі гучнасці, яркасці ці прымянення фільтраў для відарысаў.
bn: বারের সাথে সাথে স্লাইডার মানেরও ব্যাপ্তি দেখায়, যেখান থেকে ব্যবহারকারী কোনও একটি মান বেছে নিতে পারেন। ভলিউম, উজ্জ্বলতা বা ছবিতে ফিল্টার প্রয়োগ করা এমন সেটিংস অ্যাডজাস্ট করার জন্য এটি একটি আদর্শ বিকল্প।
bs: Klizači prikazuju raspon vrijednosti duž trake odakle korisnici mogu odabrati jednu vrijednost. Idealni su za podešavanje postavki kao što su jačina zvuka, osvijetljenost ili primjena filtera za slike.
ca: Els controls lliscants mostren un interval de valors al llarg d'una barra i els usuaris poden seleccionar-ne un. Són ideals per ajustar opcions de configuració com el volum o la brillantor, o bé per aplicar filtres d'imatge.
da: Skydere viser en række værdier langs en bjælke, og brugerne kan vælge en enkelt værdi. De er ideelle til justering af indstillinger som f.eks. lydstyrke eller lysstyrke samt til valg af billedfiltre.
es_ar: Los controles deslizantes reflejan un rango de valores en una barra, en la que los usuarios pueden elegir un solo valor. Son ideales para ajustar opciones de configuración como el volumen y el brillo, o bien para aplicar filtros de imagen.
et: Liugurid kajastavad väärtuste vahemikku ribal, millest kasutajad saavad valida ühe väärtuse. Need sobivad hästi selliste seadete kohandamiseks nagu helitugevus, heledus või pildifiltrite rakendamine.
eu: Graduatzaileek balioen barruti bat islatzen dute barra batean, eta erabiltzaileek barruti horretako balio bakarra hauta dezakete bertan. Oso erabilgarriak dira irudiei iragazkiak aplikatzeko edo, orokorrean, ezarpenak doitzeko; esaterako, distira edo bolumena.
fa: لغزنده‌ها گستره‌ای از مقادیر را در امتداد نواری نشان می‌دهند که کاربران می‌توانند یک مقدار را در آن انتخاب کنند. لغزنده‌ها برای تغییر تنظیماتی مثل صدا، روشنایی یا اعمال فیلتر روی تصاویر ایده‌آل هستند.
fil: Nagpapakita ang mga slider ng isang hanay ng mga value sa isang bar, kung saan puwedeng pumili ng isang value ang mga user. Mainam ang mga ito para sa pagsasaayos ng mga setting tulad ng volume, liwanag, o paglalapat ng mga filter ng larawan.
fr_ca: Les curseurs présentent une plage de valeurs le long d'une barre et permettent aux utilisateurs de sélectionner la valeur de leur choix. Ils sont idéaux pour ajuster divers paramètres, comme le volume ou la luminosité, ou encore pour appliquer des filtres à des images.
gl: Os controis desprazables reflicten un intervalo de valores ao longo dunha barra e os usuarios só poden seleccionar un valor. Son ideais para axustar opcións de configuración (como o volume ou o brillo) ou para aplicar filtros de imaxe.
gu: 'સ્લાઇડર' બારમાં મૂલ્યોની શ્રેણી બતાવે છે, જેમાંથી વપરાશકર્તાઓ એક મૂલ્ય પસંદ કરી શકે છે. તેઓ વૉલ્યૂમ, બ્રાઇટનેસ, અથવા છબી ફિલ્ટર લાગુ કરવા જેવી સેટિંગની ગોઠવણ કરવા માટે આદર્શ છે.
he: מחוונים מייצגים טווח ערכים לאורך סרגל, שהמשתמשים יכולים לבחור ערך מתוכו. הם אידיאליים להתאמת הגדרות כמו עוצמת קול, בהירות או להחלת מסנני תמונות.
hi: स्लाइडर किसी बार पर मौजूद मानों की सीमा दिखाते हैं. इससे लोग किसी भी मान को चुन सकते हैं. ये सेटिंग में बदलाव करने के लिए बेहतर विकल्प हैं. इसमें आवाज़ कम या ज़्यादा करना, चमक घटाना-बढ़ाना या किसी इमेज में फ़िल्टर लगाने जैसे बदलाव शामिल हैं.
hu: A csúszkák értéktartományt jelenítenek meg egy sáv mentén, és a felhasználók ebből a tartományból választhatják ki a kívánt értéket. A csúszkák ideális összetevők olyan beállítások módosításához, mint például a hangerő és a fényerő, valamint képszűrők alkalmazásához.
hy: Սահիչները թույլ են տալիս ընտրել անհրաժեշտ արժեքը տրված միջակայքում։ Սահիչների օգնությամբ հեշտությամբ կարող եք կարգավորել ձայնի մակարդակը, պայծառությունն ու պատկերների զտիչները։
id: Penggeser menunjukkan rentang nilai di sepanjang panel, tempat pengguna dapat memilih nilai tunggal. Penggeser cocok untuk menyesuaikan setelan seperti volume, kecerahan, atau menerapkan filter gambar.
it: I cursori rappresentano un intervallo di valori lungo una barra, da cui gli utenti possono selezionare un singolo valore. Sono la soluzione ideale per regolare impostazioni quali volume e luminosità oppure per applicare filtri delle immagini.
ja: スライダーはバー上の値の範囲を表すもので、ユーザーはスライダーから 1 つの値を選択できます。音量、明るさなどの設定を調整したり、画像フィルタを適用したりするのに最適です。
ka: სლაიდერები ზოლის გასწვრივ ასახავს მნიშვნელობათა დიაპაზონს, რომელთაგანაც მომხმარებლებს შეუძლიათ აირჩიონ ერთი მნიშვნელობა. ისინი იდეალურია ისეთი პარამეტრების კორექტირებისთვის, როგორიც არის ხმის სიმძლავრე და სიკაშკაშე, ან სურათის ფილტრების მისადაგებისთვის.
km: របាររំកិលបង្ហាញចន្លោះតម្លៃ​នៅលើរបារ ដែលអ្នកប្រើប្រាស់​អាចជ្រើសរើសតម្លៃមួយ។ របាររំកិលទាំងនេះស័ក្តិសមសម្រាប់​ការកែតម្រូវការកំណត់​ផ្សេងៗដូចជា កម្រិតសំឡេង ពន្លឺ ឬការអនុវត្តតម្រងរូបភាពជាដើម។
kn: ಸ್ಲೈಡರ್‌ಗಳು ಒಂದು ನಿರ್ದಿಷ್ಟ ಶ್ರೇಣಿಯನ್ನು ಪ್ರತಿಬಿಂಬಿಸುವ ಬಾರ್ ಆಗಿದೆ. ಇದರಿಂದ ಬಳಕೆದಾರರು ಒಂದು ಮೌಲ್ಯವನ್ನು ಆಯ್ಕೆಮಾಡಬಹುದು. ವಾಲ್ಯೂಮ್, ಪ್ರಖರತೆ ಅಥವಾ ಚಿತ್ರದ ಫಿಲ್ಟರ್‌ಗಳನ್ನು ಅನ್ವಯಿಸುವಂತಹ ಸೆಟ್ಟಿಂಗ್‌ಗಳನ್ನು ಸರಿಹೊಂದಿಸುವುದಕ್ಕೆ ಅವುಗಳು ಸೂಕ್ತವಾಗಿದೆ.
ko: 슬라이더는 막대를 따라 분포된 값 범위를 나타내어 사용자가 특정 값을 선택할 수 있게 합니다. 볼륨, 밝기 등의 설정을 조정하거나 이미지 필터를 적용하는 데 적합합니다.
ky: Сыдырмалардын жардамы менен, колдонуучулар тилкеде көрсөтүлгөн маанилердин диапазонунан бир маанини тандай алышат. Алар үндүн көлөмүн, экрандын жарыктыгын же сүрөттүн чыпкаларын колдонууда абдан пайдалуу.
lo: ຕົວເລື່ອນຈະມີໄລຍະຂອງຄ່າໄປຕາມແຖບໃດໜຶ່ງ, ເຊິ່ງຜູ້ໃຊ້ສາມາດເລືອກຄ່າດຽວໄດ້. ພວກມັນເໝາະສຳລັບການປັບແຕ່ງການຕັ້ງຄ່າຕ່າງໆ ເຊັ່ນ: ລະດັບສຽງ, ຄວາມສະຫວ່າງ ຫຼື ການນຳໃຊ້ຟິວເຕີຮູບພາບ.
lt: Šliaužikliai atspindi juostos verčių diapazoną, iš kurio naudotojai gali pasirinkti vieną vertę. Jais galima lengvai koreguoti nustatymus, pvz., garsumą, šviesumą, arba taikyti vaizdų filtrus.
lv: Slīdņi atspoguļo vērtību diapazonu joslā, kurā lietotāji var atlasīt atsevišķu vērtību. Slīdņi ir lieliski piemēroti dažādu iestatījumu, piemēram, skaļuma vai spilgtuma, pielāgošanai vai attēlu filtru lietošanai.
mk: Лизгачите прикажуваат голем број вредности на лента, а корисниците може да изберат една од нив. Идеални се за приспособување на поставките, како што се јачината на звукот, осветленоста или примената на филтри за слики.
ml: സ്ലെെഡറുകൾ ഒരു ബാറിലുടനീളം മൂല്യങ്ങളുടെ ഒരു ശ്രേണിയെ പ്രതിഫലിപ്പിക്കുന്നു, ആ മൂല്യങ്ങളിൽ നിന്ന് ഒന്ന് ഉപയോക്താക്കൾക്ക് തിരഞ്ഞെടുക്കാം. ശബ്‌ദം, തെളിച്ചം അല്ലെങ്കിൽ ചിത്ര ഫിൽട്ടറുകൾ പ്രയോഗിക്കൽ പോലുള്ള ക്രമീകരണങ്ങൾ ക്രമീകരിക്കുന്നതിന് ഏറ്റവും അനുയോജ്യമാണവ.
mn: Слайдер нь самбар дагуух утгын мужийг илэрхийлдэг бөгөөд хэрэглэгчид тэндээс дан утгыг сонгож болно. Энэ нь дууны түвшин, гэрэлтүүлэг зэрэг тохиргоог тохируулах эсвэл зургийн шүүлтүүрийг хэрэгжүүлэхэд яг таг тохирдог.
mr: स्लाइडर बारच्या बरोबरीने मूल्यांच्या रेंज दाखवतात, ज्यामधून वापरकर्ते एखादे मूल्य निवडू शकतात. व्हॉल्यूम, ब्राइटनेस किंवा इमेज फिल्टर लागू करणे यांसारख्या अ‍ॅडजस्ट करणाऱ्या सेटिंग्जसाठी ते उत्तम आहेत.
ms: Peluncur menggambarkan satu julat nilai di sepanjang bar dan pengguna boleh memilih satu daripada nilai itu. Peluncur ini sesuai untuk melaraskan tetapan seperti kelantangan, kecerahan atau penggunaan penapis imej.
my: ရွှေ့တုံးများသည် ဘားတန်းတစ်ခုပေါ်တွင် တန်ဖိုးများစွာကို ကိုယ်စားပြုပေးပြီး အသုံးပြုသူသည် ၎င်းတို့အနက်မှ တန်ဖိုးတစ်ခုကို ရွေးချယ်နိုင်ပါသည်။ ၎င်းတို့သည် အသံ၊ တောက်ပမှုတို့ကို ချိန်ညှိသည့်အခါ သို့မဟုတ် ဓာတ်ပုံအရောင်စစ်မှန်ပြားများ အသုံးပြုသည့်အခါ အသင့်လျော်ဆုံးဖြစ်သည်။
nb: Glidebrytere gjenspeiler en rekke verdier langs en rad, som brukere kan velge én enkelt verdi fra. De er perfekte for å justere innstillinger som volum, lysstyrke og bruk av bildefiltre.
ne: स्लाइडरहरूले बारमा रहेको मानको दायरा प्रतिबिम्बित गर्दछन् र प्रयोगकर्ताहरू सो दायराबाट एकल मान चयन गर्न सक्छन्। यी स्लाइडरहरू भोल्युम, चमक जस्ता सेटिङ समायोजन गर्ने वा छविका फिल्टरहरू लागू गर्ने कार्यका लागि उपयुक्त हुन्छन्।
pa: ਸਲਾਈਡਰ ਬਾਰ ਦੇ ਨਾਲ-ਨਾਲ ਮੁੱਲ ਦੀ ਰੇਂਜ ਨੂੰ ਦਰਸਾਉਂਦੀ ਹੈ, ਜਿਸ ਤੋਂ ਵਰਤੋਂਕਾਰ ਇਕੱਲੇ ਮੁੱਲ ਦੀ ਚੋਣ ਕਰ ਸਕਦੇ ਹਨ। ਉਹ ਸੈਟਿੰਗਾਂ ਵਿਵਸਥਿਤ ਕਰਨ ਲਈ ਆਦਰਸ਼ ਹਨ ਜਿਵੇਂ ਕਿ ਅਵਾਜ਼, ਚਮਕ ਜਾਂ ਚਿੱਤਰ ਫਿਲਟਰ ਲਾਗੂ ਕਰਨ ਲਈ।
pl: Suwaki prezentują zakres na pasku, z którego użytkownicy mogą wybrać jedną wartość. Ten element interfejsu idealnie nadaje się do regulacji ustawień takich jak głośność, jasność czy stopień zastosowania filtra graficznego.
pt: Os controles deslizantes refletem um intervalo de valores em uma barra, em que os usuários podem selecionar um único valor. Eles são ideais para ajustar configurações como volume e brilho ou aplicar filtros de imagem.
pt_pt: Os controlos de deslize refletem um intervalo de valores ao longo de uma barra, a partir do qual os utilizadores podem selecionar um único valor. São ideais para ajustar definições como o volume, o brilho ou aplicar filtros de imagem.
ro: Glisoarele reflectă un interval de valori de-a lungul unei bare, din care utilizatorii pot selecta o singură valoare. Acestea sunt ideale pentru reglarea setărilor, precum volumul, luminozitatea sau aplicarea filtrelor de imagine.
ru: Ползунки позволяют выбрать нужное значение в заданном диапазоне. С помощью ползунков удобно регулировать уровень громкости, настраивать яркость и фильтры изображений.
si: ස්ලයිඩර් තීරුවක් ඔස්සේ අගයන් පරාසයක් පිළිබිඹු කරන අතර එමඟින් පරිශීලකයන්ට තනි අගයක් තෝරා ගත හැකිය. පරිමාව, දීප්තිය හෝ රූප පෙරහන් යෙදීම වැනි සැකසීම් සීරුමාරු කිරීම සඳහා ඒවා ඉතා සුදුසුය.
sk: Posúvače predstavujú rozsah hodnôt na pruhu, z ktorých si môžu používatelia jednu vybrať. Sú ideálne na úpravu nastavení, ako je napríklad hlasitosť, jas alebo použitie filtrov obrázkov.
sq: Rrëshqitësit pasqyrojnë një gamë vlerash përgjatë një shiriti, nga të cilat përdoruesit mund të zgjedhin një vlerë të vetme. Ata janë idealë për rregullimin e cilësimeve si p.sh. volumi, ndriçimi ose zbatimi i filtrave të imazheve.
sr: Клизачи одражавају опсег вредности на траци, а корисници могу да изаберу једну вредност. Идеални су за прилагођавање подешавања као што су јачина звука, осветљеност или примена филтера за слике.
sr_latn: Klizači odražavaju opseg vrednosti na traci, a korisnici mogu da izaberu jednu vrednost. Idealni su za prilagođavanje podešavanja kao što su jačina zvuka, osvetljenost ili primena filtera za slike.
sv: Skjutreglage är fält med ett värdeintervall som användare väljer ett värde från. De passar perfekt till justering av inställningar som volym, ljusstyrka och bildfilter.
te: బార్ అంతటా విలువల శ్రేణిని స్లయిడర్‌లు సూచిస్తాయి. యూజర్‌లు వాటి నుండి ఒక విలువను మాత్రమే ఎంచుకోగలరు. వాల్యూమ్, కాంతి లేదా చిత్రానికి ఫిల్టర్‌లను వర్తింపజేయడం వంటి సెట్టింగ్‌లను సర్దుబాటు చేయడానికి అవి సరైన సూచికలు.
th: แถบเลื่อนแสดงช่วงของค่าในแถบซึ่งให้ผู้ใช้เลือกค่าใดค่าหนึ่ง เหมาะสำหรับการปรับการตั้งค่า เช่น ระดับเสียง ความสว่าง หรือการใช้ฟิลเตอร์รูปภาพ
tr: Kullanıcılar, kaydırma çubuklarını kullanarak belirtilen değer aralığı içinde bir değeri seçebilir. Kaydırma çubukları, ses düzeyi ve parlaklık gibi ayarları düzenlemek veya görüntü filtreleri uygulamak için idealdir.
uk: За допомогою повзунків можна вибирати одне значення з діапазону, показаного вздовж панелі. Вони найкраще підходять для налаштування таких параметрів, як звук і яскравість, або застосування фільтрів зображень.
ur: سلائیڈرز بار کے ساتھ اقدار کے رینج کی عکاسی کرتے ہیں، جہاں سے صارفین ایک ہی قدر منتخب کر سکتے ہیں۔ یہ والیوم، چمک، یا تصویر کے فلٹرز کا اطلاق کرنے جیسی ترتیبات کو ایڈجسٹ کرنے کے لیے مثالی ہیں۔
uz: Slayderlar yordamida berilgan diapazondagi kerakli qiymatni tanlash mumkin. Ular bilan tovush balandligi, yorqinlik yoki tasvir filtrlarini ham sozlash mumkin.
vi: Thanh trượt biểu thị khoảng giá trị dọc theo một thanh mà người dùng có thể chọn một giá trị từ đó. Thanh trượt là lựa chọn lý tưởng để điều chỉnh các tùy chọn cài đặt như âm lượng, độ sáng hoặc áp dụng bộ lọc hình ảnh.
zh_hk: 滑桿上列有特定範圍內的值，使用者可選擇其中一個值。滑桿最適合用來調整設定，例如調校音量或光暗，以及套用圖片濾鏡。
zu: Izilayidi zibonisa ibanga lamavelu kwibha, kusuka lapha abasebenzisi bangakhetha khona ivelu elilodwa. Abalulekele ukulungisa izilungiselelo ezifana nevolomu, ukukhanya, noma ukufaka izihlungi zesithombe.

# demoRangeSlidersTitle
source: Range Sliders
af: Reeksglyers
am: የክልል ተንሸራታቾች
ar_eg: شرائط تمرير تتضمَّن نطاقات
as: পৰিসৰৰ শ্লাইডাৰসমূহ
az: Silsilə Slayderlər
be: Паўзункі дыяпазону
bn: রেঞ্জ স্লাইডার
bs: Klizači s rasponom vrijednosti
ca: Controls lliscants d'intervals
da: Områdeskydere
es_ar: Controles deslizantes de rangos
et: Vahemiku liugurid
eu: Barruti zehatzeko graduatzaileak
fa: لغزنده گستره‌ای
fil: Mga Slider ng Hanay
fr_ca: Curseurs de valeurs
gl: Controis desprazables de intervalos
gu: સ્લાઇડરની શ્રેણી
he: מחווני טווח
hi: मानों की सीमा दिखाने वाले स्लाइडर
hu: Tartománycsúszkák
hy: Միջակայքի սահիչներ
id: Penggeser Rentang
it: Cursori intervalli
ja: 範囲スライダー
ka: დიაპაზონის სლაიდერები
km: របាររំកិលចន្លោះតម្លៃ
kn: ಶ್ರೇಣಿ ಸ್ಲೈಡರ್‌ಗಳು
ko: 범위 슬라이더
ky: Диапазон сыдырмалары
lo: ຕົວເລື່ອນໄລຍ
lt: Diapazono šliaužikliai
lv: Diapazona slīdņi
mk: Лизгачи на опсег
ml: ശ്രേണി സ്ലൈഡറുകൾ
mn: Мужийн слайдер
mr: रेंज स्लायडर
ms: Peluncur Julat
my: အပိုင်းအခြား ရွှေ့တုံး
nb: Områdeglidebrytere
ne: दायरा प्रतिबिम्बित गर्ने स्लाइडरहरू
pa: ਰੇਂਜ ਸਲਾਈਡਰ
pl: Suwaki zakresowe
pt: Controles deslizantes de intervalo
pt_pt: Controlos de deslize com intervalo
ro: Glisoare pentru interval
ru: Ползунки диапазона
si: පරාස ස්ලයිඩර්
sk: Posúvače s rozsahom
sq: Rrëshqitësit me gamë vlerash
sr: Клизачи опсега
sr_latn: Klizači opsega
sv: Skjutreglage för intervall
te: శ్రేణి స్లయిడర్‌లు
th: แถบเลื่อนสำหรับช่วง
tr: Aralık Kaydırma Çubukları
uk: Повзунки з діапазонами
ur: رینج سلائیڈرز
uz: Diapazonli slayderlar
vi: Thanh trượt khoảng
zh_hk: 範圍滑桿
zu: Izilayidi zebanga
