Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTypographyDescription
source: Definitions for the various typographical styles found in Material Design.
af: Definisies vir die verskillende tipografiese style wat in Materiaalontwerp gevind word.
am: በቁሳዊ ንድፍ ላይ የሚገኙ የተለያዩ ታይፖግራፊያዊ ቅጦች ፍቺዎች።
ar_eg: تعريف أساليب الخط المختلفة في التصميم المتعدد الأبعاد
as: Material Designত পোৱা বিভিন্ন টাইপ’গ্ৰাফীকেল শৈলীৰ সংজ্ঞাসমূহ।
az: Material Dizaynındakı müxtəlif tipoqrafik üslubların izahları.
be: Азначэнні для розных друкарскіх стыляў з каталога матэрыяльнага дызайну.
bn: মেটেরিয়াল ডিজাইনে খুঁজে পাওয়া বিভিন্ন লেখার স্টাইল।
bs: Definicije raznih tipografskih stilova u materijalnom dizajnu.
ca: Definicions dels diversos estils tipogràfics trobats a Material Design.
da: Definitioner for de forskellige typografier, der blev fundet i Material Design.
es_ar: Definiciones de distintos estilos de tipografía que se encuentran en material design.
et: Materiaalses disainil leiduvate eri tüpograafiliste stiilide definitsioonid.
eu: Material diseinuko estilo tipografikoen definizioak.
fa: تعریف‌هایی برای سبک‌های تایپوگرافی مختلف در «طراحی مواد» یافت شد.
fil: Mga kahulugan para sa iba't ibang typographical na istilong makikita sa Material Design.
fr_ca: Définition des différents styles typographiques de Material Design.
gl: Definicións dos diferentes estilos tipográficos atopados en Material Design.
gu: સામગ્રીની ડિઝાઇનમાં જોવા મળતી ટાઇપોગ્રાફીની વિવિધ શૈલીઓ માટેની વ્યાખ્યાઓ.
he: הגדרות לסגנונות הטיפוגרפיים השונים שבעיצוב חדשני תלת-ממדי.
hi: 'मटीरियल डिज़ाइन' में टाइपाेग्राफ़ी के कई तरह के स्टाइल की जानकारी हाेती है.
hu: Az anyagszerű megjelenésben található különböző tipográfiai stílusok meghatározásai.
hy: Սահմանումներ Material Design-ում առկա տարբեր տառատեսակների համար։
id: Definisi berbagai gaya tipografi yang ditemukan dalam Desain Material.
it: Definizioni dei vari stili tipografici trovati in material design.
ja: マテリアル デザインにあるさまざまな字体の定義です。
ka: განსაზღვრებები Material Design-ში არსებული სხვადასხვა ტიპოგრაფიული სტილისთვის.
km: និយមន័យសម្រាប់​រចនាប័ទ្មនៃ​ការរចនាអក្សរ ដែលបានរកឃើញ​នៅក្នុងរចនាប័ទ្មសម្ភារ។
kn: ವಸ್ತು ವಿನ್ಯಾಸದಲ್ಲಿ ಕಂಡುಬರುವ ವಿವಿಧ ಟಾಪೋಗ್ರಾಫಿಕಲ್ ಶೈಲಿಗಳ ವ್ಯಾಖ್ಯಾನಗಳು.
ko: 머티리얼 디자인에서 찾을 수 있는 다양한 타이포그래피 스타일의 정의입니다.
ky: Material Design кызматындагы ар түрдүү типографиялык стилдердин аныктамалары.
lo: ຄຳຈຳກັດຄວາມຂອງຕົວອັກສອນຮູບແບບຕ່າງໆທີ່ພົບໃນ Material Design.
lt: Įvairių tipografinių stilių apibrėžtys prie trimačių objektų dizaino.
lv: Definīcijas dažādiem tipogrāfijas stiliem, kas atrasti materiāla dizaina ceļvedī.
mk: Дефиниции за различните типографски стилови во Material Design.
ml: മെറ്റീരിയൽ രൂപകൽപ്പനയിൽ കാണുന്ന വിവിധ ടൈപ്പോഗ്രാഫിക്കൽ ശൈലികൾക്കുള്ള നിർവ്വചനങ്ങൾ.
mn: Материалын загварт байх төрөл бүрийн үсгийн урлагийн загварын тодорхойлолт.
mr: मटेरिअल डिझाइन मध्ये सापडणार्‍या विविध टायपोग्राफिकल शैलींच्या परिभाषा.
ms: Definisi bagi pelbagai gaya tipografi yang ditemui dalam Reka Bentuk Bahan.
my: 'ပစ္စည်းပုံစံ' တွင် မြင်တွေ့ရသော စာသားပုံစံအမျိုးမျိုးတို့၏ အဓိပ္ပာယ်ဖွင့်ဆိုချက်များ။
nb: Definisjoner for de forskjellige typografiske stilene som finnes i «material design».
ne: सामग्री डिजाइनमा पाइने टाइपोग्राफीका विभिन्न शैलीहरूको परिभाषा।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਛਪਾਈ ਵਾਲੇ ਸਟਾਈਲਾਂ ਲਈ ਪਰਿਭਾਸ਼ਾਵਾਂ।
pl: Definicje różnych stylów typograficznych dostępnych w Material Design.
pt: Definições para os vários estilos tipográficos encontrados no Material Design.
pt_pt: Definições para os vários estilos tipográficos encontrados no material design.
ro: Definiții pentru stilurile tipografice diferite, care se găsesc în ghidul Design material.
ru: Определения разных стилей текста в Material Design.
si: Material Design හි දක්නට ලැබෙන විවිධ මුද්‍රණ විලාස සඳහා අර්ථ දැක්වීම්.
sk: Definície rôznych typografických štýlov vo vzhľade Material Design.
sq: Përkufizimet e stileve të ndryshme tipografike të gjendura në dizajnin e materialit
sr: Дефиниције разних типографских стилова у материјалном дизајну.
sr_latn: Definicije raznih tipografskih stilova u materijalnom dizajnu.
sv: Definitioner för olika typografiska format i Material Design
te: విశేష రూపకల్పనలో కనుగొన్న వివిధ రకాల టైపోగ్రాఫికల్ శైలుల యొక్క నిర్వచనాలు.
th: คำจำกัดความของตัวอักษรรูปแบบต่างๆ ที่พบในดีไซน์ Material
tr: Materyal Tasarımında bulunan çeşitli tipografik stillerin tanımları.
uk: Визначення різних друкарських стилів із каталогу матеріального дизайну.
ur: مٹیریل ڈیزائن میں پائے جانے والے مختلف ٹائپوگرافیکل اسٹائل کی تعریفات۔
uz: Material Design ichidagi har xil shriftlar uchun izoh.
vi: Định nghĩa của nhiều kiểu nghệ thuật chữ có trong Material Design.
zh_hk: 在質感設計所定義的不同排版樣式。
zu: Izincazelo zezitayela ezahlukahlukene ze-typographical zitholakele kudizayini ebalulekile.

# demoTypographySubtitle
source: All of the predefined text styles
af: Al die voorafgedefinieerde teksstyle
am: ሁሉም ቅድሚያ የተገለጹ የጽሑፍ ቅጦች
ar_eg: جميع أنماط النص المحدّدة مسبقًا
as: পূর্বনির্ধাৰিত সকলো পাঠৰ শৈলী
az: Əvvəldən müəyyənləşdirilmiş bütün mətn üslubları
be: Усе стандартныя стылі тэксту
bn: পূর্বনির্ধারিত সব টেক্সট স্টাইল
bs: Svi unaprijed definirani stilovi teksta
ca: Tots els estils de text predefinits
da: Alle de foruddefinerede typografier
es_ar: Todos los estilos de texto predefinidos
et: Kõik eelmääratud tekstistiilid
eu: Testu-estilo lehenetsi guztiak
fa: همه سبک‌های نوشتاری ازپیش‌تعریف‌شده
fil: Lahat ng naka-predefine na istilo ng text
fr_ca: Tous les styles de texte prédéfinis
gl: Todos os estilos de texto predefinidos
gu: ટેક્સ્ટની પૂર્વવ્યાખ્યાયિત બધી જ શૈલીઓ
he: כל סגנונות הטקסט שהוגדרו מראש
hi: पहले से बताए गए सभी टेक्स्ट स्टाइल
hu: Az előre meghatározott szövegstílusok mindegyike
hy: Տեքստի բոլոր ստանդարտ ոճերը
id: Semua gaya teks yang sudah ditentukan
it: Tutti gli stili di testo predefiniti
ja: 定義済みテキスト スタイルすべて
ka: ტექსტის ყველა წინასწარ განასაზღვრული სტილი
km: រចនាប័ទ្មអក្សរ​ដែលបានកំណត់​ជាមុនទាំងអស់
kn: ಎಲ್ಲಾ ಪೂರ್ವನಿರ್ಧರಿತ ಪಠ್ಯ ಶೈಲಿಗಳು
ko: 사전 정의된 모든 텍스트 스타일
ky: Бардык алдын ала аныкталган текст стилдери
lo: ຮູບແບບຂໍ້ຄວາມທັງໝົດທີ່ກຳນົດໄວ້ລ່ວງໜ້າ
lt: Visi iš anksto nustatyti teksto stiliai
lv: Visi iepriekš definētie teksta stili
mk: Сите однапред дефинирани стилови на текст
ml: മുൻകൂട്ടി നിശ്ചയിച്ച എല്ലാ ടെക്സ്റ്റ് ശൈലികളും
mn: Бүх урьдчилан тодорхойлсон текстийн загвар
mr: सर्व पूर्वपरिभाषित मजकूर शैली
ms: Semua gaya teks yang dipratentukan
my: ကြိုတင်သတ်မှတ်ထားသည့် စာသားပုံစံများအားလုံး
nb: Alle forhåndsdefinerte tekststiler
ne: पाठका सबै पूर्वपरिभाषित शैलीहरू
pa: ਪਹਿਲਾਂ ਤੋਂ ਪਰਿਭਾਸ਼ਿਤ ਸਭ ਲਿਖਤ ਸਟਾਈਲ
pl: Wszystkie predefiniowane style tekstu
pt: Todos os estilos de texto pré-definidos
pt_pt: Todos os estilos de texto predefinidos.
ro: Toate stilurile de text predefinite
ru: Все стандартные стили текста
si: සියලු පූර්ව නිර්ණිත විලාස
sk: Všetky preddefinované štýly textu
sq: Të gjitha stilet e paracaktuara të tekstit
sr: Сви унапред дефинисани стилови текста
sr_latn: Svi unapred definisani stilovi teksta
sv: Alla fördefinierade textformat
te: అన్ని పూర్వ నిర్వచిత వచన శైలులు
th: รูปแบบข้อความทั้งหมดที่กำหนดไว้ล่วงหน้า
tr: Önceden tanımlanmış tüm metin stilleri
uk: Усі стандартні стилі тексту
ur: پہلے سے متعینہ متن کی تمام طرزیں
uz: Barcha standart matn uslublari
vi: Tất cả các kiểu chữ định sẵn
zh_hk: 所有預先定義的文字樣式
zu: Zonke izitayela zombhalo ezichazwe ngaphambilini

# demoTypographyTitle
source: Typography
af: Tipografie
am: ታይፖግራፊ
ar_eg: أسلوب الخط
as: টাইপ’গ্ৰাফী
az: Tipoqrafiya
be: Афармленне тэксту
bn: লেখার ধরন
bs: Tipografija
ca: Tipografia
da: Typografi
es_ar: Tipografía
et: Tüpograafia
eu: Tipografia
fa: تایپوگرافی
fr_ca: Typographie
gl: Tipografía
gu: ટાઇપોગ્રાફી
he: טיפוגרפיה
hi: टाइपाेग्राफ़ी
hu: Tipográfia
hy: Տառատեսակներ
id: Tipografi
it: Tipografia
ja: タイポグラフィ
ka: ტიპოგრაფია
km: ការរចនា​អក្សរ
kn: ಟೈಪೋಗ್ರಾಫಿ
ko: 타이포그래피
ky: Типография
lo: ການພິມ
lt: Spausdinimas
lv: Tipogrāfija
mk: Типографија
ml: ടൈപ്പോഗ്രാഫി
mn: Үсгийн урлаг
mr: टायपोग्राफी
ms: Tipografi
my: စာလုံးဒီဇိုင်း
nb: Typografi
ne: टाइपोग्राफी
pa: ਛਪਾਈ
pl: Typografia
pt: Tipografia
pt_pt: Tipografia
ro: Tipografie
ru: Параметры текста
si: මුද්‍රණ ශිල්පය
sk: Typografia
sq: Tipografia
sr: Типографија
sr_latn: Tipografija
sv: Typografi
te: టైపోగ్రఫీ
th: ตัวอย่างการพิมพ์
tr: Yazı biçimi
uk: Оформлення
ur: ٹائپوگرافی
uz: Matn sozlamalari
vi: Nghệ thuật chữ
zh_hk: 排版
zu: I-Typography

# demoFullscreenDialogDescription
source: The fullscreenDialog property specifies whether the incoming page is a fullscreen modal dialog
af: Die volskermdialoog-eienskap spesifiseer of die inkomende bladsy 'n volskerm- modale dialoog is
am: የ fullscreenDialog ባህሪ መጪው ገፅ ባለ ሙሉ ማያ ገፅ ሞዳል ንግግር መሆን አለመሆኑን ይጠቅሳል
ar_eg: تحدِّد خاصية fullscreenDialog ما إذا كانت الصفحة الواردة هي مربع حوار نمطي بملء الشاشة.
as: fullscreenDialog সম্পদে পৃষ্ঠাখন সম্পূর্ণ স্ক্ৰীনৰ মডেল ডায়ল'গ হয়নে নহয় সেয়া নির্দিষ্ট কৰে
az: Tam ekran dialoqu xüsusiyyəti yeni səhifənin tam ekran modal dialoqu olub-olmadığını göstərir
be: Уласцівасць поўнаэкраннасці вызначае, ці будзе ўваходная старонка выглядаць як мадальнае дыялогавае акно ў поўнаэкранным рэжыме
bn: ফুল-স্ক্রিন ডায়ালগ প্রপার্টি নির্দিষ্ট করে পরের পৃষ্ঠাটি একটি ফুল-স্ক্রিন মোডাল ডায়ালগ হবে কিনা
bs: Funkcija fullscreenDialog određuje da li se sljedeća stranica otvara u dijaloškom okviru preko cijelog ekrana
ca: La propietat fullscreenDialog indica si la pàgina entrant és un quadre de diàleg modal de pantalla completa
da: Egenskaben fullscreenDialog angiver, om den delte side er en modal dialogboks i fuld skærm.
es_ar: La propiedad fullscreenDialog especifica si la página nueva es un diálogo modal de pantalla completa.
et: Atribuut fullscreenDialog määrab, kas sissetulev leht on täisekraanil kuvatud modaaldialoog
eu: Sarrerako orria pantaila osoko leiho bat den zehazten du fullscreenDialog propietateak
fa: ویژگی fullscreenDialog مشخص می‌کند آیا صفحه ورودی، کادر گفتگوی مودال تمام‌صفحه است یا نه.
fil: Tinutukoy ng property na fullscreenDialog kung fullscreen na modal dialog ang paparating na page
fr_ca: La propriété fullscreenDialog qui spécifie si la page entrante est une boîte de dialogue modale plein écran
gl: A propiedade fullscreenDialog especifica se a páxina entrante é un cadro de diálogo modal de pantalla completa
gu: fullscreenDialog પ્રોપર્ટી ઇનકમિંગ પેજ પૂર્ણસ્ક્રીન મૉડલ સંવાદ હશે કે કેમ તેનો ઉલ્લેખ કરે છે
he: המאפיין fullscreenDialog מציין אם הדף המתקבל הוא תיבת דו-שיח מודאלית במסך מלא
hi: फ़ुल स्क्रीन डायलॉग से पता चलता है कि आने वाला पेज फ़ुल स्क्रीन मॉडल डायलॉग है या नहीं
hu: A fullscreenDialog tulajdonság határozza meg, hogy az érkezési oldal teljes képernyős moduláris párbeszédpanel-e
hy: fullscreenDialog պարամետրը հատկորոշում է, թե արդյոք հաջորդ էկրանը պետք է լինի լիաէկրան մոդալ երկխոսության պատուհան։
id: Properti fullscreenDialog akan menentukan apakah halaman selanjutnya adalah dialog modal layar penuh atau bukan
it: La proprietà fullscreenDialog specifica se la pagina che sta per essere visualizzata è una finestra di dialogo modale a schermo intero
ja: fullscreenDialog プロパティで、着信ページが全画面モード ダイアログかどうかを指定します
ka: fullscreenDialog თვისება განსაზღვრავს, არის თუ არა შემომავალი გვერდი სრულეკრანიანი მოდალური დიალოგი
km: លក្ខណៈ​របស់​ប្រអប់ពេញអេក្រង់​បញ្ជាក់ថាតើ​ទំព័របន្ទាប់​គឺជា​ប្រអប់ម៉ូដល​ពេញអេក្រង់​ឬអត់
kn: ಒಳಬರುವ ಪುಟವು, ಫುಲ್‌ಸ್ಕ್ರೀನ್‌ಡೈಲಾಗ್ ಮೋಡಲ್ ಆಗಿದೆಯೇ ಎಂಬುದನ್ನು ಫುಲ್‌ಸ್ಕ್ರೀನ್ ಡೈಲಾಗ್ ಗುಣಲಕ್ಷಣ ಸೂಚಿಸುತ್ತದೆ
ko: fullscreenDialog 속성은 수신 페이지가 전체 화면 모달 대화상자인지 여부를 지정합니다.
ky: Кирүүчү барак толук экрандуу модалдык диалог экени толук экрандуу диалогдун касиеттеринде аныкталган
lo: ຄຸນສົມບັດ fullscreenDialog ກຳນົດວ່າຈະໃຫ້ໜ້າທີ່ສົ່ງເຂົ້າມານັ້ນເປັນກ່ອງໂຕ້ຕອບແບບເຕັມຈໍຫຼືບໍ່
lt: Viso ekrano dialogo lango nuosavybė nurodo, ar gaunamas puslapis yra viso ekrano modalinis dialogo langas
lv: Rekvizīts fullscreenDialog nosaka, vai ienākošā lapa ir pilnekrāna režīma modālais dialoglodziņš.
mk: Својството fullscreenDialog одредува дали дојдовната страница е во модален дијалог на цел екран
ml: ഇൻകമിംഗ് പേജ് ഒരു പൂർണ്ണസ്‌ക്രീൻ മോഡൽ ഡയലോഗാണോയെന്ന് പൂർണ്ണസ്‌ക്രീൻ ഡയലോഗ് പ്രോപ്പർട്ടി വ്യക്തമാക്കുന്നു
mn: Бүтэн дэлгэцийн харилцах цонхны шинж чанар нь тухайн ирж буй хуудас бүтэн дэлгэцийн зайлшгүй харилцах цонх мөн эсэхийг тодорхойлдог
mr: fullscreenDialog प्रॉपर्टी ही येणारे पेज फुलस्क्रीन मोडाल डायलॉग आहे की नाही ते नमूद करते
ms: Sifat Dialogskrinpenuh menentukan sama ada halaman masuk ialah dialog mod skrin penuh
my: FullscreenDialog အချက်အလက်က အဝင်စာမျက်နှာသည် မျက်နှာပြင်အပြည့် နမူနာဒိုင်ယာလော့ဂ် ဟုတ်မဟုတ် သတ်မှတ်ပေးသည်
nb: Egenskapen fullscreenDialog angir hvorvidt den innkommende siden er en modaldialogboks i fullskjerm
ne: फुल स्क्रिनका संवादको विशेषताले आउँदो पृष्ठ फुल स्क्रिन मोडल संवाद हो वा होइन भन्ने कुरा निर्दिष्ट गर्दछ
pa: fullscreenDialog ਪ੍ਰਾਪਰਟੀ ਨਿਰਧਾਰਤ ਕਰਦੀ ਹੈ ਕਿ ਇਨਕਮਿੰਗ ਪੰਨਾ ਪੂਰੀ-ਸਕ੍ਰੀਨ ਮਾਡਲ ਵਿੰਡੋ ਹੈ ਜਾਂ ਨਹੀਂ
pl: Właściwość fullscreenDialog określa, czy następna strona jest pełnoekranowym oknem modalnym
pt: A propriedade fullscreenDialog especifica se a página recebida é uma caixa de diálogo modal em tela cheia
pt_pt: A propriedade fullscreenDialog especifica se a página recebida é uma caixa de diálogo modal em ecrã inteiro.
ro: Proprietatea casetei de dialog pe ecran complet arată dacă pagina următoare este o casetă de dialog modală pe ecran complet
ru: Свойство fullscreenDialog определяет, будет ли следующая страница полноэкранным модальным диалоговым окном.
si: පූර්ණ තිර සංවාදය එන පිටුව පූර්ණ තිර ආකෘති සංවාදයක්ද යන්න නිශ්චිතව දක්වයි
sk: Hodnota fullscreenDialog určuje, či je prichádzajúca stránka modálne dialógové okno na celú obrazovku
sq: Karakteristika e fullscreenDialog specifikon nëse faqja hyrëse është dialog modal në ekran të plotë
sr: Производ fullscreenDialog одређује да ли се следећа страница отвара у модалном дијалогу преко целог екрана
sr_latn: Proizvod fullscreenDialog određuje da li se sledeća stranica otvara u modalnom dijalogu preko celog ekrana
sv: Med egendomen fullscreenDialog anges om en inkommande sida är en modal dialogruta i helskärm
te: ఇన్‌కమింగ్ పేజీ ఫుల్-స్క్రీన్‌ మోడల్ డైలాగ్ కాదా అని ఫుల్-స్క్రీన్‌ డైలాగ్ ఆస్తి నిర్దేశిస్తుంది
th: พร็อพเพอร์ตี้ fullscreenDialog จะระบุว่าหน้าที่เข้ามาใหม่เป็นกล่องโต้ตอบในโหมดเต็มหน้าจอหรือไม่
tr: Tam ekran iletişim kutusu özelliği, gelen sayfanın tam ekran kalıcı bir iletişim kutusu olup olmadığını belirtir.
uk: Параметр fullscreenDialog визначає, чи є сторінка, що з'явиться, діалоговим вікном на весь екран
ur: fullscreenDialog کی پراپرٹی اس بات کی وضاحت کرتی ہے کہ آنے والا صفحہ ایک پوری اسکرین کا ماڈل ڈائیلاگ ہے۔
uz: fullscreenDialog xossasi butun ekran rejimidagi modal muloqot oynasida keyingi sahifa borligini koʻrsatadi
vi: Thuộc tính fullscreenDialog cho biết liệu trang sắp tới có phải là một hộp thoại ở chế độ toàn màn hình hay không
zh_hk: 您可以利用 fullscreenDialog 屬性指定接下來顯示的頁面是否顯示為全螢幕強制回應對話框
zu: Isici se-FullscreenDialog sicacisa uma ngabe ikhasi elingenayo liyibhokisi lesikrini esigcwele se-modal yini
