Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoNavigationDrawerUserName
source: User Name
af: Gebruikernaam
am: የተጠቃሚ ስም
ar_eg: اسم المستخدم
as: ব্যৱহাৰকাৰীৰ নাম
az: İstifadəçi adı
be: Імя карыстальніка
bn: ব্যবহারকারী নাম
bs: Korisničko ime
ca: Nom d'usuari
da: Brugernavn
es_ar: Nombre de usuario
et: Kasutaja nimi
eu: Erabiltzaile-izena
fa: نام کاربر
fil: Pangalan ng User
fr_ca: Nom d'utilisateur
gl: Nome de usuario
gu: વપરાશકર્તાનું નામ
he: שם משתמש
hi: उपयोगकर्ता का नाम
hu: Felhasználói név
hy: Օգտանուն
id: Nama Pengguna
it: Nome utente
ja: ユーザー名
ka: მომხმარებლის სახელი
km: ឈ្មោះ​អ្នក​ប្រើប្រាស់
kn: ಬಳಕೆದಾರ ಹೆಸರು
ko: 사용자 이름
ky: Колдонуучунун аты
lo: ຊື່ຜູ້ໃຊ້
lt: Naudotojo vardas
lv: Lietotāja vārds
mk: Корисничко име
ml: ഉപയോക്തൃനാമം
mn: Хэрэглэгчийн нэр:
mr: वापरकर्त्याचे नाव
ms: Nama Pengguna
my: အသုံးပြုသူအမည်
nb: Brukernavn
ne: युजरनेम
pa: ਵਰਤੋਂਕਾਰ ਨਾਮ
pl: Nazwa użytkownika
pt: Nome do usuário
pt_pt: Nome de utilizador
ro: Nume de utilizator
ru: Имя пользователя
si: පරිශීලක නම:
sk: Meno používateľa
sq: Emri i përdoruesit
sr: Корисничко име
sr_latn: Korisničko ime
sv: Användarnamn
te: యూజర్ పేరు
th: ชื่อผู้ใช้
tr: Kullanıcı Adı
uk: Ім'я користувача
ur: صارف کا نام
uz: Foydalanuvchi nomi
vi: Tên người dùng
zh_hk: 用戶名稱
zu: Igama Lomsebenzisi

# demoNavigationDrawerText
source: Swipe from the edge or tap the upper-left icon to see the drawer
af: Swiep van die rand af of tik op die ikoon links bo om die laai te sien
am: መሳቢያውን ለማየት ከጠርዙ ላይ ያንሸራትቱ ወይም የላይኛውን ግራ አዶ መታ ያድርጉ
ar_eg: مرِّر سريعًا من الحافة أو انقر على الرمز في أعلى يمين الصفحة لعرض لائحة التنقّل.
as: দেৰাজটো চাবলৈ কাষৰ পৰা ছোৱাইপ কৰক অথবা বাওঁফালৰ ওপৰৰ চিহ্নটোত টিপক
az: Çəkməcəni görmək üçün kənardan sürüşdürün və ya yuxarı sol ikonaya toxunun
be: Каб пабачыць высоўнае меню, правядзіце пальцам ад краю ці дакраніцеся да верхняга левага значка
bn: ড্রয়ার দেখতে স্ক্রিনের বর্ডার থেকে সোয়াইপ করুন অথবা উপরের বাঁদিকের আইকনে ট্যাপ করুন
bs: Prevucite od ruba ili dodirnite ikonu u gornjem lijevom uglu da se prikaže panel
ca: Llisca des de la vora o toca la icona de la part superior esquerra per veure el tauler
da: Stryg fra kanten af skærmen, eller tryk på ikonet øverst til venstre for at se skuffen
es_ar: Desliza el dedo desde el borde o presiona el ícono superior izquierdo para ver el panel lateral
et: Sahtli nägemiseks pühkige servast või puudutage ülal vasakul olevat ikooni
eu: Pasatu hatza ertzetik edo sakatu goian ezkerrean dagoen ikonoa panel lerrakorra ikusteko
fa: برای دیدن کشو، از لبهٔ صفحه به‌سمت داخل بکشید یا روی نماد در بالا سمت راست ضربه بزنید
fil: Mag-swipe mula sa dulo o i-tap ang icon sa kaliwang bahagi sa itaas para makita ang drawer
fr_ca: Balayez l'écran à partir du bord ou touchez l'icône située dans le coin supérieur gauche pour afficher le panneau
gl: Para ver o panel, pasa o dedo desde o bordo ou toca a icona da parte superior esquerda
gu: ડ્રોઅર જોવા માટે કિનારી પરથી સ્વાઇપ કરો અથવા ઉપર ડાબી બાજુના આઇકન પર ટૅપ કરો
he: יש להחליק מהקצה או להקיש על הסמל שבצד ימין למעלה כדי לראות את החלונית
hi: नेविगेशन पैनल देखने के लिए, स्क्रीन के किनारे से स्वाइप करें या स्क्रीन के ऊपरी हिस्से पर बाईं ओर मौजूद आइकॉन पर टैप करें
hu: A fiók megjelenítéséhez csúsztasson a szélétől, vagy koppintson a bal felső sarokban található ikonra
hy: Դարակը բացելու համար մատը սահեցրեք եզրից կամ հպեք վերևի ձախ անկյունի պատկերակին։
id: Geser dari pinggir layar atau ketuk ikon di kiri atas untuk melihat panel samping
it: Per visualizzare il riquadro a scomparsa, scorri dal bordo o tocca l'icona in alto a sinistra
ja: ドロワーを表示するには、画面の端からスワイプするか、左上のアイコンをタップします
ka: გადაფურცლეთ კიდიდან ან შეეხეთ ზედა მარცხენა ხატულას უჯრის სანახავად
km: អូសចេញពីគែម ឬចុចរូបតំណាងខាងលើផ្នែកខាងឆ្វេង ដើម្បីមើលថត​
kn: ಡ್ರಾಯರ್ ಅನ್ನು ನೋಡಲು ತುದಿಯಿಂದ ಸ್ವೈಪ್ ಮಾಡಿ ಅಥವಾ ಮೇಲಿನ ಎಡಭಾಗದ ಐಕಾನ್ ಅನ್ನು ಟ್ಯಾಪ್ ಮಾಡಿ
ko: 창을 보려면 가장자리에서 스와이프하거나 왼쪽 상단에 위치한 아이콘을 탭하세요.
ky: Суурманы көрүү үчүн кырын сүрүңүз же жогорку сол жактагы сүрөтчөнү басып коюңуз
lo: ປັດຈາກຂອບ ຫຼື ແຕະໃສ່ໄອຄອນຂວາເທິງເພື່ອເບິ່ງລິ້ນຊັກ
lt: Perbraukite nuo krašto arba palieskite viršuje kairėje esančią piktogramą, kad būtų parodytas skydelis
lv: Lai skatītu atvilktni, velciet no malas vai pieskarieties augšējā kreisajā stūrī esošajai ikonai
mk: Лизгајте од работ или допрете ја иконата горе лево за да ја погледнете фиоката
ml: ഡ്രോയർ കാണാൻ അരികിൽ നിന്ന് സ്വൈപ്പ് ചെയ്യുക അല്ലെങ്കിൽ മുകളിൽ ഇടത് ഭാഗത്തെ ഐക്കണിൽ ടാപ്പ് ചെയ്യുക
mn: Шургуулгыг харахын тулд захаас шудрах эсвэл зүүн дээд дүрс тэмдэг дээр товшино уу
mr: ड्रॉवर पाहण्यासाठी कडेने स्‍वाइप करा किंवा डावीकडील वरच्या आयकनवर टॅप करा
ms: Leret dari tepi atau ketik ikon kiri sebelah atas untuk melihat laci
my: အံဆွဲကို ကြည့်ရန် အနားစွန်းမှ ပွတ်ဆွဲပါ သို့မဟုတ် ဘယ်ဘက်အပေါ်ပိုင်းရှိ သင်္ကေတကို တို့ပါ
nb: Sveip fra kanten eller trykk på ikonet øverst til venstre for å se uttrekksmenyen
ne: ड्रअर हेर्न स्क्रिनको किनाराबाट स्वाइप गर्नुहोस् वा माथिपट्टि बायँतिर रहेको आइकनमा ट्याप गर्नुहोस्
pa: ਦਰਾਜ਼ ਦੇਖਣ ਲਈ ਕਿਨਾਰੇ ਤੋਂ ਸਵਾਈਪ ਕਰੋ ਜਾਂ ਸਿਖਰਲੇ ਖੱਬੇ ਪ੍ਰਤੀਕ 'ਤੇ ਟੈਪ ਕਰੋ
pl: Przesuń od krawędzi ekranu lub kliknij ikonę w lewym górnym rogu, by otworzyć panel
pt: Deslize da borda para dentro ou toque no ícone no canto superior esquerdo para ver a gaveta
pt_pt: Deslize rapidamente a partir da extremidade ou toque no ícone superior esquerdo para ver a gaveta.
ro: Glisați dinspre margine sau atingeți pictograma din stânga sus ca să vedeți panoul
ru: Чтобы открыть выдвигающуюся панель, нужно провести пальцем от края или коснуться значка в левом верхнем углу.
si: ලාච්චුව බැලීමට දාරයේ සිට ස්වයිප් කරන්න හෝ ඉහළ වම් නිරූපකය තට්ටු කරන්න
sk: Vysúvací panel zobrazíte potiahnutím smerom od okraja alebo klepnutím na hornú ľavú ikonu.
sq: Rrëshqit nga skaji ose trokit ikonën e majtë lart për të parë sirtarin
sr: Превуците од ивице или додирните икону у горњем левом углу да бисте видели фиоку
sr_latn: Prevucite od ivice ili dodirnite ikonu u gornjem levom uglu da biste videli fioku
sv: Svep från kanten eller tryck på ikonen uppe till höger för att öppna panelen
te: డ్రాయర్‌ను చూడటానికి అంచు నుండి స్వైప్ చేయండి లేదా ఎగువన ఎడమవైపు ఉన్న చిహ్నాన్ని ట్యాప్ చేయండి
th: เลื่อนจากขอบหรือแตะไอคอนด้านซ้ายบนเพื่อดูลิ้นชัก
tr: Çekmeceyi görmek için kenardan kaydırın veya sol üstteki simgeye dokunun
uk: Проведіть пальцем від краю екрана або натисніть значок угорі ліворуч, щоб відкрити панель
ur: دراز دیکھنے کے لئے کونے سے سوائپ کریں یا اوپری بائیں آئیکن پر تھپتھپائیں
uz: Tortma panelni chiqarish uchun chetgan suring yoki yuqori chap burchakdagi belgi ustiga bosing
vi: Vuốt từ cạnh màn hình hoặc nhấn vào biểu tượng ở phía trên bên trái để xem ngăn
zh_hk: 從邊緣滑動或輕按左上方的圖示以查看導覽列
zu: Swayipha kusuka onqenqemeni noma thepha isithonjana esiphezulu ngakwesobunxele ukuze ubone ikhabethe

# demoNavigationRailTitle
source: Navigation Rail
af: Navigasiespoor
am: የአሰሳ ሐዲድ
ar_eg: شريط التنقّل
as: নেভিগেশ্বন ৰে’ল
az: Naviqasiya Relsi
be: Планка навігацыі
bn: নেভিগেশন রেল
bs: Traka za navigaciju
ca: Barra de navegació
da: Navigationsbjælke
es_ar: Riel de navegación
et: Navigeerimisrada
eu: Nabigazio-erraila
fa: ریل پیمایش
fr_ca: Rail de navigation
gl: Raíl de navegación
gu: નૅવિગેશન રેલ
he: פס ניווט
hi: नेविगेशन रेल
hu: Navigációs sáv
hy: Նավիգացիայի գոտի
id: Kolom Navigasi Samping
it: Barra di spostamento
ja: ナビゲーション レール
ka: ნავიგაციის არხი
km: ខ្សែរុករក
kn: ನ್ಯಾವಿಗೇಶನ್ ರೈಲ್
ko: 탐색 레일
ky: Өтүү тилкеси
lo: ລາງການນຳທາງ
lt: Naršymo juosta
lv: Navigācijas josla
mk: Шина за навигација
ml: നാവിഗേഷൻ റെയിൽ
mn: Навигацын төмөр зам
mr: नेव्हिगेशन रेल
ms: Laluan Navigasi
my: လမ်းကြောင်းပြဘား
nb: Navigasjonslinje
ne: नेभिगेसन रेल
pa: ਨੈਵੀਗੇਸ਼ਨ ਰੇਲ
pl: Kolumna nawigacji
pt: Coluna de navegação
pt_pt: Barra de navegação
ro: Bară de navigare
ru: Боковая панель навигации
si: සංචාලන පීල්ල
sk: Navigačný pruh
sq: Shina e shfletimit
sr: Пруга за навигацију
sr_latn: Pruga za navigaciju
sv: Navigeringsspår
te: నావిగేషన్ రైలు
th: แถบข้างสำหรับไปยังส่วนต่างๆ
tr: Gezinme Sütunu
uk: Стрічка навігації
ur: نیوی گیشن ریل
uz: Yon navigatsiya paneli
vi: Dải điều hướng
zh_hk: 導覽欄
zu: Uthango Lokuzulazula

# demoNavigationRailSubtitle
source: Displaying a Navigation Rail within an app
af: Wys 'n navigasiespoor binne 'n program
am: የአሰሳ ሐዲድን በመተግበሪያ ውስጥ በማሳየት ላይ
ar_eg: عرض شريط تنقّل داخل تطبيق
as: এটা এপৰ ভিতৰত নেভিগেশ্বন ৰে’ল দেখুওৱা হৈছে
az: Tətbiqin içində Naviqasiya Relsi göstərilir
be: Паказ планкі навігацыі ў праграме
bn: অ্যাপের মধ্যে নেভিগেশন রেল দেখানো হচ্ছে
bs: Prikaz trake za navigaciju unutar aplikacije
ca: Es mostra una barra de navegació en una aplicació
da: Viser en navigationsbjælke i en app
es_ar: Cómo mostrar un riel de navegación dentro de una app
et: Navigeerimisraja kuvamine rakenduses
eu: Nabigazio-errail bat bistaratzen du aplikazioaren barruan
fa: «ریل پیمایش» را در برنامه نمایش می‌دهد
fil: Nagpapakita ng Navigation Rail sa app
fr_ca: Affichage d'un rail de navigation dans une application
gl: Móstrase un raíl de navegación dentro dunha aplicación
gu: ઍપની અંદર નૅવિગેશન રેલ બતાવે છે
he: הצגת פס ניווט באפליקציה
hi: ऐप्लिकेशन के अंदर दिखती हुई नेविगेशन रेल
hu: Navigációs sáv megjelenítése az adott alkalmazáson belül
hy: Նավիգացիայի գոտու ցուցադրում հավելվածում
id: Menampilkan Kolom Navigasi Samping dalam aplikasi
it: Visualizzare una barra di spostamento all'interno di un'app
ja: アプリ内にナビゲーション レールを表示する
ka: ნაჩვენებია ნავიგაციის არხი აპის შიგნით
km: ការបង្ហាញខ្សែរុករកនៅក្នុងកម្មវិធី
kn: ಆ್ಯಪ್‌ನ ಒಳಗಡೆ ನ್ಯಾವಿಗೇಶನ್ ರೈಲ್ ಅನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಾಗುತ್ತಿದೆ
ko: 앱 안에 탐색 레일 표시
ky: Колдонмодогу өтүү тилкеси көрсөтүлүүдө
lo: ການສະແດງລາງການນຳທາງພາຍໃນແອັບໃດໜຶ່ງ
lt: Programoje rodoma naršymo juosta
lv: Navigācijas joslas rādīšana lietotnē
mk: Се прикажува шина за навигација во апликацијата
ml: ആപ്പിനുള്ളിൽ ഒരു നാവിഗേഷൻ റെയിൽ പ്രദർശിപ്പിക്കുന്നു
mn: Апп дахь навигацын төмөр замыг харуулж байна
mr: ॲपमध्ये नेव्हिगेशन रेल दाखवत आहे
ms: Memaparkan Laluan Navigasi dalam apl
my: အက်ပ်အတွင်း လမ်းကြောင်းပြဘားကို ပြသခြင်း
nb: Viser en navigasjonslinje i en app
ne: कुनै एपभित्र देखिने नेभिगेसन रेल
pa: ਐਪ ਵਿੱਚ ਨੈਵੀਗੇਸ਼ਨ ਰੇਲ ਦਿਖਾਈ ਜਾ ਰਹੀ ਹੈ
pl: Wyświetla kolumnę nawigacji w aplikacji
pt: Exibindo uma coluna de navegação em um app
pt_pt: Apresentar uma barra de navegação numa app
ro: Afișarea unei bare de navigare într-o aplicație
ru: Показ боковой панели навигации в приложении
si: යෙදුමක් තුළ සංචාලන පීල්ලක් සංදර්ශනය කිරීම
sk: Zobrazenie navigačného pruhu v aplikácii
sq: Shfaqja e shinës së shfletimit brenda një aplikacioni
sr: Приказује пругу за навигацију у апликацији
sr_latn: Prikazuje prugu za navigaciju u aplikaciji
sv: Visar ett navigeringsspår i en app
te: యాప్‌లో నావిగేషన్ రైలును ప్రదర్శిస్తోంది
th: การแสดงแถบข้างสำหรับไปยังส่วนต่างๆ ภายในแอป
tr: Uygulamada Gezinme Sütunu'nu görüntüleme
uk: Показується стрічка навігації в додатку
ur: ایپ کے اندر موجود نیوی گیشن ریل کو ڈسپلے کیا جا رہا ہے
uz: Ilova ichida yon navigatsiya panelini chiqarish
vi: Hiển thị dải điều hướng trong một ứng dụng
zh_hk: 在應用程式中顯示導覽欄
zu: Ibonisa Uthango Lokuzulazula ngaphakathi kohlelo lokusebenza

# demoNavigationRailDescription
source: A material widget that is meant to be displayed at the left or right of an app to navigate between a small number of views, typically between three and five.
af: 'n Materiaallegstuk wat bedoel is om links of regs van 'n program gewys te word om te navigeer tussen 'n klein aantal aansigte, gewoonlik tussen drie en vyf.
am: በአይነተኛነት በሶስት እና አምስት መካከል የሆነ ትንሽ የዕይታዎች ቁጥር መካከል ለመዳሰስ በመተግበሪያው ግራ ወይም ቀኝ እንዲታይ የታሰበ የቁስ መግብር።
ar_eg: أداة أساسية تظهر في يمين أو يسار التطبيق للتنقّل بين عدد صغير من الأقسام داخل التطبيق، غالبًا ما بين 3 إلى 5 أقسام.
as: এটা বস্তুৰ ভিউ সাধাৰণতে তিনিৰ পৰা পাঁচটাৰ ভিতৰত কম সংখ্যক ভিউৰ মাজত নেভিগে’ট কৰিবলৈ এটা এপৰ সোঁ অথবা বাওঁফালে দেখুওৱা হয়।
az: Adətən üç-beş baxış arasında naviqasiya etmək üçün tətbiqin solu və ya sağında göstərilən material vidcet.
be: Матэрыяльны віджэт, які паказваецца з левага ці правага боку на экране праграмы і прызначаны для навігацыі паміж невялікай колькасцю старонак (звычайна 3-5).
bn: একটি মেটিরিয়াল উইজেট যা সাধারণত অ্যাপের বাঁ অথবা ডানদিকে সাধারণত তিন থেকে পাঁচটি ভিউর মধ্যে নেভিগেট করার জন্য দেখানো হয়।
bs: Materijalni vidžet koji se treba prikazivati na lijevoj ili desnoj strani aplikacije radi navigiranja između malog broja prikaza, obično između tri i pet.
ca: Widget material que es mostrarà a l'esquerra o a la dreta d'una aplicació per navegar entre unes quantes visualitzacions, normalment entre tres i cinc.
da: En Material Design-widget, der er beregnet til at blive vise til venstre eller højre for en app i forbindelse med navigation mellem nogle få visninger, typisk mellem tre og fem.
es_ar: Un widget de Material que debe mostrarse a la izquierda o la derecha de una app para navegar entre una pequeña cantidad de vistas, generalmente entre tres y cinco.
et: Materiaalse disaini vidin, mida kuvatakse rakenduse vasakul või paremal küljel, et navigeerida väikese arvu vaadete vahel, tavaliselt kolme kuni viie.
eu: Aplikazio baten ezkerrean edo eskuinean bistaratuko den Material diseinudun widgeta, ikuspegi gutxi batzuen artean (hiru eta bost artean, normalean) nabigatzeko.
fa: ابزارک طراحی مواد که برای نمایش در سمت راست یا چپ برنامه و پیمایش بین تعداد محدودی نما (معمولاً سه تا پنج نما) درنظر گرفته شده است.
fil: Isang widget ng materyal na ginawa para lumabas sa kaliwa o kanan ng app para mag-navigate sa kaunting view, karaniwang tatlo hanggang lima.
fr_ca: Widget Material Design qui doit être affiché à la gauche ou la droite d'une application pour naviguer entre un petit nombre de vues (généralement entre trois et cinq).
gl: Un widget de Material Design que se mostra á esquerda ou á dereita dunha aplicación para navegar por un número pequeno de vistas (normalmente 3-5).
gu: એક મટિરિયલ વિજેટ જેને અમુક વ્યૂની વચ્ચે નૅવિગેટ કરવા માટે, ઍપની ડાબી કે જમણી બાજુએ બતાવવામાં આવે છે, સામાન્ય રીતે ત્રણ અને પાંચની વચ્ચેના વ્યૂ.
he: ווידג'ט פיזי שאמור להיות מוצג בצד שמאל או בצד ימין של אפליקציה כדי לנווט בין מספר קטן של תצוגות, בדרך כלל בין שלוש לחמש.
hi: दिए गए कुछ व्यू के बीच नेविगेट करने के लिए, मटीरियल विजेट का इस्तेमाल किया जाता है. यह विजेट किसी ऐप्लिकेशन के बाईं या दाईं ओर दिखना चाहिए. अक्सर, कुल मिलाकर तीन से पांच व्यू होते हैं.
hu: Anyagi modul, amely az adott alkalmazás bal vagy jobb oldalán jelenik meg, és néhány (jellemzően három és öt) nézet közötti navigálásra szolgál.
hy: Material Design ոճի վիջեթ, որը ցուցադրվում է հավելվածի աջ կամ ձախ մասում և պարունակում է քիչ թվով պատկերակներ (սովորաբար երեքից հինգ)։
id: Widget material yang dimaksudkan untuk ditampilkan di bagian kiri atau kanan aplikasi guna beralih antar-beberapa tampilan, biasanya antara tiga atau lima.
it: Un widget material che dovrebbe essere visualizzato nella parte a sinistra o destra di un'app per spostarsi tra un numero limitato di visualizzazioni, generalmente da tre a cinque.
ja: 少数（通常は 3～5 個）のビュー間を移動するためにアプリの左または右に表示することを目的としたマテリアル ウィジェット。
ka: Material ვიჯეტი, რომელიც უნდა გამოჩნდეს აპის მარცხნივ ან მარჯვნივ მცირე რაოდენობით, როგორც წესი, სამიდან ხუთამდე, ხედს შორის ნავიგაციისთვის.
km: ធាតុ​ក្រាហ្វិកសំយោគ​ ដែលត្រូវបង្ហាញនៅផ្នែកខាងឆ្វេង ឬខាងស្ដាំនៃកម្មវិធី ដើម្បីរុករករវាងចំនួនមើលតិច ជាទូទៅចន្លោះពីបីទៅប្រាំ។
kn: ಇದೊಂದು ಭೌತಿಕ ವಿಜೆಟ್ ಆಗಿದ್ದು, ಸಣ್ಣ ಸಂಖ್ಯೆಯ ವೀಕ್ಷಣೆಗಳು, ಅಂದರೆ ವಿಶೇಷವಾಗಿ ಮೂರು ಮತ್ತು ಐದು ವೀಕ್ಷಣೆಗಳ ನಡುವೆ ನ್ಯಾವಿಗೇಟ್ ಮಾಡಲು, ಆ್ಯಪ್‌ನ ಎಡ ಅಥವಾ ಬಲಭಾಗದಲ್ಲಿ ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಿಕ್ಕಾಗಿ ಇದೆ.
ko: 앱의 왼쪽이나 오른쪽에 위치하여 적은 수의 뷰(일반적으로 3~5개)를 탐색하게 해 주는 머티리얼 디자인 위젯입니다.
ky: Аз сандагы, адатта үчтөн бешке чейинки, көрүнүштөрдүн ортосунда солго же оңго өтүү үчүн колдонулган материалдык виджет.
lo: ວິດເຈັດ material ແມ່ນໃຊ້ເພື່ອສະແດງຢູ່ທາງຊ້າຍ ຫຼື ຂວາຂອງແອັບໃດໜຶ່ງເພື່ອເລື່ອນໄປມາລະຫວ່າງມຸມມອງຈຳນວນໜຶ່ງ, ໂດຍປົກກະຕິແລ້ວແມ່ນສອງຫາສາມມຸມມອງ.
lt: Trimačių objektų dizaino valdiklis, rodomas programos kairėje ar dešinėje, skirtas naršyti tarp kelių rodinių, paprastai nuo trijų iki penkių.
lv: Šo materiāla dizaina logrīku ir paredzēts rādīt lietotnes kreisajā vai labajā malā, lai varētu pāriet starp nedaudziem skatiem — parasti no trim līdz pieciem.
mk: Материјален виџет што се прикажува одлево или оддесно од апликацијата и служи за навигација помеѓу мал број на прикази, обично од три до пет.
ml: സാധാരണയായി മൂന്നിനും അഞ്ചിനും ഇടയിൽ വരുന്ന ഒരു ചെറിയ എണ്ണം കാഴ്ച്ചകൾക്കിടയിൽ നാവിഗേറ്റ് ചെയ്യാൻ ഒരു ആപ്പിന്റെ ഇടത് അല്ലെങ്കിൽ വലത് ഭാഗത്ത് പ്രദർശിപ്പിക്കാനുദ്ദേശിച്ചുള്ള മെറ്റീരിയൽ വിജറ്റ്.
mn: Цөөн тоотой үзэлтийн хооронд, ихэвчлэн гурваас тавын хооронд шилжихийн тулд аппын зүүн эсвэл баруун талд харагдах зориулалттай материалын жижиг хэрэгсэл юм.
mr: मटेरियल विजेट हे काही व्ह्यूंमध्ये नेव्हिगेट करण्यासाठी वापरले जाते, हे ॲपच्या डावीकडे किंवा उजवीकडे दाखवले जाणे अपेक्षित आहे तसेच यामध्ये साधारणतः तीन ते पाच व्ह्यू असतात.
ms: Widget bahan yang dimaksudkan untuk dipaparkan di kiri atau kanan apl untuk menavigasi antara sebilangan kecil paparan, biasanya antara tiga hingga lima.
my: ပုံမှန်အားဖြင့် သုံးခုနှင့် ငါးခုကြားရှိ နည်းပါးသော ကြည့်ရှုမှုများကြား လမ်းညွှန်ရန် အက်ပ်တစ်ခု၏ ဘယ်ဘက် သို့မဟုတ် ညာဘက်တွင် ပြသရန် ရည်ရွယ်သည့် Material ဝိဂျက်။
nb: En materiellmodul som skal vises på venstre eller høyre side av en app for å navigere mellom et lite antall visninger, vanligvis mellom tre og fem.
ne: कुनै एपको बायाँ वा दायाँपट्टि देखिने मटरियल विजेट थोरै भ्यूहरू (खासगरी तीनदेखि पाँचवटा भ्यू) बिच नेभिगेसन गर्न प्रयोग गरिन्छ।
pa: ਤਿੰਨ ਅਤੇ ਪੰਜ ਵਰਗੇ ਛੋਟੇ ਦ੍ਰਿਸ਼ਾਂ ਵਿਚਾਲੇ ਨੈਵੀਗੇਟ ਕਰਨ ਲਈ ਮੈਟੀਰੀਅਲ ਵਿਜੇਟ ਨੂੰ ਐਪ ਦੇ ਖੱਬੇ ਜਾਂ ਸੱਜੇ ਪਾਸੇ ਦਿਖਾਇਆ ਜਾਂਦਾ ਹੈ।
pl: Widżet Material Design, który wyświetla się z lewej lub prawej strony aplikacji i ułatwia nawigację po niewielkiej liczbie widoków (zazwyczaj 3 lub 5).
pt: Um widget do Material Design criado para ser exibido do lado esquerdo ou direito de um app para navegar entre um pequeno número de visualizações, geralmente entre três e cinco.
pt_pt: Um widget material que se destina a ser apresentado à esquerda ou direita de uma app para navegar entre um pequeno número de vistas, normalmente, entre três e cinco.
ro: Un widget pentru design material care se afișează în stânga sau în dreapta unei aplicații, pentru a putea naviga prin câteva vizualizări, de obicei între trei și cinci.
ru: Виджет в стиле Material Design, который отображается слева или справа в приложении и позволяет переходить между небольшим количеством просмотров, обычно от трех до пяти.
si: සාමාන්‍යයෙන් කුඩා දසුන් තුනක් සහ පහක් අතර සංචාලනය කිරීම සඳහා යෙදුමක වමේ හෝ දකුණේ සංදර්ශනය කිරීමට අදහස් කරන ද්‍රව්‍යමය විජට්.
sk: Miniaplikácia so vzhľadom Material Design, ktorá sa má zobrazovať na ľavej alebo pravej strane aplikácie a umožňovať navigáciu medzi menším počtom zobrazení (zvyčajne troma až piatimi).
sq: Një miniaplikacion material që synohet për shfaqje majtas apo djathtas një aplikacioni për të shfletuar mes një numri të vogël, rëndom mes tri e pesë, pamjesh.
sr: Виџет материјалног дизајна који треба да се приказује лево или десно у апликацији ради кретања између малог броја приказа, обично између три и пет.
sr_latn: Vidžet materijalnog dizajna koji treba da se prikazuje levo ili desno u aplikaciji radi kretanja između malog broja prikaza, obično između tri i pet.
sv: En Material Design-widget avsedd att visas till vänster eller höger i en app för navigering mellan ett mindre antal vyer, vanligtvis mellan tre och fem.
te: తక్కువ సంఖ్యలో వీక్షణల మధ్య, సాధారణంగా మూడు, ఐదు వీక్షణల మధ్య నావిగేట్ చేయడానికి యాప్‌కు ఎడమ లేదా కుడి వైపున ప్రదర్శించబడే విశేష విడ్జెట్.
th: วิดเจ็ตแบบ Material ที่มีไว้เพื่อแสดงบริเวณด้านซ้ายหรือขวาของแอปสำหรับการไปยังส่วนต่างๆ ระหว่างมุมมองไม่กี่มุมมอง โดยทั่วไปจะอยู่ที่ระหว่าง 3 ถึง 5 มุมมอง
tr: Az sayıda, genellikle üç ila beş görünüm arasında gezinmek için uygulamanın solunda veya sağında görüntülenmesi amaçlanan bir materyal widget'ı.
uk: Віджет матеріального дизайну, який показується ліворуч або праворуч на екрані додатка й містить невелику кількість значків (зазвичай від трьох до п'яти).
ur: ملاحظات کی کم تعداد کے درمیان جو کہ عام طور پر تین اور پانچ کے بیچ ہوتے ہیں پر نیوی گیٹ کرنے کیلئے ایپ کے دائیں یا بائیں جانب قابل ڈسپلے مٹیریل ویجیٹ۔
uz: Ilovaning chap yoki oʻng tomonida chiqadigan, odatda uchdan beshtagacha koʻrishlar soni boʻyicha harakatlanish imkonini beruvchi Material Design uslubidagi vidjet.
vi: Tiện ích của Material Design được hiển thị ở bên trái hoặc bên phải của một ứng dụng để di chuyển giữa một số ít lượt xem, thông thường là từ 3 đến 5 lượt.
zh_hk: 在應用程式左側或右側顯示的質感小工具，用以在少量視圖 (一般為 3 至 5 個) 之間導覽。
zu: Iwijethi ebalulekile ehloselwe ukuboniswa kwesobunxele noma sokudla ukuze uhlelo lokusebenza luzulazule phakathi kwenombolo encane yokubuka, ngokuvamile phakathi kokuthathu nokuhlanu.

# demoNavigationRailFirst
source: First
af: Eerste
am: መጀመሪያ
ar_eg: الأول
as: প্ৰথম
az: Birinci
be: Першая
bn: প্রথম
bs: Prvo
ca: Primera
da: Første
es_ar: Primera
et: Esimene
eu: Lehena
fa: اولین
fil: Una
fr_ca: Premier
gl: Primeiro
gu: પહેલું
he: הראשון
hi: पहला
hu: Első
hy: Առաջին
id: Pertama
it: Prima etichetta
ja: 1 つ目
ka: პირველი
km: ទីមួយ
kn: ಮೊದಲನೆಯದು
ko: 첫 번째
ky: Биринчи
lo: ໜຶ່ງ
lt: Pirma
lv: Pirmais galamērķis
mk: Прва
ml: ആദ്യത്തെ
mn: Эхний
mr: पहिले
ms: Pertama
my: ပထမ
nb: Første
ne: पहिलो
pa: ਪਹਿਲਾ
pl: Pierwszy
pt: Primeiro
pt_pt: Primeiro
ro: Prima
ru: Первая
si: පළමු
sk: Prvý
sq: E para
sr: Прва
sr_latn: Prva
sv: Första
te: మొదటి
th: อันดับที่ 1
tr: Birinci
uk: Перший елемент
ur: پہلا
uz: Birinchi
vi: Thứ nhất
zh_hk: 第一個
zu: Okokuqala

# demoNavigationDrawerTitle
source: Navigation Drawer
af: Navigasielaai
am: የአሰሳ መሳቢያ
ar_eg: لائحة التنقّل
as: নেভিগেশ্বন ড্ৰৱাৰ
az: Naviqasiya Çəkməcəsi
be: Высоўнае меню навігацыі
bn: নেভিগেশান ড্রয়ার
bs: Panel za navigaciju
ca: Tauler de navegació
da: Sidemenu
es_ar: Panel lateral de navegación
et: Navigeerimissahtel
eu: Nabigazio-panel lerrakorra
fa: کشوی پیمایش
fr_ca: Panneau de navigation
gl: Panel de navegación
gu: નૅવિગેશન ડ્રોઅર
he: חלונית הזזה לניווט
hi: नेविगेशन पैनल
hu: Navigációs fiók
hy: Նավիգացիայի դարակ
id: Panel Navigasi
it: Riquadro di navigazione a scomparsa
ja: ナビゲーション ドロワー
ka: ნავიგაციის უჯრა
km: ថតរុករក
kn: ನ್ಯಾವಿಗೇಶನ್ ಡ್ರಾಯರ್
ko: 탐색 창
ky: Чабыттоо суурмасы
lo: ແຜງການນຳທາງ
lt: Naršymo skydelis
lv: Navigācijas atvilktne
mk: Фиока за навигација
ml: നാവിഗേഷൻ ഡ്രോയർ
mn: Навигацын шургуулга
mr: नेव्हिगेशन ड्रॉवर
ms: Laci Navigasi
my: လမ်းကြောင်းပြ အံဆွဲ
nb: Uttrekksmeny
ne: नेभिगेसन ड्रअर
pa: ਨੈਵੀਗੇਸ਼ਨ ਡ੍ਰਾਅਰ
pl: Panel nawigacji
pt: Gaveta de navegação
pt_pt: Gaveta de navegação
ro: Panou de navigare
ru: Панель навигации
si: සංචාලන ලාච්චුව
sk: Navigačný vysúvací panel
sq: Sirtari i navigimit
sr: Фиока за навигацију
sr_latn: Fioka za navigaciju
sv: Navigeringspanel
te: నావిగేషన్ డ్రాయర్
th: ลิ้นชักการนำทาง
tr: Gezinme Çekmecesi
uk: Панель навігації
ur: نیویگیشن دراز
uz: Navigatsiya paneli
vi: Ngăn điều hướng
zh_hk: 導覽列
zu: Idrowa Lokuzula

# demoNavigationRailThird
source: Third
af: Derde
am: ሦስተኛ
ar_eg: الثالث
as: তৃতীয়
az: Üçüncü
be: Трэцяя
bn: তৃতীয়
bs: Treće
ca: Tercera
da: Tredje
es_ar: Tercera
et: Kolmas
eu: Hirugarrena
fa: سومین
fil: Ikatlo
fr_ca: Troisième
gl: Terceiro
gu: ત્રીજું
he: השלישי
hi: तीसरा
hu: Harmadik
hy: Երրորդ
id: Ketiga
it: Terza etichetta
ja: 3 つ目
ka: მესამე
km: ទីបី
kn: ಮೂರನೇ
ko: 세 번째
ky: Үчүнчү
lo: ທີສາມ
lt: Trečia
lv: Trešais galamērķis
mk: Трета
ml: മൂന്നാമത്തെ
mn: Гурав дахь
mr: तिसरे
ms: Ketiga
my: တတိယ
nb: Tredje
ne: तेस्रो
pa: ਤੀਜਾ
pl: Trzeci
pt: Terceiro
pt_pt: Terceiro
ro: A treia
ru: Третья
si: තුන්වන
sk: Tretí
sq: E treta
sr: Трећа
sr_latn: Treća
sv: Tredje
te: మూడవ
th: อันดับที่ 3
tr: Üçüncü
uk: Третій елемент
ur: تیسرا
uz: Uchinchi
vi: Thứ ba
zh_hk: 第三個
zu: Okwesithathu
