Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoTextFieldDescription
source: A text field lets the user enter text, either with a hardware keyboard or with an onscreen keyboard.
af: 'n Teksveld stel die gebruiker in staat om teks in te voer, hetsy met 'n hardewaresleutelbord of 'n sleutelbord op die skerm.
am: የጽሁፍ መስክ ተጠቃሚው በሃርድዌር ቁልፍ ሰሌዳ ወይም በማያ ገፅ ላይ ቁልፍ ሰሌዳ ጽሁፍ እንዲያስገቡ ያስችላቸዋል።
ar_eg: يسمح حقل النص للمستخدم بإدخال نص إما باستخدام لوحة مفاتيح حقيقية أو لوحة مفاتيح تظهر على الشاشة.
as: এখন পাঠৰ ক্ষেত্ৰই ব্যৱহাৰকাৰীক এখন হাৰ্ডৱেৰ কীব'ৰ্ড অথবা অনস্ক্ৰীন কীব'ৰ্ডৰ দ্বাৰা পাঠ অন্তর্ভুক্ত কৰিবলৈ দিয়ে।
az: Mətn sahəsi istifadəçiyə mətni aparat klaviaturasından və ya ekran klaviaturasından daxil etməyə imkan verir.
be: Тэкставае поле дазваляе карыстальніку ўводзіць тэкст з дапамогай апаратнай ці экраннай клавіятуры.
bn: টেক্সট লেখার জায়গাতে ব্যবহারকারী হার্ডওয়্যার কীবোর্ড অথবা অনস্ক্রিন কীবোর্ড ব্যবহার করে টেক্সট লিখতে পারেন।
bs: Polje za tekst omogućava korisniku da unese tekst, bilo pomoću hardverske tastature ili pomoću tastature na ekranu.
ca: Un camp de text permet que l'usuari introdueixi text, tant des del teclat del maquinari com del teclat en pantalla.
da: Et tekstfelt giver brugeren mulighed for at angive tekst via enten et hardwaretastatur eller et skærmtastatur.
es_ar: Un campo de texto permite que el usuario ingrese texto con un teclado de hardware o en pantalla.
et: Tekstiväli võimaldab kasutajal füüsilise või ekraanil kuvatava klaviatuuriga teksti sisestada.
eu: Teklatu fisikoarekin edo pantailakoarekin testua idazteko eremua.
fa: فیلد نوشتاری به کاربر اجازه می‌دهد نوشتار را (با صفحه‌کلید سخت‌افزار یا با صفحه‌کلید مجازی) وارد کند.
fil: Ang isang field ng text ay nagbibigay-daan sa user na maglagay ng text sa pamamagitan ng hardware na keyboard o gamit ang isang keyboard sa screen.
fr_ca: Un champ de texte permet à l'utilisateur d'y entrer du texte, à l'aide d'un clavier matériel ou d'un clavier à l'écran.
gl: Un campo de texto utilízase para escribir texto ben cun teclado físico, ben cun teclado en pantalla.
gu: ટેક્સ્ટ ફીલ્ડની મદદથી વપરાશકર્તા ટેક્સ્ટને હાર્ડવેરના કીબોર્ડ અથવા ઑનસ્ક્રીન કીબોર્ડ વડે દાખલ કરી શકે છે.
he: שדה טקסט מאפשר למשתמש להזין טקסט באמצעות מקלדת חומרה או מקלדת במסך.
hi: टेक्स्ट फ़ील्ड में उपयोगकर्ता, हार्डवेयर कीबोर्ड या स्क्रीन पर दिखने वाले कीबोर्ड से टेक्स्ट लिख सकते हैं.
hu: A szövegmezőbe a felhasználók beírhatnak szöveget hardveres vagy képernyő-billentyűzettel.
hy: Տեքստային դաշտը օգտատիրոջը թույլ է տալիս մուտքագրել տեքստ սովորական կամ էկրանային ստեղնաշարի օգնությամբ։
id: Kolom teks tempat pengguna memasukkan teks, baik menggunakan keyboard hardware atau dengan keyboard di layar.
it: Un campo di testo consente all'utente di inserire testo, con una tastiera hardware o una tastiera sullo schermo.
ja: テキスト項目では、ハードウェアのキーボードまたは画面上のキーボードのいずれかを使って、ユーザーがテキストを入力できます。
ka: ტექსტური ველი მომხმარებელს საშუალებას აძლევს, შეიყვანოს ტექსტი, როგორც აპარატურული კლავიატურით, ისე ეკრანული კლავიატურით.
km: កន្លែងបញ្ចូល​អក្សរអនុញ្ញាត​ឱ្យអ្នកប្រើប្រាស់បញ្ចូល​អក្សរ តាមរយៈក្ដារចុច​ហាតវែរ ឬក្ដារចុច​លើអេក្រង់។
kn: ಪಠ್ಯದ ಸ್ಥಳದಲ್ಲಿ, ಬಳಕೆದಾರರು ಹಾರ್ಡ್‌ವೇರ್ ಕೀಬೋರ್ಡ್ ಅಥವಾ ಆನ್‌ಸ್ಕ್ರೀನ್ ಕೀಬೋರ್ಡ್ ಬಳಸಿ ಪಠ್ಯವನ್ನು ನಮೂದಿಸಬಹುದು.
ko: 사용자가 하드웨어 키보드 또는 터치 키보드를 사용해 텍스트를 입력할 수 있는 텍스트 입력란입니다.
ky: Текст киргизүүчү талаа колдонуучуга текстти, кадимки же экрандагы баскычтоп менен киргизүүгө мүмкүнчүлүк берет.
lo: ຊ່ອງຂໍ້ຄວາມທີ່ໃຫ້ຜູ້ໃຊ້ພິມຂໍ້ຄວາມຈາກແປ້ນພິມຮາດແວ ຫຼື ແປ້ນພິມຢູ່ໜ້າຈໍໄດ້.
lt: Teksto lauke naudotojas gali įvesti tekstą aparatinės įrangos arba ekrano klaviatūra.
lv: Teksta lauks, kurā lietotājs var ievadīt tekstu, izmantojot aparatūras tastatūru vai ekrāna tastatūru.
mk: Полето за текст му овозможува на корисникот внесување текст или со хардверска тастатура или со тастатура на екран.
ml: ഒന്നുകിൽ ഹാർഡ്‌വെയർ കീബോർഡ് ഉപയോഗിച്ച് അല്ലെങ്കിൽ ഓൺ സ്ക്രീൻ കീബോർഡ് ഉപയോഗിച്ച് ടെക്‌സ്റ്റ് നൽകാൻ ടെക്‌സ്റ്റ് ഫീൽഡ് ഉപയോക്താവിനെ അനുവദിക്കുന്നു.
mn: Текстийн талбар нь хэрэглэгчид техник хангамжийн гар эсвэл дэлгэц дээрх гарын тусламжтай текст оруулах боломж олгодог.
mr: मजकूर फील्ड वापरकर्त्याला हार्डवेअर कीबोर्ड किंवा ऑनस्क्रीन कीबोर्ड वापरून मजकूर एंटर करू देते.
ms: Medan teks membolehkan pengguna memasukkan teks menggunakan papan kekunci perkakasan atau papan kekunci pada skrin.
my: စာသားအကွက်တွင် အသုံးပြုသူက ဟာ့ဒ်ဝဲလက်ကွက် သို့မဟုတ် ဖန်သားပြင် လက်ကွက် တစ်ခုခုဖြင့် စာသားထည့်နိုင်သည်။
nb: Brukeren bruker tekstfelt til å skrive inn tekst, enten med et fysisk tastatur eller et tastatur på skjermen.
ne: पाठको क्षेत्रले प्रयोगकर्तालाई हार्डवेयर किबोर्ड वा स्क्रिनमा देखिने किबोर्डमध्ये कुनै एक प्रयोग गरी पाठ प्रविष्टि गर्न दिन्छ।
pa: ਕੋਈ ਲਿਖਤ ਖੇਤਰ ਵਰਤੋਂਕਾਰ ਨੂੰ ਲਿਖਤ ਦਾਖਲ ਕਰਨ ਦਿੰਦਾ ਹੈ, ਭਾਵੇਂ ਹਾਰਡਵੇਅਰ ਕੀਬੋਰਡ ਨਾਲ ਜਾਂ ਕਿਸੇ ਸਕ੍ਰੀਨ ਉਤਲੇ ਕੀਬੋਰਡ ਨਾਲ।
pl: Pole tekstowe pozwala użytkownikowi na wpisywanie tekstu za pomocą klawiatury fizycznej lub ekranowej.
pt: Um campo de texto permite que o usuário digite com um teclado físico ou virtual.
pt_pt: Um campo de texto permite ao utilizador introduzir texto, seja com um teclado do hardware ou um teclado no ecrã.
ro: Într-un câmp de text, utilizatorul poate să introducă text folosind o tastatură hardware sau o tastatură de pe ecran.
ru: Поле, в которое можно ввести текст с помощью аппаратной или экранной клавиатуры.
si: පෙළ ක්ෂේත්‍රයක් පරිශීලකට දෘඩාංග යතුරුපුවරුවකින් හෝ තිරය මත යතුරුපුවරුවකින් හෝ පෙළ ඇතුළත් කිරීමට ඉඩ දෙයි.
sk: Textové pole umožňuje používateľovi zadávať text, či už pomocou hardvérovej klávesnice, alebo tej na obrazovke.
sq: Një fushë teksti lejon që përdoruesi të futë tekstin me një tastierë fizike ose me një tastierë në ekran.
sr: Поље за унос текста омогућава кориснику да уноси текст помоћу физичке тастатуре или тастатуре на екрану.
sr_latn: Polje za unos teksta omogućava korisniku da unosi tekst pomoću fizičke tastature ili tastature na ekranu.
sv: En användare kan skriva text i textfältet, antingen med ett fysiskt tangentbord eller med ett tangentbord på skärmen.
te: యూజర్ హార్డ్‌వేర్ కీబోర్డ్‌తో లేదా ఆన్‌స్క్రీన్ కీబోర్డ్‌తో వచనాన్ని ఎంటర్ చేయగలిగే వచన ఫీల్డ్.
th: ช่องข้อความที่ให้ผู้ใช้ป้อนข้อความด้วยแป้นพิมพ์ที่เป็นฮาร์ดแวร์หรือแป้นพิมพ์บนหน้าจอ
tr: Metin alanı, kullanıcının donanım klavyesi veya ekran klavyesi ile metin girmesini sağlar.
uk: У текстові поля можна вводити текст з апаратної або екранної клавіатури.
ur: ٹیکسٹ کا فیلڈ صارف کو ہارڈویئر کی بورڈ کے ساتھ یا اسکرین کی بورڈ کے ساتھ ٹیکسٹ داخل کرنے دیتا ہے۔
uz: Matn maydonchasiga tashqi yoki ekran klaviaturasi yordamida matn kiritish mumkin.
vi: Trường văn bản để người dùng nhập văn bản bằng bàn phím thực hoặc bàn phím ảo.
zh_hk: 文字欄位讓使用者利用實體鍵盤或螢幕鍵盤輸入文字。
zu: Inkambu yombhalo ivumela umsebenzisi afake umbhalo, kungaba khekhibhodi yekhompuyutha noma ngekhibhodi esesikrinini.

# demoCupertinoTextFieldSubtitle
source: iOS-style text fields
af: Teksvelde in iOS-styl
am: የiOS-ቅጥ የጽሑፍ መስኮች
ar_eg: حقول نصل بنمط iOS
as: iOS-শৈলীৰ পাঠৰ ক্ষেত্ৰসমূহ
az: iOS ülublu mətn sahələri
be: Тэкставыя палі ў стылі iOS
bn: iOS-স্টাইলে টেক্সট লেখার জায়গা
bs: Polja za tekst u stilu iOS-a
ca: Camps de text d'estil iOS
da: iOS-lignende tekstfelter
es_ar: Campos de texto similares a los de iOS
et: iOS-stiilis tekstiväljad
eu: iOS estiloko testu-eremuak
fa: فیلدهای نوشتاری سبک iOS
fil: Mga field ng text na may istilong pang-iOS
fr_ca: Champs de texte de style iOS
gl: Campos de texto de tipo iOS
gu: iOS-શૈલીની ટેક્સ્ટ ફીલ્ડ
he: שדות טקסט בסגנון iOS
hi: iOS स्टाइल के टेक्स्ट फ़ील्ड
hu: iOS-stílusú szövegmezők
hy: iOS-ի ոճով տեքստային դաշտեր
id: Kolom teks gaya iOS
it: Campi di testo in stile iOS
ja: iOS スタイルのテキスト項目
ka: iOS-სტილის ტექსტური ველები
km: កន្លែងបញ្ចូល​អក្សរដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿ ಪಠ್ಯ ಫೀಲ್ಡ್‌ಗಳು
ko: iOS 스타일 텍스트 입력란
ky: iOS стилиндеги текст талаалары
lo: ຊ່ອງຂໍ້ຄວາມຮູບແບບ iOS
lt: „iOS“ stiliaus teksto laukai
lv: iOS stila teksta lauki
mk: Полиња за текст во iOS-стил
ml: iOS-സ്റ്റെെലിലുള്ള ടെക്‌സ്‌റ്റ് ഫീൽഡുകൾ
mn: iOS загварын текстийн талбар
mr: iOS-शैलीतील मजकूर भाग
ms: Medan teks gaya iOS
my: iOS ပုံစံ စာသားအကွက်များ
nb: Tekstfelt i iOS-stil
ne: iOS शैलीका पाठका क्षेत्रहरू
pa: iOS-ਸਟਾਈਲ ਲਿਖਤ ਖੇਤਰ
pl: Pola tekstowe w stylu iOS
pt: Campos de texto no estilo iOS
pt_pt: Campos de texto ao estilo do iOS
ro: Câmpuri de text în stil iOS
ru: Текстовые поля в стиле iOS
si: iOS-විලාස පෙළ ක්ෂේත්‍ර
sk: Textové polia v štýle systému iOS
sq: Fushat e tekstit në stilin e iOS
sr: Поља за унос текста у iOS стилу
sr_latn: Polja za unos teksta u iOS stilu
sv: Textfält i iOS-stil
te: iOS-శైలి వచన ఫీల్డ్‌లు
th: ช่องข้อความแบบ iOS
tr: iOS stili metin alanı
uk: Текстові поля в стилі iOS
ur: iOS کی طرز پر ٹیکسٹ کے فیلڈز
uz: iOS uslubidagi matn maydonchasi
vi: Trường văn bản kiểu iOS
zh_hk: iOS 樣式文字欄位
zu: Izinkambu zombhalo wesitayela se-iOS

# demoCupertinoTextFieldTitle
source: Text fields
af: Teksvelde
am: የጽሑፍ መስኮች
ar_eg: حقول النص
as: পাঠৰ ক্ষেত্ৰসমূহ
az: Mətn sahələri
be: Тэкставыя палі
bn: টেক্সট ফিল্ড
bs: Polja za tekst
ca: Camps de text
da: Tekstfelter
es_ar: Campos de texto
et: Tekstiväljad
eu: Testu-eremuak
fa: فیلدهای نوشتاری
fil: Mga field ng text
fr_ca: Champs de texte
gl: Campos de texto
gu: ટેક્સ્ટ ફીલ્ડ
he: שדות טקסט
hi: टेक्स्ट फ़ील्ड
hu: Szövegmezők
hy: Տեքստային դաշտեր
id: Kolom teks
it: Campi di testo
ja: テキスト欄
ka: ტექსტური ველები
km: កន្លែងបញ្ចូលអក្សរ
kn: ಪಠ್ಯ ಫೀಲ್ಡ್‌ಗಳು
ko: 입력란
ky: Текст киргизилүүчү талаалар
lo: ຊ່ອງຂໍ້ຄວາມ
lt: Teksto laukai
lv: Teksta lauki
mk: Полиња за текст
ml: ടെക്‌സ്റ്റ് ഫീൽഡുകൾ
mn: Текстийн талбар
mr: मजकूर भाग
ms: Medan teks
my: စာသားအကွက်များ
nb: Tekstfelt
ne: पाठका क्षेत्रहरू
pa: ਲਿਖਤ ਖੇਤਰ
pl: Pola tekstowe
pt: Campos de texto
pt_pt: Campos de texto
ro: Câmpuri de text
ru: Текстовые поля
si: පෙළ ක්ෂේත්‍ර
sk: Textové polia
sq: Fushat me tekst
sr: Поља за унос текста
sr_latn: Polja za unos teksta
sv: Textfält
te: వచన ఫీల్డ్‌లు
th: ช่องข้อความ
tr: Metin-alanları
uk: Текстові поля
ur: متن کی فیلڈز
uz: Matn maydonchalari
vi: Trường văn bản
zh_hk: 文字欄位
zu: Izinkambu zombhalo

# demoDatePickerDescription
source: Shows a dialog containing a Material Design date picker.
af: Wys 'n dialoog met 'n materiaalontwerp-datumkieser.
am: የቁሳዊ ንድፍ ቀን መራጭ የያዘ ማሳያን ያሳያል።
ar_eg: تعرض مربّع حوار يحتوي على أداة اختيار تاريخ ذات تصميم متعدد الأبعاد.
as: এটা বস্তুৰ ডিজাইনৰ তাৰিখ বাছনি কৰোঁতা থকা কোনো ডায়ল'গ প্ৰদৰ্শন কৰে।
az: Material Design tarix seçicisini ehtiva edən dialoq pəncərəsini göstərir.
be: Дыялогавае акно ў Material Design, у якім можна выбраць дату.
bn: মেটেরিয়াল ডিজাইনের তারিখ চয়নকারী রয়েছে এমন ডায়ালগ দেখায়।
bs: Prikazuje dijaloški okvir koji sadrži birač datuma u materijalnom dizajnu.
ca: Mostra un quadre de diàleg que conté un selector de data de Material Design.
da: Viser en dialogboks med en Material Design-datovælger.
es_ar: Muestra un diálogo que contiene un selector de fecha de material design.
et: Kuvatakse dialoog, mis sisaldab materiaalse disaini kuupäevavalijat.
eu: Material diseinuko data-hautatzailea duen leiho bat dago ikusgai.
fa: کادر گفتگویی حاوی انتخابگر تاریخ «طراحی مواد» را نمایش می‌دهد.
fil: Nagpapakita ng dialog na naglalaman ng picker ng petsa ng Material Design.
fr_ca: Affiche une boîte de dialogue comportant un outil Material Design de sélection de la date.
gl: Mostra un cadro de diálogo que inclúe un selector de data de Material Design.
gu: સામગ્રીની ડિઝાઇનવાળા તારીખ પિકરને સમાવતો સંવાદ બતાવે છે.
he: מציג דיאלוג שמכיל בורר תאריך בעיצוב חדשני תלת-ממדי.
hi: यह ऐसा डायलॉग दिखाता है जिसमें Material Design वाला टूल मौजूद होता है, जिससे तारीख चुन सकते हैं.
hu: Anyagszerű megjelenéssel rendelkező dátumválasztót tartalmazó párbeszédpanelt jelenít meg.
hy: Ցուցադրում է երկխոսության պատուհան, որը պարունակում է Material Design-ի ոճով ամսաթվի ընտրիչ։
id: Menampilkan dialog yang berisi pemilih tanggal Desain Material.
it: Viene mostrata una finestra di dialogo contenente un selettore della data di Material Design.
ja: マテリアル デザインの日付選択ツールを含むダイアログが表示されます。
ka: აჩვენებს დიალოგს, რომელიც შეიცავს მასალების დიზაინის თარიღის ამომრჩევს.
km: បង្ហាញ​ប្រអប់ ដែលមាន​ផ្ទាំងជ្រើសរើស​កាលបរិច្ឆេទ​ដែលមានការរចនាគ្រប់ជ្រុងជ្រោយ។
kn: ವಸ್ತು ವಿನ್ಯಾಸ ದಿನಾಂಕ ಪಿಕರ್ ಹೊಂದಿರುವ ಡೈಲಾಗ್ ಅನ್ನು ತೋರಿಸುತ್ತದೆ.
ko: 머티리얼 디자인의 날짜 선택도구가 포함된 대화상자를 표시합니다.
ky: Material Design күн тандагычы камтылган диалогду көрсөтөт.
lo: ສະແດງກ່ອງໂຕ້ຕອບທີ່ມີຕົວເລືອກວັນທີແບບ Material Design.
lt: Rodomas dialogo langas, kuriame pateikiamas trimačių objektų dizaino datos rinkiklis.
lv: Tiek rādīts dialoglodziņš ar materiāla dizaina datuma atlasītāju.
mk: Прикажува дијалог што содржи избирач на датум во Material Design.
ml: മെറ്റീരിയൽ രൂപകൽപ്പനാ തീയതി പിക്കർ അടങ്ങിയ ഡയലോഗ് കാണിക്കുന്നു.
mn: Материалын загварын огноо сонгогчийг агуулсан харилцах цонхыг харуулдаг.
mr: मटेरियल डिझाइन ची तारीख पिकर असलेला डायलॉग दाखवतो.
ms: Menunjukkan dialog yang mengandungi pemilih tarikh Reka Bentuk Bahan.
my: Material Design ရက်စွဲရွေးချယ်ရေးစနစ် ပါဝင်သော ဒိုင်ယာလော့ခ်ကို ပြပေးသည်။
nb: Viser en dialogboks med en datovelger for «material design».
ne: सामग्री डिजाइनको मिति चयनकर्ता समावेश भएको संवाद देखाउँछ।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਦੇ ਤਾਰੀਖ ਚੋਣਕਾਰ ਵਾਲੀ ਵਿੰਡੋ ਦਿਖਾਉਂਦਾ ਹੈ।
pl: Wyświetla okno z selektorem daty w stylu Material Design.
pt: Mostra uma caixa de diálogo com um seletor de data do Material Design.
pt_pt: Apresenta uma caixa de diálogo que contém um selecionador de data do material design.
ro: Afișează o casetă de dialog cu un selector de dată pentru design material.
ru: Диалоговое окно в стиле Material Design, в котором можно выбрать дату.
si: ද්‍රව්‍ය සැලසුම් දින තෝරක අඩංගුවන සංවාදයක් පෙන්වයි.
sk: Zobrazuje dialógové okno s výberom dátumu so vzhľadom Material Design.
sq: Shfaq një dialog që përfshin një zgjedhës date me dizajnin e materialit.
sr: Приказује дијалог са бирачем датума материјалног дизајна.
sr_latn: Prikazuje dijalog sa biračem datuma materijalnog dizajna.
sv: Visar en dialog med en datumväljare i Material Design.
te: విశేష రూపకల్పన తేదీ పికర్‌ను కలిగి ఉండే డైలాగ్‌ను చూపుతుంది.
th: แสดงกล่องโต้ตอบที่มีเครื่องมือเลือกวันที่แบบดีไซน์ Material
tr: Materyal Tasarıma sahip tarih seçici içeren bir iletişim kutusu gösterir.
uk: Показує вікно з інструментом вибору дати з матеріальним дизайном.
ur: مٹیریل ڈیزائن کی تاریخ منتخب کنندہ پر مشتمل ڈائیلاگ دکھاتا ہے۔
uz: Material Design uslubidagi oyna orqali sanani tanlash mumkin.
vi: Hiển thị hộp thoại chứa bộ chọn ngày Material Design.
zh_hk: 顯示載有 Material Design 日期點選器的對話框。
zu: Ibonisa ibhokisi eliqukethe isikhi sedethi yedizayini ebalulekile.

# demoCupertinoPickerTime
source: Time
af: Tyd
am: ሰዓት
ar_eg: الوقت
as: সময়
az: Vaxt
be: Час
bn: সময়
bs: Vrijeme
ca: Hora
da: Tid
es_ar: Hora
et: Aeg
eu: Ordua
fa: زمان
fil: Oras
fr_ca: Heure
gl: Hora
gu: સમય
he: שעה
hi: समय
hu: Idő
hy: Ժամ
id: Waktu
it: Ora
ja: 時刻
ka: დრო
km: ម៉ោង
kn: ಸಮಯ
ko: 시간
ky: Качан
lo: ເວລາ
lt: Laikas
lv: Laiks
mk: Време
ml: സമയം
mn: Цаг
mr: वेळ
ms: Masa
my: အချိန်
nb: Klokkeslett
ne: समय
pa: ਸਮਾਂ
pl: Godzina
pt: Hora
pt_pt: Hora
ro: Ora
ru: Время
si: වේලාව
sk: Čas
sq: Ora
sr: Време
sr_latn: Vreme
sv: Tid
te: సమయం
th: เวลา
tr: Saat
uk: Час
ur: وقت
uz: Vaqt
vi: Giờ
zh_hk: 時間
zu: Isikhathi

# demoCupertinoPickerDate
source: Date
af: Datum
am: ቀን
ar_eg: التاريخ
as: তাৰিখ
az: Tarix
be: Дата
bn: তারিখ
bs: Datum
ca: Data
da: Dato
es_ar: Fecha
et: Kuupäev
eu: Data
fa: تاریخ
fil: Petsa
gl: Data
gu: તારીખ
he: תאריך
hi: तारीख
hu: Dátum
hy: Ամսաթիվ
id: Tanggal
it: Data
ja: 日付
ka: თარიღი
km: កាលបរិច្ឆេទ
kn: ದಿನಾಂಕ
ko: 날짜
ky: Күн
lo: ວັນທີ
lt: Data
lv: Datums
mk: Датум
ml: തീയതി
mn: Огноо
mr: तारीख
ms: Tarikh
my: ရက်စွဲ
nb: Dato
ne: मिति
pa: ਤਾਰੀਖ
pl: Data
pt: Data
pt_pt: Data
ro: Data
ru: Дата
si: දිනය
sk: Dátum
sq: Data
sr: Датум
sr_latn: Datum
sv: Datum
te: తేదీ
th: วันที่
tr: Tarih
uk: Дата
ur: تاریخ
uz: Sana
vi: Ngày
zh_hk: 日期
zu: Idethi

# demoCupertinoPickerTimer
source: Timer
af: Afteller
am: ሰዓት ቆጣሪ
ar_eg: الموقِّت
as: টাইমাৰ
az: Taymer
be: Таймер
bn: টাইমার
bs: Tajmer
ca: Temporitzador
es_ar: Temporizador
et: Taimer
eu: Tenporizadorea
fa: تایمر
fr_ca: Minuterie
gl: Temporizador
gu: ટાઇમર
he: טיימר
hi: टाइमर
hu: Időzítő
hy: Ժամաչափ
ja: タイマー
ka: ტაიმერი
km: កម្មវិធីកំណត់ម៉ោង
kn: ಟೈಮರ್
ko: 타이머
ky: Таймер
lo: ໂມງຈັບເວລາ
lt: Laikmatis
lv: Taimeris
mk: Тајмер
ml: ടൈമർ
mn: Цаг хэмжигч
mr: टायमर
ms: Pemasa
my: အချိန်တိုင်းစက်
nb: Nedtelling
ne: टाइमर
pa: ਟਾਈਮਰ
pl: Licznik czasu
pt_pt: Temporizador
ro: Temporizator
ru: Таймер
si: කාල ගණකය
sk: Časovač
sq: Kohëmatësi
sr: Тајмер
sr_latn: Tajmer
te: టైమర్
th: ตัวจับเวลา
tr: Zamanlayıcı
uk: Таймер
ur: ٹائمر
uz: Taymer
vi: Hẹn giờ
zh_hk: 計時器
zu: Isibali sikhathi

# demoCupertinoPickerDescription
source: An iOS-style picker widget that can be used to select strings, dates, times, or both date and time.
af: ’n Kieserlegstuk in iOS-styl wat gebruik kan word om stringe, datums, tye of sowel datum as tyd te kies.
am: የiOS-ቅጥ ያለው መራጭ ምግብር ሕብረቁምፊዎችን፣ ቀኖችን፣ ሰዓቶችን ወይም ሁለቱም ቀን እና ሰዓት ለመምረጥ ስራ ላይ መዋል ይችላሉ።
ar_eg: تطبيق مصغّر لأدوات اختيار بنمط iOS يمكن استخدامه لاختيار السلاسل النصية أو التواريخ أو الأوقات أو لاختيار التاريخ والوقت معًا.
as: কোনো iOS-শৈলী বাছনি কৰোঁতা ৱিজেট যিটো ষ্ট্ৰিং, তাৰিখ, সময় অথবা তাৰিখ আৰু সময় দুয়োটা বাছনি কৰিবলৈ ব্যৱহাৰ কৰিব পাৰি।
az: Sətirləri, tarixi, vaxtı, yaxud eyni anda həm tarixi, həm də vaxtı seçmək üçün istifadə oluna biləcək iOS üslubunda seçici vidceti.
be: Віджэт інструмента выбару ў стылі iOS, які можа выкарыстоўвацца для выбару радкоў, дат, часу ці адначасова даты і часу.
bn: iOS-স্টাইল বাছাইকারী উইজেট, স্ট্রিং, তারিখ, সময় বা তারিখ ও সময় দু'টিই বেছে নিতে ব্যবহার করা যেতে পারে।
bs: Vidžet birača u stilu iOS-a koji se može koristiti za odabir nizova, datuma, vremena ili i datuma i vremena.
ca: Widget selector d'estil iOS que es pot utilitzar per seleccionar cadenes i dates o hores, o totes dues coses.
da: En vælgerwidget i iOS-format, der kan bruges til at vælge strenge, datoer, tidspunkter eller både dato og tid.
es_ar: Corresponde al widget de un selector similar al de iOS que se puede usar para elegir strings, fechas, horas, o tanto fechas como horas.
et: iOS-stiilis valikuvidin, mida saab kasutada stringide, kuupäevade, kellaaegade või nii kuupäeva kui ka kellaaja valimiseks.
eu: iOS estiloko hautatzailearen widgeta, kateak, datak, orduak, edo datak eta orduak hautatzeko.
fa: ابزارک انتخاب‌گر سبک iOS که می‌توان برای انتخاب رشته، تاریخ، زمان، یا هم زمان و هم تاریخ استفاده کرد.
fil: Widget ng picker na may istilong pang-iOS na magagamit para pumili ng mga string, mga petsa, mga oras, o petsa at oras.
fr_ca: Un widget de sélection de style iOS pouvant être utilisé pour sélectionner des chaînes, des dates, des heures ou les deux.
gl: Widget de selector de tipo iOS que se pode usar para seleccionar cadeas, datas, horas ou datas e horas.
gu: iOS-શૈલીનું પિકર વિજેટ જેનો ઉપયોગ સ્ટ્રિંગ, તારીખ, સમય અથવા તારીખ અને સમય એમ બન્ને પસંદ કરવા માટે કરી શકાય છે.
he: ווידג'ט בורר בסגנון iOS שיכול לשמש לבחירת מחרוזות, תאריכים, שעות או שני הערכים (תאריך ושעה).
hi: iOS-स्टाइल पिकर विजेट, जिसका इस्तेमाल तारीख, समय या दोनों चुनने के लिए किया जा सकता है. इसका इस्तेमाल स्ट्रिंग चुनने के लिए भी किया जा सकता है.
hu: iOS-stílusú választómodul, amelyet karakterláncok, dátumok, időpontok, illetve dátumok és időpontok egyidejű kiválasztására lehet használni.
hy: iOS-ի ոճով ընտրիչի վիջեթ, որի միջոցով կարելի է ընտրել տողեր, ամսաթվեր, ժամեր կամ ամսաթիվն ու ժամը միասին։
id: Widget alat pilih bergaya iOS yang dapat digunakan untuk memilih string, tanggal, waktu, atau kedua tanggal dan waktu sekaligus.
it: Un widget selettore in stile iOS che può essere usato per selezionare date, orari o entrambi oppure stringhe.
ja: 文字列、日付、時刻、または日付と時刻の両方を選択する場合に使用できる、iOS スタイルの選択ツール ウィジェットです。
ka: iOS-სტილის ამომრჩევი ვიჯეტი, რომლის გამოყენებაც შესაძლებელია თარიღების, დროების ან ორივეს ასარჩევად.
km: ធាតុក្រាហ្វិកនៃ​ផ្ទាំងជ្រើសរើស​ដែលមានរចនាប័ទ្ម iOS ដែលអាច​ត្រូវបានប្រើ ដើម្បីជ្រើសរើស​ជួរអក្សរ កាលបរិច្ឆេទ ម៉ោង ឬទាំង​កាលបរិច្ឆេទ និងម៉ោង។
kn: ಸ್ಟ್ರಿಂಗ್‌ಗಳು, ದಿನಾಂಕಗಳು, ಸಮಯ ಅಥವಾ ದಿನಾಂಕ ಮತ್ತು ಸಮಯ ಎರಡನ್ನೂ ಆಯ್ಕೆಮಾಡಲು iOS ಶೈಲಿಯ ಪಿಕರ್‌ ವಿಜೆಟ್‌ಗಳನ್ನು ಬಳಸಬಹುದು.
ko: 날짜와 시간을 동시에 선택하거나 날짜, 시간, 문자열을 각각 선택하는 데 사용할 수 있는 iOS 스타일의 선택 도구 위젯입니다.
ky: iOS стилиндеги саптарды, күндөрдү, убакыттарды же күн менен убакытты тандагыч виджети.
lo: ວິດເຈັດຕົວເລືອກຮູບແບບ iOS ທີ່ສາມາດໃຊ້ເພື່ອເລືອກສະຕຣິງ, ວັນທີ, ເວລາ ຫຼື ທັງວັນທີ ແລະ ເວລາໄດ້.
lt: „iOS“ stiliaus rinkiklio valdiklis, kurį galima naudoti norint pasirinkti eilutes, datas, laiką arba ir datą, ir laiką.
lv: iOS stila atlasītāja logrīks, ko var izmantot virkņu, kā arī datuma un/vai laika atlasīšanai.
mk: Виџет за избор во iOS-стил што може да се користи за избирање низи, датуми, времиња или датум и време заедно.
ml: സ്ട്രിംഗുകൾ, തീയതി, സമയം, അല്ലെങ്കിൽ അവ രണ്ടും തിരഞ്ഞെടുക്കാൻ ഉപയോഗിക്കാവുന്ന iOS-സ്റ്റെെലിലുള്ള പിക്കർ വിജറ്റ്.
mn: Мөр, огноо, цаг эсвэл огноо, цагийг хамтад нь сонгоход ашиглаж болох iOS-загвар сонгогч виджет.
mr: स्ट्रिंग, तारीख, वेळ किंवा तारीख आणि वेळ हे दोन्ही निवडण्यासाठी वापरले जाणारे एक iOS च्या शैलीतील पिकर विजेट.
ms: Widget pemilih gaya iOS yang boleh digunakan untuk memilih rentetan, tarikh, masa atau kedua-dua tarikh dan masa.
my: လိုင်း၊ ရက်စွဲ၊ အချိန် သို့မဟုတ် ရက်စွဲနှင့် အချိန်နှစ်မျိုးလုံး ရွေးရန် အသုံးပြုနိုင်သော iOS ပုံစံ ရွေးချယ်ရေးစနစ် ဝိဂျက်။
nb: En valgmodul i iOS-stil som kan brukes til å velge strenger, datoer, klokkeslett eller både dato og klokkeslett.
ne: स्ट्रिङ, मिति, समय वा मिति तथा समय दुवै कुरा चयन गर्न प्रयोग गर्न सकिने iOS शैलीको पिकरको विजेट।
pa: ਉਹ iOS-ਸਟਾਈਲ ਚੋਣਕਾਰ ਵਿਜੇਟ ਜਿਸਨੂੰ ਸਤਰ, ਤਾਰੀਖ, ਸਮਾਂ ਜਾਂ ਤਾਰੀਖ ਅਤੇ ਸਮਾਂ ਦੋਵਾਂ ਨੂੰ ਚੁਣਨ ਲਈ ਵਰਤਿਆ ਜਾ ਸਕਦਾ ਹੈ।
pl: Widżet z selektorem w stylu iOS, którego można używać do wybierania tekstu, daty, godziny lub równocześnie daty i godziny.
pt: Um widget de seleção no estilo do iOS que pode ser usado para escolher strings, datas, horários ou data e hora.
pt_pt: Um widget de selecionador ao estilo do iOS que pode ser usado para selecionar strings, a data, a hora ou ambas.
ro: Widget pentru selectorul în stil iOS care poate fi folosit pentru a selecta șirurile, datele, orele sau data și ora.
ru: Окно выбора в стиле iOS, которое можно использовать, чтобы указать строку, дату или время.
si: තන්තු, දින, වේලාවන්, හෝ දිනය සහ වේලාව යන දෙකම තේරීමට භාවිතා කළ හැකි iOS-විලාසයේ තෝරක විජට්ටුවක්.
sk: Pomocou miniaplikácie výberu v štýle systému iOS môžete vybrať reťazce, dátumy, časy, alebo dátumy aj časy súčasne.
sq: Një miniaplikacion zgjedhësi në stilin e iOS që mund të përdoret për të zgjedhur vargjet, datat, orët ose datën bashkë me orën.
sr: Виџет бирача у iOS стилу који може да се користи за бирање стрингова, датума, времена или и датума и времена.
sr_latn: Vidžet birača u iOS stilu koji može da se koristi za biranje stringova, datuma, vremena ili i datuma i vremena.
sv: En väljarwidget i iOS-stil som du kan använda för att välja strängar, datum, tider eller både datum och tid.
te: స్ట్రింగ్‌లు, తేదీలు, సమయాలు లేదా తేదీ అలాగే సమయం రెండింటినీ ఎంచుకోవడానికి ఉపయోగించబడే iOS-స్టయిల్ పికర్ విడ్జెట్.
th: วิดเจ็ตเครื่องมือเลือกรูปแบบ iOS ที่ใช้ในการเลือกสตริง วันที่ เวลา หรือทั้งวันที่และเวลาได้
tr: Dize, tarih, saat veya hem tarih hem de saat seçmek için kullanılabilen iOS stili seçici widget'ı.
uk: Віджет засобу вибору в стилі iOS, який можна використовувати для вибору сегментів, дат, часу або дати й часу одночасно.
ur: iOS کی طرز پر منتخب کرنے والا ویجیٹ جسے اسٹرنگز، تواریخ، اوقات یا تاریخ اور وقت دونوں کو منتخب کرنے کے لیے استعمال کیا جا سکتا ہے۔
uz: iOS uslubidagi tanlash oynasi orqali qator, sana va vaqtni sozlash mumkin.
vi: Một tiện ích bộ chọn kiểu iOS có thể dùng để chọn chuỗi, ngày, giờ hoặc cả ngày và giờ.
zh_hk: iOS 樣式的點選器小工具可用於選擇字串、日期和/或時間。
zu: Iwijethi yesikhi sesitayela se-iOS engasetshenziselwa ukukhetha iyunithi yezinhlamvu, izinsuku, izikhathi, noma kokubili usuku nesikhathi.
