Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoAlertDescription
source: An alert dialog informs the user about situations that require acknowledgement. An alert dialog has an optional title, optional content, and an optional list of actions. The title is displayed above the content and the actions are displayed below the content.
af: 'n Opletberigdialoog lig die gebruiker in oor situasies wat erkenning nodig het. 'n Opletberigdialoog het 'n opsionele titel, opsionele inhoud en 'n opsionele lys handelinge. Die titel word bo die inhoud vertoon en die handelinge word onder die inhoud vertoon.
am: የማንቂያ ንግግር ተጠቃሚውን ስለ ዕውቅና መስጠት የሚያስፈልጋቸው ሁኔታዎች በተመለከተ መረጃ ይሰጣል። የማንቂያ ንግግር አማራጭ አርዕስት፣ አማራጭ ይዘት እና የድርጊቶች አማራጭ ዝርዝር አለው። አርእስቱ ከይዘቱ በላይ ይታያል እና እርምጃዎቹ ከይዘቱ ሥር ይታያሉ።
ar_eg: يخبر مربع حوار التنبيهات المستخدم بالحالات التي تتطلب تأكيد الاستلام. ويشتمل مربع حوار التنبيهات على عنوان اختياري ومحتوى اختياري وقائمة إجراءات اختيارية. ويتم عرض العنوان أعلى المحتوى بينما تُعرض الإجراءات أسفل المحتوى.
as: এটা সতর্কবার্তাৰ ডায়ল'গে ব্যৱহাৰকাৰীক স্বীকৃতি আৱশ্যক হোৱা পৰিস্থিতিসমূহৰ বিষয়ে জনায়। এটা সতর্কবার্তাৰ ডায়ল'গত এটা ঐচ্ছিক শিৰোনাম, ঐচ্ছিক সমল আৰু এখন কার্যসমূহৰ ঐচ্ছিক সূচী থাকে। শিৰোনামটো সমলৰ ওপৰত প্ৰদর্শন কৰা হয় আৰু কার্যসমূহ সমলৰ তলত প্ৰদর্শন কৰা হয়।
az: Xəbərdarlıq dialoqu istifadəçiyə razılıq tələb edən məqamlar barədə bildirir. Xəbərdarlıq dialoqunda şərti başlıq, şərti məzmun və əməliyyatların şərti siyahısı olur. Başlıq məzmunun yuxarısında, əməliyyatlar isə məzmunun aşağısında göstərilir.
be: Дыялогавае акно абвесткі інфармуе карыстальніка пра сітуацыі, для якіх патрабуецца пацвярджэнне. Дыялогавае акно абвесткі можа мець назву, змесціва і спіс дзеянняў. Назва паказваецца над змесцівам, а дзеянні – пад ім.
bn: সতর্কতা সংক্রান্ত ডায়ালগ পরিস্থিতি সম্পর্কে ব্যবহারকারীকে জানায়, যা খেয়াল রাখতে হয়। সতর্কতা সংক্রান্ত ডায়ালগে ঐচ্ছিক শীর্ষক, ঐচ্ছিক কন্টেন্ট এবং ঐচ্ছিক অ্যাকশনের তালিকা দেওয়া থাকে। শীর্ষক কন্টেন্টের উপরে দেওয়া থাকে এবং অ্যাকশন কন্টেন্টের নিচে উল্লেখ করা থাকে।
bs: Dijaloški okvir za obavještenje informira korisnika o situacijama koje zahtijevaju potvrdu. Dijaloški okvir za obavještenje ima neobavezni naslov, neobavezni sadržaj i neobavezni spisak radnji. Naslov se prikazuje iznad sadržaja, a radnje se prikazuju ispod sadržaja.
ca: Un quadre de diàleg d'alerta informa l'usuari sobre situacions que requereixen la seva aprovació. Inclou un títol, una llista d'accions i contingut opcionals. El títol es mostra a sobre del contingut i les accions, a sota.
da: En underretningsdialogboks oplyser brugeren om situationer, der kræver handling. En underretningsdialogboks har en valgfri titel, valgfrit indhold og en valgfri liste med handlinger. Titlen vises oven over indholdet, og handlinger vises under indholdet.
es_ar: Un diálogo de alerta informa al usuario sobre situaciones que debe conocer para poder seguir usando la app. Un diálogo de alerta tiene un título, un contenido y una lista de acciones que son opcionales. El título se muestra encima del contenido y las acciones debajo del contenido.
et: Hoiatusdialoog teavitab kasutajat olukordadest, mis nõuavad tähelepanu. Hoiatusdialoogil on valikuline pealkiri, valikuline sisu ja valikuline toimingute loend. Pealkiri kuvatakse sisu kohal ja toimingud sisu all.
eu: Kontuan hartu beharreko egoeren berri ematen diote alerta-leihoek erabiltzaileari. Aukeran, izenburua, edukia eta ekintza-zerrendak izan ditzakete alerta-leihoek. Izenburua edukiaren gainean bistaratuko da; ekintzak, berriz, edukiaren azpian.
fa: کادر گفتگوی هشدار، کاربر را از موقعیت‌هایی که نیاز به تصدیق دارند مطلع می‌کند. کادر گفتگوی هشدار دارای عنوان، محتوا، و فهرست کنش‌های اختیاری است. عنوان موردنظر در بالای محتوا و کنش‌ها در زیر محتوا نمایش داده می‌شوند.
fil: Ipinapaalam ng dialog ng alerto sa user ang tungkol sa mga sitwasyong nangangailangan ng pagkilala. May opsyonal na pamagat, opsyonal na content, at opsyonal na listahan ng mga pagkilos ang dialog ng alerto. Ipapakita ang pamagat sa itaas ng content at ipapakita ang mga pagkilos sa ibaba ng content.
fr_ca: Un dialogue d'alerte informe l'utilisateur à propos de situations qui nécessitent qu'on y porte attention. Un dialogue d'alerte a un titre optionnel, du contenu optionnel et une liste d'actions optionnelle. Le titre est affiché au-dessus du contenu et les actions sont affichées sous le contenu.
gl: Un cadro de diálogo de alerta informa ao usuario das situacións que requiren unha confirmación. Un cadro de diálogo de alerta ten un título opcional, contido opcional e unha lista opcional de accións. O título móstrase enriba do contido, mentres que as accións aparecen debaixo.
gu: અલર્ટ સંવાદ વપરાશકર્તાને જ્યાં સંમતિ જરૂરી હોય એવી સ્થિતિઓ વિશે સૂચિત કરે છે. અલર્ટ સંવાદમાં વૈકલ્પિક શીર્ષક, વૈકલ્પિક કન્ટેન્ટ અને ક્રિયાઓની વૈકલ્પિક સૂચિ હોય છે. શીર્ષક, કન્ટેન્ટની ઉપર બતાવવામાં આવે છે અને ક્રિયાઓ, કન્ટેન્ટની નીચે બતાવવામાં આવે છે.
he: תיבת דו-שיח של התראה נועדה ליידע את המשתמש לגבי מצבים שדורשים אישור. לתיבת דו-שיח של התראה יש כותרת ותוכן אופציונליים ורשימה אופציונלית של פעולות. הכותרת מוצגת מעל התוכן, והפעולות מוצגות מתחת לתוכן.
hi: सूचना वाला डायलॉग उपयोगकर्ताओं को ऐसी स्थितियों के बारे में जानकारी देता है जिनके लिए अनुमति की ज़रूरत होती है. किसी सूचना वाले डायलॉग में दूसरा टाइटल, सामग्री, और कार्रवाइयों की दूसरी सूची होती है. इसमें टाइटल, सामग्री के ऊपर की तरफ़ होता है. इसके अलावा, सामग्री के नीचे कार्रवाइयां दी गई होती हैं.
hu: Egy párbeszédpanel tájékoztatja a felhasználót a figyelmét igénylő helyzetekről. Az értesítési párbeszédpanel nem kötelező címmel, nem kötelező tartalommal és nem kötelező műveletlistával rendelkezik. A cím a tartalom felett, a műveletek pedig a tartalom alatt jelennek meg.
hy: Ծանուցումների երկխոսության պատուհանը տեղեկացնում է օգտատիրոջը ուշադրության արժանի իրադարձությունների մասին։ Այն կարող է ունենալ վերնագիր և բովանդակություն, ինչպես նաև հասանելի գործողությունների ցանկ։ Վերնագիրը ցուցադրվում է բովանդակության վերևում, իսկ գործողությունները՝ ներքևում։
id: Dialog notifikasi akan memberitahukan situasi yang memerlukan konfirmasi kepada pengguna. Dialog notifikasi memiliki judul, konten, dan daftar tindakan yang opsional. Judul ditampilkan di atas konten dan tindakan ditampilkan di bawah konten.
it: Una finestra di dialogo di avviso segnala all'utente situazioni che richiedono l'accettazione. Una finestra di dialogo di avviso include un titolo facoltativo e un elenco di azioni tra cui scegliere. Il titolo viene mostrato sopra i contenuti e le azioni sono mostrate sotto i contenuti.
ja: アラート ダイアログでは、確認を要する状況をユーザーに伝えることができます。必要に応じて、タイトル、コンテンツ、アクション リストを設定できます。コンテンツの上にタイトル、コンテンツの下にアクションが表示されます。
ka: გამაფრთხილებელი დიალოგი აცნობებს მომხმარებელს ისეთი სიტუაციების შესახებ, რომლებიც ყურადღების მიქცევას საჭიროებს. სურვილისამებრ, გამაფრთხილებელ დიალოგს შეიძლება ჰქონდეს სათაური, კონტენტი და ქმედებათა სია. სათაური ნაჩვენებია კონტენტის თავზე, ხოლო ქმედებები — კონტენტის ქვემოთ.
km: ប្រអប់​ជូនដំណឹង​ជូនដំណឹង​ដល់អ្នកប្រើប្រាស់​អំពី​ស្ថានភាព ដែលតម្រូវឱ្យមាន​ការទទួលស្គាល់។ ប្រអប់​ជូនដំណឹង​មានចំណងជើង ខ្លឹមសារ និងបញ្ជី​សកម្មភាព​ដែលជាជម្រើស។ ចំណងជើង​បង្ហាញ​នៅលើ​ខ្លឹមសារ ហើយ​សកម្មភាព​បង្ហាញនៅក្រោម​ខ្លឹមសារ។
kn: ಅಲರ್ಟ್ ಡೈಲಾಗ್ ಸ್ವೀಕೃತಿ ಅಗತ್ಯವಿರುವ ಸಂದರ್ಭಗಳ ಬಗ್ಗೆ ಬಳಕೆದಾರರಿಗೆ ತಿಳಿಸುತ್ತದೆ. ಐಚ್ಛಿಕ ಶೀರ್ಷಿಕೆ, ಐಚ್ಛಿಕ ವಿಷಯ ಮತ್ತು ಐಚ್ಛಿಕ ಆ್ಯಕ್ಷನ್‌ಗಳ ಪಟ್ಟಿಯನ್ನು ಅಲರ್ಟ್‌ಗಳ ಡೈಲಾಗ್ ಹೊಂದಿದೆ. ಶೀರ್ಷಿಕೆಯನ್ನು ವಿಷಯದ ಮೇಲೆ ಮತ್ತು ಆ್ಯಕ್ಷನ್‌ಗಳನ್ನು ವಿಷಯದ ಕೆಳಗೆ ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಾಗಿದೆ.
ko: 알림 대화상자는 사용자에게 인지가 필요한 상황을 알려줍니다. 알림 대화상자에는 제목, 콘텐츠, 작업 목록이 선택사항으로 포함됩니다. 제목은 콘텐츠 위에 표시되고 작업은 콘텐츠 아래에 표시됩니다.
ky: Билдирме диалогу колдонуучуга анын ырастоосун талап кылган кырдаалдар тууралуу кабар берет. Билдирме диалогунун аталышы, мазмуну жана аракеттер тизмеси болушу мүмкүн. Аталышы мазмундун жогору жагында, ал эми аракеттер мазмундун төмөн жагында жайгашкан.
lo: ກ່ອງໂຕ້ຕອບການແຈ້ງເຕືອນເພື່ອບອກໃຫ້ຜູ້ໃຊ້ຮູ້ກ່ຽວກັບສະຖານະການທີ່ຕ້ອງຮັບຮູ້. ກ່ອງໂຕ້ຕອບການແຈ້ງເຕືອນທີ່ມີຊື່, ເນື້ອຫາ ແລະ ລາຍຊື່ຄຳສັ່ງແບບບໍ່ບັງຄັບ. ຊື່ຈະສະແດງຢູ່ທາງເທິງຂອງເນື້ອຫາ ແລະ ຄຳສັ່ງແມ່ນຈະສະແດງຢູ່ທາງລຸ່ມຂອງເນື້ອຫາ.
lt: Įspėjimo dialogo lange naudotojas informuojamas apie situacijas, kurias reikia patvirtinti. Nurodomi įspėjimo dialogo lango pasirenkamas pavadinimas, pasirenkamas turinys ir pasirenkamas veiksmų sąrašas. Pavadinimas pateikiamas virš turinio, o veiksmai – po juo.
lv: Brīdinājumu dialoglodziņš informē lietotāju par situācijām, kam nepieciešams pievērst uzmanību. Brīdinājumu dialoglodziņam ir neobligāts virsraksts, neobligāts saturs un neobligātu darbību saraksts. Virsraksts tiek parādīts virs satura, un darbības tiek parādītas zem satura.
mk: Дијалогот за предупредување го информира корисникот за ситуациите што бараат потврда. Дијалогот за предупредување има изборен наслов, изборни содржини и изборен список со дејства. Насловот е прикажан над содржините, а дејствата се прикажани под содржините.
ml: മുന്നറിയിപ്പ് ഡയലോഗ്, അംഗീകാരം ആവശ്യമുള്ള സാഹചര്യങ്ങളെക്കുറിച്ച് ഉപയോക്താവിനെ അറിയിക്കുന്നു. മുന്നറിയിപ്പ് ഡയലോഗിന് ഒരു ഓപ്‌ഷണൽ പേര്, ഓപ്‌ഷണൽ ഉള്ളടക്കം, പ്രവർത്തനങ്ങളുടെ ഒരു ഓപ്‌ഷണൽ പട്ടിക എന്നിവയുണ്ട്. ഉള്ളടക്കത്തിന്റെ മുകളിൽ പേര്, താഴെ പ്രവർത്തനങ്ങൾ എന്നിവ പ്രദർശിപ്പിക്കുന്നു.
mn: Сэрэмжлүүлгийн харилцах цонх нь хэрэглэгчид батламж шаардлагатай нөхцөл байдлын талаар мэдээлдэг. Сэрэмжлүүлгийн харилцах цонх нь сонгох боломжтой гарчиг, контент болон үйлдлийн жагсаалттай байдаг. Гарчиг контентын дээр харагдах бөгөөд үйлдлүүд нь контентын доор харагдана.
mr: सूचना डायलॉग हा वापरकर्त्यांना कबुली आवश्यक असलेल्या गोष्टींबद्दल सूचित करतो. एका सूचना डायलॉगमध्ये एक पर्यायी शीर्षक, पर्यायी आशय आणि एक पर्यायी क्रिया सूची असते. शीर्षक हे मजकूराच्या वरती दाखवले जाते आणि क्रिया ही मजकूराच्या खाली दाखवली जाते.
ms: Dialog makluman memberitahu pengguna tentang situasi yang memerlukan perakuan. Dialog makluman mempunyai tajuk pilihan, kandungan pilihan dan senarai tindakan pilihan. Tajuk dipaparkan di bahagian atas kandungan manakala tindakan dipaparkan di bahagian bawah kandungan.
my: သတိပေးချက် ဒိုင်ယာလော့ဂ်သည် အသိအမှတ်ပြုရန် လိုအပ်သည့် အခြေအနေများအကြောင်း အသုံးပြုသူထံ အသိပေးသည်။ သတိပေးချက် ဒိုင်ယာလော့ဂ်တွင် ချန်လှပ်ထားနိုင်သည့် ခေါင်းစဉ်၊ ချန်လှပ်ထားနိုင်သည့် အကြောင်းအရာနှင့် ချန်လှပ်ထားနိုင်သည့် လုပ်ဆောင်ချက်စာရင်း ပါဝင်သည်။ ခေါင်းစဉ်ကို အကြောင်းအရာ၏ အပေါ်တွင် ဖော်ပြပြီး ‌လုပ်ဆောင်ချက်များကို အကြောင်းအရာ၏ အောက်တွင် ဖော်ပြသည်။
nb: En varseldialogboks som informerer brukeren om situasjoner som krever bekreftelse. Varseldialogbokser har en valgfri tittel, valgfritt innhold og en valgfri liste over handlinger. Tittelen vises over innholdet, og handlingene vises under innholdet.
ne: सतर्कता संवादले प्रयोगकर्तालाई प्राप्तिको सूचना आवश्यक पर्ने अवस्थाहरूका बारेमा जानकारी दिन्छ। सतर्कता संवादमा वैकल्पिक शीर्षक, वैकल्पिक सामग्री र कार्यहरूको वैकल्पिक सूची रहन्छ। शीर्षक सामग्री माथि र कार्यहरू सामग्री तल देखाइन्छ।
pa: ਸੁਚੇਤਨਾ ਵਿੰਡੋ ਵਰਤੋਂਕਾਰ ਨੂੰ ਉਹਨਾਂ ਸਥਿਤੀਆਂ ਬਾਰੇ ਸੂਚਿਤ ਕਰਦੀ ਹੈ ਜਿਨ੍ਹਾਂ ਨੂੰ ਸਵੀਕ੍ਰਿਤੀ ਦੀ ਲੋੜ ਹੈ। ਸੁਚੇਤਨਾ ਵਿੰਡੋ ਵਿੱਚ ਵਿਕਲਪਿਕ ਸਿਰਲੇਖ, ਵਿਕਲਪਿਕ ਸਮੱਗਰੀ ਅਤੇ ਕਾਰਵਾਈਆਂ ਦੀ ਵਿਕਲਪਿਕ ਸੂਚੀ ਸ਼ਾਮਲ ਹੁੰਦੀ ਹੈ। ਸਿਰਲੇਖ ਸਮੱਗਰੀ ਦੇ ਉੱਪਰ ਦਿਸਦਾ ਹੈ ਅਤੇ ਕਾਰਵਾਈਆਂ ਸਮੱਗਰੀ ਦੇ ਹੇਠਾਂ ਦਿਸਦੀਆਂ ਹਨ।
pl: Okno alertu informuje użytkownika o sytuacjach wymagających potwierdzenia. Okno alertu ma opcjonalny tytuł, opcjonalną treść i opcjonalną listę działań. Tytuł jest wyświetlany nad treścią, a działania pod treścią.
pt: Uma caixa de diálogo de alerta informa o usuário sobre situações que precisam ser confirmadas. A caixa de diálogo de alerta tem uma lista de ações, um título e conteúdo opcionais. O título é exibido acima do conteúdo, e as ações são exibidas abaixo dele.
pt_pt: Uma caixa de diálogo de alerta informa o utilizador acerca de situações que requerem confirmação. Uma caixa de diálogo de alerta tem um título opcional, conteúdo opcional e uma lista de ações opcional. O título é apresentado acima do conteúdo e as ações são apresentadas abaixo do conteúdo.
ro: Caseta de dialog pentru alerte informează utilizatorul despre situații care necesită confirmare. Caseta de dialog pentru alerte are un titlu opțional, conținut opțional și o listă de acțiuni opțională. Titlul este afișat deasupra conținutului, iar acțiunile sub conținut.
ru: Диалоговое окно с оповещением сообщает пользователю о событиях, требующих внимания. Оно может иметь заголовок, содержимое, а также список доступных действий. Заголовок располагается над содержимым, а действия – под ним.
si: ඇඟවීම් සංවාදයක් පිළිගැනීම අවශ්‍ය තත්ත්වයන් පිළිබඳ පරිශීලකට දැනුම් දෙයි. ඇඟවීම් සංවාදයකට විකල්ප මාතෘකාවක්, විකල්ප අන්තර්ගතයක් සහ විකල්ප ක්‍රියා ලැයිස්තුවක් තිබේ. මාතෘකාව අන්තර්ගතය ඉහළින් සංදර්ශනය වන අතර ක්‍රියා අන්තර්ගතයට පහළින් සංදර්ශනය වේ.
sk: Dialógové okno upozornenia informuje používateľa o situáciách, ktoré vyžadujú potvrdenie. Dialógové okno upozornenia má voliteľný názov, obsah aj zoznam akcií. Názov sa zobrazuje nad obsahom a akcie pod obsahom.
sq: Një dialog sinjalizues informon përdoruesin rreth situatave që kërkojnë konfirmim. Një dialog sinjalizimi ka një titull opsional, përmbajtje opsionale dhe një listë opsionale veprimesh. Titulli shfaqet mbi përmbajtje dhe veprimet shfaqen poshtë përmbajtjes.
sr: Дијалог обавештења информише кориснике о ситуацијама које захтевају њихову пажњу. Дијалог обавештења има опционални наслов, опционални садржај и опционалну листу радњи. Наслов се приказује изнад садржаја, а радње се приказују испод садржаја.
sr_latn: Dijalog obaveštenja informiše korisnike o situacijama koje zahtevaju njihovu pažnju. Dijalog obaveštenja ima opcionalni naslov, opcionalni sadržaj i opcionalnu listu radnji. Naslov se prikazuje iznad sadržaja, a radnje se prikazuju ispod sadržaja.
sv: Med en varningsruta uppmärksammas användaren på saker som behöver bekräftas. Titeln, innehållet och listan på åtgärder i varningsruta är valfria. Titeln visas ovanför innehållet och åtgärderna nedanför innehållet.
te: అందినట్టుగా నిర్ధారణ అవసరమయ్యే పరిస్థితుల గురించి అలర్ట్ డైలాగ్ యూజర్‌కు తెలియజేస్తుంది. అలర్ట్ డైలాగ్‌లో ఐచ్ఛిక శీర్షిక, ఐచ్ఛిక కంటెంట్, ఐచ్ఛిక చర్యలకు సంబంధించిన లిస్ట్‌లు ఉంటాయి శీర్షిక కంటెంట్ పైన ప్రదర్శించబడుతుంది అలాగే చర్యలు కంటెంట్ కింద ప్రదర్శించబడతాయి.
th: กล่องโต้ตอบการแจ้งเตือนจะแจ้งผู้ใช้เกี่ยวกับสถานการณ์ที่ต้องการการตอบรับ กล่องโต้ตอบการแจ้งเตือนมีชื่อที่ไม่บังคับ เนื้อหาที่ไม่บังคับ และรายการที่ไม่บังคับของการดำเนินการ ชื่อจะแสดงเหนือเนื้อหาและการดำเนินการจะแสดงใต้เนื้อหา
tr: Uyarı iletişim kutusu, kullanıcıyı onay gerektiren durumlar hakkında bilgilendirir. Uyarı iletişim kutusunun isteğe bağlı başlığı, isteğe bağlı içeriği ve isteğe bağlı işlemler listesi vardır. Başlık içeriğin üzerinde görüntülenir ve işlemler içeriğin altında görüntülenir.
uk: Діалогове вікно сповіщення повідомляє користувачів про ситуації, про які вони мають знати. Воно може мати назву, вміст і список дій (необов'язково). Назва відображається над вмістом, а список дій – під ним.
ur: الرٹ ڈائیلاگ صارف کو ایسی صورتحال سے آگاہ کرتا ہے جہاں اقرار درکار ہوتا ہے۔ الرٹ ڈائیلاگ میں اختیاری عنوان، اختیاری مواد، اور کارروائیوں کی ایک اختیاری فہرست ہوتی ہے۔ عنوان کو مندرجات کے اوپر دکھایا جاتا ہے اور کارروائیوں کو مندرجات کے نیچے دکھایا جاتا ہے۔
uz: Ogohlantiruvchi muloqot oynasi foydalanuvchini u eʼtibor qaratishi lozim boʻlgan voqealar yuz berganda ogohlantiradi. Unda sarlavha, kontent va mavjud harakatlar roʻyxati boʻlishi mumkin. Sarlavha matn tepasida, harakatlar esa ularning ostida joylashadi.
vi: Hộp thoại cảnh báo thông báo cho người dùng về các tình huống cần xác nhận. Hộp thoại cảnh báo không nhất thiết phải có tiêu đề, nội dung cũng như danh sách các hành động. Bạn sẽ thấy tiêu đề ở phía trên nội dung còn các hành động thì ở phía dưới.
zh_hk: 通知對話框會通知使用者目前發生要確認的情況。您可按需要為這類對話框設定標題、內容和動作清單。標題會在內容上方顯示，動作會在內容下方顯示。
zu: Ibhokisi lesexwayiso lazisa umsebenzisi mayelana nezimo ezidinga ukuvunywa. Ibhokisi lesexwayiso linesihloko ongasikhetha, okuqukethwe ongakukhetha, kanye nohlu ongalukhetha lwezenzo. Isihloko siboniswa ngaphezulu kokuqukethwe futhi izenzo ziboniswa ngaphansi kokuqukethwe.

# demoCupertinoAlertWithTitleTitle
source: Alert With Title
af: Opletberig met titel
am: ከርዕስ ጋር ማንቂያ
ar_eg: تنبيه يتضمّن عنوانًا
as: শিৰোনামৰ সৈতে সতর্কবার্তা
az: Başlıqlı Xəbərdarlıq
be: Абвестка з назвай
bn: শীর্ষক সহ সতর্কতা
bs: Obavještenje s naslovom
ca: Alerta amb el títol
da: Underretning med titel
es_ar: Alerta con título
et: Hoiatus koos pealkirjaga
eu: Alerta izenburuduna
fa: هشدار دارای عنوان
fil: Alertong May Pamagat
fr_ca: Alerte avec titre
gl: Alerta con título
gu: શીર્ષકની સાથે અલર્ટ
he: התראה עם כותרת
hi: टाइटल की सुविधा वाली सूचना
hu: Értesítés címmel
hy: Վերնագրով ծանուցում
id: Notifikasi dengan Judul
it: Avviso con titolo
ja: タイトル付きアラート
ka: გაფრთხილება სათაურით
km: ជូនដំណឹង​រួមជាមួយ​ចំណងជើង
kn: ಶೀರ್ಷಿಕೆ ಜೊತೆಗೆ ಅಲರ್ಟ್ ಮಾಡಿ
ko: 제목이 있는 알림
ky: Аталышы бар билдирме
lo: ການແຈ້ງເຕືອນທີ່ມີຊື່
lt: Įspėjimas su pavadinimu
lv: Brīdinājums ar nosaukumu
mk: Предупредување со наслов
ml: ശീർഷകത്തോടെയുള്ള മുന്നറിയിപ്പ്
mn: Гарчигтай сэрэмжлүүлэг
mr: शीर्षकाशी संबंधित सूचना
ms: Makluman Bertajuk
my: ခေါင်းစဉ်ပါသည့် သတိပေးချက်
nb: Varsel med tittel
ne: शीर्षकसहितको अलर्ट
pa: ਸਿਰਲੇਖ ਨਾਲ ਸੁਚੇਤਨਾ
pl: Alert z tytułem
pt: Alerta com título
pt_pt: Alerta com título
ro: Alertă cu titlu
ru: Оповещение с заголовком
si: මාතෘකාව සමග ඇඟවීම
sk: Upozornenie s názvom
sq: Sinjalizo me titullin
sr: Обавештење са насловом
sr_latn: Obaveštenje sa naslovom
sv: Varning med titel
te: శీర్షికతో అలర్ట్
th: การแจ้งเตือนที่มีชื่อ
tr: Başlıklı Uyarı
uk: Сповіщення з назвою
ur: عنوان کے ساتھ الرٹ
uz: Sarlavhali bildirishnoma
vi: Cảnh báo có tiêu đề
zh_hk: 具有標題的通知
zu: Isexwayiso esinesihloko

# demoCupertinoAlertButtonsTitle
source: Alert With Buttons
af: Opletberig met knoppies
am: ከአዝራሮች ጋር ማንቂያዎች
ar_eg: تنبيه مزوّد بأزرار
as: সতর্কবার্তাৰ সৈতে বুটামসমূহ
az: Düymələrlə Xəbərdarlıq
be: Абвестка з кнопкамі
bn: সতর্কতা সংক্রান্ত বোতাম
bs: Obavještenje s dugmadi
ca: Alerta amb botons
da: Underretning med knapper
es_ar: Alerta con botones
et: Hoiatus koos nuppudega
eu: Alerta botoiduna
fa: هشدار با دکمه‌ها
fil: Alertong May Mga Button
fr_ca: Alerte avec des boutons
gl: Alerta con botóns
gu: બટનની સાથે અલર્ટ
he: התראה עם לחצנים
hi: बटन की सुविधा वाली सूचना
hu: Értesítés gombokkal
hy: Ծանուցում կոճակներով
id: Notifikasi dengan Tombol
it: Avvisi con pulsanti
ja: ボタン付きアラート
ka: გაფრთხილება ღილაკებით
km: ការជូនដំណឹង​ដែលមាន​ប៊ូតុង
kn: ಬಟನ್‌ಗಳ ಜೊತೆಗೆ ಅಲರ್ಟ್
ko: 버튼이 있는 알림
ky: Баскычтар аркылуу эскертүү
lo: ການແຈ້ງເຕືອນແບບມີປຸ່ມ
lt: Įspėjimas su mygtukais
lv: Brīdinājums ar pogām
mk: Предупредување со копчиња
ml: ബട്ടണുകൾ ഉപയോഗിച്ച് മുന്നറിയിപ്പ്
mn: Товчлууртай сэрэмжлүүлэг
mr: बटणांशी संबंधित सूचना
ms: Makluman Dengan Butang
my: ခလုတ်များနှင့် သတိပေးချက်
nb: Varsel med knapper
ne: बटनहरूमार्फत सतर्कता
pa: ਬਟਨਾਂ ਨਾਲ ਸੁਚੇਤਨਾ
pl: Alert z przyciskami
pt: Alerta com botões
pt_pt: Alerta com botões
ro: Alertă cu butoane
ru: Оповещение с кнопками
si: බොත්තම් සමග ඇඟවීම
sk: Upozornenie s tlačidlami
sq: Sinjalizimi me butonat
sr: Обавештење са дугмади
sr_latn: Obaveštenje sa dugmadi
sv: Avisering med knappar
te: బటన్‌లతో ఆలర్ట్
th: การแจ้งเตือนแบบมีปุ่ม
tr: Düğmeli Uyarı
uk: Сповіщення з кнопками
ur: بٹن کے ساتھ الرٹ
uz: Tugmali bildirishnomalar
vi: Cảnh báo đi kèm các nút
zh_hk: 含有按鈕的通知
zu: Isexwayiso esinezinkinobho

# demoCupertinoAlertButtonsOnlyTitle
source: Alert Buttons Only
af: Net opletberigknoppies
am: የማንቂያ አዝራሮች ብቻ
ar_eg: أزرار التنبيه فقط
as: কেৱল সতর্কবার্তাৰ বুটামসমূহ
az: Yalnız Xəbərdarlıq Düymələri
be: Толькі кнопкі абвестак
bn: শুধুমাত্র সতর্কতা বিষয়ক বোতাম
bs: Samo dugmad za obavještenje
ca: Només botons d'alerta
da: Kun underretningsknapper
es_ar: Solo botones de alerta
et: Ainult hoiatusnupud
eu: Alerta-botoiak bakarrik
fa: فقط دکمه‌های هشدار
fil: Mga Button ng Alerto Lang
fr_ca: Boutons d'alerte seulement
gl: Só botóns de alerta
gu: ફક્ત અલર્ટ બટન
he: לחצני התראות בלבד
hi: सिर्फ़ सूचना देने वाले बटन
hu: Csak értesítőgombok
hy: Միայն ծանուցումներով կոճակներ
id: Hanya Tombol Notifikasi
it: Solo pulsanti di avviso
ja: アラートボタンのみ
ka: მხოლოდ გამაფრთხილებელი ღილაკები
km: ប៊ូតុង​ជូនដំណឹង​តែប៉ុណ្ណោះ
kn: ಅಲರ್ಟ್ ಬಟನ್‌ಗಳು ಮಾತ್ರ
ko: 알림 버튼만
ky: Билдирме баскычтары гана
lo: ປຸ່ມການແຈ້ງເຕືອນເທົ່ານັ້ນ
lt: Tik įspėjimo mygtukai
lv: Tikai brīdinājumu pogas
mk: Само копчиња за предупредување
ml: മുന്നറിയിപ്പ് ബട്ടണുകൾ മാത്രം
mn: Зөвхөн сэрэмжлүүлгийн товчлуур
mr: फक्त सूचना बटणे
ms: Butang Makluman Sahaja
my: သတိပေးချက် ခလုတ်များသာ
nb: Bare varselknapper
ne: सतर्कता बटनहरू मात्र
pa: ਸਿਰਫ਼ ਸੁਚੇਤਨਾ ਬਟਨ
pl: Tylko przyciski alertu
pt: Apenas botões de alerta
pt_pt: Apenas botões de alerta
ro: Doar butoane pentru alerte
ru: Только кнопки из оповещения
si: ඇඟවීම් බොත්තම් පමණයි
sk: Iba tlačidlá upozornení
sq: Vetëm butonat e sinjalizimit
sr: Само дугмад са обавештењем
sr_latn: Samo dugmad sa obaveštenjem
sv: Endast aviseringsknappar
te: అలర్ట్ బటన్‌లు మాత్రమే
th: ปุ่มการแจ้งเตือนเท่านั้น
tr: Yalnızca Uyarı Düğmeleri
uk: Лише кнопки сповіщень
ur: صرف الرٹ بٹنز
uz: Faqat bildirishnoma tugmalari
vi: Chỉ nút cảnh báo
zh_hk: 只限通知按鈕
zu: Izinkinobho zesexwayiso kuphela

# demoCupertinoActionSheetTitle
source: Action Sheet
af: Handelingelys
am: የእርምጃ ሉህ
ar_eg: ورقة الإجراءات
as: কার্যৰ শ্বীট
az: Əməliyyat Cədvəli
be: Аркуш дзеяння
bn: অ্যাকশন শিট
bs: Tabela radnji
ca: Full d'accions
da: Handlingsark
es_ar: Hoja de acción
et: Toiminguleht
eu: Ekintza-orria
fa: برگ کنش
fil: Sheet ng Pagkilos
fr_ca: Feuille d'action
gl: Folla de acción
gu: ઍક્શન શીટ
he: גיליון פעולות
hi: कार्रवाई शीट
hu: Műveleti munkalap
hy: Գործողությունների ցանկ
id: Sheet Tindakan
it: Foglio azioni
ja: アクション シート
ka: ქმედებათა ფურცელი
km: បញ្ជី​សកម្មភាព
kn: ಆ್ಯಕ್ಷನ್ ಶೀಟ್
ko: 작업 시트
ky: Аракеттер барагы
lo: ຊີດຄຳສັ່ງ
lt: Veiksmų lapas
lv: Darbību izklājlapa
mk: Лист со дејства
ml: ആക്ഷൻ ഷീറ്റ്
mn: Үйлдлийн хүснэгт
mr: क्रिया शीट
ms: Helaian Tindakan
my: လုပ်ဆောင်ချက် စာမျက်နှာ
nb: Handlingsark
ne: कार्य पाना
pa: ਕਾਰਵਾਈ ਸ਼ੀਟ
pl: Arkusz działań
pt: Página de ações
pt_pt: Página Ações
ro: Foaie de acțiune
ru: Окно действия
si: ක්‍රියා පත්‍රය
sk: Hárok s akciami
sq: Fleta e veprimit
sr: Табела радњи
sr_latn: Tabela radnji
sv: Åtgärdsblad
te: చర్య షీట్
th: แผ่นงานการดำเนินการ
tr: İşlem Sayfası
uk: Аркуш дій
ur: کارروائی شیٹ
uz: Harakatlar keltirilgan sahifa
vi: Trang tính hành động
zh_hk: 動作表
zu: Ishidi lesenzo
