Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoScrollbarTitle
source: Scrollbar
af: Rolbalk
am: ማሸብለያ አሞሌ
ar_eg: شريط التمرير
as: স্ক্ৰ’লবাৰ
az: Sürüşdürmə paneli
be: Паласа прагортвання
bn: স্ক্রলবার
bs: Traka za pomicanje
ca: Barra de desplaçament
da: Rullepanel
es_ar: Barra de desplazamiento
et: Kerimisriba
eu: Korritze-barra
fa: نوار پیمایش
fr_ca: Barre de défilement
gl: Barra de desprazamento
gu: સ્ક્રોલ બાર
he: סרגל גלילה
hi: स्क्रोलबार
hu: Görgetősáv
hy: Ոլորագոտի
it: Barra di scorrimento
ja: スクロールバー
ka: გადაადგილების ზოლი
km: របារ​រំកិល
kn: ಸ್ಕ್ರಾಲ್‌ಬಾರ್
ko: 스크롤바
ky: Сыдыруу тилкеси
lo: ແຖບເລື່ອນ
lt: Slinkties juosta
lv: Ritjosla
mk: Лента за лизгање
ml: സ്‌ക്രോൾ ബാർ
mn: Гүйлгэгч
mr: स्‍क्रोलबार
ms: Bar tatal
my: လှိမ့်ရန်ဘား
nb: Rullefelt
ne: स्क्रोलबार
pa: ਸਕ੍ਰੋਲ ਬਾਰ
pl: Pasek przewijania
pt: Barra de rolagem
pt_pt: Barra de deslocamento
ro: Bara de derulare
ru: Полоса прокрутки
si: අනුචලන තීරුව
sk: Posúvač
sq: Shiriti i lëvizjes
sr: Трака за померање
sr_latn: Traka za pomeranje
sv: Scrollningslist
te: స్క్రోల్ బార్
th: แถบเลื่อน
tr: Kaydırma çubuğu
uk: Панель прокручування
ur: اسکرول بار
uz: Aylantirish paneli
vi: Thanh cuộn
zh_hk: 捲軸
zu: Ibha yokuskrola

# demoCupertinoScrollbarSubtitle
source: iOS-style scrollbar
af: Rolbalk in iOS-styl
am: የiOS-ቅጥ ማሸብለያ አሞሌ
ar_eg: شريط تمرير بنمط iOS
as: iOS-শৈলীৰ স্ক্ৰ’লবাৰ
az: iOS üslubunda sürüşdürmə paneli
be: Паласа прагортвання ў стылі iOS
bn: iOS-স্টাইল স্ক্রলবার
bs: Traka za pomicanje u stilu iOS-a
ca: Barra de desplaçament d'estil iOS
da: Rullepanel i iOS-format
es_ar: Barra de desplazamiento similar a la de iOS
et: iOS-stiilis kerimisriba
eu: iOS estiloko korritze-barra
fa: نوار پیمایش به‌سبک iOS
fil: Scrollbar na may istilong pang-iOS
fr_ca: Barre de défilement de style iOS
gl: Barra de desprazamento de tipo iOS
gu: iOS-શૈલીનું સ્ક્રોલ બાર
he: סרגל גלילה בסגנון iOS
hi: iOS स्टाइल का स्क्रोलबार
hu: iOS-stílusú görgetősáv
hy: iOS-ի ոճով ոլորագոտի
id: Scrollbar bergaya iOS
it: Barra di scorrimento in stile iOS
ja: iOS スタイルのスクロールバー
ka: iOS-სტილის გადაადგილების ზოლი
km: របាររំកិល​ដែលមានរចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿಯ ಸ್ಕ್ರಾಲ್‌ಬಾರ್
ko: iOS 스타일 스크롤바
ky: iOS стилиндеги сыдыруу тилкеси
lo: ແຖບເລື່ອນຮູບແບບ iOS
lt: „iOS“ stiliaus slinkties juosta
lv: iOS stila ritjosla
mk: Лента за лизгање во iOS-стил
ml: iOS-സ്റ്റൈൽ സ്ക്രോൾ ബാർ
mn: iOS-загварын гүйлгэгч
mr: iOS च्या शैलीतील स्‍क्रोलबार
ms: Bar tatal gaya iOS
my: iOS-ပုံစံ လှိမ့်ရန်ဘား
nb: Rullefelt i iOS-stil
ne: iOS शैलीको स्क्रोलबार
pa: iOS-ਸਟਾਈਲ ਸਕ੍ਰੋਲ ਬਾਰ
pl: Pasek przewijania w stylu iOS
pt: Barra de rolagem no estilo do iOS
pt_pt: Barra de deslocamento ao estilo do iOS
ro: Bara de derulare în stil iOS
ru: Полоса прокрутки в стиле iOS
si: iOS-විලාසයේ අනුචලන තීරුව
sk: Posúvač v štýle systému iOS
sq: Shiriti i lëvizjes në stilin e iOS
sr: Трака за померање у iOS стилу
sr_latn: Traka za pomeranje u iOS stilu
sv: Scrollningslist i iOS-stil
te: iOS-స్టయిల్ స్క్రోల్ బార్
th: แถบเลื่อนรูปแบบ iOS
tr: iOS stili kaydırma çubuğu
uk: Панель прокручування в стилі iOS
ur: iOS طرز کا اسکرول بار
uz: iOS uslubidagi aylantirish paneli
vi: Thanh cuộn kiểu iOS
zh_hk: iOS 樣式捲軸
zu: Ibha yokuskrola yesitayela se-iOS

# demoCupertinoScrollbarDescription
source: A scrollbar that wraps the given child
af: ’n Rolbalk wat die bepaalde kind toemaak
am: የተሰጠውን ልጅ የሚጠቀልል ማሸብለያ አሞሌ
ar_eg: شريط تمرير يشمل العنصر الثانوي المتوفّر.
as: এটা স্ক্ৰ’লবাৰ যি প্ৰদত্ত চাইল্ডটো আবৃত্ত কৰে
az: Verilmiş alt elementi örtən sürüşdürmə paneli
be: Паласа прагортвання для дадзенага даччынага элемента
bn: স্ক্রলবার তার সামনে থাকা চাইল্ড এলিমেন্টকে র‌্যাপ করে দেয়
bs: Traka za pomicanje koja obuhvata dato dijete
ca: Barra de desplaçament que uneix l'element secundari determinat.
da: Et rullepanel, der omgiver det givne underordnede element
es_ar: Es una barra de desplazamiento que une el elemento secundario proporcionado.
et: Kerimisriba on alati kuvatud
eu: Haurra biltzen duen korritze-barra
fa: نوار پیمایشی که کودکان را درنظر می‌گیرد
fil: Scrollbar na nagra-wrap sa partikular na child
fr_ca: Une barre de défilement qui enveloppe l'enfant donné
gl: Unha barra de desprazamento que envolve o elemento secundario en cuestión
gu: આપેલા ચાઇલ્ડને આવરી લેતું સ્ક્રોલ બાર
he: סרגל גלילה שעוטף את הצאצא הנתון
hi: दिए गए चाइल्ड को रैप करने वाला स्क्रोलबार
hu: Az adott alárendelt elemet körülvevő görgetősáv
hy: Ոլորագոտի, որը դարձում է ենթավիջեթը
id: Scrollbar yang menggabungkan turunan tertentu
it: Una barra di scorrimento che aggrega la risorsa secondaria specificata
ja: 特定の子をラップするスクロールバー
ka: გადაადგილების ზოლი, რომელიც ეხვევა ქვე-ერთეულს
km: របាររំកិលដែលមើលឃើញ
kn: ಸೂಚಿಸಿರುವ ಮಗುವನ್ನು ಸುತ್ತುವರಿದ ಸ್ಕ್ರಾಲ್‌ಬಾರ್
ko: 지정된 하위 요소를 래핑하는 스크롤바
ky: Сыдыруу тилкеси башкы бетти ташыйт
lo: ແຖບເລື່ອນທີ່ຮວມອົງປະກອບຍ່ອຍທີ່ລະບຸ
lt: Slinkties juosta, apgaubianti nurodytą antrinį elementą
lv: Ritjosla, kas ietver konkrēto pakārtoto vienumu.
mk: Лента за лизгање што се обвиткува околу подредената ставка
ml: നൽകിയിരിക്കുന്ന ചൈൽഡിനെ റാപ്പ് ചെയ്യുന്ന സ്ക്രോൾ ബാർ
mn: Өгөгдсөн дэд элементийг нэг эгнээнд хураах гүйлгэгч
mr: दिलेल्या चाइल्डला रॅप करणारा स्क्रोलबार
ms: Bar tatal yang membalut anak tertentu
my: ပေးထားသောအခွဲကို ငုံထားသည့် လှိမ့်ရန်ဘား
nb: Et rullefelt som omslutter det angitte underordnede elementet
ne: दिइएको बच्चालाई र्‍याप गर्ने स्क्रोलबार
pa: ਦਿੱਤੇ ਗਏ ਚਾਈਲਡ ਨੂੰ ਸਮੇਟਣ ਵਾਲਾ ਸਕ੍ਰੋਲ ਬਾਰ
pl: Pasek przewijania, który pakuje dany element podrzędny
pt: Uma barra de rolagem que envolve o elemento filho específico
pt_pt: Uma barra de deslocamento que une o elemento secundário indicado
ro: O bară de derulare care include elementul subordonat
ru: Полоса прокрутки для просмотра дочернего элемента.
si: දී ඇති දාරකයා දවටන අනුචලන තීරුවක්
sk: Posúvač okolo príslušnej podradenej položky
sq: Një shirit lëvizjeje që mbështjell elementin e dhënë në varësi
sr: Трака за померање која прекрива подређени елемент
sr_latn: Traka za pomeranje koja prekriva podređeni element
sv: En scrollningslist som omger det angivna underordnade objektet
te: అందించిన చైల్డ్ ర్యాప్ చేసిన స్క్రాల్ బార్
th: แถบเลื่อนที่รวมองค์ประกอบย่อยที่ระบุ
tr: Belirtilen alt öğeyi sarmalayan kaydırma çubuğu
uk: Панель прокручування, що обтікає певний дочірній елемент
ur: ہوم پیج میں دکھائی دینے والا اسکرول بار
uz: Berilgan asosiy elementni qamrab oluvchi aylantirish paneli
vi: Một thanh cuộn bao bọc phần tử con đã cho
zh_hk: 捲軸可將特定子節點換行
zu: Ibha yokuskrola egoqa ingane enikeziwe

# demoTwoPaneItem
source: Item {value}
am: ንጥል {value}
ar_eg: العنصر {value}
as: বস্তু {value}
az: {value} elementi
be: Элемент {value}
bn: আইটেম {value}
bs: Stavka {value}
ca: Elements {value}
da: Element {value}
es_ar: Artículo {value}
et: Üksus {value}
eu: Elementua: {value}
fa: مورد {value}
fr_ca: Élément {value}
gl: Elemento {value}
gu: આઇટમ {value}
he: פריט {value}
hi: आइटम {value}
hu: {value} elem
hy: Տարր {value}
it: Elemento {value}
ja: アイテム {value}
ka: ერთეული {value}
km: ធាតុទី {value}
kn: ಐಟಂ {value}
ko: {value} 항목
ky: Нерсе {value}
lo: ລາຍການ {value}
lt: Elementas {value}
lv: Vienums {value}
mk: Ставка {value}
ml: ഇനം {value}
mn: Зүйл {value}
mr: आयटम {value}
my: ပစ္စည်း {value}
nb: Vare {value}
ne: वस्तु {value}
pa: ਆਈਟਮ {value}
pl: Element {value}
ro: Articol {value}
ru: Объект {value}
si: අයිතමය {value}
sk: Položka {value}
sq: Artikulli {value}
sr: Ставка {value}
sr_latn: Stavka {value}
sv: Objekt {value}
te: ఐటెమ్ {value}
th: รายการ {value}
tr: {value} öğesi
uk: Елемент {value}
ur: آئٹم {value}
uz: {value} obyekti
vi: Mục {value}
zh_hk: 項目 {value}
zu: Into {value}

# demoTwoPaneList
source: List
af: Lys
am: ዝርዝር
ar_eg: القائمة
as: সূচী
az: Siyahı
be: Спіс
bn: তালিকা
bs: Lista
ca: Llista
da: Liste
es_ar: Lista
et: Loend
eu: Zerrenda
fa: فهرست
fil: Listahan
fr_ca: Liste
gl: Lista
gu: સૂચિ
he: רשימה
hi: सूची
hu: Lista
hy: Ցանկ
id: Daftar
it: Elenco
ja: リスト
ka: სია
km: បញ្ជី
kn: ಪಟ್ಟಿ
ko: 목록
ky: Тизме
lo: ລາຍຊື່
lt: Sąrašas
lv: Saraksts
mk: Список
ml: ലിസ്റ്റ്
mn: Жагсаалт
mr: सूची
ms: Senarai
my: စာရင်း
nb: Liste
ne: सूची
pa: ਸੂਚੀ
pl: Lista
pt: Lista
pt_pt: Lista
ro: Listă
ru: Список
si: ලැයිස්තුව
sk: Zoznam
sq: Lista
sr: Листа
sr_latn: Lista
sv: Lista
te: లిస్ట్
th: รายการ
tr: Liste
uk: Список
ur: فہرست
uz: Roʻyxat
vi: Danh sách
zh_hk: 清單
zu: Uhlu

# demoTwoPaneFoldableLabel
source: Foldable
af: Opvoubaar
am: ሊታጠፍ የሚችል
ar_eg: قابل للطي
as: মোকোটাব পৰা
az: Qatlanan
be: Складваецца
bn: ফোল্ড করা যায়
bs: Sklopivo
ca: Plegable
da: Foldbar
es_ar: Plegable
et: Volditav
eu: Gailu tolesgarria
fa: تاشو
fr_ca: Pliable
gl: Pregable
gu: ફોલ્ડ કરી શકાય એવું
he: מכשיר מתקפל
hi: फ़ोल्ड किया जा सकने वाला डिवाइस
hu: Összehajtható
hy: Ծալվող
id: Perangkat foldable
it: Pieghevoli
ja: 折りたたみ式
ka: დასაკეცი
km: អាចបត់បាន
kn: ಫೋಲ್ಡ್ ಮಾಡಬಹುದಾದುದು
ko: 폴더블
ky: Бүктөлүүчү
lo: ພັບໄດ້
lt: Lankstomasis
lv: Salokāma ierīce
mk: Преклопувачки
ml: ഫോൾഡ് ചെയ്യാവുന്നത്
mn: Эвхэгддэг
mr: फोल्ड करता येण्यासारखे
ms: Boleh lipat
my: ခေါက်နိုင်ခြင်း
nb: Sammenleggbar
ne: फोल्ड गर्न मिल्ने
pa: ਮੋੜਨਯੋਗ
pl: Składane
pt: Dobrável
pt_pt: Dobrável
ro: Dispozitiv pliabil
ru: Складное устройство
si: නැවිය හැකි
sk: Skladacie
sq: E palosshme
sr: На преклоп
sr_latn: Na preklop
sv: Vikbar enhet
te: మడవగల
th: พับได้
tr: Katlanabilir
uk: Розкладний пристрій
ur: فولڈ ہونے والے
uz: Buklanadigan
vi: Thiết bị có thể gập lại
zh_hk: 摺疊式
zu: Okungagoqeka

# demoTwoPaneSmallScreenLabel
source: Small Screen
af: Klein skerm
am: ትንሽ ማያ ገፅ
ar_eg: الشاشة الصغيرة
as: সৰু স্ক্ৰীন
az: Kiçik Ekran
be: Малы экран
bn: ছোট স্ক্রিন
bs: Mali ekran
ca: Pantalla petita
da: Lille skærm
es_ar: Pantalla pequeña
et: Väike ekraan
eu: Pantaila txikiko gailua
fa: صفحه‌نمایش کوچک
fil: Maliit na Screen
fr_ca: Petit écran
gl: Pantalla pequena
gu: નાની સ્ક્રીન
he: מסך קטן
hi: छोटी स्क्रीन
hu: Kis képernyő
hy: Փոքր էկրան
id: Layar Kecil
it: Schermo piccolo
ja: 小画面
ka: პატარა ეკრანი
km: អេក្រង់តូច
kn: ಚಿಕ್ಕ ಸ್ಕ್ರೀನ್
ko: 소형 화면
ky: Кичине экран
lo: ຈໍນ້ອຍ
lt: Mažas ekranas
lv: Ierīce ar mazu ekrānu
mk: Мал екран
ml: ചെറിയ സ്ക്രീൻ
mn: Жижиг дэлгэц
mr: लहान स्क्रीन
ms: Skrin Kecil
my: စခရင်အသေး
nb: Liten skjerm
ne: सानो स्क्रिन
pa: ਛੋਟੀ ਸਕ੍ਰੀਨ
pl: Mały ekran
pt: Tela pequena
pt_pt: Ecrã pequeno
ro: Ecran mic
ru: Небольшой экран
si: කුඩා තිරය
sk: Malá obrazovka
sq: Ekran i vogël
sr: Мали екран
sr_latn: Mali ekran
sv: Liten skärm
te: చిన్న స్క్రీన్
th: หน้าจอขนาดเล็ก
tr: Küçük Ekran
uk: Невеликий екран
ur: چھوٹی اسکرین
uz: Kichik ekran
vi: Thiết bị có màn hình nhỏ
zh_hk: 小螢幕
zu: Isikrini Esincane

# demoTwoPaneSmallScreenDescription
source: This is how TwoPane behaves on a small screen device.
af: Dit is hoe TwoPane op ’n kleinskermtoestel werk.
am: ባለሁለት ፔን ትንሽ ማያ ገፅ ያለው መሣሪያ ላይ እንደዚህ ነው የሚሰራው።
ar_eg: هذه هي الطريقة التي يتصرف بها TwoPane على جهاز مزوَّد بشاشة صغيرة.
as: এটা সৰু স্ক্ৰীনৰ ডিভাইচত TwoPaneএ এইদৰে আচৰণ কৰে।
az: TwoPane kiçik ekranlı cihazda belə davranır.
be: Вось так TwoPane выглядае на прыладзе з малым экранам.
bn: ছোট স্ক্রিনের ডিভাইসে TwoPane এইভাবে পারফর্ম করে।
bs: Ovako TwoPane funkcionira na uređaju s malim ekranom.
ca: Aquest és el comportament de TwoPane en un dispositiu amb la pantalla petita.
da: Sådan fungerer TwoPane på en enhed med en lille skærm.
es_ar: Así es como se comporta TwoPane en un dispositivo con pantalla pequeña.
et: Nii käitub vidin TwoPane väikese ekraaniga seadmes.
eu: Hau da TwoPane-ren portaera pantaila txikiko gailu batean.
fa: نحوه عملکرد ویژگی «دوصفحه‌ای» در دستگاه دارای صفحه‌نمایش کوچک.
fil: Ganito ang gawi ng TwoPane sa isang device na may maliit na screen.
fr_ca: Voici comment s'affiche TwoPane sur un appareil à petit écran.
gl: Así se comporta TwoPane nun dispositivo cunha pantalla pequena.
gu: નાની સ્ક્રીનવાળા ડિવાઇસ પર TwoPane આ રીતે કામ કરે છે.
he: זו ההתנהגות של TwoPane במכשיר עם מסך קטן.
hi: छोटी स्क्रीन वाले डिवाइस पर TwoPane इस तरह काम करता है.
hu: Így működik a TwoPane kis képernyős eszközön.
hy: Ահա թե ինչպես է TwoPane-ը աշխատում փոքր էկրանով սարքում։
id: Ini adalah perilaku TwoPane di perangkat yang memiliki layar berukuran kecil.
it: TwoPane si comporta in questo modo su un dispositivo con uno schermo piccolo.
ja: 小画面デバイスでの TwoPane の動作です。
ka: აი, როგორ მოიქცევა TwoPane პატარა მოწყობილობაზე.
km: នេះគឺជារបៀបដែល TwoPane ដំណើរការនៅលើឧបករណ៍ដែលមានអេក្រង់តូច។
kn: ಚಿಕ್ಕ ಸ್ಕ್ರೀನ್ ಸಾಧನದಲ್ಲಿ TwoPane ಈ ರೀತಿಯಾಗಿ ವರ್ತಿಸುತ್ತದೆ ಎಂಬುದಾಗಿದೆ.
ko: 소형 화면 기기에서 TwoPane이 작동하는 방식입니다.
ky: TwoPane экраны кичинекей түзмөктөрдө ушинтип иштейт.
lo: ນີ້ແມ່ນວິທີທີ່ TwoPane ເຮັດວຽກຢູ່ອຸປະກອນຈໍນ້ອຍ.
lt: Tai nurodo, kaip „TwoPane“ veikia naudojant mažo ekrano įrenginį.
lv: Demonstrācija, kā TwoPane darbojas ierīcē ar mazu ekrānu.
mk: Вака се однесува TwoPane на уред со мал екран.
ml: ചെറിയ സ്ക്രീനുള്ള ഉപകരണത്തിൽ ഇപ്രകാരമാണ് TwoPane പ്രവർത്തിക്കുന്നത്.
mn: TwoPane нь жижиг дэлгэцтэй төхөөрөмж дээр ингэж ажилладаг.
mr: लहान स्क्रीन डिव्हाइसवर TwoPane हे अशाप्रकारे काम करते.
ms: Inilah gelagat TwoPane pada peranti skrin kecil.
my: ဤအရာသည် စခရင်သေးသည့်စက်တွင် TwoPane က လုပ်ဆောင်သည့်ပုံစံဖြစ်သည်။
nb: Slik fungerer TwoPane på en enhet med liten skjerm.
ne: TwoPane सुविधाले सानो स्क्रिन भएको डिभाइसमा यसरी काम गर्छ।
pa: ਛੋਟੀ ਸਕ੍ਰੀਨ ਵਾਲੇ ਡੀਵਾਈਸ 'ਤੇ TwoPane ਇਸ ਤਰ੍ਹਾਂ ਕੰਮ ਕਰਦਾ ਹੈ।
pl: Tak wygląda widżet TwoPane na urządzeniu z małym ekranem.
pt: O TwoPane se comporta dessa forma em dispositivos com tela pequena.
pt_pt: É assim que o TwoPane se comporta num dispositivo com um ecrã pequeno.
ro: Acesta este comportamentul TwoPane pe un dispozitiv cu ecran mic.
ru: Вот так TwoPane работает на устройстве с маленьким экраном.
si: කුඩා තිර උපාංගයක TwoPane හැසිරෙන්නේ මේ ආකාරයටයි.
sk: Takto sa TwoPane správa v zariadení s malou obrazovkou.
sq: Ja si sillet TwoPane në një pajisje me ekran të vogël.
sr: Овако се TwoPane понаша на уређају са малим екраном.
sr_latn: Ovako se TwoPane ponaša na uređaju sa malim ekranom.
sv: Så här fungerar TwoPane på en enhet med liten skärm.
te: చిన్న స్క్రీన్ గల పరికరంలో TwoPane ఇలా ప్రవర్తిస్తుంది.
th: นี่คือลักษณะการทำงานของ TwoPane ในอุปกรณ์ที่มีหน้าจอขนาดเล็ก
tr: TwoPane, küçük ekranlı bir cihazda bu şekilde davranır.
uk: Опис роботи TwoPane на пристроях із невеликими екранами.
ur: چھوٹی اسکرین والے آلے پر TwoPane اس طرح برتاؤ کرتا ہے۔
uz: TwoPane kichik ekranli qurilmada shunday ishlaydi.
vi: Bản minh hoạ cách TwoPane hoạt động trên thiết bị có màn hình nhỏ.
zh_hk: 這是 TwoPane 在小螢幕裝置上的行為方式。
zu: Lena yindlela i-TwoPane eziphatha ngayo kudivayisi enesikrini esincane.

# demoTwoPaneTabletLabel
source: Tablet / Desktop
af: Tablet/rekenaar
am: ጡባዊ / ዴስክቶፕ
ar_eg: الأجهزة اللوحية / أجهزة الكمبيوتر المكتبية
as: টেবলেট / ডেস্কটপ
az: Planşet / Masaüstü
be: Планшэт / ПК
bn: ট্যাবলেট / ডেস্কটপ
bs: Tablet / računar
ca: Tauleta/Ordinador
da: Tablet/computer
es_ar: Tablet/computadora
et: Tahvelarvuti/lauaarvuti
eu: Tableta / Mahaigaineko ordenagailua
fa: رایانه لوحی / رایانه رومیزی
fr_ca: Tablette/Ordinateur de bureau
gl: Tableta/Escritorio
gu: ટૅબ્લેટ / ડેસ્કટૉપ
he: טאבלט או מחשב
hi: टैबलेट / डेस्कटॉप
hu: Táblagép / számítógép
hy: Պլանշետ կամ համակարգիչ
ja: タブレットまたはパソコン
ka: ტაბლეტი / დესკტოპი
km: ថេប្លេត / កុំព្យូទ័រ
kn: ಟ್ಯಾಬ್ಲೆಟ್‌‌ / ಡೆಸ್ಕ್‌ಟಾಪ್
ko: 태블릿/데스크톱
ky: Планшет / Иш такта
lo: ແທັບເລັດ / ເດັສທັອບ
lt: Planšetiniai ir staliniai kompiuteriai
lv: Planšetdatori/galddatori
mk: Таблет/компјутер
ml: ടാബ്‌ലെറ്റ് / ഡെസ്‌ക്ടോപ്പ്
mn: Таблет / Компьютер
mr: टॅबलेट / डेस्कटॉप
my: တက်ဘလက် / ဒက်စ်တော့
nb: Nettbrett/datamaskin
ne: ट्याब्लेट / डेस्कटप
pa: ਟੈਬਲੈੱਟ / ਡੈਸਕਟਾਪ
pl: Tablet/komputer
pt: Tablet / computador
pt_pt: Tablet/computador
ro: Tabletă / computer
ru: Планшет или компьютер
si: ටැබ්ලට් / ඩෙස්ක්ටොප්
sk: Tablet a počítač
sr: Таблети и рачунари
sr_latn: Tableti i računari
sv: Surfplatta/dator
te: టాబ్లెట్ / డెస్క్‌టాప్
th: แท็บเล็ต/เดสก์ท็อป
tr: Tablet/Masaüstü
uk: Планшети й настільні комп’ютери
ur: ٹیبلیٹ / ڈیسک ٹاپ
uz: Planshet/Kompyuter
vi: Máy tính bảng/Máy tính để bàn
zh_hk: 平板電腦/桌面電腦
zu: Ithebulethi / Ideskithophu

# demoTwoPaneTabletDescription
source: This is how TwoPane behaves on a larger screen like a tablet or desktop.
af: Dit is hoe TwoPane op ’n groter skerm, soos ’n tablet of rekenaar, werk.
am: ባለሁለት ፔን እንደ ጡባዊ ወይም ዴስክቶፕ ዓይነት ተለቅ ያለ ማያ ገፅ ላይ እንደዚህ ነው የሚሰራው።
ar_eg: هذه هي الطريقة التي يتصرف بها TwoPane على جهاز مزوَّد بشاشة كبيرة، مثل الجهاز اللوحي أو جهاز الكمبيوتر المكتبي.
as: টেবলেট অথবা ডেস্কটপৰ দৰে ডাঙৰ স্ক্ৰীনত TwoPaneএ এইদৰে আচৰণ কৰে।
az: TwoPane planşet və ya masaüstü kimi daha böyük ekranda belə davranır.
be: Вось так TwoPane выглядае на прыладах в вялікім экранам, напрыклад на планшэтах і ПК.
bn: ট্যাবলেট বা ডেস্কটপের মতো বড় স্ক্রিনের ডিভাইসে TwoPane এইভাবে পারফর্ম করে।
bs: Ovako TwoPane funkcionira na uređaju s većim ekranom kao što je tablet ili računar.
ca: Aquest és el comportament de TwoPane en una pantalla més gran com ara la d'una tauleta o un ordinador.
da: Sådan fungerer TwoPane på en større skærm som f.eks. en tablet eller en computer.
es_ar: Así es como se comporta TwoPane en una pantalla de mayor tamaño, como la de una tablet o una computadora.
et: Nii käitub vidin TwoPane suure ekraaniga seadmes, nt tahvel- või lauaarvutis.
eu: Hau da TwoPane-ren portaera pantaila handiago batean (adibidez, tableta edo mahaigaineko ordenagailu batean)
fa: نحوه عملکرد ویژگی «دوصفحه‌ای» در صفحه‌نمایشی بزرگ مثل رایانه لوحی یا رایانه رومیزی.
fil: Ganito ang gawi ng TwoPane sa isang mas malaking screen tulad ng tablet o desktop.
fr_ca: Voici comment TwoPane s'affiche sur un écran plus grand, comme une tablette ou un ordinateur de bureau.
gl: Así se comporta TwoPane nun dispositivo cunha pantalla máis grande, como unha tableta ou un ordenador.
gu: ટૅબ્લેટ અથવા ડેસ્કટૉપ જેવા ડિવાઇસ પર TwoPane આ રીતે કામ કરે છે.
he: זו ההתנהגות של TwoPane במכשיר עם מסך גדול יותר, כמו טאבלט או מחשב.
hi: बड़ी स्क्रीन वाले डिवाइस, जैसे कि टैबलेट या डेस्कटॉप पर TwoPane इस तरह काम करता है.
hu: Így működik a TwoPane nagy képernyőn (pl. táblagépen vagy számítógépen).
hy: Ահա թե ինչպես է TwoPane-ը աշխատում ավելի մեծ էկրանով սարքում, օրինակ՝ պլանշետում կամ համակարգչում։
id: Ini adalah perilaku TwoPane di perangkat yang memiliki layar lebih besar seperti tablet atau desktop.
it: TwoPane si comporta in questo modo su un dispositivo con uno schermo più grande, come un tablet o un computer.
ja: タブレットまたはパソコンのような大画面での TwoPane の動作です。
ka: აი, როგორ მოიქცევა TwoPane უფრო დიდეკრანიან მოწყობილობაზე, მაგალითად, ტაბლეტზე ან დესკტოპზე.
km: នេះគឺជារបៀបដែល TwoPane ដំណើរការនៅលើអេក្រង់កាន់តែធំដូចជាថេប្លេត ឬកុំព្យូទ័រ។
kn: ದೊಡ್ಡ ಸ್ಕ್ರೀನ್‌ನಂತಹ ಟ್ಯಾಬ್ಲೆಟ್ ಅಥವಾ ಡೆಸ್ಕ್‌ಟಾಪ್ ಸಾಧನದಲ್ಲಿ TwoPane ಈ ರೀತಿಯಾಗಿ ವರ್ತಿಸುತ್ತದೆ ಎಂಬುದಾಗಿದೆ.
ko: 태블릿 또는 데스크톱 등 대형 화면에서 TwoPane이 작동하는 방식입니다.
ky: TwoPane планшет же иш такта сыяктуу экраны чоңураак түзмөктөрдө ушинтип иштейт.
lo: ນີ້ແມ່ນວິທີທີ່ TwoPane ເຮັດວຽກຢູ່ໜ້າຈໍໃຫຍ່ຂຶ້ນ ເຊັ່ນ: ແທັບເລັດ ຫຼື ເດັສທັອບ.
lt: Tai nurodo, kaip „TwoPane“ veikia didesniame ekrane, pvz., naudojant planšetinį ar stalinį kompiuterį.
lv: Demonstrācija, kā TwoPane darbojas ierīcē ar lielāku ekrānu, piemēram, planšetdatorā vai galddatorā.
mk: Вака се однесува TwoPane на поголем екран како таблет или компјутер.
ml: ടാബ്‌ലെറ്റിലോ ഡെസ്‌ക്ടോപ്പിലോ ഇപ്രകാരമാണ് TwoPane പ്രവർത്തിക്കുന്നത്.
mn: TwoPane нь таблет болон компьютер зэрэг том дэлгэц дээр ингэж ажилладаг.
mr: टॅबलेट किंवा डेस्कटॉप यांसारख्या मोठ्या स्क्रीनवर TwoPane हे अशाप्रकारे काम करते.
ms: Inilah gelagat TwoPane pada skrin yang lebih besar, seperti tablet atau desktop.
my: ဤအရာသည် တက်ဘလက် (သို့) ဒက်စ်တော့ကဲ့သို့ ကြီးမားသည့်စက်တွင် TwoPane က လုပ်ဆောင်သည့်ပုံစံဖြစ်သည်။
nb: Slik fungerer TwoPane på store skjermer som nettbrett og datamaskiner.
ne: TwoPane ले ट्याब्लेट वा डेस्कटप जस्ता ठुला स्क्रिनमा यसरी काम गर्छ।
pa: ਵੱਡੀ ਸਕ੍ਰੀਨ ਵਾਲੇ ਡੀਵਾਈਸ, ਜਿਵੇਂ ਕਿ ਟੈਬਲੈੱਟ ਜਾਂ ਡੈਸਕਟਾਪ 'ਤੇ TwoPane ਇਸ ਤਰ੍ਹਾਂ ਕੰਮ ਕਰਦਾ ਹੈ।
pl: Tak wygląda widżet TwoPane na większym ekranie, np. tablecie lub komputerze.
pt: O TwoPane se comporta dessa forma em dispositivos com tela grande, como tablets ou computadores.
pt_pt: É assim que o TwoPane se comporta num ecrã maior, como um tablet ou um computador.
ro: Acesta este comportamentul TwoPane pe un ecran mai mare, cum ar fi cel de tabletă sau de computer.
ru: Вот так TwoPane работает на устройстве с большим экраном, например на планшете или компьютере.
si: ටැබ්ලටයක් හෝ ඩෙස්ක්ටොප් එකක් වැනි විශාල තිරයක් මත TwoPane හැසිරෙන්නේ මේ ආකාරයටයි.
sk: Takto sa TwoPane správa na väčšej obrazovke, napríklad v tablete alebo počítači
sq: Ja si sillet TwoPane në një ekran më të madh, si p.sh. një tablet ose një dektop.
sr: Овако се TwoPane понаша на већем екрану, попут оних на таблету или рачунару.
sr_latn: Ovako se TwoPane ponaša na većem ekranu, poput onih na tabletu ili računaru.
sv: Så här fungerar TwoPane på en enhet med en större skärm, som en surfplatta eller dator.
te: టాబ్లెట్ లేదా డెస్క్‌టాప్ వంటి చాలా పెద్ద స్క్రీన్‌లో TwoPane ఇలా ప్రవర్తిస్తుంది.
th: นี่คือลักษณะการทำงานของ TwoPane ในอุปกรณ์ที่มีหน้าจอขนาดใหญ่ขึ้น เช่น แท็บเล็ตหรือเดสก์ท็อป
tr: TwoPane, tablet veya masaüstü gibi büyük bir ekranda bu şekilde davranır.
uk: Опис роботи TwoPane на більших екранах (як-от планшети чи настільні комп’ютери)
ur: ٹیبلیٹ یا ڈیسک ٹاپ کی طرح بڑی اسکرین پر TwoPane اس طرح برتاؤ کرتا ہے۔
uz: TwoPane planshet yoki kompyuter kabi kichik ekranli qurilmada shunday ishlaydi.
vi: Bản minh hoạ cách TwoPane hoạt động trên thiết bị có màn hình lớn hơn như máy tính bảng hoặc máy tính.
zh_hk: 這是 TwoPane 在平板電腦或桌面電腦等較大螢幕上的行為方式。
zu: Lena yindlela i-TwoPane eziphatha ngayo esikrinini esikhulu njengesethebulethi noma sedeskithophu.
