Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoBottomSheetModalTitle
source: Modal bottom sheet
af: Modale blad aan die onderkant
am: የሞዳል አዝራር ሉህ
ar_eg: البطاقة السفلية المقيِّدة
as: একেবাৰে নিম্নাংশৰ মডেল শ্বীট
az: Modal alt vərəq
be: Мадальны ніжні аркуш
bn: মোডাল বটম শিট
bs: Modalna donja tabela
ca: Full modal inferior
da: Modalt felt i bunden
es_ar: Hoja modal inferior
et: Modaalne alumine leht
eu: Beheko orri modala
fa: برگه پایانی مودال
fil: Modal na bottom sheet
fr_ca: Page de contenu flottante dans le bas de l'écran
gl: Panel inferior modal
gu: મોડલ બોટમ શીટ
he: גיליון תחתון מודלי
hi: मॉडल बॉटम शीट
hu: Modális alsó lap
hy: Ներքևի մոդալ թերթ
id: Sheet bawah modal
it: Foglio inferiore modale
ja: モーダル ボトムシート
ka: მოდალური ქვედა ფურცელი
km: សន្លឹកខាងក្រោម​លក្ខណៈម៉ូដល
kn: ಮೋಡಲ್ ಬಾಟಮ್ ಶೀಟ್
ko: 모달 하단 시트
ky: Ылдый жактагы модалдык барак
lt: Modalinis apatinio lapo mygtukas
lv: Modālā ekrāna apakšdaļa
mk: Модален долен лист
ml: മോഡൽ ബോട്ടം ഷീറ്റ്
mn: Зайлшгүй харилцах доод хүснэгт
mr: मोडल तळाचे शीट
ms: Helaian bawah mod
my: အောက်ခြေမီနူးပါ ပုံစံစာမျက်နှာ
nb: Modalfelt nederst
ne: मोडल नामक फेदको पाना
pa: ਮਾਡਲ ਹੇਠਲੀ ਸ਼ੀਟ
pl: Modalna plansza dolna
pt: Página inferior modal
pt_pt: Secção inferior modal
ro: Foaia modală din partea de jos
ru: Модальный нижний экран
si: මොඩල් පහළ පත්‍රය
sk: Modálny dolný hárok
sq: Fleta e poshtme modale
sr: Модална доња табела
sr_latn: Modalna donja tabela
sv: Modalt ark längst ned på skärmen
te: నమూనా దిగువున ఉండే షీట్
tr: Kalıcı alt sayfa
uk: Модальна сторінка, що розгортається знизу
ur: نیچے کی ماڈل شیٹ
uz: Modal quyi ekran
vi: Bảng dưới cùng cách điệu
zh_hk: 強制回應底部工作表
zu: Ishidi laphansi le-Modal

# demoBottomSheetPersistentDescription
source: A persistent bottom sheet shows information that supplements the primary content of the app. A persistent bottom sheet remains visible even when the user interacts with other parts of the app.
af: 'n Blywende blad aan die onderkant van die skerm wys inligting wat die primêre inhoud van die program aanvul. Dit bly sigbaar, selfs wanneer die gebruiker met ander dele van die program interaksie het.
am: ጽኑ የሆነ የግርጌ ሉህ የመተግበሪያውን ዋና ይዘት የሚያሟላ መረጃ ያሳያል። ጽኑ የግርጌ ሉህ ተጠቃሚው የመተግበሪያው ሌሎች ክፍሎች ጋር መስተጋብር ቢፈጥርም እንኳ የሚታይ እንደሆነ ይቆያል።
ar_eg: تعرض البطاقة السفلية العادية معلومات تكميلية للمحتوى الأساسي للتطبيق. ولا تختفي هذه البطاقة عندما يتفاعل المستخدم مع المحتوى الآخر على الشاشة.
as: এখন একেবাৰে নিম্নাংশৰ অবিৰত শ্বীটে এপ্‌টোৰ প্ৰাথমিক সমলক পৰিপূৰণ কৰা তথ্য দেখুৱায়। ব্যৱহাৰকাৰীয়ে এপ্‌টোৰ অন্য অংশসমূহ ব্যৱহাৰ কৰাৰ সময়তো একেবাৰে নিম্নাংশৰ অবিৰত শ্বীটখন দৃশ্যমান হৈ থাকে।
az: Sabit alt vərəq tətbiqin ilkin məzmununa əlavə edilən məlumatları göstərir. Sabit alt vərəq istifadəçi tətbiqin digər hissələri ilə işlədikdə belə görünür.
be: Пастаянны ніжні аркуш паказвае дадатковую інфармацыю да асноўнага змесціва праграмы. Ён заўсёды застаецца бачным, нават калі карыстальнік узаемадзейнічае з іншымі раздзеламі праграмы.
bn: সব সময় দেখা যায় এমন বোটম শিট অ্যাপের প্রধান কন্টেন্টের সাথে সম্পর্কিত অন্যান্য তথ্য দেখায়। ব্যবহারকারী অ্যাপের অন্যান্য ফিচারেরে সাথে ইন্ট্যারঅ্যাক্ট করলে সব সময় দেখা যায় এমন বোটম শিট।
bs: Fiksna donja tabela prikazuje informacije koje nadopunjuju primarni sadržaj aplikacije. Fiksna donja tabela ostaje vidljiva čak i tokom interakcije korisnika s drugim dijelovima aplikacije.
ca: Una full inferior persistent mostra informació que complementa el contingut principal de l'aplicació. A més, continua visible quan l'usuari interacciona amb altres parts de l'aplicació.
da: Et fast felt i bunden viser oplysninger, der supplerer det primære indhold i appen. Et fast felt i bunden forbliver synligt, selvom brugeren interagerer med andre elementer i appen.
es_ar: Una hoja inferior persistente muestra información que suplementa el contenido principal de la app. La hoja permanece visible, incluso si el usuario interactúa con otras partes de la app.
et: Püsival alumisel lehel kuvatakse teave, mis täiendab rakenduse peamist sisu. Püsiv alumine leht jääb nähtavale ka siis, kui kasutaja suhtleb rakenduse muu osaga.
eu: Aplikazioko eduki nagusia osatzea helburu duen informazioa erakusten du beheko orri finkoak. Beheko orri finkoa ikusgai dago beti, baita erabiltzailea aplikazioko beste elementu batzuk erabiltzen ari denean ere.
fa: «برگه پایانی پایدار»، اطلاعاتی را نشان می‌دهد که محتوای اولیه برنامه را تکمیل می‌کند. حتی اگر کاربر با قسمت‌های دیگر برنامه کار کند، این برگه همچنان قابل‌مشاهده خواهد بود.
fil: Ang persistent na bottom sheet ay nagpapakita ng impormasyon na dumaragdag sa pangunahing content ng app. Makikita pa rin ang persistent na bottom sheet kahit pa makipag-ugnayan ang user sa iba pang bahagi ng app.
fr_ca: Une page de contenu fixe dans le bas de l'écran affiche de l'information qui complète le contenu principal de l'application. Elle reste visible même lorsque l'utilisateur interagit avec d'autres parties de l'application.
gl: Un panel mostrado de xeito permanente na parte inferior que complementa o contido principal da aplicación. Un panel mostrado de xeito permanente na parte inferior permanece visible incluso cando o usuario interactúa con outras partes da aplicación.
gu: પર્સીસ્ટન્ટ બોટમ શીટ ઍપના મુખ્ય કન્ટેન્ટને પૂરક હોય તેવી માહિતી બતાવે છે. વપરાશકર્તા ઍપના અન્ય ભાગ સાથે ક્રિયાપ્રતિક્રિયા કરતા હોય ત્યારે પણ પર્સીસ્ટન્ટ બોટમ શીટ દેખાતી રહે છે.
he: גיליון תחתון קבוע מציג מידע שמשלים את התוכן הראשי באפליקציה. גיליון תחתון קבוע נשאר גלוי גם כשהמשתמש מבצע אינטראקציה עם חלקים אחרים באפליקציה.
hi: हमेशा दिखने वाली बॉटम शीट, ऐप्लिकेशन की मुख्य सामग्री से जुड़ी दूसरी जानकारी दिखाती है. हमेशा दिखने वाली बॉटम शीट, स्क्रीन पर तब भी दिखाई देती है, जब उपयोगकर्ता ऐप्लिकेशन में दूसरी चीज़ें देख रहा होता है.
hu: Az állandó alsó lap olyan információkat jelenít meg, amelyek kiegészítik az alkalmazás elsődleges tartalmát. Az állandó alsó lap még akkor is látható marad, amikor a felhasználó az alkalmazás más részeit használja.
hy: Ներքևի ստատիկ թերթը ցույց է տալիս հավելվածի հիմնական բաժինները։ Այսպիսի թերթը միշտ կլինի էկրանի ներքևի հատվածում (նույնիսկ այն դեպքերում, երբ օգտատերը անցնում է մեկ բաժնից մյուսը)։
id: Sheet bawah persisten akan menampilkan informasi yang melengkapi konten utama aplikasi. Sheet bawah persisten akan tetap terlihat bahkan saat pengguna berinteraksi dengan bagian lain aplikasi.
it: Un foglio inferiore permanente mostra informazioni che integrano i contenuti principali dell'app. Un foglio inferiore permanente rimane visibile anche quando l'utente interagisce con altre parti dell'app.
ja: 永続ボトムシートには、アプリのメイン コンテンツを補う情報が表示されます。永続ボトムシートは、ユーザーがアプリの他の部分を操作している場合も表示されたままとなります。
ka: მუდმივი ქვედა ფურცელი აჩვენებს ინფორმაციას, რომელიც ავსებს აპის ძირითად კონტენტს. მუდმივი ქვედა ფურცელი ხილვადია მომხმარებლის მიერ აპის სხვა ნაწილებთან ინტერაქციის დროსაც.
km: សន្លឹកខាងក្រោម​លក្ខណៈភើស៊ីស្ទើន​បង្ហាញព័ត៌មាន​ដែលបន្ថែមលើ​ខ្លឹមសារចម្បងនៃកម្មវិធី។ សន្លឹកខាងក្រោម​លក្ខណៈភើស៊ីស្ទើននៅតែអាចមើលឃើញ​ដដែល ទោះបីជានៅពេលអ្នកប្រើប្រាស់​ធ្វើអន្តរកម្ម​ជាមួយផ្នែកផ្សេងទៀតនៃ​កម្មវិធីក៏ដោយ។
kn: ಪರ್ಸಿಸ್ಟಂಟ್ ಬಾಟಮ್ ಶೀಟ್, ಆ್ಯಪ್‌ನ ಪ್ರಾಥಮಿಕ ವಿಷಯವನ್ನು ಪೂರೈಸುವ ಮಾಹಿತಿಯನ್ನು ತೋರಿಸುತ್ತದೆ. ಬಳಕೆದಾರರು ಆ್ಯಪ್‌ನ ಇತರ ಭಾಗಗಳೊಂದಿಗೆ ಸಂವಹನ ಮಾಡಿದಾಗಲೂ ಪರ್ಸಿಸ್ಟಂಟ್ ಬಾಟಮ್ ಶೀಟ್ ಗೋಚರಿಸುತ್ತದೆ.
ko: 지속적 하단 시트는 앱의 주요 콘텐츠를 보완하는 정보를 표시합니다. 또한 사용자가 앱의 다른 부분과 상호작용할 때도 계속해서 표시됩니다.
ky: Ылдый жакта жайгашкан туруктуу барак колдонмодогу негизги мазмунга кошумча маалыматты көрсөтөт. Ылдый жакта жайгашкан туруктуу барак колдонуучу колдонмонун башка бөлүмдөрүн колдонуп жатса да, ар дайым көрүнүп турат.
lo: Persistent bottom sheet ຈະສະແດງຂໍ້ມູນທີ່ເສີມເນື້ອຫາຫຼັກຂອງແອັບ. ຜູ້ໃຊ້ຈະຍັງສາມາດເບິ່ງເຫັນອົງປະກອບນີ້ໄດ້ເຖິງແມ່ນວ່າຈະໂຕ້ຕອບກັບສ່ວນອື່ນໆຂອງແອັບຢູ່ກໍຕາມ.
lt: Nuolatiniu apatinio lapo mygtuku pateikiama informacija, papildanti pagrindinį programos turinį. Nuolatinis apatinio lapo mygtukas išlieka matomas net asmeniui naudojant kitas programos dalis.
lv: Pastāvīgajā ekrāna apakšdaļā tiek rādīta informācija, kas papildina primāro lietotnes saturu. Pastāvīgā ekrāna apakšdaļa paliek redzama arī tad, kad lietotājs mijiedarbojas ar citām lietotnes daļām.
mk: Постојаниот долен лист прикажува информации што ги дополнуваат примарните содржини на апликацијата. Постојаниот долен лист останува видлив дури и при интеракцијата на корисникот со другите делови на апликацијата.
ml: ആപ്പിന്റെ പ്രാഥമിക ഉള്ളടക്കത്തിന് അനുബന്ധമായ വിവരങ്ങൾ സ്ഥിരമായ ബോട്ടം ഷീറ്റ് കാണിക്കുന്നു. ഉപയോക്താവ് ആപ്പിന്റെ മറ്റ് ഭാഗങ്ങളുമായി സംവദിക്കുമ്പോഴും സ്ഥിരമായ ഒരു ബോട്ടം ഷീറ്റ് ദൃശ്യമാകും.
mn: Тогтмол доод хүснэгт нь аппын үндсэн контентыг дэмждэг мэдээллийг харуулдаг. Тогтмол доод хүснэгт нь хэрэглэгчийг аппын бусад хэсэгтэй харилцаж байхад ч харагдсаар байдаг.
mr: सातत्यपूर्ण तळाचे शीट अ‍ॅपच्या प्राथमिक आशयाला पूरक असलेली माहिती दाखवते. वापरकर्ता अ‍ॅपच्या इतर भागांसोबत परस्परसंवाद साधत असतानादेखील सातत्यपूर्ण तळाचे शीट दृश्यमान राहते.
ms: Helaian bawah berterusan menunjukkan maklumat yang menambah kandungan utama apl. Helaian bawah berterusan tetap kelihatan walaupun semasa pengguna berinteraksi dengan bahagian lain apl.
my: မပြောင်းလဲသော အောက်ခြေမီနူးပါ စာမျက်နှာသည် အက်ပ်၏ ပင်မအကြောင်းအရာအတွက် ဖြည့်စွက်ချက်များပါဝင်သည့် အချက်အလက်များကို ပြသည်။ အသုံးပြုသူက အက်ပ်၏ အခြားအစိတ်အပိုင်းများကို အသုံးပြုနေသည့်အခါတွင်ပင် မပြောင်းလဲသော အောက်ခြေမီနူးပါ စာမျက်နှာကို မြင်နိုင်ပါမည်။
nb: Et vedvarende felt nederst viser informasjon som supplerer primærinnholdet i appen. Et vedvarende felt nederst er fremdeles synlig, selv når brukeren samhandler med andre deler av appen.
ne: सधैँ देखिइरहने फेदको पानाले एपको मुख्य सामग्रीसँग सम्बन्धित सहायक सामग्री देखाउँछ। सधैँ देखिइरहने फेदको पाना प्रयोगकर्ताले एपका अन्य भागसँग अन्तर्क्रिया गर्दा समेत देखिइरहन्छ।
pa: ਸਥਾਈ ਹੇਠਲੀ ਸ਼ੀਟ ਉਹ ਜਾਣਕਾਰੀ ਦਿਖਾਉਂਦੀ ਹੈ ਜੋ ਐਪ ਦੀ ਪ੍ਰਮੁੱਖ ਸਮੱਗਰੀ ਦੀ ਪੂਰਕ ਹੁੰਦੀ ਹੈ। ਇਹ ਸਥਾਈ ਹੇਠਲੀ ਸ਼ੀਟ ਉਦੋਂ ਤੱਕ ਦਿਖਣਯੋਗ ਰਹਿੰਦੀ ਹੈ ਜਦੋਂ ਵਰਤੋਂਕਾਰ ਐਪ ਦੇ ਹੋਰਨਾਂ ਹਿੱਸਿਆਂ ਨਾਲ ਅੰਤਰਕਿਰਿਆ ਕਰਦਾ ਹੈ।
pl: Trwała plansza dolna zawiera informacje, które dopełniają podstawową zawartość aplikacji. Plansza ta jest widoczna nawet wtedy, gdy użytkownik korzysta z innych elementów aplikacji.
pt: Uma página inferior persistente mostra informações que suplementam o conteúdo principal do app. Essa página permanece visível mesmo quando o usuário interage com outras partes do app.
pt_pt: Uma secção inferior persistente apresenta informações que complementam o conteúdo principal da aplicação. Uma secção inferior persistente permanece visível mesmo quando o utilizador interage com outras partes da aplicação.
ro: Foaia persistentă din partea de jos afișează informații care completează conținutul principal al aplicației. Foaia persistentă din partea de jos rămâne vizibilă chiar dacă utilizatorul interacționează cu alte părți alte aplicației.
ru: Постоянный нижний экран показывает дополнительную информацию в приложении. Такой экран всегда остается видимым, даже когда пользователь взаимодействует с другими разделами.
si: දිගටම පවතින පහළ පත්‍රයක් යෙදුමේ මූලික අන්තර්ගතය සපයන තොරතුරු පෙන්වයි.පරිශීලක යෙදුමේ අනෙක් කොටස් සමග අන්තර්ක්‍රියා කරන විට දිගටම පවතින පහළ පත්‍රයක් දෘශ්‍යමානව පවතී.
sk: Trvalý dolný hárok zobrazuje informácie doplňujúce hlavný obsah aplikácie. Zobrazuje sa neustále, aj keď používateľ interaguje s inými časťami aplikácie.
sq: Një fletë e poshtme e përhershme shfaq informacione që plotësojnë përmbajtjen parësore të aplikacionit. Një fletë e poshtme e përhershme mbetet e dukshme edhe kur përdoruesi bashkëvepron me pjesët e tjera të aplikacionit.
sr: Трајна доња табела приказује информације које допуњују примарни садржај апликације. Трајна доња табела остаје видљива и при интеракцији корисника са другим деловима апликације.
sr_latn: Trajna donja tabela prikazuje informacije koje dopunjuju primarni sadržaj aplikacije. Trajna donja tabela ostaje vidljiva i pri interakciji korisnika sa drugim delovima aplikacije.
sv: I ett permanent ark längst ned på skärmen visas information som kompletterar appens primära innehåll. Ett permanent ark fortsätter att visas när användaren interagerar med andra delar av appen.
te: దిగువున నిరంతరంగా ఉండే షీట్ అనేది యాప్‌లోని ప్రాధమిక కంటెంట్‌కు పూరకంగా ఉండే అనుబంధ సమాచారాన్ని చూపుతుంది. యాప్‌లోని ఇతర భాగాలతో యూజర్ ఇంటరాక్ట్ అయినప్పుడు కూడా దిగువున నిరంతర షీట్ కనపడుతుంది.
th: Persistent Bottom Sheet แสดงข้อมูลที่เสริมเนื้อหาหลักของแอป ผู้ใช้จะยังมองเห็นองค์ประกอบนี้ได้แม้จะโต้ตอบอยู่กับส่วนอื่นๆ ของแอป
tr: Sürekli görüntülenen alt sayfa, uygulamanın asıl içeriğine ek bilgileri gösterir ve kullanıcı uygulamanın diğer bölümleriyle etkileşimde bulunurken görünmeye devam eder.
uk: На постійній сторінці, що розгортається знизу, міститься супровідна інформація для основного контенту додатка. Ця сторінка відображається, навіть коли користувач взаємодіє з іншими частинами додатка.
ur: نیچے کی مستقل شیٹ ایپ کے بنیادی مواد کی اضافی معلومات دکھاتی ہے۔ جب تک صارف ایپ کے دوسرے حصوں سے تعامل کرتا ہے تب بھی نیچے کی مستقل شیٹ نظر آتی ہے۔
uz: Doimiy quyi ekranda ilovadagi qoʻshimcha maʼlumotlar chiqadi. Bunday ekran doim ochiq turadi, hatto foydalanuvchi ilovaning boshqa qismlari bilan ishlayotgan paytda ham.
vi: Bảng cố định dưới cùng hiển thị thông tin bổ sung cho nội dung chính của ứng dụng. Ngay cả khi người dùng tương tác với các phần khác của ứng dụng thì bảng cố định dưới cùng sẽ vẫn hiển thị.
zh_hk: 固定底部工作表會顯示應用程式主要內容以外的補充資訊。即使使用者與應用程式的其他部分互動，仍會看到固定底部工作表。
zu: Ishidi eliphansi eliphoqelelayo libonisa uolwazi olusekela okuqukethwe okuyinhloko kohlelo lokusebenza. Ishidi laphansi eliphoqelelayo lihlala libonakala ngisho noma umsebenzisi exhumana nezinye izingxenye zohlelo lokusebenza.

# demoBottomSheetPersistentTitle
source: Persistent bottom sheet
af: Blywende blad onder
am: ጽኑ የግርጌ ሉህ
ar_eg: البطاقة السفلية العادية
as: একেবাৰে নিম্নাংশৰ অবিৰত শ্বীট
az: Sabit alt vərəq
be: Пастаянны ніжні аркуш
bn: সব সময় দেখা যায় এমন বোটম শিট
bs: Fiksna donja tabela
ca: Full inferior persistent
da: Fast felt i bunden
es_ar: Hoja inferior persistente
et: Püsiv alumine leht
eu: Beheko orri finkoa
fa: برگه پایانی پایدار
fil: Persistent na bottom sheet
fr_ca: Page de contenu fixe dans le bas de l'écran
gl: Panel inferior que se mostra de xeito permanente
gu: પર્સીસ્ટન્ટ બોટમ શીટ
he: גיליון תחתון קבוע
hi: हमेशा दिखने वाली बॉटम शीट
hu: Állandó alsó lap
hy: Ներքևի ստատիկ թերթ
id: Sheet bawah persisten
it: Foglio inferiore permanente
ja: 永続ボトムシート
ka: მუდმივი ქვედა ფურცელი
km: សន្លឹកខាងក្រោម​លក្ខណៈភើស៊ីស្ទើន
kn: ಪರ್ಸಿಸ್ಟಂಟ್ ಬಾಟಮ್ ಶೀಟ್
ko: 지속적 하단 시트
ky: Ылдый жактагы туруктуу барак
lt: Nuolatinis apatinio lapo mygtukas
lv: Pastāvīgā ekrāna apakšdaļas izklājlapa
mk: Постојан долен лист
ml: സ്ഥിരമായ ബോട്ടം ഷീറ്റ്
mn: Тогтмол доод хүснэгт
mr: सातत्यपूर्ण तळाचे शीट
ms: Helaian bawah berterusan
my: မပြောင်းလဲသော အောက်ခြေမီနူးပါ စာမျက်နှာ
nb: Vedvarende felt nederst
ne: सधैँ देखिइरहने फेदको पाना
pa: ਸਥਾਈ ਹੇਠਲੀ ਸ਼ੀਟ
pl: Trwała plansza dolna
pt: Página inferior persistente
pt_pt: Secção inferior persistente
ro: Foaia persistentă din partea de jos
ru: Постоянный нижний экран
si: දිගටම පවතින පහළ පත්‍රය
sk: Trvalý dolný hárok
sq: Fletë e poshtme e përhershme
sr: Трајна доња табела
sr_latn: Trajna donja tabela
sv: Permanent ark på nedre delen av skärmen
te: నిరంతరం దిగువున ఉండే షీట్
tr: Sürekli görüntülenen alt sayfa
uk: Постійна сторінка, що розгортається знизу
ur: نیچے کی مستقل شیٹ
uz: Doimiy quyi ekran
vi: Bảng cố định dưới cùng
zh_hk: 固定底部工作表
zu: ishidi eliphansi eliphoqelelayo

# demoBottomSheetSubtitle
source: Persistent and modal bottom sheets
af: Blywende en modale blaaie onder
am: ጽኑ እና ሞዳል የግርጌ ሉሆች
ar_eg: البطاقات السفلية المقيِّدة والعادية
as: একেবাৰে নিম্নাংশৰ অবিৰত আৰু ম’ডাল শ্বীটসমূহ
az: Sabit və modal alt vərəqlər
be: Пастаянныя і мадальныя ніжнія аркушы
bn: সব সময় দেখা যায় এমন এবং মোডাল বটম শিট
bs: Fiksna i modalna donja tabela
ca: Pàgines modal i persistent inferiors
da: Faste og modale felter i bunden
es_ar: Hojas inferiores modales y persistentes
et: Püsivad ja modaalsed alumised lehed
eu: Beheko orri finko eta modalak
fa: برگه‌های پایانی مودال و پایدار
fil: Mga persistent at modal na bottom sheet
fr_ca: Pages de contenu flottantes et fixes dans le bas de l'écran
gl: Paneis inferiores mostrados de xeito permanente e de modo
gu: પર્સીસ્ટન્ટ અને મોડલ બોટમ શીટ
he: גיליון תחתון מודלי וקבוע
hi: हमेशा दिखने वाली और मॉडल बॉटम शीट
hu: Állandó és modális alsó lapok
hy: Ներքևի ստատիկ և մոդալ թերթեր
id: Sheet bawah persisten dan modal
it: Fogli inferiori permanenti e modali
ja: 永続ボトムシートとモーダル ボトムシート
ka: მუდმივი და მოდალური ქვედა ფურცლები
km: សន្លឹកខាងក្រោម​លក្ខណៈម៉ូដល និងភើស៊ីស្ទើន
kn: ಪರ್ಸಿಸ್ಟಂಟ್ ಮತ್ತು ಮೋಡಲ್ ಬಾಟಮ್ ಶೀಟ್‌ಗಳು
ko: 지속적 하단 시트 및 모달 하단 시트
ky: Ылдый жакта жайгашкан туруктуу жана модалдык барактар
lo: Persistent ແລະ modal bottom sheets
lt: Nuolatinis ir modalinis apatinio lapo mygtukai
lv: Pastāvīgā un modālā ekrāna apakšdaļa
mk: Постојан и модален долен лист
ml: സ്ഥിരമായ, മോഡൽ ബോട്ടം ഷീറ്റുകൾ
mn: Тогтмол болон зайлшгүй харилцах доод хүснэгт
mr: सातत्यपूर्ण आणि मोडल तळाची पत्रके
ms: Helaian bawah mod dan berterusan
my: မပြောင်းလဲသော အောက်ခြေမီနူးပါ စာမျက်နှာပုံစံများ
nb: Vedvarende felt og modalfelt nederst
ne: सधैँ देखिइरहने र मोडल नामक फेदका पानाहरू
pa: ਸਥਾਈ ਅਤੇ ਮਾਡਲ ਹੇਠਲੀ ਸ਼ੀਟ
pl: Trwałe i modalne plansze dolne
pt: Páginas inferiores persistente e modal
pt_pt: Secções inferiores persistentes e modais
ro: Foile persistente și modale din partea de jos
ru: Постоянный и модальный нижние экраны
si: දිගටම පවතින සහ ආදර්ශ පහළ පත්‍ර
sk: Trvalé a modálne dolné hárky
sq: Fletët e përkohshme dhe modale të poshtme
sr: Трајне и модалне доње табеле
sr_latn: Trajne i modalne donje tabele
sv: Permanent och modalt ark på nedre delen av skärmen
te: స్థిరమైన నమూనా దిగువున ఉండే షిట్‌లు
th: Persistent และ Modal Bottom Sheet
tr: Sürekli ve kalıcı alt sayfalar
uk: Постійна й модальна сторінки, що розгортаються знизу
ur: نیچے کی مستقل اور موڈل شیٹس
uz: Doimiy va modal quyi ekranlar
vi: Bảng cách điệu và bảng cố định dưới cùng
zh_hk: 固定及強制回應底部工作表
zu: Amashidi waphansi aphoqelelayo nawe-modal

# demoTextFieldNameHasPhoneNumber
source: {name} phone number is {phoneNumber}
af: {name} se foonnommer is {phoneNumber}
am: የ{name} ስልክ ቁጥር {phoneNumber} ነው
ar_eg: رقم هاتف {name} هو {phoneNumber}.
as: {name}ৰ ফ’ন নম্বৰটো হৈছে {phoneNumber}
az: {name} telefon nömrəsi: {phoneNumber}
be: Нумар тэлефона карыстальніка {name}: {phoneNumber}
bn: {name} ফোন নম্বর হল {phoneNumber}
bs: Broj telefona korisnika {name} je {phoneNumber}
ca: El número de telèfon de {name} és {phoneNumber}
da: Telefonnummeret til {name} er {phoneNumber}
es_ar: El número de teléfono de {name} es {phoneNumber}
et: Kontakti {name} telefoninumber on {phoneNumber}
eu: {name} erabiltzailearen telefono-zenbakia {phoneNumber} da
fa: شماره تلفن {name} ‏{phoneNumber} است
fil: Ang numero ng telepono ni/ng {name} ay {phoneNumber}
fr_ca: Le numéro de téléphone de {name} est le {phoneNumber}
gl: O número de teléfono de {name} é o {phoneNumber}
gu: {name} ફોન નંબર {phoneNumber} છે
he: מספר הטלפון של {name} הוא {phoneNumber}
hi: {name} का फ़ोन नंबर {phoneNumber} है
hu: {name} telefonszáma: {phoneNumber}
hy: {name}՝ {phoneNumber}
id: Nomor telepon {name} adalah {phoneNumber}
it: Il numero di telefono di {name} è {phoneNumber}
ja: {name} さんの電話番号は {phoneNumber} です
ka: {name} ტელეფონის ნომერია {phoneNumber}
km: លេខទូរសព្ទ​របស់ {name} គឺ {phoneNumber}
kn: {name} ಅವರ ಫೋನ್ ಸಂಖ್ಯೆ {phoneNumber} ಆಗಿದೆ
ko: {name}의 전화번호는 {phoneNumber}입니다.
ky: {name} телефон номери {phoneNumber}
lo: ເບີໂທລະສັບຂອງ {name} ແມ່ນ {phoneNumber}
lt: {name} telefono numeris: {phoneNumber}
lv: {name} tālruņa numurs ir {phoneNumber}
mk: Телефонскиот број на {name} е {phoneNumber}
ml: {name} എന്ന വ്യക്തിയുടെ ഫോൺ നമ്പർ {phoneNumber} ആണ്
mn: {name}-н утасны дугаар {phoneNumber}
mr: {name} फोन नंबर {phoneNumber} आहे
ms: Nombor telefon {name} ialah {phoneNumber}
my: {name} ၏ ဖုန်းနံပါတ်သည် {phoneNumber}
nb: Telefonnummeret til {name} er {phoneNumber}
ne: {name} को फोन नम्बर {phoneNumber} हो
pa: {name} ਦਾ ਫ਼ੋਨ ਨੰਬਰ {phoneNumber} ਹੈ
pl: {name} ma następujący numer telefonu: {phoneNumber}
pt: O número de telefone de {name} é {phoneNumber}
pt_pt: O número de telefone de {name} é {phoneNumber}.
ro: Numărul de telefon al persoanei de contact {name} este {phoneNumber}
ru: {name}: {phoneNumber}
si: {name} දුරකථන අංකය {phoneNumber}
sk: Telefónne číslo používateľa {name} je {phoneNumber}
sq: Numri i telefonit të {name} është {phoneNumber}
sr: {name} има број телефона {phoneNumber}
sr_latn: {name} ima broj telefona {phoneNumber}
sv: Telefonnumret till {name} är {phoneNumber}
te: {name} యొక్క ఫోన్ నంబర్ {phoneNumber}
th: หมายเลขโทรศัพท์ของ {name} คือ {phoneNumber}
tr: {name} adlı kişinin telefon numarası: {phoneNumber}
uk: Номер телефону користувача {name}: {phoneNumber}
ur: {name} کا فون نمبر {phoneNumber} ہے
uz: {name} telefoni raqami: {phoneNumber}
vi: Số điện thoại của {name} là {phoneNumber}
zh_hk: {name}的電話號碼是 {phoneNumber}
zu: {name} inombolo yefoni ngu-{phoneNumber}

# buttonText
source: BUTTON
af: KNOPPIE
am: አዝራር
ar_eg: زر
as: বুটাম
az: DÜYMƏ
be: КНОПКА
bn: বোতাম
bs: DUGME
ca: BOTÓ
da: KNAP
es_ar: BOTÓN
et: NUPP
eu: BOTOIA
fa: دکمه
fr_ca: BOUTON
gl: BOTÓN
gu: બટન
he: לחצן
hi: बटन
hu: GOMB
hy: ԿՈՃԱԿ
id: TOMBOL
it: PULSANTE
ja: ボタン
ka: ღილაკი
km: ប៊ូតុង
kn: ಬಟನ್
ko: 버튼
ky: БАСКЫЧ
lo: ປຸ່ມ
lt: MYGTUKAS
lv: POGA
mk: КОПЧЕ
ml: ബട്ടൺ
mn: ТОВЧЛУУР
mr: बटण
ms: BUTANG
my: ခလုတ်
nb: KNAPP
ne: बटन
pa: ਬਟਨ
pl: PRZYCISK
pt: BOTÃO
pt_pt: BOTÃO
ro: BUTON
ru: КНОПКА
si: බොත්තම
sk: TLAČIDLO
sq: BUTONI
sr: ДУГМЕ
sr_latn: DUGME
sv: KNAPP
te: బటన్
th: ปุ่ม
tr: DÜĞME
uk: КНОПКА
ur: بٹن
uz: TUGMA
vi: NÚT
zh_hk: 按鈕
zu: INKINOBHO
