Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demo2dTransformationsDescription
source: Tap to edit tiles, and use gestures to move around the scene. Drag to pan and pinch with two fingers to zoom. Press the reset button to return to the starting orientation.
af: Tik om teëls te wysig en gebruik gebare om op die toneel rond te beweeg. Sleep om te beeldrol, knyp om te zoem, gebruik twee vingers om te draai. Druk die terugstellingknoppie om na die aanvanklike oriëntasie terug te keer.
am: ስድሮችን አርትዕ ለማድረግ መታ ያድርጉ እና በትዕይንቱ አካባቢ ለማንቀሳቀስ የእጅ ውዝዋዜዎችን ይጠቀሙ። ለማንፏቀቅ ይጎትቱ፣ ለማጉላት ይቆንጥጡ፣ በሁለት ጣቶች ያሽከርክሩ። ወደ ማስጀመሪያው አቀማመጥ ለመመለስ የዳግም አቀናብር አዝራሩን ይጫኑ።
ar_eg: انقر لتعديل المربّعات واستخدام الإيماءات للتنقل خلال المشهد. اسحب لتنفيذ العرض الشامل وحرّك إصبعيك للتكبير/التصغير ويمكنك التدوير بإصبعين. اضغط على زر إعادة الضبط للرجوع إلى الاتجاه الأصلي.
as: টাইলসমূহ সম্পাদনা কৰিবলৈ টিপক আৰু দৃশ্যটো সকলোফালে চাবলৈ নিৰ্দেশসমূহ ব্যৱহাৰ কৰক। পেন কৰিবলৈ টানি আনি এৰক, জুম কৰিবলৈ পিঞ্চ কৰক, দুটা আঙুলিৰে ৰ’টেট কৰক। আৰম্ভণিৰ দিশটোলৈ উভতি যাবলৈ ৰিছেট বুটামটো টিপক।
az: Lövhəciklərə düzəliş etmək üçün toxunun və kadrı çevirmək üçün jestlərdən istifadə edin. Çəkərək kənarları yığın, barmaqları birləşdirərək miqyası dəyişin, iki barmaqla fırladın. Başlanğıc oriyentasiyaya qayıtmaq üçün sıfırlama düyməsini basın.
be: Націсніце, каб змяніць пліткі, і выкарыстоўвайце жэсты, каб перамяшчацца па паверхні. Перацягніце, каб зрушыць, зводзьце і разводзьце пальцы для змянення маштабу, паварочвайце двума пальцамі. Націсніце кнопку скіду, каб вярнуцца да першапачатковага становішча.
bn: টাইল এডিট করতে ট্যাপ করুন এবং দৃশ্যের আশেপাশে সরানোর জন্য জেসচার ব্যবহার করুন। প্যানে টেনে আনুন, জুম করতে পিঞ্চ করুন এবং দুটি আঙ্গুল ব্যবহার করে ঘোরান। শুরুর ওরিয়েন্টেশনে ফিরে আসার জন্য 'আবার সেট করুন' বোতামে প্রেস করুন।
bs: Dodirnite da uredite naslove i koristite pokrete da se krećete po prizoru. Povucite da pomičete, uhvatite prstima da zumirate, rotirajte s dva prsta. Pritisnite dugme za poništavanje da se vratite na početnu orijentaciju.
ca: Toca per editar mosaics i fes servir gestos per moure't per l'escena. Arrossega per obtenir una panoràmica, pinça per fer zoom i gira amb dos dits. Prem el botó de restabliment per tornar a l'orientació inicial.
da: Tryk for at redigere felter, og brug bevægelser til at navigere rundt i motivet. Træk for at panorere, knib fingrene sammen for at zoome, og roter ved hjælp af to fingre Tryk på knappen til nulstilling for at gå tilbage til den oprindelige retning.
es_ar: Presiona para editar mosaicos y usa los gestos para moverte en la escena. Arrastra el dedo para desplazarte lateralmente, pellizca para hacer zoom o usa dos dedos para rotar. Presiona el botón restablecer para volver a la orientación inicial.
et: Puudutage paanide muutmiseks ja kasutage stseenis liikumiseks liigutusi. Lohistage paanimiseks, liigutage sõrmi suumimiseks kokku-lahku, pöörake kahe sõrmega. Algsesse suunda naasmiseks vajutage lähtestusnuppu.
eu: Sakatu hau lauzak editatzeko eta erabili keinuak eszenaren barruan mugitzeko. Arrastatu mugitzeko, atximurkatu zooma aplikatzeko eta erabili bi hatz biratzeko. Hasierako orientaziora itzultzeko, sakatu berrezartzeko botoia.
fa: برای ویرایش کاشی‌ها ضربه بزنید و از اشاره‌ها برای حرکت کردن در صحنه استفاده کنید. برای حرکت دادن بکشید، برای بزرگ‌نمایی انگشتان را نزدیک یا دور کنید، و با دو انگشت بچرخانید. برای برگشتن به جهت ابتدایی، دکمه بازنشانی را فشار دهید.
fil: I-tap para i-edit ang mga tile, at gumamit ng mga galaw para magpalipat-lipat ng lugar. I-drag para i-pan, i-pinch para i-zoom, i-rotate gamit ang dalawang daliri. Pindutin ang button na i-reset para bumalik sa panimulang oryentasyon.
fr_ca: Touchez pour modifier des tuiles et utilisez des gestes pour vous déplacer dans la scène. Faites glisser un doigt pour faire un panoramique, pincez l'écran pour zoomer et faites pivoter un élément avec deux doigts. Appuyez sur le bouton de réinitialisation pour retourner à l'orientation de départ.
gl: Toca para editar os mosaicos e utiliza xestos para moverte pola escena. Arrastra para desprazarte, belisca para usar o zoom e xira con dous dedos. Toca o botón de restablecer para volver á orientación inicial.
gu: ટાઇલમાં ફેરફાર કરવા માટે ટૅપ કરો અને દૃશ્યની આસપાસ ફરવા માટે સંકેતનો ઉપયોગ કરો. પૅન કરવા ખેંચો, નાનું-મોટું કરવા માટે પિન્ચ કરો, બે આંગળીઓથી ફેરવો. પ્રારંભિક ઓરિએન્ટેશન પર પાછા ફરવા માટે રીસેટ કરો બટન દબાવો.
he: יש להקיש כדי לערוך אריחים, ויש להשתמש בתנועות כדי לנוע בסביבה. יש לגרור כדי להזיז, לעשות תנועת צביטה כדי לשנות את מרחק התצוגה, לסובב עם שתי אצבעות. יש ללחוץ על לחצן האיפוס כדי לחזור לכיוון ההתחלתי.
hi: टाइल में बदलाव करने के लिए टैप करें. साथ ही, सीन पर इधर-उधर जाने के लिए हाथ के जेस्चर (हाव-भाव) का इस्तेमाल करें. पैन करने के लिए खींचकर छोड़ें और ज़ूम करने के लिए पिंच करें. साथ ही, दो उंगलियों की मदद से स्क्रीन घुमाएं. स्क्रीन को शुरुआती दिशा पर वापस लाने के लिए रीसेट बटन दबाएं.
hu: A mozaikok szerkesztéséhez koppintson, a jelenetben való mozgáshoz pedig használjon kézmozdulatokat. Húzza ujját a pásztázáshoz, húzza össze ujjait a nagyításhoz/kicsinyítéshez, és használja két ujját a forgatáshoz. Nyomja meg a visszaállítás gombot a kezdő tájoláshoz való visszatéréshez.
hy: Հպեք՝ սալիկները փոփոխելու համար։ Համայնապատկերումը կառավարեք ժեստերի միջոցով։ Մասշտաբը կարգավորելու համար կարող եք մոտեցնել կամ հեռացնել մատները։ Երկու մատների օգնությամբ կարող եք նաև պտտել օբյեկտը։ Սկզբնական պարամետրերին վերադառնալու համար սեղմեք վերակայման կոճակը։
id: Ketuk untuk mengedit potongan foto, dan gunakan gestur untuk berpindah antar-adegan. Tarik untuk menggeser, cubit untuk zoom, putar dengan dua jari. Tekan tombol reset untuk kembali ke orientasi awal.
it: Tocca per modificare i riquadri e usa i gesti per spostarti nella scena. Trascina per la panoramica, pizzica per lo zoom e ruota con due dita. Premi il pulsante di ripristino per tornare all'orientamento iniziale.
ja: タイルを編集するにはタップし、シーンを移動するにはジェスチャーを使用します。パン、ピンチ操作、ズーム、回転するには、2 本の指でドラッグします。最初の向きに戻すには、リセットボタンを押します。
ka: შეეხეთ ბლოკების დასარედაქტირებლად და გამოიყენეთ ჟესტები სცენის ფარგლებში გადასაადგილებლად. პანირებისთვის ჩაავლეთ, მასშტაბირებისთვის თითებით მოუჭირეთ, შეატრიალეთ ორი თითით. საწყის ორიენტაციაზე დასაბრუნებლად დააჭირეთ გადაყენების ღილაკს.
km: ចុច​ដើម្បី​កែប្រអប់ និង​ប្រើចលនា ដើម្បី​ផ្លាស់ទី​ជុំវិញ​ទិដ្ឋភាព។ ចុចអូស ច្បិចដើម្បី​ពង្រីកបង្រួម បង្វិល​ដោយប្រើ​ម្រាមដៃពីរ។ ចុច​ប៊ូតុង​កំណត់​ឡើងវិញ ដើម្បី​ត្រឡប់ទៅ​ទិស​ចាប់ផ្ដើមវិញ។
kn: ಟೈಲ್‌ಗಳನ್ನು ಎಡಿಟ್ ಮಾಡಲು ಟ್ಯಾಪ್ ಮಾಡಿ ಮತ್ತು Tದೃಶ್ಯದ ಸುತ್ತಲೂ ಚಲಿಸಲು ಸ್ಪರ್ಶ ಗೆಸ್ಚರ್‌ಗಳನ್ನು ಬಳಸಿ. ವಸ್ತುವನ್ನು ಪ್ಯಾನ್ ಮಾಡಲು ಎಳೆಯಿರಿ, ಝೂಮ್ ಮಾಡಲು ಪಿಂಚ್ ಮಾಡಿ ಮತ್ತು ತಿರುಗಿಸಲು ಎರಡು ಬೆರಳುಗಳಿಂದ ಸರಿಸಿ. ಆರಂಭಿಕ ಓರಿಯಂಟೇಶನ್‌ಗೆ ಹಿಂತಿರುಗಲು ಮರುಹೊಂದಿಸಿ ಬಟನ್ ಅನ್ನು ಒತ್ತಿರಿ.
ko: 탭하여 타일을 수정하고 동작으로 화면에서 이동하세요. 드래그하여 화면 간에 이동하고 손가락을 모으거나 펼쳐 확대/축소하거나 두 손가락을 사용하여 회전하세요. 재설정 버튼을 누르면 시작한 방향으로 돌아갑니다.
ky: Мозаиканы түзөтүү үчүн таптап, көрүнүштөрдү жаңсап жылдырыңыз. Жылдырып кароо үчүн сүйрөңүз, чоңойтуп/кичирейтүү үчүн эки манжаңызды бириктириңиз жана эки манжаңыз менен буруңуз. Баштапкы багытка кайтаруу үчүн "Баштапкы абалга келтирүү" баскычын басыңыз.
lo: ແຕະເພື່ອແກ້ໄຂແຜ່ນ ແລະ ໃຊ້ທ່າທາງເພື່ອຍ້າຍໄປມາໃນສາກ. ລາກເພື່ອເລື່ອນ, ຖ່າງເພື່ອຊູມ, ໝຸນດ້ວຍສອງນິ້ວ. ກົດປຸ່ມຣີເຊັດເພື່ອກັບໄປຫາທິດທາງການເລີ່ມຕົ້ນ.
lt: Palieskite, kad redaguotumėte išklotinės elementus, ir naudokite gestus, kad galėtumėte judėti. Vilkite, kad pastumtumėte, suimkite, kad pakeistumėte mastelį, pasukite dviem pirštais. Paspauskite nustatymo iš naujo mygtuką, kad grįžtumėte į pradinę orientaciją.
lv: Pieskarieties, lai rediģētu elementus, un izmantojiet žestus, lai pārvietotos. Velciet, lai izmantotu pārvietošanu; savelciet pirkstus, lai izmantotu tālummaiņu; veiciet pagriešanu ar diviem pirkstiem. Nospiediet atiestatīšanas pogu, lai atgrieztos pie sākotnējā virziena.
mk: Допрете за да изменувате наслови и да користите движења за движење низ сцената. Повлечете за движење, штипнете за зумирање, ротирајте со два прста. Притиснете го копчето за ресетирање за да се вратите на стартната ориентација.
ml: ടൈലുകൾ എഡിറ്റ് ചെയ്യാൻ ടാപ്പ് ചെയ്യുക, ഒപ്പം സീനിന് ചുറ്റും നീക്കുന്നതിന് വിരൽചലനങ്ങൾ ഉപയോഗിക്കുക. പാൻ ചെയ്യാൻ വലിച്ചിടുക, സൂം ചെയ്യാൻ പിഞ്ച് ചെയ്യുക, രണ്ട് വിരലുകൾ ഉപയോഗിച്ച് റൊട്ടേറ്റ് ചെയ്യുക. ആരംഭ ഓറിയന്റേഷനിലേക്ക് മടങ്ങാൻ റീസെറ്റ് ബട്ടൺ അമർത്തുക.
mn: Хавтанг засахын тулд товшиж, үзэгдлийг нааш цааш нь зөөхийн тулд зангаа ашиглана уу. Чиглүүлэхийн тулд чирч, томруулахын тулд чимхэж, хоёр хуруугаараа эргүүлнэ үү. Эхэлж буй чиглэл рүү буцахын тулд шинэчлэх товчлуурыг дарна уу.
mr: टाइल संपादित करण्यासाठी टॅप करा आणि देखाव्याभोवती फिरण्यासाठी जेश्चर वापरा. पॅन करण्यासाठी ड्रॅग करा, झूम करण्यासाठी पिंच करा, दोन बोटांनी फिरवा. सुरुवातीच्या ओरिएंटेशनवर पुन्हा जाण्यासाठी रीसेट बटण प्रेस करा.
ms: Ketik untuk mengedit jubin dan gunakan gerak isyarat untuk bergerak di sekitar latar. Seret untuk menyorot, cubit untuk mengezum, putar menggunakan dua jari. Tekan butang tetapkan semula untuk kembali ke orientasi permulaan.
my: လေးထောင့်ကွက်များကို တည်းဖြတ်ရန်တို့ပြီး မြင်ကွင်းတစ်လျှောက် ရွှေ့ရန် လက်ဟန်များကို အသုံးပြုပါ။ ရွှေ့ရန် ဖိဆွဲပါ၊ ချဲ့ရန် လက်နှစ်ချောင်းဖြင့် ထိ၍ခွာလိုက်ပါ၊ လက်နှစ်ချောင်းဖြင့် လှည့်ပါ။ မူရင်းအနေအထားသို့ ပြန်သွားရန် ပြင်ဆင်သတ်မှတ်ခြင်းခလုတ်ကို နှိပ်ပါ။
nb: Trykk for å endre infobrikker, og bruk bevegelser til å navigere rundt på skjermen. Dra for å panorere, klyp for å zoome, rotér med to fingre. Trykk på tilbakestillingsknappen for å gå tilbake til opprinnelig retning.
ne: टाइलहरू सम्पादन गर्न ट्याप गर्नुहोस् र दृश्यको वरिपरि घुम्न इसाराहरूको प्रयोग गर्नुहोस्। प्यान गर्न ड्र्याग गर्नुहोस्, जुम गर्न पिन्च गर्नुहोस्, दुईवटा औँलाले घुमाउनुहोस्। सुरु गर्ने अभिमुखीकरणमा फर्कन रिसेट गर्नुहोस् नामक बटन थिच्नुहोस्।
pa: ਟਾਇਲਾਂ ਦਾ ਸੰਪਾਦਨ ਕਰਨ ਲਈ ਟੈਪ ਕਰੋ ਅਤੇ ਦ੍ਰਿਸ਼ ਨੂੰ ਇੱਧਰ-ਉੱਧਰ ਘੁਮਾਉਣ ਲਈ ਇਸ਼ਾਰਿਆਂ ਦੀ ਵਰਤੋਂ ਕਰੋ। ਪੈਨ ਕਰਨ ਲਈ ਘਸੀਟੋ, ਜ਼ੂਮ ਕਰਨ ਲਈ ਚੂੰਢੀ ਭਰੋ, ਦੋ ਉਂਗਲਾਂ ਨਾਲ ਘੁਮਾਓ। ਸ਼ੁਰੂਆਤੀ ਦਿਸ਼ਾਮਾਨ 'ਤੇ ਵਾਪਸ ਜਾਣ ਲਈ 'ਰੀਸੈੱਟ ਕਰੋ' ਬਟਨ ਨੂੰ ਦਬਾਓ।
pl: Klikaj kafelki, by je edytować, i używaj gestów, by poruszać się po scenie. Przeciągnij palcem, by przesunąć widok, ściągnij palce do siebie, by go powiększyć, i przesuń dwoma palcami, by go obrócić. Naciśnij przycisk resetowania, by wrócić do widoku początkowego.
pt: Toque para editar blocos e use gestos para se mover pela cena. Arraste para se movimentar, faça um gesto de pinça para aplicar o zoom e gire com dois dedos. Pressione o botão de redefinição para voltar à orientação inicial.
pt_pt: Toque para editar mosaicos e utilize gestos para se mover no cenário. Arraste para deslocar, junte ou afaste os dedos para fazer zoom e rode com dois dedos. Prima o botão de reposição para voltar à orientação inicial.
ro: Atingeți pentru a edita filele și folosiți gesturi pentru a deplasa cadrul. Trageți pentru a deplasa, ciupiți pentru a mări sau micșora, rotiți cu două degete. Apăsați butonul de resetare pentru a reveni la orientarea inițială.
ru: Нажмите, чтобы изменить элементы. Для панорамирования используйте перетаскивание. Чтобы настроить масштаб, сведите или разведите пальцы. Вы также можете поворачивать объект двумя пальцами. Чтобы вернуться к исходным параметрам, нажмите кнопку сброса.
si: ටයිල් සංස්කරණය කිරීමට තට්ටු කරන්න, එමෙන්ම දර්ශනය වටා ගෙන යාමට ඉංගිත භාවිත කරන්න. පෑන් කිරීමට අදින්න, විශාලනය කිරීමට කොනහන්න, ඇඟිලි දෙකින් කරකවන්න ආරම්භක දිශානතිය වෙත ආපසු යාමට යළිි සැකසීමේ බොත්තම ඔබන්න.
sk: Klepnutím upavujte dlaždice a gestami sa pohybujte po okolí. Posúvajte presunutím, približujte stiahnutím prstov a otáčajte dvoma prstami. Na začiatočnú orientáciu sa vrátite stlačením tlačidla Resetovať.
sq: Trokit për të modifikuar pllakëzat dhe përdor gjestet për të lëvizur në skenë. Zvarrit për ta zgjeruar, afro gishtat për ta zmadhuar, rrotulloje me dy gishta. Shtyp butonin "Rivendos" për t'u kthyer tek orientimi fillestar.
sr: Додирните да бисте изменили делове слике и користите покрете да бисте се кретали по сцени. Превуците да бисте померали, скупите прсте да бисте зумирали и ротирајте помоћу два прста. Притисните дугме за ресетовање да бисте се вратили на почетни положај.
sr_latn: Dodirnite da biste izmenili delove slike i koristite pokrete da biste se kretali po sceni. Prevucite da biste pomerali, skupite prste da biste zumirali i rotirajte pomoću dva prsta. Pritisnite dugme za resetovanje da biste se vratili na početni položaj.
sv: Tryck för att redigera ramar och använd rörelser för att navigera i bilden. Dra för att panorera, rotera och nypa för att zooma in med två fingrar. Återgå till startriktningen genom att trycka på återställningsknappen.
te: టైల్‌లను ఎడిట్ చేయడానికి ట్యాప్ చేయండి, సీన్ చుట్టూ తిరగడానికి సంజ్ఞలను ఉపయోగించండి. ప్యాన్ చేయడానికి లాగి, జూమ్ చేయడానికి వేళ్లతో స్క్రీన్‌ను నియంత్రించి, రెండు వేళ్లతో తిప్పండి. ప్రారంభ ఓరియంటేషన్‌కు తిరిగివెళ్లడానికి రీసెట్ బటన్‌ను నొక్కండి.
th: แตะเพื่อแก้ไขชิ้นส่วนแล้วใช้ท่าทางสัมผัสเพื่อเคลื่อนไหวไปรอบๆ ฉาก ใช้ 2 นิ้วลากเพื่อเลื่อน บีบเพื่อซูม หมุน กดปุ่มรีเซ็ตเพื่อกลับไปที่การวางแนวเริ่มต้น
tr: Blokları düzenlemek için dokunun ve sahnede farklı yerlere taşımak için hareketleri kullanın. Kaydırmak için sürükleyin, yakınlaştırmak için sıkıştırın, iki parmağınızla döndürün. Başlangıç yönüne geri döndürmek için sıfırlama düğmesine basın.
uk: Натисніть, щоб змінити мозаїки, і використовуйте жести, щоб рухати кадр. Потягніть, щоб панорамувати, стисніть пальці, щоб змінити масштаб, обертайте двома пальцями. Щоб повернути початкову орієнтацію, натисніть кнопку "Скинути".
ur: ٹائلز میں ترمیم کرنے کے ليے تھپتھپائیں اور منظر کے ارد گرد گھومنے کے ليے اشاروں کا استعمال کریں۔ پین کرنے کے ليے گھسیٹیں، زوم کرنے کے ليے پِنچ کریں، دو انگلیوں سے گھمائیں۔ شروعاتی سمت بندی پر واپس جانے کے لیے ری سیٹ بٹن دبائیں۔
uz: Katakchalarni tahrirlash uchun bosing va sahnalarga surish uchun ishoralardan foydalaning. Panoramalash uchun suring, miqyosni oʻzgartirish uchun chimding, ikkita barmoq yordamida buring. Dastlabki joylashuviga qaytarish uchun tiklash tugmasini bosing.
vi: Nhấn để chỉnh sửa thẻ thông tin rồi dùng cử chỉ để di chuyển xung quanh cảnh. Kéo để di chuyển, chụm để thu phóng, xoay bằng 2 ngón tay. Nhấn nút đặt lại để trở về hướng bắt đầu.
zh_hk: 輕按以編輯圖塊，並使用手勢在場景中移動。以拖曳進行平移，用兩指縮放，並以兩隻手指旋轉。按一下重設按鈕即可返回原來的定向。
zu: Thepha ukuze uhlele amathayela, futhi usebenzise ukuthinta ukuze uzulazule esigcawini. Hudula ukuze unyakazise, nciza ukuze usondeze, phendukisa ngeminwe emibili. Cindezela inkinobho yokusetha kabusha ukuze ubuyele ekuqaleni komumo wesikrini.

# demo2dTransformationsSubtitle
source: Pan and zoom
af: Beeldrol, zoem en draai
am: ማንፏቀቅ፣ ማጉላት፣ ማሽከርከር
ar_eg: عرض شامل، تكبير/تصغير، تدوير
as: পেন, জুম, ৰ’টেট
az: Kənarları yığma, miqyası dəyişmə, fırlatma
be: Зрушыць, змяніць маштаб, павярнуць
bn: প্যান, জুম, ঘোরান
bs: Pomičite, zumirajte, rotirate
ca: Panoràmica, zoom i rotació
da: Panorer, zoom og roter
es_ar: Desplazamiento lateral, zoom y rotación
et: Paanimine, suumimine, pööramine
eu: Mugitu, aplikatu zooma eta biratu
fa: حرکت دادن، بزرگ‌نمایی کردن، چرخاندن
fil: I-pan, i-zoom, i-rotate
fr_ca: Panoramique, zoom, rotation
gl: Despraza, usa o zoom e xira
gu: પૅન કરો, નાનું-મોટું કરો, ફેરવો
he: הזזה, שינוי מרחק התצוגה, סיבוב
hi: पैन करना, ज़ूम करना, और घुमाना
hu: Pásztázás, nagyítás/kicsinyítés, forgatás
hy: Համայնապատկերում, մասշտաբավորում, պտտում
id: Geser, zoom, putar
it: Panoramica, zoom ruota,
ja: パン、ズーム、回転
ka: პანირება, მასშტაბირება, შეტრიალება
km: អូស ពង្រីក​បង្រួម បង្វិល
kn: ಪ್ಯಾನ್‌, ಝೂಮ್, ತಿರುಗಿಸಿ
ko: 이동, 확대/축소, 회전
ky: Жылдырып кароо, чоңойтуп/кичирейтүү, буруу
lo: ເລື່ອນ, ຊູມ, ໝຸນ
lt: Stumdymas, mastelio keitimas, pasukimas
lv: Pārvietošana, tālummaiņa, pagriešana
mk: Движење, зумирање, ротирање
ml: പാൻ ചെയ്യുക, സൂം ചെയ്യുക, റൊട്ടേറ്റ് ചെയ്യുക
mn: Чиглүүлэх, томруулах, эргүүлэх
mr: पॅन करा, झूम करा, फिरवा
ms: Sorot, zum, putar
my: ရွှေ့၊ ချဲ့၊ လှည့်
nb: Panorer, zoom, rotér
ne: प्यान गर्नु, जुम गर्नु, घुमाउनु
pa: ਪੈਨ ਕਰਨਾ, ਜ਼ੂਮ ਕਰਨਾ, ਘੁਮਾਉਣਾ
pl: Przesunięcie, powiększenie, obrót
pt: Movimentar, aplicar zoom, girar
pt_pt: Desloque, faça zoom e rode.
ro: Deplasați, măriți/micșorați, rotiți
ru: Панорамирование, масштабирование и поворот
si: පෑන් කරන්න, විශාලනය කරන්න, කරකවන්න
sk: Posunutie, priblíženie a otočenie
sq: Zgjero, zmadho, rrotullo
sr: Померање, зумирање, ротирање
sr_latn: Pomeranje, zumiranje, rotiranje
sv: Panorera, zooma, rotera
te: ప్యాన్ చేయండి, జూమ్ చేయండి, తిప్పండి
th: เลื่อน ซูม หมุน
tr: Kaydırma, yakınlaştırma, döndürme
uk: Панорамування, масштаб, обертання
ur: پین کریں، زوم کریں، گھمائیں
uz: Panorama, masshtab, burish
vi: Dịch chuyển, thu phóng, xoay
zh_hk: 平移、縮放、旋轉
zu: Nyakaza, sondeza, phendukisa

# demo2dTransformationsTitle
source: 2D transformations
af: 2D-transformasies
am: 2ል ቅየራዎች
ar_eg: التحويلات الثنائية الأبعاد
as: 2D ৰূপান্তৰণসমূহ
az: 2D transformasiya
be: Двухмерныя пераўтварэнні
bn: 2D ট্রান্সফর্মেশন
bs: 2D transformacije
ca: Transformacions 2D
da: 2D-transformationer
es_ar: Transformaciones en 2D
et: 2D-teisendamised
eu: 2D bihurketak
fa: تبدیل دوبعدی
fil: Mga 2D na pagbabago
fr_ca: Transformations 2D
gl: Transformacións 2D
gu: 2D રૂપાંતરણો
he: טרנספורמציות דו-ממדיות
hi: 2D ट्रांसफ़र्मेशन
hu: 2D-s átalakítások
hy: 2D փոխակերպումներ
id: Transformasi 2D
it: Trasformazioni 2D
ja: 2D 変換
ka: 2D გარდაქმნები
km: ការបំប្លែង​ទម្រង់ 2D
kn: 2D ಪರಿವರ್ತನೆಗಳು
ko: 2D 변환
ky: 2D өзгөрүүлөрү
lo: ການປັບປ່ຽນ 2 ມິຕິ
lt: 2D transformacijos
lv: 2D pārveidošana
mk: 2D-трансформации
ml: 2D പരിവർത്തനം
mn: 2D хэлбэр өөрчлөлт
mr: 2D रुपांतरे
ms: Transformasi 2D
my: 2D အသွင်ပြောင်းခြင်းများ
nb: 2D-transformasjoner
ne: 2D रूपान्तरणहरू
pa: 2D ਰੂਪਾਂਤਰਨ
pl: Przekształcenia 2D
pt: Transformações 2D
pt_pt: Transformações 2D
ro: Transformări 2D
ru: 2D-трансформации
si: 2D පරිණාමනය කිරීම්
sk: 2D transformácie
sq: Transformimet 2D
sr: 2D трансформације
sr_latn: 2D transformacije
sv: 2D-transformationer
te: 2D పరివర్తనాలు
th: การเปลี่ยนรูปแบบ 2 มิติ
tr: 2D dönüşümler
uk: Двовимірні трансформації
ur: 2D ٹرانسفارمیشنز
uz: 2D transformatsiya
vi: Phép biến đổi 2D
zh_hk: 2D 變形
zu: 2D ukuguqula

# demoCupertinoTextFieldPIN
source: PIN
am: ፒን
ar_eg: رقم التعريف الشخصي
as: পিন
be: PIN-код
bn: পিন
da: Pinkode
et: PIN-kood
eu: PINa
fa: پین
fr_ca: NIP
gu: પિન
he: קוד אימות
hi: पिन
hu: PIN-kód
hy: PIN կոդ
ka: PIN-კოდი
km: កូដ PIN
kn: ಪಿನ್
ky: PIN код
lt: PIN kodas
ml: പിൻ
mn: ПИН
mr: पिन
my: ပင်နံပါတ်
nb: PIN-kode
pa: ਪਿੰਨ
pl: Kod PIN
ru: PIN-код
sv: Pinkod
te: పిన్
uk: PIN-код
uz: PIN kod
vi: Mã PIN
zu: I-PIN
