Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTwoPaneSubtitle
source: Responsive layouts on foldable, large, and small screens
af: Reagerende uitlegte op opvoubare, groot en klein skerms
am: ሊታጠፍ በሚችል ትልቅ እና ትንሽ ማያ ገጾች ላይ ምላሽ ሰጪ አቀማመጦች
ar_eg: التصميمات المتجاوبة مع مختلف الأجهزة على الشاشات القابلة للطي والكبيرة والصغيرة
as: মোকোটাব পৰা, ডাঙৰ আৰু সৰু স্ক্ৰীনত সঁহাৰিসূচক লে’আউট
az: Qatlanan, böyük və kiçik ekranlarda responsiv düzənlər
be: Адаптыўныя макеты для прылад, якія складваюцца, маюць вялікі ці малы экран
bn: ফোল্ড করা যায় এমন ডিভাইস, বড় এবং ছোট স্ক্রিনের জন্য রেসপন্সিভ লেআউট
bs: Prilagodljivi rasporedi na sklopivim, velikim i malim ekranima
ca: Dissenys responsius en pantalles plegables, grans i petites
da: Et responsivt layout på foldbare, store og små skærme
es_ar: Diseño responsivo en pantallas plegables, grandes y pequeñas
et: Automaatselt kohanduvad paigutused volditavatel, suurtel ja väikestel ekraanidel
eu: Diseinu moldagarriak gailu tolesgarrietan, eta pantaila handiko eta txikiko gailuetan
fa: طرح‌بندی‌های کاربردی در صفحه‌نمایش‌های تاشو، بزرگ، و کوچک
fil: Mga responsive na layout sa mga foldable, malaki, at maliit na screen
fr_ca: Des mises en page réactives sur des écrans pliables, grands et petits
gl: Deseños adaptables en pantallas pregables, grandes e pequenas
gu: ફોલ્ડ કરી શકાય તેવી, મોટી અને નાની સ્ક્રીન પર રિસ્પૉન્સિવ લેઆઉટ
he: פריסות רספונסיביות במכשירים מתקפלים, גדולים וכאלה עם מסכים קטנים
hi: फ़ोल्ड किए जा सकने वाले डिवाइस, बड़ी स्क्रीन, और छोटी स्क्रीन के लिए रिस्पॉन्सिव लेआउट
hu: Reszponzív elrendezések összehajtható, nagy és kis képernyőn
hy: Ադապտիվ դասավորություններ ծալվող սարքերում, ինչպես նաև մեծ և փոքր էկրաններով սարքերում
id: Layout responsif pada perangkat yang memiliki layar besar, kecil, dan perangkat foldable
it: Layout adattabili su dispositivi con schermi pieghevoli, grandi e piccoli
ja: 折りたたみ式、大画面、小画面でのレスポンシブ レイアウト
ka: ადაპტური განლაგებები დასაკეც, დიდ და პატარაეკრანიან მოწყობილობებზე
km: ប្លង់​ដែលបត់បែននៅលើអេក្រង់ដែលអាចបត់បាន ធំ និងតូច
kn: ಫೋಲ್ಡ್ ಮಾಡಬಹುದಾದ, ದೊಡ್ಡ ಮತ್ತು ಚಿಕ್ಕ ಸ್ಕ್ರೀನ್ ಮೇಲೆ ಚೆನ್ನಾಗಿ ಪ್ರತಿಕ್ರಿಯಿಸುವ ಲೇಔಟ್‌ಗಳು
ko: 폴더블, 대형, 소형 화면의 반응형 레이아웃
ky: Бүктөлүүчү, чоң жана кичине экрандарга туура келүүчү калыптар
lo: ໂຄງຮ່າງແບບ responsive ຢູ່ອຸປະກອນທີ່ພັບໄດ້, ໜ້າຈໍໃຫຍ່ ແລະ ນ້ອຍ
lt: Interaktyvieji išdėstymai lankstomuosiuose, dideliuose ir mažuose ekranuose
lv: Adaptīvi izkārtojumi salokāmās ierīcēs, kā arī ierīcēs ar lieliem un maziem ekrāniem
mk: Приспособливи распореди на преклопувачки, големи и мали екрани
ml: ഫോൾഡ് ചെയ്യാവുന്നതും വലുപ്പം കൂടിയതും കുറഞ്ഞതുമായ സ്ക്രീനുകളിലെ റെസ്‌പോൺസീവ് ലേയൗട്ടുകൾ
mn: Эвхэгддэг, том болон жижиг дэлгэц дээрх хариу үйлдэлт бүдүүвч
mr: फोल्ड करता येण्यासारख्या, मोठ्या आणि लहान स्क्रीनवरील सत्वर प्रतिसाद देणारे लेआउट
ms: Reka letak responsif pada peranti boleh lipat, skrin besar dan skrin kecil
my: ခေါက်နိုင်သော၊ ကြီးမားသောနှင့် သေးငယ်သော ဖန်သားပြင်များရှိ အလိုက်သင့်တုံ့ပြန်သော အပြင်အဆင်များ
nb: Responsive layouter på små, store og sammenleggbare skjermer.
ne: रेस्पोन्सिभ लेआउटहरू फोल्ड गर्न मिल्ने डिभाइस र ठुला तथा साना स्क्रिनहरूमा प्रयोग गर्न मिल्छ
pa: ਮੋੜਨਯੋਗ, ਵੱਡੀਆਂ ਅਤੇ ਛੋਟੀਆਂ ਸਕ੍ਰੀਨਾਂ 'ਤੇ ਪ੍ਰਤਿਕਿਰਿਆਤਮਕ ਖਾਕੇ
pl: Układy elastyczne na składanych, dużych i małych ekranach
pt: Layouts responsivos em telas grandes, pequenas e dobráveis
pt_pt: Esquemas dinâmicos em ecrãs pequenos, grandes e dobráveis
ro: Aspecte adaptabile pe ecrane pliabile, mari și mici
ru: Адаптивные макеты на складных устройствах, а также устройствах с большим или маленьким экраном.
si: නැවිය හැකි, විශාල සහ කුඩා තිර මත ප්‍රතිචාරාත්මක පිරිසැලසුම්
sk: Responzívne rozloženia v skladacích zariadeniach a zariadeniach s veľkými a malými obrazovkami
sq: Struktura reaguese në pajisje të palosshme, të mëdha dhe të vogla
sr: Прилагодљиви распореди на уређајима на преком, великим и малим екранима
sr_latn: Prilagodljivi rasporedi na uređajima na prekom, velikim i malim ekranima
sv: Responsiva layouter på vikbara, stora och små skärmar
te: మడవగల, పెద్ద, చిన్న స్క్రీన్‌లలో ఫ్లెక్సిబుల్ లేఅవుట్‌లు
th: เลย์เอาต์ที่ปรับเปลี่ยนตามอุปกรณ์ในอุปกรณ์ที่พับได้ อุปกรณ์หน้าจอขนาดใหญ่ และอุปกรณ์หน้าจอขนาดเล็ก
tr: Katlanabilir, büyük ve küçük ekranlarla uyumlu düzenler
uk: Адаптивні макети на розкладних пристроях, великих і малих екранах
ur: فولڈ ہونے والی، بڑی اور چھوٹی اسکرینز پر ریسپانسیو لے آؤٹس
uz: Buklanadigan, katta yoki kichik ekranli qurilmalarda moslashuvchan dizayn.
vi: Bố cục thích ứng trên màn hình của thiết bị có thể gập lại, màn hình lớn và màn hình nhỏ
zh_hk: 摺疊式裝置、大螢幕和小螢幕上的回應式版面配置
zu: Izinhlaka eziphendulayo kuzikrini ezigoqekayo, ezinkulu nezincane

# splashSelectDemo
source: Select a demo
af: Kies ’n demonstrasie
am: ቅንጭብ ማሳያ ይምረጡ
ar_eg: اختيار إصدار تجريبي
as: এটা ডেম’ বাছনি কৰক
az: Demo seçin
be: Выберыце дэманстрацыю
bn: ডেমো
bs: Odaberite demonstraciju
ca: Selecciona una demostració
da: Vælg en demo
es_ar: Selecciona una demostración
et: Valige demo
eu: Hautatu demo-bertsio bat
fa: نمونه‌ای را انتخاب کنید
fil: Pumili ng demo
fr_ca: Sélectionnez une démo
gl: Selecciona unha versión de demostración
gu: ડેમો પસંદ કરો
he: יש לבחור הדגמה
hi: कोई डेमो चुनें
hu: Bemutató kiválasztása
hy: Ընտրեք դեմո տարբերակ
id: Pilih demo
it: Seleziona una demo
ja: デモを選択
ka: აირჩიეთ დემო
km: ជ្រើសរើសគំរូបង្ហាញ
kn: ಡೆಮೋ ಆಯ್ಕೆಮಾಡಿ
ko: 데모 선택
ky: Демо версияны тандоо
lo: ເລືອກເດໂມ
lt: Pasirinkti demonstracinę versiją
lv: Atlasiet demonstrāciju
mk: Изберете демо
ml: ഒരു ഡെമോ തിരഞ്ഞെടുക്കുക
mn: Демо сонгоно уу
mr: डेमो निवडा
ms: Pilih demo
my: သရုပ်ပြမှု ရွေးပါ
nb: Velg en demo
ne: डेमो चयन गर्नुहोस्
pa: ਕੋਈ ਡੈਮੋ ਚੁਣੋ
pl: Wybierz wersję demonstracyjną
pt: Selecione uma demonstração
pt_pt: Selecione uma demonstração
ro: Selectați o demonstrație
ru: Выберите демоверсию
si: ආදර්ශනයක් තෝරන්න
sk: Vyberte demo
sq: Zgjidh një demonstrim
sr: Изаберите демонстрацију
sr_latn: Izaberite demonstraciju
sv: Välj en demo
te: డెమోను ఎంచుకోండి
th: เลือกเดโม
tr: Demo seçin
uk: Виберіть демо
ur: ڈیمو منتخب کریں
uz: Demo rejimni tanlang
vi: Hãy chọn một bản minh hoạ
zh_hk: 選取示範
zu: Khetha idemo

# demoTwoPaneFoldableDescription
source: This is how TwoPane behaves on a foldable device.
af: Dit is hoe TwoPane op ’n opvoubare toestel werk.
am: ባለሁለት ፔን ሊታጠፍ የሚችል መሣሪያ ላይ እንደዚህ ነው የሚሰራው።
ar_eg: هذه هي الطريقة التي يتصرف بها TwoPane على جهاز قابل للطي.
as: এটা মোকোটাব পৰা ডিভাইচত TwoPaneএ এইদৰে আচৰণ কৰে।
az: TwoPane qatlanan cihazda belə davranır.
be: Вось так TwoPane выглядае на прыладзе, якая складваецца.
bn: ফোল্ড করা যায় এমন ডিভাইসে TwoPane এইভাবে পারফর্ম করে।
bs: Ovako TwoPane funkcionira na sklopivom uređaju.
ca: Aquest és el comportament de TwoPane en un dispositiu plegable.
da: Sådan fungerer TwoPane på en foldbar enhed.
es_ar: Así es cómo se comporta TwoPane en un dispositivo plegable.
et: Nii käitub vidin TwoPane volditavas seadmes.
eu: Hau da TwoPane-ren portaera gailu tolesgarri batean.
fa: نحوه عملکرد ویژگی «دوصفحه‌ای» در دستگاه تاشو.
fil: Ganito ang gawi ng TwoPane sa isang foldable na device.
fr_ca: Voici comment s'affiche TwoPane sur un appareil pliable.
gl: Así se comporta TwoPane nun dispositivo pregable.
gu: ફોલ્ડ કરી શકાય તેવા ડિવાઇસ પર TwoPane આ રીતે કામ કરે છે.
he: זו ההתנהגות של TwoPane במכשיר מתקפל.
hi: फ़ोल्ड किए जा सकने वाले डिवाइस पर TwoPane इस तरह काम करता है.
hu: Így működik összehajtható eszközön a TwoPane.
hy: Ահա թե ինչպես է TwoPane-ը աշխատում ծալվող սարքում։
id: Ini adalah perilaku TwoPane di perangkat foldable.
it: TwoPane si comporta in questo modo su un dispositivo pieghevole.
ja: 折りたたみ式デバイスでの TwoPane の動作です。
ka: აი, როგორ მოიქცევა TwoPane დასაკეც მოწყობილობაზე.
km: នេះគឺជារបៀបដែល TwoPane ដំណើរការនៅលើឧបករណ៍ដែលអាចបត់បាន។
kn: ಫೋಲ್ಡ್ ಮಾಡಬಹುದಾದುದು ಸಾಧನದಲ್ಲಿ TwoPane ಈ ರೀತಿಯಾಗಿ ವರ್ತಿಸುತ್ತದೆ ಎಂಬುದಾಗಿದೆ.
ko: 폴더블 기기에서 TwoPane이 작동하는 방식입니다.
ky: TwoPane бүктөлүүчү түзмөктө ушинтип иштейт.
lo: ນີ້ແມ່ນວິທີທີ່ TwoPane ເຮັດວຽກຢູ່ອຸປະກອນທີ່ພັບໄດ້.
lt: Tai nurodo, kaip „TwoPane“ veikia naudojant lankstomąjį įrenginį.
lv: Demonstrācija, kā TwoPane darbojas salokāmā ierīcē.
mk: Вака се однесува TwoPane на преклопувачки уред.
ml: ഫോൾഡ് ചെയ്യാവുന്ന ഉപകരണത്തിൽ ഇപ്രകാരമാണ് TwoPane പ്രവർത്തിക്കുന്നത്.
mn: TwoPane нь эвхэгддэг төхөөрөмж дээр ингэж ажилладаг.
mr: फोल्ड करता येण्यासारख्या डिव्हाइसवर TwoPane हे अशाप्रकारे काम करते.
ms: Inilah gelagat TwoPane pada peranti boleh lipat.
my: ဤအရာသည် ခေါက်နိုင်သည့်စက်တွင် TwoPane က လုပ်ဆောင်သည့်ပုံစံဖြစ်သည်။
nb: Slik fungerer TwoPane på en sammenleggbar enhet.
ne: TwoPane ले फोल्ड गर्न मिल्ने डिभाइसमा यसरी काम गर्छ।
pa: ਮੋੜਨਯੋਗ ਡੀਵਾਈਸ 'ਤੇ TwoPane ਇਸ ਤਰ੍ਹਾਂ ਕੰਮ ਕਰਦਾ ਹੈ।
pl: Tak wygląda widżet TwoPane na urządzeniu składanym.
pt: O TwoPane se comporta dessa forma em dispositivos dobráveis.
pt_pt: É assim que o TwoPane se comporta num dispositivo dobrável.
ro: Acesta este comportamentul TwoPane pe un dispozitiv pliabil.
ru: Вот так TwoPane работает на складном устройстве.
si: නැවිය හැකි උපාංගයක් මත TwoPane හැසිරෙන්නේ මේ ආකාරයටයි.
sk: Takto sa TwoPane správa v skladacom zariadení.
sq: Ja si sillet TwoPane në një pajisje të palosshme.
sr: Овако се TwoPane понаша на уређају на преклоп.
sr_latn: Ovako se TwoPane ponaša na uređaju na preklop.
sv: Så här fungerar TwoPane på en vikbar enhet.
te: మడవగల పరికరంలో TwoPane ఇలా ప్రవర్తిస్తుంది.
th: นี่คือลักษณะการทำงานของ TwoPane ในอุปกรณ์ที่พับได้
tr: TwoPane, katlanabilir bir cihazda bu şekilde davranır.
uk: Опис роботи TwoPane на розкладних пристроях.
ur: فولڈ ہونے والے آلے پر TwoPane اس طرح برتاؤ کرتا ہے۔
uz: TwoPane buklanadigan qurilmada shunday ishlaydi.
vi: Bản minh hoạ cách TwoPane hoạt động trên thiết bị có thể gập lại.
zh_hk: 這是 TwoPane 在摺疊式裝置上的行為方式。
zu: Lena yindlela i-TwoPane eziphatha ngayo kwidivayisi egoqekayo.

# demoTwoPaneDetails
source: Details
af: Besonderhede
am: ዝርዝሮች
ar_eg: التفاصيل
as: সবিশেষ
az: Məlumat
be: Падрабязныя звесткі
bn: বিবরণ
bs: Detalji
ca: Detalls
da: Oplysninger
es_ar: Detalles
et: Üksikasjad
eu: Xehetasunak
fa: جزئیات
fil: Mga Detalye
fr_ca: Détails
gl: Detalles
gu: વિગતો
he: פרטים
hi: ब्यौरा
hu: Részletek
hy: Մանրամասներ
id: Detail
it: Dettagli
ja: 詳細
ka: დეტალები
km: ព័ត៌មាន​លម្អិត
kn: ವಿವರಗಳು
ko: 세부정보
ky: Чоо-жайы
lo: ລາຍລະອຽດ
lt: Išsami informacija
lv: Detalizēta informācija
mk: Детали
ml: വിശദാംശങ്ങൾ
mn: Дэлгэрэнгүй
mr: तपशील
ms: Butiran
my: အသေးစိတ်
nb: Detaljer
ne: विवरण
pa: ਵੇਰਵੇ
pl: Szczegóły
pt: Detalhes
pt_pt: Detalhes
ro: Detalii
ru: Сведения
si: විස්තර
sk: Podrobnosti
sq: Detajet
sr: Детаљи
sr_latn: Detalji
sv: Information
te: వివరాలు
th: รายละเอียด
tr: Ayrıntılar
uk: Деталі
ur: تفصیلات
uz: Batafsil
vi: Thông tin chi tiết
zh_hk: 詳情
zu: Imininingwane

# demoTwoPaneSelectItem
source: Select an item
af: Kies ’n item
am: አንድ ንጥል ይምረጡ
ar_eg: اختيار عنصر
as: এটা বস্তু বাছনি কৰক
az: Element seçin
be: Выберыце элемент
bn: একটি আইটেম বেছে নিন
bs: Odaberite stavku
ca: Selecciona un element
da: Vælg et element
es_ar: Selecciona un elemento
et: Valige üksus
eu: Hautatu elementu bat
fa: موردی را انتخاب کنید
fil: Pumili ng item
fr_ca: Sélectionner un élément
gl: Selecciona un elemento
gu: આઇટમ પસંદ કરો
he: יש לבחור פריט
hi: कोई आइटम चुनें
hu: Elem kijelölése
hy: Ընտրեք տարր
id: Pilih item
it: Seleziona un elemento
ja: アイテムを選択
ka: აირჩიეთ ერთეული
km: ជ្រើសរើសធាតុ
kn: ಐಟಂ ಆಯ್ಕೆಮಾಡಿ
ko: 항목 선택
ky: Нерсе тандоо
lo: ເລືອກລາຍການໃດໜຶ່ງ
lt: Pasirinkti elementą
lv: Atlasiet vienumu
mk: Изберете ставка
ml: ഒരു ഇനം തിരഞ്ഞെടുക്കുക
mn: Зүйл сонгоно уу
mr: आयटम निवडणे
ms: Pilih item
my: ပစ္စည်းရွေးပါ
nb: Velg et element
ne: कुनै वस्तु चयन गर्नुहोस्
pa: ਕੋਈ ਆਈਟਮ ਚੁਣੋ
pl: Wybierz element
pt: Selecione um item
pt_pt: Selecione um item
ro: Selectați un articol
ru: Выберите объект
si: අයිතමයක් තෝරන්න
sk: Vyberte položku
sq: Zgjidh një artikull
sr: Изаберите ставку
sr_latn: Izaberite stavku
sv: Välj ett objekt
te: ఒక ఐటెమ్‌ను ఎంచుకోండి
th: เลือกรายการ
tr: Öğe seçin
uk: Виберіть елемент
ur: ایک آئٹم منتخب کریں
uz: Obyektni tanlang
vi: Hãy chọn một mục
zh_hk: 選取項目
zu: Khetha into

# demoTwoPaneItemDetails
source: Item {value} details
af: Item {value} se besonderhede
am: የንጥል {value} ዝርዝሮች
ar_eg: تفاصيل العنصر {value}
as: বস্তু {value} সবিশেষ
az: {value} elementinin detalları
be: Падрабязныя звесткі пра элемент {value}
bn: আইটেমের {value} বিবরণ
bs: Detalji o stavci {value}
ca: Detalls de l'element {value}
da: Oplysninger om elementet {value}
es_ar: Detalles del artículo {value}
et: Üksuse {value} üksikasjad
eu: {value} elementuaren xehetasunak
fa: جزئیات مورد {value}
fil: Mga detalye ng tem {value}
fr_ca: Détails de l'élément {value}
gl: Detalles do elemento {value}
gu: આઇટમ {value}ની વિગતો
he: מידע על פריט {value}
hi: आइटम {value} का ब्यौरा
hu: {value} elem részletei
hy: Տարր {value}-ի մանրամասներ
id: Detail item {value}
it: Dettagli elemento {value}
ja: アイテム {value} の詳細
ka: ერთეულის {value} დეტალები
km: ព័ត៌មានលម្អិតនៃធាតុទី {value}
kn: {value} ಐಟಂ ವಿವರಗಳು
ko: {value} 항목 세부정보
ky: Нерсенин {value} чоо-жайы
lo: ລາຍລະອຽດລາຍການ {value}
lt: Išsami elemento {value} informacija
lv: Detalizēta informācija par vienumu {value}
mk: Детали за ставка {value}
ml: ഇനത്തിന്റെ {value} വിശദാംശങ്ങൾ
mn: Зүйлийн {value} дэлгэрэнгүй
mr: आयटम {value} तपशील
ms: Butiran item {value}
my: ပစ္စည်း {value} အသေးစိတ်
nb: Detaljer om vare {value}
ne: वस्तुसम्बन्धी {value} विवरणहरू
pa: ਆਈਟਮ {value} ਸੰਬੰਧੀ ਵੇਰਵੇ
pl: Szczegóły elementu {value}
pt: Detalhes do item {value}
pt_pt: Detalhes do item {value}
ro: Detalii despre articolul {value}
ru: Сведения об объекте {value}
si: අයිතම {value} විස්තර
sk: Podrobnosti položky {value}
sq: Detajet e artikullit {value}
sr: Детаљи ставке {value}
sr_latn: Detalji stavke {value}
sv: Information om objektet {value}
te: ఐటెమ్ {value} వివరాలు
th: รายละเอียดรายการ {value}
tr: {value} öğe ayrıntıları
uk: Інформація про елемент {value}
ur: آئٹم {value} تفصیلات
uz: {value} obyekti tafsilotlari
vi: Thông tin chi tiết về mục {value}
zh_hk: 項目 {value} 詳情
zu: Imininingwane yento {value}

# demoCupertinoContextMenuActionText
source: Tap and hold the Flutter logo to see the context menu.
af: Tik en hou die Flutter-logo om die kontekskieslys te sien.
am: ተገቢ ሁኔታ ምናሌውን ለማየት የFlutter አርማውን መታ አድርገው ይያዙ።
ar_eg: اضغط مع الاستمرار على شعار Flutter لعرض قائمة السياقات.
as: প্ৰসংগ মেনুখন চাবলৈ ফ্লাটাৰ ল’গ’টোত হেঁচি ধৰি ৰাখক।
az: Kontekst menyusuna baxmaq üçün Flutter loqosuna basıb saxlayın.
be: Каб адкрыць кантэкстнае меню, націсніце і ўтрымлівайце лагатып Flutter.
bn: কনটেক্সট মেনু দেখতে 'ফ্লাটার' লোগোতে ট্যাপ করে ধরে থাকুন।
bs: Dodirnite i zadržite logotip Fluttera da prikažete kontekstni meni.
ca: Mantén premut el logotip de Flutter per veure el menú contextual.
da: Hold fingeren på Flutter-logoet for at se genvejsmenuen.
es_ar: Mantén presionado el logotipo de Flutter para ver el menú contextual.
et: Kontekstimenüü nägemiseks puudutage Flutteri logo pikalt.
eu: Laster-menua ikusteko, eduki sakatuta Flutter-en logotipoa.
fa: برای دیدن منوی بافت، روی نشان‌واره Flutter ضربه بزنید و آن را نگه دارید.
fil: I-tap at i-hold ang Flutter logo para makita ang menu ng konteksto.
fr_ca: Maintenez le doigt sur le logo de Flutter afin que le menu contextuel s'affiche.
gl: Mantén premido o logotipo de Flutter para ver o menú contextual.
gu: સંદર્ભ મેનૂ જોવા માટે, ફ્લટર લોગો પર ટૅપ કરીને દબાવી રાખો.
he: יש ללחוץ לחיצה ארוכה על הלוגו של Flutter כדי להציג את תפריט ההקשר.
hi: संदर्भ मेन्यू देखने के लिए, फ़्लटर लोगो को टैप करके रखें.
hu: Tartsa lenyomva a Flutter-logót a helyi menü megtekintéséhez.
hy: Հպեք Flutter-ի լոգոյին և պահեք՝ տեղային ընտրացանկը տեսնելու համար։
id: Sentuh lama logo Flutter untuk melihat menu konteks.
it: Tocca e tieni premuto il logo di Flutter per vedere il menu contestuale.
ja: コンテキスト メニューを表示するには、Flutter のロゴを長押しします。
ka: კონტექსტური მენიუს სანახავად ხანგრძლივად შეეხეთ Flutter-ის ლოგოს.
km: ចុចលើនិមិត្តសញ្ញា Flutter ដើម្បីមើលម៉ឺនុយ​បរិបទ។
kn: ಸಂದರ್ಭ ಮೆನುವನ್ನು ನೋಡಲು ಫ್ಲಟರ್ ಲೋಗೋವನ್ನು ಒತ್ತಿಹಿಡಿದುಕೊಳ್ಳಿ.
ko: Flutter 로고를 길게 탭하여 컨텍스트 메뉴를 표시합니다.
ky: Контексттик менюну көрүү үчүн Flutter логотибин коё бербей басып турңуз.
lo: ແຕະໃສ່ໂລໂກ້ Flutter ຄ້າງໄວ້ເພື່ອເບິ່ງເມນູບໍລິບົດ.
lt: Palieskite ir palaikykite „Flutter“ logotipą, kad pamatytumėte kontekstinį meniu.
lv: Pieskarieties Flutter logotipam un turiet to, lai skatītu kontekstizvēlni.
mk: Допрете го и задржете го логото на Flutter за да се прикаже контекстуалното мени.
ml: സന്ദർഭ മെനു കാണാൻ ഫ്ലട്ടർ ലോഗോ ടാപ്പ് ചെയ്ത് പിടിക്കുക.
mn: Хам сэдэв цэсийг харахын тулд Flutter-н логог товшоод удаан дарна уу.
mr: कॉंटेक्स्ट मेनू पाहण्यासाठी फ्लटर लोगोवर टॅप करून धरून ठेवा.
ms: Ketik dan tahan logo Flutter bagi melihat menu konteks.
my: အကြောင်းအရာမီနူး မြင်ရရန် Flutter လိုဂိုကို တို့ပြီးဖိထားပါ။
nb: Trykk og hold på Flutter-logoen for å åpne den kontekstuelle menyen.
ne: सन्दर्भ मेनु हेर्न Flutter लोगोमा ट्याप गरी थिचिरहनुहोस्
pa: ਸੰਦਰਭੀ ਮੀਨੂ ਦੇਖਣ ਲਈ Flutter ਲੋਗੋ 'ਤੇ ਟੈਪ ਕਰੋ ਅਤੇ ਦਬਾਈ ਰੱਖੋ।
pl: Aby zobaczyć menu kontekstowe, naciśnij i przytrzymaj logo Flutter.
pt: Toque no logotipo do Flutter e o pressione para ver o menu de contexto.
pt_pt: Toque sem soltar no logótipo do Flutter para ver o menu de contexto.
ro: Atingeți lung sigla Flutter ca să vedeți meniul contextual
ru: Чтобы увидеть контекстное меню, нажмите на логотип Flutter и удерживайте.
si: ප්‍රකරණ මෙනුව බැලීමට Flutter ලාංඡනය තට්ටු කර අල්ලාගෙන සිටින්න.
sk: Kontextovú ponuku zobrazíte pridržaním loga Flutter.
sq: Trokit dhe mbaj shtypur logon e Flutter për të parë menynë kontekstuale.
sr: Додирните и задржите Flutter логотип да бисте видели контекстуални мени.
sr_latn: Dodirnite i zadržite Flutter logotip da biste videli kontekstualni meni.
sv: Tryck länge på Flutter-logotypen för att visa snabbmenyn.
te: సంబంధిత మెనూను చూడటానికి Flutter లోగోను ట్యాప్ చేసి ఉంచండి.
th: แตะโลโก้ Flutter ค้างไว้เพื่อดูเมนูตามบริบท
tr: İçerik menüsünü görmek için Flutter logosuna dokunup basılı tutun.
uk: Натисніть і утримуйте логотип Flutter, щоб переглянути контекстне меню.
ur: سیاق و سباق کا مینیو دیکھنے کے لیے فلوٹر لوگو کو تھپتھپائیں اور دبائے رکھیں۔
uz: Kontekst menyusini koʻrish uchun Flutter logotipini bosib turing.
vi: Chạm và giữ biểu tượng Flutter để xem trình đơn theo bối cảnh.
zh_hk: 按住 Flutter 標誌即可查看內容選單。
zu: Thepha futhi ubambe ilogo ye-Flutter ukuze ubone imenyu yokuqukethwe.
