Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoFadeThroughSearchDestination
source: Search
af: Soek
am: ፍለጋ
ar_eg: بحث
az: Axtarış
be: Пошук
bs: Pretraži
ca: Cerca
da: Søg
es_ar: Buscar
et: Otsi
eu: Bilatu
fa: جستجو
fil: Maghanap
fr_ca: Rechercher
gl: Buscar
gu: શોધો
he: חיפוש
hi: खोज
hu: Keresés
hy: Որոնում
id: Telusuri
it: Cerca
ja: 検索
ka: ძიება
km: ស្វែងរក
kn: ಹುಡುಕಿ
ko: 검색
ky: Издөө
lo: ຊອກຫາ
lt: Ieškoti
lv: Meklēt
mk: Пребарување
mn: Хайх
ms: Cari
my: ရှာရန်
nb: Søk
ne: खोज
pa: ਖੋਜੋ
pl: Szukaj
pt: Pesquisa
pt_pt: Pesquisar
ro: Căutați
ru: Поиск
si: සෙවීම
sk: Hľadať
sq: Kërko
sr: Претрага
sr_latn: Pretraga
sv: Sök
te: వెతకండి
th: ค้นหา
tr: Ara
uk: Пошук
ur: تلاش
uz: Qidiruv
vi: Tìm kiếm
zh_hk: 搜尋
zu: Sesha

# demoFadeThroughPhotosDestination
source: Photos
af: Foto's
am: ፎቶዎች
ar_eg: صور
az: Fotolar
be: Фота
bn: ফটো
bs: Fotografije
ca: Fotos
da: Billeder
es_ar: Fotos
et: Fotod
eu: Argazkiak
fa: عکس‌ها
fil: Mga Larawan
gl: Fotos
gu: ફોટા
he: תמונות
hi: फ़ोटो
hu: Fotók
hy: Լուսանկարներ
id: Foto
it: Foto
ja: 写真
ka: ფოტოები
km: រូបថត
ko: 사진
ky: Фото
lo: ຮູບພາບ
lt: Nuotraukos
lv: Fotoattēli
mk: Фотографии
mn: Зургууд
mr: फोटो
ms: Foto
my: ဓာတ်ပုံများ
nb: Bilder
ne: फोटो
pa: ਫ਼ੋਟੋਆਂ
pl: Zdjęcia
pt: Fotos
pt_pt: Fotos
ro: Fotografii
ru: Фотографии
si: ඡායාරූප
sk: Fotky
sq: Fotografitë
sr: Слике
sr_latn: Slike
sv: Foton
th: รูปภาพ
tr: Fotoğraflar
uk: Фото
ur: تصاویر
uz: Suratlar
vi: Ảnh
zh_hk: 相片
zu: Izithombe

# demoSharedXAxisCoursePageSubtitle
source: Bundled categories appear as groups in your feed. You can always change this later.
af: Gebondelde kategorieë verskyn as groepe in jou stroom. Jy kan dit altyd later verander.
am: የተጠቃለሉ ምድቦች በምግብዎ ላይ እንደ ቡድን ሆነው ይታያሉ። ይህን በኋላ ላይ በማንኛውም ጊዜ መቀየር ይችላሉ።
ar_eg: تظهر الفئات المجمّعة كمجموعات في الخلاصة. يمكنك دائمًا تغيير هذا لاحقًا.
as: বাণ্ডল হৈ থকা শ্ৰেণীসমূহ আপোনাৰ ফীডত গোট হিচাপে দেখা পোৱা যায়। আপুনি পাছত যিকোনো সময়তে এয়া সলনি কৰিব পাৰে।
az: Paketlənmiş kateqoriyalar lentinizdə qruplar kimi görünür. Bunu həmişə dəyişə bilərsiniz.
be: Звязаныя катэгорыі паказаны ў вашай стужцы ў выглядзе груп. Пазней вы можаце змяніць гэту наладу.
bn: আপনার ফিডে বান্ডেল করা বিভাগগুলি গ্রুপ হিসেবে দেখা যাবে। আপনি পরে যেকোনও সময় এটিকে পরিবর্তন করতে পারবেন।
bs: Upakovane kategorije se prikazuju u grupama u vašem sažetku sadržaja. Ovo uvijek možete promijeniti kasnije.
ca: Les categories agrupades es mostren com a grups al teu feed. Pots canviar aquesta opció en qualsevol moment.
da: Grupperede kategorier vises som grupper i dit feed. Du kan altid ændre dette senere.
es_ar: Las categorías adheridas aparecen como grupos en tu feed. Puedes modificar esto más adelante.
et: Kogumis olevad kategooriad kuvatakse teie voos gruppidena. Seda saab alati hiljem muuta.
eu: Multzokatutako kategoriak talde gisa agertzen dira jarioan. Gero alda dezakezu hori.
fa: دسته‌های مجموعه‌ای به‌صورت گروه‌هایی در فیدتان نشان داده می‌شوند. هرزمان بخواهید می‌توانید این مورد را در فرصتی دیگر تغییر دهید.
fil: Lalabas ang mga naka-bundle na kategorya bilang mga grupo sa iyong feed. Mababago mo ito anumang oras.
fr_ca: Les catégories groupées s'affichent comme groupes dans votre flux. Vous pourrez toujours modifier ce paramètre plus tard.
gl: As categorías integradas aparecen como grupos no teu feed. Sempre podes cambiar esta opción máis tarde.
gu: બંડલ બનાવેલી કૅટેગરી તમારા ફીડમાં ગ્રૂપ તરીકે દેખાય છે. તમે આને પછીથી ગમે-ત્યારે બદલી શકો છો.
he: קטגוריות מקובצות מופיעות כקבוצות בפיד שלכם. אפשר תמיד לשנות את ההגדרה הזו בעתיד.
hi: इससे बंडल की गई श्रेणियां, ग्रुप के तौर पर आपकी फ़ीड में दिखेंगी. आप जब चाहें, इसे बदल सकते हैं.
hu: A csomagolt kategóriák csoportokként jelennek meg a hírcsatornában. Ezt később bármikor megváltoztathatja.
hy: Կատեգորիաների փաթեթները ֆիդում հայտնվում են խմբերի տեսքով։ Դուք ցանկացած ժամանակ կարող եք փոխել սա։
id: Kategori gabungan muncul sebagai grup di feed Anda. Anda dapat mengubahnya kapan saja.
it: Le categorie raggruppate vengono visualizzate come gruppi nel tuo feed. Potrai sempre modificare questa scelta in un secondo momento.
ja: カテゴリがまとめられて、フィードにグループとして表示されます。この設定は後からいつでも変更できます。
ka: კატეგორიების ნაკრებები თქვენს არხში ჯგუფების სახით გამოჩნდება. ამის შეცვლა ყოველთვის შეგიძლიათ.
km: ប្រភេទជា​កញ្ចប់បង្ហាញ​ជាក្រុម​នៅក្នុង​ផ្ទាំងព័ត៌មាន​របស់អ្នក។ អ្នកអាច​ប្ដូរវា​នៅពេលក្រោយ​បានជានិច្ច។
kn: ಬಂಡಲ್ ಮಾಡಲಾದ ವಿಭಾಗಗಳು ನಿಮ್ಮ ಫೀಡ್‌ನಲ್ಲಿ ಗುಂಪುಗಳಾಗಿ ಗೋಚರಿಸುತ್ತವೆ. ನೀವು ಇದನ್ನು ಯಾವಾಗಲಾದರೂ ಬದಲಾಯಿಸಬಹುದು.
ko: 번들 카테고리가 피드에 그룹으로 표시됩니다. 나중에 언제든지 변경할 수 있습니다.
ky: Таңылган категориялар түрмөгүңүздө топтор катары көрүнөт. Муну кийин каалаган убакта өзгөртүп алсаңыз болот.
lo: ໝວດໝູ່ທີ່ຮວມຈະປາກົດເປັນກຸ່ມໃນຟີດຂອງທ່ານ. ທ່ານສາມາດປ່ຽນຕົວເລືອກນີ້ໄດ້ທຸກເມື່ອໃນພາຍຫຼັງ.
lt: Kategorijų rinkiniai rodomi kaip grupės jūsų sklaidos kanale. Vėliau bet kada galėsite tai pakeisti.
lv: Kategorijas, kas iekļautas komplektos, plūsmā tiek rādītas pa grupām. To jebkurā laikā varēsiet mainīt.
mk: Категориите во пакет се појавуваат како групи во вашата активност. Секогаш можете да го промените ова подоцна.
ml: ബണ്ടിൽ ചെയ്‌ത വിഭാഗങ്ങൾ നിങ്ങളുടെ ഫീഡിൽ ഗ്രൂപ്പുകളായി ദൃശ്യമാകുന്നു. നിങ്ങൾക്കിത് പിന്നീട് എപ്പോൾ വേണമെങ്കിലും മാറ്റാം.
mn: Багцалсан ангиллууд нь таны хангамж дээр бүлгээр харагдана. Та үүнийг дараа нь үргэлж өөрчлөх боломжтой.
mr: बंडल केलेल्या वर्गवाऱ्या तुमच्या फीडमध्ये गट म्हणून दिसतात. तुम्ही हे कधीही बदलू शकता.
ms: Kategori yang dihimpun dipaparkan sebagai kumpulan dalam suapan anda. Anda boleh menukar tetapan ini pada bila-bila masa kemudian.
my: သင့်ဖိဒ်တွင် အဖွဲ့များအဖြစ်ပေါ်လာသော ပေါင်းချုပ်ထားသည့် အမျိုးအစားများ။ ဤအရာကို နောက်ပိုင်းတွင် အချိန်မရွေးပြောင်းနိုင်သည်။
nb: Grupperte kategorier vises som grupper i feeden din. Du kan endre dette når som helst.
ne: बन्डल बनाइएका कोटीहरू तपाईंको फिडमा समूहका रूपमा देखिन्छन्। तपाईं पछि जुनसुकै बेला यो सेटिङ परिवर्तन गर्न सक्नुहुन्छ।
pa: ਬੰਡਲਬੱਧ ਸ਼੍ਰੇਣੀਆਂ ਤੁਹਾਡੀ ਫ਼ੀਡ ਵਿੱਚ ਸਮੂਹਾਂ ਵਜੋਂ ਦਿਸਦੀਆਂ ਹਨ। ਤੁਸੀਂ ਇਸਨੂੰ ਬਾਅਦ ਵਿੱਚ ਕਦੇ ਵੀ ਬਦਲ ਸਕਦੇ ਹੋ।
pl: Na Twojej karcie pakiety kategorii są widoczne jako grupy. Później możesz zmienić to ustawienie.
pt: As categorias agrupadas aparecem como grupos no seu feed. É possível mudar essa configuração a qualquer momento.
pt_pt: As categorias agrupadas aparecem como grupos no seu feed. Pode alterar esta definição mais tarde.
ro: Categoriile apar ca grupuri în feed. Puteți modifica oricând această opțiune.
ru: Наборы категорий появляются в фиде как группы. Это можно изменить в любое время.
si: පොදි කළ ප්‍රවර්ග ඔබේ සංග්‍රහයේ සමූහ ලෙස දිස් වේ. ඔබට මෙය සැම විට පසුව වෙනස් කළ හැකිය.
sk: Kategórie v balíkoch sa v informačnom kanáli zobrazujú ako skupiny. Toto nastavenie môžete neskôr zmeniť.
sq: Kategoritë pjesë e paketës shfaqen si grupe në burimin tënd. Mund ta ndryshosh gjithmonë këtë më vonë.
sr: Категорије у пакету се приказују као групе у фиду. Ово можете да промените кад год пожелите.
sr_latn: Kategorije u paketu se prikazuju kao grupe u fidu. Ovo možete da promenite kad god poželite.
sv: Grupperade kategorier visas som grupper i flödet. Du kan alltid ändra detta senare.
te: బండిల్ చేయబడిన కేటగిరీలు మీ ఫీడ్‌లో గ్రూప్‌లుగా కనిపిస్తాయి. మీరు దీన్ని తర్వాత ఎప్పుడైనా మార్చవచ్చు.
th: หมวดหมู่ตามกลุ่มจะแสดงเป็นกลุ่มในฟีดของคุณ ซึ่งคุณจะเปลี่ยนแปลงได้ในภายหลังเสมอ
tr: Pakete dahil edilen kategoriler, feed'inizde grup olarak görünür. Bunu daha sonra istediğiniz zaman değiştirebilirsiniz.
uk: Згруповані категорії показуються у фіді як групи. Це можна будь-коли змінити.
ur: بنڈل شدہ زمرے آپ کی فیڈ میں گروپس کے بطور ظاہر ہوتے ہیں۔ آپ بعد میں کبھی بھی اسے تبدیل کر سکتے ہیں۔
uz: Turkumlar majmuasi tasmada guruh sifatida chiqadi. Buni istalgan vaqt oʻzgartirish mumkin.
vi: Các danh mục theo gói sẽ xuất hiện ở dạng nhóm trong nguồn cấp dữ liệu của bạn. Bạn luôn có thể thay đổi tùy chọn này vào lúc khác.
zh_hk: 分類組合會以群組形式在您的資訊提供中顯示。您稍後可以隨時變更。
zu: Izigaba ezenziwe inqwaba zivela njengamaqembu kokuphakelayo kwakho. Ungahlala ushintsha lokhu ngemuva kwesikhathi.

# demoFadeThroughDescription
source: The fade through pattern is used for transitions between UI elements that do not have a strong relationship to each other.
af: Die deurdoofpatroon word gebruik vir oorgang tussen UI-elemente wat nie 'n sterk vehouding met mekaar het nie.
am: በስርዓተ-ጥለት በኩል አደብዝዝ እርስ ከራሳቸው ጠንካራ ግንኙነት በሌላቸው የዩአይ ክፍለ-አካላት መካከል ላለ ሽግግር ስራ ላይ ይውላል።
ar_eg: يتم استخدام نمط التلاشي التدريجي لتأثيرات الانتقال بين عناصر واجهة المستخدم التي لا تربطها علاقة قوية ببعضها.
as: ফে’ড থ্ৰু আৰ্হিটো পৰস্পৰৰ সৈতে দৃঢ় সম্পৰ্ক নথকা ইউআই উপাদানসমূহৰ মাজত হোৱা ট্ৰানজিশ্বনসমূহৰ বাবে ব্যৱহাৰ কৰা হয়।
az: Tədricən solğunlaşma modeli bir-biri ilə güclü əlaqəsi olmayan UI elementləri arasında keçid üçün istifadə edilir.
be: Шаблон паступовага змянення выкарыстоўваецца для пераходаў паміж элементамі карыстальніцкага інтэрфейсу, між якімі няма цесных сувязей.
bn: UI এলিমেন্টের মধ্যে ট্রানজিশন করতে 'বরাবর অস্পষ্ট' প্যাটার্ন ব্যবহার করা হয়, যেখানে প্রত্যেকটি এলিমেন্টের মধ্যে শক্তিশালি সম্পর্ক থাকে না।
bs: Obrazac iščezavanja s prijelazom se koristi za prijelaz između elemenata korisničkog interfejsa koji nisu međusobno čvrsto povezani.
ca: El patró d'esvaïment s'utilitza per a transicions entre elements de la IU que no tenen una relació estreta entre ells.
da: Mønsteret for fortoning anvendes til overgange mellem brugerfladeelementer, der ikke har et stærkt forhold til hinanden.
es_ar: El patrón de atenuación rápida se usa para hacer transiciones entre elementos de la IU que no tienen una relación estrecha entre sí.
et: Läbihajutuse mustrit kasutatakse üleminekuna kasutajaliidese elementide puhul, millel ei ole teineteisega tugevat seost.
eu: Beren artean harreman handirik ez daukaten erabiltzaile-interfazeko elementuen arteko trantsizioetarako erabiltzen da agertzea eta desagertzearen eredua.
fa: الگوی محو کردن گسترده برای انتقال بین عناصر رابط کاربری‌ای استفاده می‌شود که ارتباطی قوی با یکدیگر ندارند.
fil: Ginagamit ang fade through pattern para sa mga transition sa pagitan ng mga element ng UI na walang matibay na ugnayan sa isa't isa.
fr_ca: Le motif d'atténuation graduelle est utilisé pour les transitions entre les éléments d'IU qui ne possèdent pas de relation marquée entre eux.
gl: O padrón de esvaecemento utilízase para transicións entre os elementos da IU que non teñen unha relación forte entre si.
gu: ફેડ થ્રૂ પૅટર્નનો ઉપયોગ તેવા UI ઘટકોની વચ્ચે ટ્રાંઝિશન માટે થાય છે કે જેનો એકબીજાની સાથે મજબૂત સંબંધ હોતો નથી.
he: הדפוס 'להפוך לשקוף בהדרגה' משמש למעברים בין רכיבי ממשק משתמש שאין ביניהם קשר חזק.
hi: फ़ेड थ्रू वाला पैटर्न, उन यूज़र इंटरफ़ेस (यूआई) एलिमेंट के बीच ट्रांज़िशन के लिए इस्तेमाल किया जाता है जिनके बीच बेहतर तालमेल नहीं होता.
hu: Az áttűnés mintát olyan UI-elemek közötti átmenetekhez használja a rendszer, amelyek között nincs szoros kapcsolat.
hy: Սահուն անցումն օգտագործվում է միջերեսի այն տարրերի միջև անցում կատարելու համար, որոնց միջև սերտ կապ չկա։
id: Pola memudar digunakan untuk transisi antara elemen UI yang tidak memiliki hubungan kuat satu sama lain.
it: Il pattern di dissolvenza tramite viene utilizzato per le transizioni tra elementi UI che non hanno una forte correlazione.
ja: フェードスルー パターンは、相互に強力な関係がない UI 要素間の移行に使用します。
ka: ჩაბნელების ნიმუში გამოიყენება UI-ის იმ ელემენტებს შორის გადასვლისთვის, რომლებსაც ერთმანეთთან ძლიერი კავშირი არ აქვთ.
km: លំនាំ​លេចឡើង​ពីក្នុងត្រូវបានប្រើ​សម្រាប់​ការផ្លាស់ប្ដូរ​រវាងធាតុ UI ដែលមិនមាន​ទំនាក់ទំនង​រឹងមាំ​ជាមួយគ្នា។
kn: ಪರಸ್ಪರ ಬಲವಾದ ಸಂಬಂಧವನ್ನು ಹೊಂದಿರದ UI ಅಂಶಗಳ ನಡುವಿನ ಪರಿವರ್ತನೆಗಾಗಿ ಫೇಡ್ ಥ್ರೂ ಪ್ಯಾಟರ್ನ್ ಅನ್ನು ಬಳಸಲಾಗುತ್ತದೆ.
ko: 페이드 스루 패턴은 서로 큰 관련이 없는 UI 요소 간의 전환에 사용됩니다.
ky: Ортосунан баштап бозоруу шаблону колдонуучу интерфейсинин бири-бирине болгон күчтүү байланышы жок элеметтерин өзгөртүү үчүн колдонулат.
lo: ຮູບແບບຈາງຫາຍແມ່ນໃຊ້ສຳລັບການປ່ຽນລະຫວ່າງອົງປະກອບສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ທີ່ບໍ່ມີຄວາມສຳພັນໜັກແນ້ນຕໍ່ກັນແລະກັນ.
lt: Išblukimo šablonas naudojamas NS elementams, kurie nėra susieti tvirtais ryšiais, perkelti.
lv: Pakāpeniskas izzušanas un parādīšanās formu izmanto pārejām starp lietotāja saskarnes elementiem, kas nav cieši savstarpēji saistīti.
mk: Шемата на избледување низ сите се користи за транзиции меѓу елементи на корисничкиот интерфејс што не се цврсто поврзани.
ml: പരസ്‌പരം ദൃഢമായ ബന്ധമില്ലാത്ത UI ഘടകങ്ങൾ തമ്മിലുള്ള പരിവർത്തനത്തിനായാണ് ഫേഡ് ത്രൂ പാറ്റേൺ ഉപയോഗിക്കുന്നത്.
mn: Нэвт уусах загварыг бие биетэйгээ хүчтэй харилцаагүй UI элементүүдийн хоорондын шилжилтэд ашигладаг.
mr: फेड थ्रू पॅटर्न हा एकमेकांशी घट्ट संबंध नसलेल्या UI घटकांदरम्यान बदल करण्यासाठी वापरला जातो.
ms: Corak lenyap digunakan untuk peralihan antara unsur UI yang tidak mempunyai perhubungan yang kukuh antara satu sama lain.
my: မှိန်သွားသည့်ပုံစံကို တစ်ခုနှင့်တစ်ခု ခိုင်မာသည့်ဆက်နွယ်မှုမရှိသော UI အစိတ်အပိုင်းများကြားတွင် ကူပြောင်းမှုများအတွက် အသုံးပြုသည်။
nb: Gjennomtoningsmønsteret brukes for overganger mellom elementer i brukergrensesnittet som ikke har et sterkt forhold til hverandre.
ne: फेड थ्रु प्याटर्न एक आपसमा बलियो सम्बन्ध भएका UI एलिमेन्टहरूबिच हुने ट्रान्जिसनका लागि प्रयोग गरिन्छ।
pa: ਫੇਡ ਥਰੂ ਪੈਟਰਨ ਅਜਿਹੇ UI ਤੱਤਾਂ ਵਿਚਾਲੇ ਪਰਿਵਰਤਨਾਂ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਿਨ੍ਹਾਂ ਵਿਚਾਲੇ ਮਜ਼ਬੂਤ ਸੰਬੰਧ ਨਹੀਂ ਹੁੰਦਾ।
pl: Wzorzec Przenikanie jest przeznaczony dla przejść między elementami interfejsu, między którymi nie ma wyraźnego związku.
pt: O padrão de esmaecimento é usado para transições entre elementos da IU que não têm uma relação forte entre si.
pt_pt: O padrão de desvanecimento é utilizado para transições entre elementos da IU que não têm uma relação forte entre si.
ro: Modelul de înlocuire gradată este folosit pentru tranziții între elemente IU între care nu există o legătură strânsă.
ru: Плавное переключение используется для переходов между элементами пользовательского интерфейса, между которыми нет тесной связи.
si: එකිනෙක සමඟ ශක්තිමත් සම්බන්ධතාවයක් නොමැති UI මූලාංග අතර සංක්‍රාන්තිය සඳහා මැකී යාමේ රටාව භාවිතා වේ.
sk: Vzor postupného miznutia sa používa v prípade prechodov medzi prvkami používateľského rozhrania, ktoré nie sú v silnom vzájomnom vzťahu.
sq: Motivi i zbehjes graduale përdoret për kalimet mes elementeve të ndërfaqes së përdoruesit që nuk kanë marrëdhënie të fortë me njëri-tjetrin.
sr: Шаблон постепеног прелаза се користи за прелаз између елемената корисничког интерфејса који немају јак међусобни однос.
sr_latn: Šablon postepenog prelaza se koristi za prelaz između elemenata korisničkog interfejsa koji nemaju jak međusobni odnos.
sv: Mönstret med genomtoning används för övergångar mellan element i användargränssnittet som inte har någon tydlig inbördes koppling.
te: ఒకదానితో ఒకటి బలమైన సంబంధం లేని UI మూలకాల మధ్య పరివర్తనల కోసం ఫేడ్ త్రూ ఆకృతి ఉపయోగించబడుతుంది.
th: รูปแบบ "จางผ่าน" ใช้กับการเปลี่ยนระหว่างองค์ประกอบ UI ที่ไม่มีความสัมพันธ์ที่มีอิทธิพลต่อกัน
tr: Şeffaflaşarak geçiş deseni, birbiriyle güçlü bir ilişkisi olmayan kullanıcı arayüzü öğeleri arasındaki geçişler için kullanılır.
uk: Стиль "Перехід зі зникненням" призначений для переходів між елементами інтерфейсу, які безпосередньо не пов'язані між собою.
ur: فیڈ تھرو پیٹرن کا استعمال UI عناصر کے درمیان ٹرانزیشن کے لیے کیا جاتا ہے جس کا ایک دوسرے کے ساتھ مضبوط تعلق نہیں ہوتا ہے۔
uz: Silliq oʻzgarish bir-biriga kuchli aloqasi boʻlmagan foydalanuvchi interfeysi elementlari orasidagi oʻtishlarga moʻljallangan.
vi: Mẫu chuyển mờ được dùng cho quá trình chuyển đổi giữa các thành phần giao diện người dùng không có mối quan hệ chặt chẽ với nhau.
zh_hk: 交匯淡出模式用於轉移沒有明確關係的使用者介面元素。
zu: Iphethini yokufiphala kudlulwe isetshenziselwa ukudlula okuphakathi kwama-elementi e-UI anganabo ubudlelwano obuqinile kokunye.

# demoFadeThroughTitle
source: Fade through
af: Deurdoof
am: በዚህ በኩል አደብዝዝ፦
ar_eg: التلاشي التدريجي
as: ফে’ড থ্ৰু
az: Tədricən solğunlaşma
be: Паступовае змяненне
bn: বরাবর অস্পষ্ট
bs: Iščezavanje s prijelazom
ca: Esvaïment
da: Fortoning
es_ar: Atenuación rápida
et: Läbihajutus
eu: Agertzea eta desagertzea
fa: محو کردن گسترده
fr_ca: Atténuation graduelle
gl: Esvaecer
gu: ફેડ થ્રૂ
he: להפוך לשקוף בהדרגה
hi: फ़ेड थ्रू
hu: Áttűnés
hy: Սահուն անցում
id: Memudar
it: Dissolvenza tramite
ja: フェードスルー
ka: ჩაბნელება
km: លេចឡើង​ពីក្នុង
kn: ಫೇಡ್ ಥ್ರೂ
ko: 페이드 스루
ky: Ортосунан баштап бозоруу
lo: ຈາງຫາຍ
lt: Išblukimas
lv: Pakāpeniska izzušana un parādīšanās
mk: Избледување низ сите
ml: ഫേഡ് ത്രൂ
mn: Нэвт уусах
mr: फेड थ्रू
ms: Lenyap
my: မှိန်သွားသည်
nb: Ton gjennom
ne: फेड थ्रु
pa: ਫੇਡ ਥਰੂ
pl: Przenikanie
pt: Esmaecer
pt_pt: Desvanecimento
ro: Înlocuire gradată
ru: Плавное переключение
si: මැකී යාම
sk: Postupné miznutie
sq: Zbehje graduale
sr: Постепени прелаз
sr_latn: Postepeni prelaz
sv: Tona genom
te: ఫేడ్ త్రూ
th: จางผ่าน
tr: Şeffaflaşarak geçiş
uk: Перехід зі зникненням
ur: فیڈ تھرو
uz: Shaffof almashinuv
vi: Chuyển mờ
zh_hk: 交匯淡出
zu: Fiphala udlulele

# demoSharedZAxisHelpSettingLabel
source: Help
af: Hulp
am: እገዛ
ar_eg: مساعدة
as: সহায়
az: Yardım
be: Даведка
bn: সহায়তা
bs: Pomoć
ca: Ajuda
da: Hjælp
es_ar: Ayuda
et: Abi
eu: Laguntza
fa: راهنما
fil: Tulong
fr_ca: Aide
gl: Axuda
gu: સહાય
he: עזרה
hi: सहायता
hu: Súgó
hy: Օգնություն
id: Bantuan
it: Guida
ja: ヘルプ
ka: დახმარება
km: ជំនួយ
kn: ಸಹಾಯ
ko: 도움말
ky: Жардам
lo: ຊ່ວຍເຫຼືອ
lt: Pagalba
lv: Palīdzība
mk: Помош
ml: സഹായം
mn: Тусламж
mr: मदत
ms: Bantuan
my: အကူအညီ
nb: Hjelp
ne: मद्दत
pa: ਮਦਦ
pl: Pomoc
pt: Ajuda
pt_pt: Ajuda
ro: Ajutor
ru: Справка
si: උදවු
sk: Pomocník
sq: Ndihma
sr: Помоћ
sr_latn: Pomoć
sv: Hjälp
te: సహాయం
th: ความช่วยเหลือ
tr: Yardım
uk: Довідка
ur: مدد
uz: Yordam
vi: Trợ giúp
zh_hk: 說明
zu: Usizo

# demoMotionSubtitle
source: All of the predefined transition patterns
af: Al die voorafgedefinieerde oorgangspatrone
am: ሁሉም ቅድሚያ የተገለጹ የሽግግር ስርዓተ ጥለቶች
ar_eg: كل أنماط الانتقال المُعرَّفة مسبقًا
as: সকলো পূর্বনির্ধাৰিত ট্ৰানজিশ্বনৰ আৰ্হি
az: Əvvəldən müəyyənləşdirilmiş bütün keçid modelləri
be: Усе стандартныя шаблоны пераходу
bn: পূর্বনির্ধারিত সব ট্রানজিশনের প্যাটার্ন
bs: Svi unaprijed definirani obrasci prijelaza
ca: Tots els patrons de transició predefinits
da: Alle de foruddefinerede overgangsmønstre
es_ar: Todos los patrones de transición predefinidos
et: Kõik eelmääratud üleminekumustrid
eu: Aurrez zehaztutako trantsizio-eredu guztiak
fa: همه الگوهای انتقال از پیش تعریف‌شده
fil: Lahat ng naka-predefine na pattern ng transition
fr_ca: Tous les motifs de la transition prédéfinie
gl: Todos os padróns de transición predefinidos
gu: પૂર્વવ્યાખ્યાયિત ટ્રાંઝિશનની બધી જ પૅટર્ન
he: כל דפוסי המעבר המוגדרים מראש
hi: पहले से तय किए गए सभी ट्रांज़िशन पैटर्न
hu: Az előre meghatározott áttűnési minták mindegyike
hy: Բոլոր ստանդարտ անցումները
id: Semua pola transisi yang sudah ditentukan
it: Tutti i pattern di transizione predefiniti
ja: 事前定義のすべての移行パターン
ka: გადასვლის ყველა წინასწარ განასაზღვრული ნიმუში
km: លំនាំនៃការ​ផ្លាស់ប្ដូរ​ដែលបានកំណត់​ជាមុនទាំងអស់
kn: ಎಲ್ಲಾ ಪೂರ್ವನಿರ್ಧರಿತ ಪರಿವರ್ತನೆಯ ಪ್ಯಾಟರ್ನ್‌ಗಳು
ko: 사전 정의된 전환 패턴 전체
ky: Бардык алдын ала аныкталган өтмө шаблондор
lo: ຮູບແບບການປ່ຽນທີ່ກຳນົດໄວ້ລ່ວງໜ້າທັງໝົດ
lt: Visi iš anksto nustatyti perkėlimo šablonai
lv: Visas iepriekš definētās pārejas formas
mk: Сите однапред дефинирани шеми на транзиција
ml: മൂൻകൂട്ടി നിശ്ചയിച്ച എല്ലാ ട്രാൻസിഷൻ പാറ്റേണുകളും
mn: Бүх урьдчилан тодорхойлсон шилжилтийн загвар
mr: बदलाचे सर्व पूर्वनिर्धारित पॅटर्न
ms: Semua corak peralihan yang dipratentukan
my: ကြိုတင်သတ်မှတ်ထားသည့် ကူးပြောင်းမှုပုံစံအားလုံး
nb: Alle de forhåndsdefinerte overgangsmønstrene
ne: पहिले नै तय गरिएका सबै ट्रान्जिसन प्याटर्न
pa: ਪਹਿਲਾਂ ਤੋਂ ਪਰਿਭਾਸ਼ਿਤ ਪਰਿਵਰਤਨ ਪੈਟਰਨ
pl: Wszystkie predefiniowane wzorce przejść
pt: Todos os padrões de transição pré-definidos
pt_pt: Todos os padrões de transição predefinidos.
ro: Toate modelele de tranziție predefinite
ru: Все стандартные переходы
si: සියලු පූර්ව නිර්ණිත සංක්‍රාන්ති රටා
sk: Všetky preddefinované vzory prechodov
sq: Të gjitha motivet e paracaktuara të kalimit
sr: Сви унапред дефинисани шаблони прелаза
sr_latn: Svi unapred definisani šabloni prelaza
sv: Alla fördefinierade övergångsmönster
te: ముందే నిర్వచించిన పరివర్తన ఆకృతులు
th: รูปแบบต่างๆ ของการเปลี่ยนที่กำหนดค่าไว้ล่วงหน้า
tr: Önceden tanımlanmış tüm geçiş desenleri
uk: Усі стандартні стилі переходів
ur: پہلے سے متعینہ ٹرانزٹ کے سبھی پیٹرنز
uz: Barcha standart oʻtishlar
vi: Tất cả mẫu chuyển đổi định sẵn
zh_hk: 所有預先定義的轉移模式
zu: Wonke amaphethini okudlula achazwe ngaphambilini

# demoSharedZAxisNotificationSettingLabel
source: Notifications
af: Kennisgewings
am: ማሳወቂያዎች
ar_eg: الإشعارات
as: জাননীসমূহ
az: Bildirişlər
be: Апавяшчэнні
bn: বিজ্ঞপ্তি
bs: Obavještenja
ca: Notificacions
da: Notifikationer
es_ar: Notificaciones
et: Märguanded
eu: Jakinarazpenak
fa: اعلان‌ها
fil: Mga Notification
gl: Notificacións
gu: નોટિફિકેશન
he: הודעות
hi: सूचनाएं
hu: Értesítések
hy: Ծանուցումներ
id: Notifikasi
it: Notifiche
ja: 通知
ka: შეტყობინებები
km: ការ​ជូនដំណឹង
kn: ಅಧಿಸೂಚನೆಗಳು
ko: 알림
ky: Билдирмелер
lo: ການແຈ້ງເຕືອນ
lt: Pranešimai
lv: Paziņojumi
mk: Известувања
ml: അറിയിപ്പുകൾ
mn: Мэдэгдлүүд
mr: सूचना
ms: Pemberitahuan
my: သတိပေးချက်များ
nb: Varsler
ne: सूचना
pa: ਸੂਚਨਾਵਾਂ
pl: Powiadomienia
pt: Notificações
pt_pt: Notificações
ro: Notificări
ru: Уведомления
si: දැනුම්දීම්
sk: Upozornenia
sq: Njoftimet
sr: Обавештења
sr_latn: Obaveštenja
sv: Aviseringar
te: నోటిఫికేషన్‌లు
th: การแจ้งเตือน
tr: Bildirimler
uk: Сповіщення
ur: اطلاعات
uz: Bildirishnomalar
vi: Thông báo
zh_hk: 通知
zu: Izaziso

# demoSharedZAxisProfileSettingLabel
source: Profile
af: Profiel
am: መገለጫ
ar_eg: الملف الشخصي
as: প্ৰ’ফাইল
az: Profil
be: Профіль
bn: প্রোফাইল
bs: Profil
ca: Perfil
da: Profil
es_ar: Perfil
et: Profiil
eu: Profila
fa: نمایه
fr_ca: Profil
gl: Perfil
gu: પ્રોફાઇલ
he: פרופיל
hi: प्रोफ़ाइल
hu: Profil
hy: Պրոֆիլ
id: Profil
it: Profilo
ja: プロフィール
ka: პროფილი
km: កម្រងព័ត៌មាន
kn: ಪ್ರೊಫೈಲ್
ko: 프로필
ky: Профиль
lo: ໂປຣໄຟລ໌
lt: Profilis
lv: Profils
mk: Профил
ml: പ്രൊഫൈൽ
mn: Профайл
mr: प्रोफाइल
ms: Profil
my: ပရိုဖိုင်
nb: Profil
ne: प्रोफाइल
pa: ਪ੍ਰੋਫਾਈਲ
pl: Profil
pt: Perfil
pt_pt: Perfil
ro: Profil
ru: Профиль
si: පැතිකඩ
sk: Profil
sq: Profili
sr: Профил
sr_latn: Profil
sv: Profil
te: ప్రొఫైల్
th: โปรไฟล์
tr: Profil
uk: Профіль
ur: پروفائل
uz: Profil
vi: Hồ sơ
zh_hk: 個人檔案
zu: Iphrofayela

# demoSharedZAxisSavedRecipesListTitle
source: Saved Recipes
af: Gestoorde resepte
am: የተቀመጡ የምግብ አሰራሮች
ar_eg: الوصفات المحفوظة
as: ছেভ কৰি থোৱা ৰন্ধনবিধিসমূহ
az: Yadda saxlanmış reseptlər
be: Захаваныя рэцэпты
bn: সেভ করা রেসিপি
bs: Sačuvani recepti
ca: Receptes desades
da: Gemte opskrifter
es_ar: Recetas guardadas
et: Salvestatud retseptid
eu: Gordetako errezetak
fa: دستورهای پخت ذخیره‌شده
fil: Mga Naka-save na Recipe
fr_ca: Recettes enregistrées
gl: Receitas gardadas
gu: સાચવેલી રૅસિપિ
he: מתכונים שמורים
hi: सेव की गई रेसिपी
hu: Mentett receptek
hy: Պահված բաղադրատոմսեր
id: Resep yang Tersimpan
it: Ricette salvate
ja: 保存済みのレシピ
ka: შენახული რეცეპტები
km: រូបមន្ត​ដែលបានរក្សាទុក
kn: ಉಳಿಸಲಾದ ರೆಸಿಪಿಗಳು
ko: 저장된 레시피
ky: Сакталган рецепттер
lo: ສູດອາຫານທີ່ບັນທຶກໄວ້
lt: Išsaugoti receptai
lv: Saglabātās receptes
mk: Зачувани рецепти
ml: സംരക്ഷിച്ച റെസിപ്പികൾ
mn: Хадгалсан жорууд
mr: सेव्ह केलेल्या पाककृती
ms: Resipi yang Disimpan
my: သိမ်းထားသော ဟင်းချက်နည်းများ
nb: Lagrede oppskrifter
ne: सुरक्षित गरिएका पाकविधि
pa: ਰੱਖਿਅਤ ਕੀਤੀਆਂ ਪਕਵਾਨ-ਵਿਧੀਆਂ
pl: Zapisane przepisy
pt: Receitas salvas
pt_pt: Receitas guardadas
ro: Rețete salvate
ru: Сохраненные рецепты
si: සුරැකි වට්ටෝරු
sk: Uložené recepty
sq: Recetat e ruajtura
sr: Сачувани рецепти
sr_latn: Sačuvani recepti
sv: Sparade recept
te: సేవ్ చేసిన వంటకాల తయారీ విధానాలు
th: สูตรที่บันทึกไว้
tr: Kaydedilen Tarifler
uk: Збережені рецепти
ur: محفوظ کردہ نسخے
uz: Saqlangan retseptlar
vi: Công thức nấu ăn đã lưu
zh_hk: 已儲存的食譜
zu: Amaresiphu Alondoloziwe
