Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# colorsLightBlue
source: LIGHT BLUE
af: LIGBLOU
am: ፈካ ያለ ሰማያዊ
ar_eg: أزرق فاتح
as: পাতল নীলা
az: AÇIQ MAVİ
be: СВЕТЛА-СІНІ
bn: হালকা নীল
bs: SVIJETLOPLAVA
ca: BLAU CLAR
da: LYSEBLÅ
es_ar: CELESTE
et: HELESININE
eu: URDIN ARGIA
fa: آبی روشن
fr_ca: BLEU CLAIR
gl: AZUL CLARO
gu: આછો વાદળી
he: תכלת
hi: हल्का नीला
hu: VILÁGOSKÉK
hy: ԲԱՑ ԿԱՊՈՒՅՏ
id: BIRU MUDA
it: AZZURRO
ja: ライトブルー
ka: ცისფერი
km: ខៀវ​ស្រាល
kn: ತಿಳಿ ನೀಲಿ ಬಣ್ಣ
ko: 하늘색
ky: МАЛА КӨК
lo: ສີຟ້າອ່ອນ
lt: ŠVIESIAI MĖLYNA
lv: GAIŠI ZILA
mk: СВЕТЛОСИНА
ml: ഇളം നീല
mn: ЦАЙВАР ЦЭНХЭР
mr: फिकट निळा
ms: BIRU MUDA
my: အပြာဖျော့
nb: LYSEBLÅ
ne: हल्का निलो
pa: ਹਲਕਾ ਨੀਲਾ
pl: JASNONIEBIESKI
pt: AZUL-CLARO
pt_pt: AZUL CLARO
ro: ALBASTRU DESCHIS
ru: СВЕТЛО-ГОЛУБОЙ
si: ලා නිල්
sk: SVETLOMODRÁ
sq: BLU E ÇELUR
sr: СВЕТЛОПЛАВО
sr_latn: SVETLOPLAVO
sv: LJUSBLÅ
te: లేత నీలి రంగు
th: ฟ้าอ่อน
tr: AÇIK MAVİ
uk: СВІТЛО-СИНІЙ
ur: ہلکا نیلا
uz: HAVORANG
vi: MÀU XANH LAM NHẠT
zh_hk: 淺藍色
zu: OKULUHLAZA OKWESIBHAKABHAKA NGOKUKHANYAYO

# colorsCyan
source: CYAN
af: GROENBLOU
am: አረንጓዴ-ሰማያዊ
ar_eg: سماوي
as: চায়ান
az: MAVİ
be: БЛАКІТНЫ
bn: সবুজ-নীল
bs: CIJAN
ca: CIAN
es_ar: CIAN
et: TSÜAAN
eu: ZIANA
fa: فیروزه‌ای
gl: CIANO
gu: સ્યાન
he: ציאן
hi: सियान
hu: ZÖLDESKÉK
hy: ԵՐԿՆԱԳՈՒՅՆ
id: BIRU KEHIJAUAN
it: CIANO
ja: シアン
ka: ციანი
km: ស៊ីលៀប
kn: ಹಸಿರುನೀಲಿ ಬಣ್ಣ
ko: 청록색
ky: КӨГҮЛТҮР
lo: ສີຟ້າຂຽວ
lt: ŽYDRA
lv: CIĀNZILA
mk: ЦИЈАН
ml: സിയാൻ
mn: НОГООН ЦЭНХЭР
mr: निळसर
ms: BIRU KEHIJAUAN
my: စိမ်းပြာ
nb: TURKIS
ne: सायन
pa: ਹਰਾ ਨੀਲਾ
pl: CYJAN
pt: CIANO
pt_pt: AZUL-TURQUESA
ru: ЦИАН
si: මයුර නීල
sk: TYRKYSOVÁ
sq: I KALTËR
sr: ТИРКИЗНА
sr_latn: TIRKIZNA
sv: CYANBLÅ
te: ముదురు నీలం
th: น้ำเงินเขียว
tr: CAMGÖBEĞİ
uk: БЛАКИТНИЙ
ur: ازرق
uz: ZANGORI
vi: MÀU XANH LƠ
zh_hk: 青藍色
zu: I-CYAN

# dialogAddAccount
source: Add account
af: Voeg rekening by
am: መለያ አክል
ar_eg: إضافة حساب
as: একাউণ্ট যোগ কৰক
az: Hesab əlavə edin
be: Дадаць уліковы запіс
bn: অ্যাকাউন্ট যোগ করুন
bs: Dodaj račun
ca: Afegeix un compte
da: Tilføj konto
es_ar: Agregar cuenta
et: Lisa konto
eu: Gehitu kontu bat
fa: افزودن حساب
fil: Magdagdag ng account
fr_ca: Ajouter un compte
gl: Engadir conta
gu: એકાઉન્ટ ઉમેરો
he: הוספת חשבון
hi: खाता जोड़ें
hu: Fiók hozzáadása
hy: Ավելացնել հաշիվ
id: Tambahkan akun
it: Aggiungi account
ja: アカウントを追加
ka: ანგარიშის დამატება
km: បញ្ចូលគណនី
kn: ಖಾತೆಯನ್ನು ಸೇರಿಸಿ
ko: 계정 추가
ky: Аккаунт кошуу
lo: ເພີ່ມບັນຊີ
lt: Pridėti paskyrą
lv: Pievienot kontu
mk: Додајте сметка
ml: അക്കൗണ്ട് ചേർക്കുക
mn: Бүртгэл нэмэх
mr: खाते जोडा
ms: Tambah akaun
my: အကောင့်ထည့်ရန်
nb: Legg til en konto
ne: खाता थप्नुहोस्
pa: ਖਾਤਾ ਸ਼ਾਮਲ ਕਰੋ
pl: Dodaj konto
pt: Adicionar conta
pt_pt: Adicionar conta
ro: Adăugați un cont
ru: Добавить аккаунт
si: ගිණුම එක් කරන්න
sk: Pridať účet
sq: Shto llogari
sr: Додај налог
sr_latn: Dodaj nalog
sv: Lägg till konto
te: ఖాతాను జోడించండి
th: เพิ่มบัญชี
tr: Hesap ekle
uk: Додати обліковий запис
ur: اکاؤنٹ شامل کریں
uz: Hisob qoʻshish
vi: Thêm tài khoản
zh_hk: 新增帳戶
zu: Engeza i-akhawunti

# demoTwoPaneTitle
source: TwoPane
am: ባለሁለት-ፔን
fa: دوصفحه‌ای
zu: I-TwoPane

# shrineProductPrice
source: x {price}
eu: × {price}
fa: ×‏{price}
hu: × {price}
lt: po {price}
sk: × {price}

# demoNavigationDrawerUserEmail
source: user.name@example.com
af: gebruiker.naam@voorbeeld.com
ca: nom.usuari@example.com
da: brugernavn@eksempel.com
es_ar: nombre.de.usuario@example.com
et: kasutaja.nimi@näide.com
lv: lietotaja.vards@example.com
mk: korisnicko.ime@primer.com
pl: nazwa.użytkownika@example.com
pt: nome.de.usuario@example.com
pt_pt: nome.de.utilizador@example.com

# craneFlightDuration
source: {hoursShortForm} {minutesShortForm}
eu: {hoursShortForm} eta {minutesShortForm}
gl: {hoursShortForm} e {minutesShortForm}
pt: {hoursShortForm} e {minutesShortForm}
