Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoMenuPreview
source: Preview
af: Voorskou
am: ቅድመ ዕይታ
ar_eg: معاينة
as: পূৰ্বদৰ্শন
az: Önizləmə
be: Прагледзець
bn: প্রিভিউ
bs: Pregled
ca: Previsualitza
da: Se forhåndsvisning
es_ar: Obtener vista previa
et: Eelvaade
eu: Aurreikusi
fa: پیش‌نمایش
fil: I-preview
fr_ca: Aperçu
gl: Vista previa
gu: પ્રીવ્યૂ કરો
he: תצוגה מקדימה
hi: झलक देखें
hu: Előnézet
hy: Դիտել
id: Pratinjau
it: Anteprima
ja: プレビュー
ka: გადახედვა
km: មើលសាកល្បង
kn: ಪೂರ್ವವೀಕ್ಷಣೆ
ko: 미리보기
ky: Алдын ала көрүү
lo: ຕົວຢ່າງ
lt: Peržiūrėti
lv: Priekšskatīt
mk: Преглед
ml: പ്രിവ്യു
mn: Урьдчилан үзэх
mr: पूर्वावलोकन
ms: Pratonton
my: အစမ်းကြည့်ရန်
nb: Se forhåndsvisning
ne: पूर्वावलोकन
pa: ਪੂਰਵ-ਝਲਕ
pl: Podgląd
pt: Visualizar
pt_pt: Pré-visualizar
ro: Previzualizați
ru: Предпросмотр
si: පෙරදසුන
sk: Zobraziť ukážku
sq: Shiko paraprakisht
sr: Преглед
sr_latn: Pregled
sv: Förhandsgranska
te: ప్రివ్యూ
th: แสดงตัวอย่าง
tr: Önizle
uk: Переглянути
ur: پیش منظر
uz: Razm solish
vi: Xem trước
zh_hk: 預覽
zu: Buka kuqala

# demoBottomAppBarTitle
source: Bottom app bar
af: Onderste programbalk
am: የግርጌ መተግበሪያ አሞሌ
ar_eg: شريط التطبيق السفلي
as: তলত অৱস্থিত এপ্‌ বাৰ
az: Alt tətbiq paneli
be: Ніжняя панэль праграм
bn: স্ক্রিনের নিচের দিকে থাকা অ্যাপ বার
bs: Donja traka aplikacije
ca: Barra de l'aplicació de la part inferior
da: Appbjælke nederst på skærmen
es_ar: Barra de la app inferior
et: Alumine rakenduseriba
eu: Aplikazioaren behealdeko barra
fa: نوار برنامه پایین صفحه
fil: Bar ng app sa ibaba
fr_ca: Barre d'applications inférieure
gl: Barra de aplicacións inferior
gu: ઍપનો સૌથી નીચેનો બાર
he: סרגל האפליקציה התחתון
hi: बॉटम ऐप्लिकेशन बार
hu: Alsó alkalmazássáv
hy: Հավելվածների ստորին գոտի
id: Panel aplikasi bawah
it: Barra dell'app in basso
ja: ボトム アプリバー
ka: აპების ქვედა ზოლი
km: របារកម្មវិធី​ផ្នែកខាងក្រោម
kn: ಬಾಟಮ್ ಆ್ಯಪ್ ಬಾರ್
ko: 하단 앱 바
ky: Колдонмонун ылдый жакта жайгашкан тилкеси
lo: ແຖບແອັບທາງລຸ່ມ
lt: Apatinė programų juosta
lv: Apakšējā lietotņu josla
mk: Долна лента со апликации
ml: ചുവടെയുള്ള ആപ്പ് ബാർ
mn: Доод талд байрлах аппын самбар
mr: तळाशी ॲप बार
ms: Bar apl sebelah bawah
my: အောက်ခြေရှိ အက်ပ်ဘား
nb: Nederste apprad
ne: एप फेदको बार
pa: ਹੇਠਲੀ ਐਪ ਬਾਰ
pl: Dolny pasek aplikacji
pt: Barra de apps inferior
pt_pt: Barra de apps inferior
ro: Bara de aplicații din partea de jos
ru: Нижняя панель приложения
si: පහළ යෙදුම් තීරුව
sk: Dolný panel aplikácií
sq: Shiriti i aplikacioneve në fund
sr: Доња трака са апликацијама
sr_latn: Donja traka sa aplikacijama
sv: Nedre appfält
te: దిగువ యాప్ బార్
th: แถบด้านล่างของแอป
tr: Alt uygulama çubuğu
uk: Нижня панель додатків
ur: نیچے کا ایپ بار
uz: Quyi ilovalar paneli
vi: Thanh ứng dụng ở dưới cùng
zh_hk: 底部應用程式列
zu: Ibha yaphansi yohlelo lokusebenza

# demoBottomAppBarDescription
source: Bottom app bars provide access to a bottom navigation drawer and up to four actions, including the floating action button.
af: Onderste programbalke bied toegang tot 'n onderste navigasielaai en tot vier handelinge, insluitend die swewende handelingknoppie.
am: የግርጌ መተግበሪያ አሞሌዎች ለግርጌ ዳሰሳ መሳቢያ እና እስከ አራት ለሚደርሱ እርምጃዎች ለተንሳፋፊ የእርምጃ አዝራር ጨምሮ መዳረሻን ያቀርባሉ።
ar_eg: تساعدك أشرطة التطبيقات السفلية على الوصول إلى لائحة التنقل السفلية وما يصل إلى أربعة إجراءات، بما في ذلك زر الإجراء العائم.
as: তলত অৱস্থিত এপ্‌ বাৰে নিম্নাংশত থকা এটা নেভিগে’শ্বন ড্ৰৱাৰ আৰু ওপঙি থকা কাৰ্য বুটামকে ধৰি চাৰিটা কাৰ্যলৈ এক্সেছ প্ৰদান কৰে।
az: Alt tətbiq panelləri alt naviqasiya siyirməsi və dördə qədər əməliyyata, o cümlədən, üzən əməliyyat düyməsinə giriş təmin edir.
be: Ніжнія панэлі праграм даюць доступ да высоўнага меню навігацыі ўнізе экрана, а таксама максімум да чатырох дзеянняў, уключаючы рухомую кнопку дзеяння.
bn: স্ক্রিনের নিচের দিকের অ্যাপ বার থেকে নিচের নেভিগেশন ড্রয়ার এবং ফ্লোটিং অ্যাকশন বোতাম সহ সর্বোচ্চ আরও চারটে অ্যাকশন অ্যাক্সেস করার অনুমতি দেয়।
bs: Donje trake aplikacije pružaju pristup donjem panelu za navigaciju i maksimalno četiri radnje, uključujući plutajuće dugme za radnju.
ca: Les barres d'aplicacions de la part inferior permeten accedir a un tauler de navegació de la part inferior i a un màxim de quatre accions, inclosa la del botó d'acció flotant.
da: Appbjælker nederst på skærmen giver adgang til en sidemenu i bunden af skærmen og op til fire handlinger, bl.a. den svævende handlingsknap.
es_ar: Las barras de apps inferiores proporcionan acceso a un panel lateral de navegación en la parte inferior y hasta cuatro acciones, incluido el botón de acción flotante.
et: Alumised rakenduseribad võimaldavad juurdepääsu alumisele navigeerimissahtlile ja kuni neljale toimingule, sealhulgas hõljuvale toimingunupule.
eu: Aplikazioaren behealdeko barrak nabigazio-panel lerrakor bat erakusten du, bai eta erabilgarri dauden ekintzak ere (gehienez, lau). Barra horretan agertzen da ekintza-botoi gainerakorra ere.
fa: نوارهای برنامه پایین صفحه دسترسی به کشوی پیمایش پایین صفحه و تا چهار کنش (ازجمله دکمه عمل شناور) را امکان‌پذیر می‌کنند.
fil: Nagbibigay ang mga bar ng app sa ibaba ng access sa navigation drawer sa ibaba at sa hanggang apat na pagkilos, kasama ang floating action button.
fr_ca: Les barres d'applications inférieures procurent l'accès à un panneau de navigation inférieur et jusqu'à quatre actions, y compris le bouton d'action flottant.
gl: Coas barras de aplicacións inferiores pódese acceder a un panel de navegación inferior e como máximo a catro accións, incluído o botón de acción flotante.
gu: ઍપના સૌથી નીચેના બાર, ફ્લોટિંગ એક્શન બટન સહિત સૌથી નીચેના નૅવિગેશન ડ્રોઅર અને વધુમાં વધુ ચાર ક્રિયાઓનો ઍક્સેસ પ્રદાન કરે છે.
he: סרגלי אפליקציה תחתונים נותנים גישה לחלונית הזזה תחתית לניווט ולארבע פעולות לכל היותר, כולל לחצן הפעולה הצף.
hi: स्क्रीन के सबसे नीचे मौजूद ऐप्लिकेशन बार (बॉटम ऐप्लिकेशन बार), नीचे की ओर खुलने वाले नेविगेशन पैनल (बॉटम नेविगेशन पैनल) और ज़्यादा से ज़्यादा चार कार्रवाइयों के लिए ऐक्सेस देते हैं. इन कार्रवाइयों में फ़्लोट करने वाला कार्रवाई बटन भी शामिल है.
hu: Az alsó alkalmazássávok hozzáférést biztosítanak az alsó navigációs fiókhoz és akár négy művelethez (a lebegő műveletgombot is beleértve).
hy: Հավելվածների ստորին գոտում կարելի է տեղակայել նավիգացիայի դարակը և մինչև չորս գործողություն, այդ թվում գործողության լողացող կոճակը։
id: Panel aplikasi bawah memberikan akses ke maksimal empat tindakan, termasuk tombol tindakan mengambang, serta ke panel navigasi bawah.
it: Le barre dell'app in basso consentono di accedere a un riquadro di navigazione a scomparsa inferiore e a massimo quattro azioni, incluso il pulsante di azione mobile.
ja: ボトム アプリバーでは、ボトム ナビゲーション ドロワーと、フローティング アクション ボタンなど最大 4 つのアクションにアクセスできます。
ka: აპების ქვედა ზოლები უზრუნველყოფს წვდომას ნავიგაციის ქვედა უჯრაზე და ოთხამდე მოქმედებაზე, მათ შორის მოქმედების მოლივლივე ღილაკზე.
km: របារកម្មវិធី​ផ្នែកខាងក្រោមផ្ដល់​សិទ្ធិចូលប្រើ​ថត​​រុករក​នៅផ្នែកខាងក្រោម និងសកម្មភាព​រហូតដល់បួន រួមទាំងប៊ូតុងសកម្មភាពអណ្ដែត​ផងដែរ។
kn: ಫ್ಲೋಟಿಂಗ್ ಕ್ರಿಯಾ ಬಟನ್ ಸೇರಿದಂತೆ, ಕೆಳಗಿನ ನ್ಯಾವಿಗೇಶನ್ ಬಾರ್ ಮತ್ತು ನಾಲ್ಕು ಕ್ರಿಯೆಗಳವರೆಗೆ ಬಾಟಮ್ ಆ್ಯಪ್ ಬಾರ್‌ಗಳು ಪ್ರವೇಶವನ್ನು ಒದಗಿಸುತ್ತದೆ.
ko: 하단 앱 바를 통해 플로팅 작업 버튼을 포함한 최대 4개의 작업과 하단 탐색 창에 액세스할 수 있습니다.
ky: Колдонмолордун ылдый жакта жайгашкан тилкелери төмөндө жайгашкан чабыттоо суурмаларын колдонуп, төрт аракетке чейин, анын ичинде калкыма аракеттер баскычын кошууга мүмкүнчүлүк берет.
lo: ແຖບແອັບທາງລຸ່ມຈະເຮັດໃຫ້ສາມາດເຂົ້າເຖິງແຖບນຳທາງ ແລະ ຄຳສັ່ງຕ່າງໆໄດ້ສູງສຸດ 4 ຄຳສັ່ງ, ຮວມທັງປຸ່ມຄຳສັ່ງທີ່ລອຍຢູ່ໄດ້ນຳ.
lt: Apatinėse programų juostose galima pasiekti apatinį naršymo skydelį ir iki keturių veiksmų, įskaitant slankųjį veiksmo mygtuką.
lv: Apakšējās lietotņu joslas ļauj piekļūt apakšdaļā esošajai navigācijas atvilktnei un ne vairāk kā četrām darbībām, tostarp peldošajai darbības pogai.
mk: Долните ленти со апликации обезбедуваат пристап до една долна фиока за навигација и најмногу четири дејства, вклучувајќи го и лебдечкото копче за дејство.
ml: ചുവടെയുള്ള ഒരു നാവിഗേഷൻ ഡ്രോയറിലേക്കും ഫ്ലോട്ടിംഗ് പ്രവർത്തന ബട്ടൺ ഉൾപ്പെടെ നാല് പ്രവർത്തനങ്ങളിലേക്കും വരെയുള്ള ആക്‌സസ് ചുവടെയുള്ള ആപ്പ് ബാറുകൾ നൽകുന്നു.
mn: Доод талд байрлах аппын самбар нь доод талын навигацын шургуулга болон үйлдлийн хөвөгч товчлуурыг оролцуулаад дөрөв хүртэлх үйлдэлд хандах боломжийг олгодог.
mr: तळाशी असलेले बार तळाच्या नेव्हिगेशन ड्रॉवरचा आणि फ्लोटिंग अ‍ॅक्शन बटणाच्या समावेशासह कमाल चार अ‍ॅक्शनचा अ‍ॅक्सेस देते.
ms: Bar apl sebelah bawah menyediakan akses kepada laci navigasi bawah dan sehingga empat tindakan, termasuk butang tindakan terapung.
my: အောက်ခြေရှိ အက်ပ်ဘားများသည် အောက်ခြေ လမ်းညွှန်အံဆွဲနှင့် အလွတ်ရွှေ့နိုင်သည့် လုပ်ဆောင်ချက် ခလုတ်အပါအဝင် လုပ်ဆောင်ချက် လေးခုအထိ အသုံးပြုခွင့်ရရှိစေသည်။
nb: De nederste appradene gir tilgang til en uttrekksmeny nederst og opptil fire handlinger, inkludert den svevende handlingsknappen.
ne: एपका फेदका बारहरूले फ्लोटिङ कार्य बटनलगायर फेदको नेभिगेसन ड्रअर र अधिकतम चारवटा कार्यहरूमाथिको पहुँच प्रदान गर्दछन्।
pa: ਹੇਠਲੀਆਂ ਐਪ ਬਾਰਾਂ ਫਲੋਟਿੰਗ ਕਾਰਵਾਈ ਬਟਨ ਸਮੇਤ, ਹੇਠਲੇ ਨੈਵੀਗੇਸ਼ਨ ਡ੍ਰਾਅਰ ਅਤੇ ਵੱਧ ਤੋਂ ਵੱਧ ਚਾਰ ਕਾਰਵਾਈਆਂ ਕਰਨ ਦੀ ਪਹੁੰਚ ਮੁਹੱਈਆ ਕਰਵਾਉਂਦੀਆਂ ਹਨ।
pl: Dolne paski aplikacji oferują dostęp do dolnego panelu nawigacji i maksymalnie czterech działań, w tym za pomocą pływającego przycisku polecenia.
pt: As barras de apps inferiores fornecem acesso a uma gaveta de navegação e até quatro ações, incluindo o botão de ação flutuante.
pt_pt: As barras de aplicações inferiores fornecem acesso a uma gaveta de navegação inferior e até quatro ações, incluindo o botão de ação flutuante.
ro: Barele de aplicații din partea de jos oferă acces la un panou de navigare din partea de jos și la maximum patru acțiuni, între care butonul flotant pentru acțiuni.
ru: На нижней панели приложения можно разместить панель навигации и до четырех действий, включая плавающую командную кнопку.
si: පහළ යෙදුම් තීරුව පහළ සංචාලන ලාච්චුවකට සහ පාවෙන ක්‍රියා බොත්තම ඇතුළුව ක්‍රියා හතරක් දක්වා ප්‍රවේශය සපයයි.
sk: Dolné panely aplikácií poskytujú prístup k dolnému navigačnému vysúvaciemu panelu a až štyrom akciám (vrátane plávajúceho tlačidla akcie).
sq: Shiritat e aplikacioneve në fund ofrojnë qasje te një sirtar navigimi në fund dhe deri në katër veprime, duke përfshirë butonin pluskues të veprimit.
sr: Доње траке са апликацијама пружају приступ доњој фиоки за навигацију и највише четири радње, укључујући плутајуће дугме за радњу.
sr_latn: Donje trake sa aplikacijama pružaju pristup donjoj fioki za navigaciju i najviše četiri radnje, uključujući plutajuće dugme za radnju.
sv: Ett nedre appfält ger användaren åtkomst till en navigeringspanel längst ned på skärmen och upp till fyra åtgärder, inklusive den flytande åtgärdsknappen.
te: దిగువున ఉన్న నావిగేషన్ డ్రాయర్‌కు, అలాగే తేలియాడే యాక్షన్ బటన్‌తో కలిపి గరిష్ఠంగా నాలుగు చర్యలకు దిగువున ఉన్న యాప్ బార్‌లు యాక్సెస్‌ను ఇస్తాయి.
th: แถบด้านล่างของแอปช่วยในการเข้าถึงลิ้นชักการนำทางด้านล่างและการทำงานสูงสุด 4 รายการ ซึ่งรวมถึงปุ่มการทำงานแบบลอย
tr: Alt uygulama çubuğu, hem alt gezinme çekmecesine hem de kayan işlem düğmesi dahil olmak üzere dörde kadar işleme erişim sağlar.
uk: Нижня панель додатків надає доступ до нижньої панелі навігації та до щонайбільше чотирьох командних кнопок, зокрема плаваючої.
ur: نیچے کی ایپ بارز نیچے کے نیویگیشن دراز اور چار کارروائیوں تک رسائی فراہم کرتی ہیں، اس میں فلوٹنگ کارروائی کا بٹن شامل ہے۔
uz: Quyi ilovalar panelida navigatsiya paneli va toʻrttagacha amal joylash mumkin, jumladan, erkin harakatlanuvchi amal tugmasini ham.
vi: Với thanh ứng dụng ở dưới cùng, bạn có thể truy cập vào ngăn điều hướng ở dưới cùng và tối đa 4 hành động, bao gồm cả nút hành động nổi.
zh_hk: 在底部應用程式列中，您可存取底部導覽列和最多 4 個動作，包括懸浮動作按鈕。
zu: Amabha wohlelo lokusebenza waphansi anikezela ngokufinyelela kwikhabethe lokuzula eliphansi futhi kufika kwizenzo ezine, kufaka phakathi inkinobho yesenzo yokuntanta.

# bottomAppBarNotch
source: Notch
af: Keep
am: ስርጉድ
ar_eg: قطع علوي
as: নট্‌চ্চ
az: Nişan
be: Выемка
bn: নচ
bs: Urez
ca: Retall
da: Skærmhak
es_ar: Con recorte
et: Sälk
eu: Koska
fa: حاشیه بالای نمایشگر
fr_ca: Encoche
gl: Rañura
gu: નૉચ
he: חריץ
hi: नॉच
hu: Képernyőkivágás
hy: Կտրվածք
ja: ノッチ
ka: ჭრილი
km: ក្បាលឆក
kn: ನಾಚ್
ko: 노치
ky: Белги
lo: ຮອຍບາກ
lt: Įranta
lv: Izgriezums
mk: Исечок
ml: നോച്ച്
mn: Хэрчлээс
mr: नॉच
ms: Takuk
my: အချိုင့်
nb: Skjermutklipp
ne: नच गर्नुहोस्
pa: ਨੌਚ
pl: Z wycięciem
pt: Entalhe
pt_pt: Entalhe
ro: Decupaj
ru: Выемка
si: නොච්
sk: Výrez
sq: E prera
sr: Урез
sr_latn: Urez
sv: Skärmutskärning
te: నాచ్
th: รอยบาก
tr: Çentik
uk: Виріз екрана
ur: نشان
uz: Kesim
vi: Vết cắt
zh_hk: 凹口
zu: I-Notch

# bottomAppBarPosition
source: Floating Action Button Position
af: Posisie van swewende handelingknoppie
am: ተንሳፋፊ የድርጊት አዝራር አቀማመጥ
ar_eg: موضع زر الإجراء العائم
as: ওপঙি থকা কাৰ্য বুটামৰ অৱস্থান
az: Üzən Əməliyyat Düyməsi Mövqeyi
be: Пазіцыя рухомай кнопкі дзеяння
bn: যেখানে ফ্লোটিং অ্যাকশন বোতাম আছে
bs: Položaj plutajućeg dugmeta za radnju
ca: Posició del botó d'acció flotant
da: Placering af svævende handlingsknap
es_ar: Posición del botón de acción flotante
et: Hõljuva toimingunupu asukoht
eu: Ekintza-botoi gainerakorraren kokapena
fa: موقعیت «دکمه عمل» شناور
fil: Posisyon ng Floating Action Button
fr_ca: Position du bouton d'action flottant
gl: Posición do botón de acción flotante
gu: ફ્લોટિંગ ઍક્શન બટનની સ્થિતિ
he: המיקום של לחצן הפעולה הצף
hi: बॉटम ऐप्लिकेशन बार में, फ़्लोट करने वाले कार्रवाई बटन की जगह
hu: Lebegő műveletgomb pozíciója
hy: Գործողության լողացող կոճակի դիրքը
id: Posisi Tombol Tindakan Mengambang
it: Posizione del pulsante di azione mobile
ja: フローティング アクション ボタンの位置
ka: მოქმედების მოლივლივე ღილაკის პოზიცია
km: ទីតាំងប៊ូតុងសកម្មភាពអណ្ដែត
kn: ಫ್ಲೋಟಿಂಗ್ ಕ್ರಿಯಾ ಬಟನ್‌ ಸ್ಥಾನ
ko: 플로팅 작업 버튼 위치
ky: Калкыма аракеттер баскычынын абалы
lo: ຕຳແໜ່ງປຸ່ມຄຳສັ່ງແບບລອຍ
lt: Slankiojo veiksmo mygtuko pozicija
lv: Peldošās darbības pogas pozīcija
mk: Позиција на лебдечкото копче за дејство
ml: ഫ്ലോട്ടിംഗ് പ്രവർത്തന ബട്ടണിന്റെ സ്ഥാനം
mn: Үйлдлийн хөвөгч товчлуурын байршил
mr: फ्लोटिंग अ‍ॅक्शन बटणाचे स्थान
ms: Kedudukan Butang Tindakan Terapung
my: အလွတ်ရွှေ့နိုင်သည့် လုပ်ဆောင်ချက်ခလုတ် တည်နေရာ
nb: Plassering av svevende handlingsknapp
ne: फ्लोटिङ कार्य बटनको स्थिति
pa: ਫਲੋਟਿੰਗ ਕਾਰਵਾਈ ਬਟਨ ਦੀ ਸਥਿਤੀ
pl: Położenie pływającego przycisku polecenia
pt: Posição do botão de ação flutuante
pt_pt: Posição do botão de ação flutuante
ro: Poziția butonului flotant pentru acțiuni
ru: Положение плавающей командной кнопки
si: පාවෙන ක්‍රියා බොත්තමේ පිහිටීම
sk: Pozícia plávajúceho tlačidla akcie
sq: Pozicioni i butonit pluskues të veprimit
sr: Положај плутајућег дугмета за радњу
sr_latn: Položaj plutajućeg dugmeta za radnju
sv: Placering av flytande åtgärdsknapp
te: తేలియాడే యాక్షన్ బటన్ యొక్క స్థానం
th: ตำแหน่งของปุ่มการทำงานแบบลอย
tr: Kayan İşlem Düğmesinin Konumu
uk: Розташування плаваючої командної кнопки
ur: فلوٹنگ کارروائی کے بٹن کی پوزیشن
uz: Erkin harakatlanuvchi amal tugmasi joylashuvi
vi: Vị trí của nút hành động nổi
zh_hk: 懸浮動作按鈕位置
zu: Indawo Yenkinobho Yesenzo Yokuntanta

# bottomAppBarPositionDockedEnd
source: Docked - End
af: Gedok – einde
am: ተሰክቷል - ማብቂያ
ar_eg: ثابت، في الطرف
as: ডক কৰা - শেষত
az: Əlavə edilib - Son
be: Замацавана на краі
bn: ডক করা - নিচের দিকে
bs: Na traci – Na kraju
ca: Acoblat: al final
da: Fastgjort – Til sidst
es_ar: Anclado (extremo)
et: Dokitud – lõpus
eu: Ainguratuta - Amaieran
fa: متصل - انتها
fil: Naka-dock - Dulo
fr_ca: Ancré à l'extrémité
gl: Ancorado (final)
gu: ડૉક કર્યુ - અંતમાં
he: מעוגן - בקצה
hi: फ़्लोट करने वाले कार्रवाई बटन को नीचे दाईं तरफ़ डॉक किया गया
hu: Dokkolva – a sáv végén
hy: Վահանակի վրա՝ վերջում
id: Tersemat - Ujung
it: Ancorato: alla fine
ja: 固定 - 端
ka: ჩამაგრებული — ბოლოში
km: ភ្ជាប់ - ចុង
kn: ಡಾಕ್ ಮಾಡಿರುವುದು - ತುದಿಯಲ್ಲಿ
ko: 도킹됨 - 끝
ky: Туташтырылды - Аягы
lo: ວາງແລ້ວ - ຈຸດສິ້ນສຸດ
lt: Prijungta prie doko – pabaigoje
lv: Dokota — beigās
mk: Сокриено - на крај
ml: ഡോക്ക് ചെയ്‌തിരിക്കുന്നു - അവസാനം
mn: Суурилуулсан - төгсгөлд
mr: डॉक केलेले - शेवटी
ms: Dok - Hujung
my: နေရာချထားသည် - အဆုံး
nb: Dokket – enden
ne: डक गरियो - अन्त्यमा
pa: ਡੌਕ ਕੀਤਾ - ਸਮਾਪਤ
pl: Zadokowany – na końcu
pt: Na base: fim
pt_pt: Ancorado – no final
ro: Andocat – Capătul din dreapta
ru: На панели с краю
si: රඳවා ඇත - අග
sk: Ukotvené – na konci
sq: Lidhur me stacionin - në fund
sr: На траци са апликацијама – на крају
sr_latn: Na traci sa aplikacijama – na kraju
sv: Dockad – längst ned
te: డాక్ చేయబడింది - చివర
th: อยู่กับที่ - ส่วนท้าย
tr: Yerleştirilmiş - Uçta
uk: Закріплена (в кінці)
ur: ڈاک سے منسلک کیا گیا - اختتام
uz: Chekkaga mahkamlangan
vi: Cố định – Ở cuối
zh_hk: 已固定 - 末端
zu: Kudokhiwe - Phelisa

# bottomAppBarPositionDockedCenter
source: Docked - Center
af: Gedok – middel
am: ተሰክቷል - መሃል
ar_eg: ثابت، في الوسط
as: ডক কৰা - কেন্দ্ৰত
az: Əlavə edilib - Mərkəz
be: Замацавана ў цэнтры
bn: ডক করা - মাঝখানে
bs: Na traci – U sredini
ca: Acoblat: al centre
da: Fastgjort – I midten
es_ar: Anclado (centro)
et: Dokitud – keskel
eu: Ainguratuta - Erdian
fa: متصل - مرکز
fil: Naka-dock - Gitna
fr_ca: Ancré au centre
gl: Ancorado (centro)
gu: ડૉક કર્યુ - મધ્યમાં
he: מעוגן - במרכז
hi: फ़्लोट करने वाले कार्रवाई बटन को बीच में डॉक किया गया
hu: Dokkolva – a sáv közepén
hy: Վահանակի վրա՝ կենտրոնում
id: Tersemat - Tengah
it: Ancorato: al centro
ja: 固定 - 中央
ka: ჩამაგრებული — ცენტრში
km: ភ្ជាប់ - កណ្ដាល
kn: ಡಾಕ್ ಮಾಡಿರುವುದು - ಮಧ್ಯದಲ್ಲಿ
ko: 도킹됨 - 중앙
ky: Туташтырылды - Борбору
lo: ວາງແລ້ວ - ຈຸດທາງກາງ
lt: Prijungta prie doko – per vidurį
lv: Dokota — centrā
mk: Сокриено - на средина
ml: ഡോക്ക് ചെയ്‌തിരിക്കുന്നു - മധ്യം
mn: Суурилуулсан - төвд
mr: डॉक केलेले - मध्यभागी
ms: Dok - Tengah
my: နေရာချထားသည် - အလယ်
nb: Dokket – midten
ne: डक गरियो - मध्य भागमा
pa: ਡੌਕ ਕੀਤਾ - ਕੇਂਦਰ
pl: Zadokowany – na środku
pt: Na base: centro
pt_pt: Ancorado – no centro
ro: Andocat – Centru
ru: На панели в центре
si: රඳවා ඇත - මැද
sk: Ukotvené – v strede
sq: Lidhur me stacionin - në qendër
sr: На траци са апликацијама – у средини
sr_latn: Na traci sa aplikacijama – u sredini
sv: Dockad – mitten
te: డాక్ చేయబడింది - మధ్యలో
th: อยู่กับที่ - ตรงกลาง
tr: Yerleştirilmiş - Ortada
uk: Закріплена (посередині)
ur: ڈاک سے منسلک کیا گیا - مرکز
uz: Markazga mahkamlangan
vi: Cố định – Ở giữa
zh_hk: 已固定 - 中間
zu: Kudokhiwe - Maphakathi

# bottomAppBarPositionFloatingEnd
source: Floating - End
af: Swewend – einde
am: ተንሳፋፊ - ማብቂያ
ar_eg: عائم، في الطرف
as: ওপঙি থকা - শেষত
az: Üzən - Son
be: Рухомая кнопка на краі
bn: ফ্লোটিং - নিচের দিকে
bs: Plutajuće – Na kraju
ca: Flotant: al final
da: Svævende – Til sidst
es_ar: Flotante (extremo)
et: Hõljuv – lõpus
eu: Gainerakorra - Amaieran
fa: شناور - انتها
fil: Floating - Dulo
fr_ca: Flottant à l'extrémité
gl: Flotante (final)
gu: ફ્લોટિંગ - અંતમાં
he: צף - בקצה
hi: फ़्लोट करने वाले कार्रवाई बटन को नीचे दाईं तरफ़ लगाया गया
hu: Lebeg – a sáv végén
hy: Վահանակի վերևում՝ վերջում
id: Mengambang - Ujung
it: Mobile: alla fine
ja: フローティング - 端
ka: მოლივლივე — ბოლოში
km: អណ្ដែត - ចុង
kn: ಫ್ಲೋಟಿಂಗ್ - ತುದಿಯಲ್ಲಿ
ko: 플로팅 - 끝
ky: Калкыма - Аягы
lo: ລອຍຢູ່ - ຈຸດສິ້ນສຸດ
lt: Slankusis – pabaigoje
lv: Peldoša — beigās
mk: Лебдечко - на крај
ml: ഫ്ലോട്ടിംഗ് - അവസാനം
mn: Хөвөгч - төгсгөлд
mr: फ्लोटिंग - शेवटी
ms: Terapung - Hujung
my: အလွတ်ရွှေ့နိုင်သည် - အဆုံးတွင်ထားရန်
nb: Svevende – enden
ne: फ्लोटिङ - अन्त्यमा
pa: ਫਲੋਟਿੰਗ - ਸਮਾਪਤ
pl: Pływający – na końcu
pt: Flutuando: extremidade
pt_pt: Flutuante – no final
ro: Flotant – Capătul din dreapta
ru: Над панелью с краю
si: පාවෙන - අග
sk: Plávajúce – na konci
sq: Pluskues - në fund
sr: Плутање – на крају
sr_latn: Plutanje – na kraju
sv: Flytande – längst ned
te: తేలియాడుతోంది - చివర
th: ลอย - ส่วนท้าย
tr: Kayan - Uçta
uk: Плаваюча (в кінці)
ur: فلوٹنگ - اختتام
uz: Chekkada erkin harakatlanuvchi
vi: Nổi – Ở cuối
zh_hk: 懸浮 - 末端
zu: Ukuntanta - Phelisa

# bottomAppBarPositionFloatingCenter
source: Floating - Center
af: Swewend – middel
am: ተንሳፋፊ - መሃል
ar_eg: عائم، في الوسط
as: ওপঙি থকা - কেন্দ্ৰত
az: Üzən - Mərkəz
be: Рухомая кнопка ў цэнтры
bn: ফ্লোটিং - মাঝখানে
bs: Plutajuće – U sredini
ca: Flotant: al centre
da: Svævende – I midten
es_ar: Flotante (centro)
et: Hõljuv – keskel
eu: Gainerakorra - Erdian
fa: متصل - مرکز
fil: Floating - Gitna
fr_ca: Flottant au centre
gl: Flotante (centro)
gu: ફ્લોટિંગ - મધ્યમાં
he: צף - במרכז
hi: फ़्लोट करने वाले कार्रवाई बटन को बीच में लगाया गया
hu: Lebeg – a sáv közepén
hy: Վահանակի վերևում՝ կենտրոնում
id: Mengambang - Tengah
it: Mobile: al centro
ja: フローティング - 中央
ka: მოლივლივე — ცენტრში
km: អណ្ដែត - កណ្ដាល
kn: ಫ್ಲೋಟಿಂಗ್ - ಮಧ್ಯದಲ್ಲಿ
ko: 플로팅 - 중앙
ky: Калкыма - Борбору
lo: ລອຍຢູ່ - ຈຸດທາງກາງ
lt: Slankusis – per vidurį
lv: Peldoša — centrā
mk: Лебдечко - на средина
ml: ഫ്ലോട്ടിംഗ് - മധ്യം
mn: Хөвөгч - төвд
mr: फ्लोटिंग - मध्यभागी
ms: Terapung - Tengah
my: အလွတ်ရွှေ့နိုင်သည် - အလယ်တွင်ထားရန်
nb: Svevende – midten
ne: फ्लोटिङ - मध्य भागमा
pa: ਫਲੋਟਿੰਗ - ਕੇਂਦਰ
pl: Pływający – na środku
pt: Flutuando: centro
pt_pt: Flutuante – no centro
ro: Flotant – Centru
ru: Над панелью в центре
si: පාවෙන - මැද
sk: Plávajúce – v strede
sq: Pluskues - në qendër
sr: Плутање – у средини
sr_latn: Plutanje – u sredini
sv: Flytande – mitten
te: తేలియాడుతోంది - మధ్యలో
th: ลอย - ตรงกลาง
tr: Kayan - Ortada
uk: Плаваюча (посередині)
ur: فلوٹنگ - مرکز
uz: Markazda erkin harakatlanuvchi
vi: Nổi – Ở giữa
zh_hk: 懸浮 - 中間
zu: Ukuntanta - Maphakathi

# demoSlidersEditableNumericalValue
source: Editable numerical value
af: Wysigbare numeriese waarde
am: አርትዕ ሊደረግ የሚችል አሃዛዊ እሴት
ar_eg: قيمة رقمية قابلة للتعديل
as: সম্পাদনা কৰিব পৰা সাংখ্যিক মান
az: Redaktə olunan rəqəmli dəyər
be: Лічбавае значэнне, якое можна змяніць
bn: এডিট করা যায় এমন সাংখ্যিক মান
bs: Izmjenjiva brojčana vrijednost
ca: Valor numèric editable
da: Redigerbar numerisk værdi
es_ar: Valor numérico que se puede editar
et: Muudetav arvväärtus
eu: Zenbakizko balio editagarria
fa: مقدار عددی قابل ویرایش
fil: Nae-edit na numerong value
fr_ca: Valeur numérique modifiable
gl: Valor numérico editable
gu: ફેરફાર કરી શકાય તેવું સંખ્યાત્મક મૂલ્ય
he: ערך מספרי שניתן לעריכה
hi: ऐसा मान जिसमें बदलाव किया जा सकता है
hu: Szerkeszthető számérték
hy: Թվային արժեք
id: Nilai angka yang dapat diedit
it: Valore numerico modificabile
ja: 編集可能な数値
ka: რედაქტირებადი რიცხობრივი მნიშვნელობა
km: តម្លៃលេខដែលអាចកែបាន
kn: ಎಡಿಟ್ ಮಾಡಬಹುದಾದ ಸಂಖ್ಯಾತ್ಮಕ ಮೌಲ್ಯ
ko: 수정 가능한 숫자값
ky: Түзөтүлүүчү сан
lo: ຄ່າຕົວເລກທີ່ແກ້ໄຂໄດ້
lt: Redaguojama skaitinė vertė
lv: Rediģējama skaitliskā vērtība
mk: Нумеричка вредност што може да се изменува
ml: തിരുത്താവുന്ന സംഖ്യാപരമായ മൂല്യം
mn: Засаж болдог тоон утга
mr: संपादित करण्यायोग्य मूल्य
ms: Nilai berangka boleh edit
my: တည်းဖြတ်၍ရသော ကိန်းဂဏန်းတန်ဖိုး
nb: Redigerbar numerisk verdi
ne: सम्पादन गर्न मिल्ने सङ्ख्यात्मक मान
pa: ਸੰਪਾਦਨਯੋਗ ਸੰਖਿਆਵਾਚੀ ਮੁੱਲ
pl: Pole do wpisania wartości liczbowej
pt: Valor numérico editável
pt_pt: Valor numérico editável
ro: Valoare numerică ce poate fi editată
ru: Числовое значение
si: සංස්කරණය කළ හැකි සංඛ්‍යාත්මක අගය
sk: Upraviteľná číselná hodnota
sq: Vlera numerike e modifikueshme
sr: Нумеричка вредност која може да се измени
sr_latn: Numerička vrednost koja može da se izmeni
sv: Redigerbart siffervärde
te: ఎడిట్ చేయదగిన సంఖ్యాత్మక విలువ
th: ค่าตัวเลขที่แก้ไขได้
tr: Düzenlenebilir sayısal değer
uk: Змінне числове значення
ur: قابل ترمیم عددی قدر
uz: Raqamli qiymatlari tahrirlanuvchi
vi: Giá trị số có thể chỉnh sửa
zh_hk: 可編輯的數值
zu: Ivelu lenombolo elihlelekayo
