Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneEat5
source: Seoul, South Korea
af: Seoel 06236 Suid-Korea
am: ሲዮል፣ ደቡብ ኮሪያ
ar_eg: سول، كوريا الجنوبية
as: ছিউল, দক্ষিণ কোৰিয়া
az: Seul, Cənubi Koreya
be: Сеул, Паўднёвая Карэя
bn: সিওল, দক্ষিণ কোরিয়া
bs: Seul, Južna Koreja
ca: Seül, Corea del Sud
da: Seoul, Sydkorea
es_ar: Seúl, Corea del Sur
et: Seoul, Lõuna-Korea
eu: Seul (Hego Korea)
fa: سئول، کره جنوبی
fr_ca: Séoul, Corée du Sud
gl: Seúl, Corea do Sur
gu: સિઓલ, દક્ષિણ કોરિયા
he: סיאול, דרום קוריאה
hi: सियोल, दक्षिण कोरिया
hu: Szöul, Dél-Korea
hy: Սեուլ, Հարավային Կորեա
id: Seoul, Korea Selatan
it: Seul, Corea del Sud
ja: ソウル（韓国）
ka: სეული, სამხრეთ კორეა
km: សេអ៊ូល កូរ៉េ​ខាងត្បូង
kn: ಸಿಯೊಲ್, ದಕ್ಷಿಣ ಕೊರಿಯಾ
ko: 대한민국 서울
ky: Сеул, Түштүк Корея
lo: ໂຊລ, ເກົາຫຼີໃຕ້
lt: Seulas 06236, Pietų Korėja
lv: Seula, Dienvidkoreja
mk: Сеул, Јужна Кореја
ml: സോൾ, ദക്ഷിണ കൊറിയ
mn: Өмнөд Солонгос, Сөүл
mr: सोल, दक्षिण कोरिया
ms: Seoul, Korea Selatan
my: ဆိုးလ်၊ တောင်ကိုးရီးယား
nb: Seoul, Sør-Korea
ne: सियोल, दक्षिण कोरिया
pa: ਸਿਓਲ, ਦੱਖਣੀ ਕੋਰੀਆ
pl: Seul, Korea Południowa
pt: Seul, Coreia do Sul
pt_pt: Seul, Coreia do Sul
ro: Seoul, Coreea de Sud
ru: Сеул, Южная Корея
si: සෝල්, දකුණු කොරියාව
sk: Soul, Južná Kórea
sq: Seul, Koreja e Jugut
sr: Сеул, Јужна Кореја
sr_latn: Seul, Južna Koreja
sv: Seoul, Sydkorea
te: సియోల్, దక్షిణ కొరియా
th: โซล เกาหลีใต้
tr: Seul, Güney Kore
uk: Сеул, Республіка Корея
ur: سیول، جنوبی کوریا
uz: Seul, Janubiy Koreya
vi: Seoul, Hàn Quốc
zh_hk: 南韓首爾
zu: I-Seoul, South Korea

# demoChipTitle
source: Chips
af: Skyfies
am: ቺፖች
ar_eg: الشرائح
as: চিপসমূহ
az: Çiplər
be: Чыпы
bn: চিপস
bs: Čipovi
ca: Etiquetes
da: Tips
et: Kiibid
eu: Pilulak
fa: تراشه‌ها
fil: Mga Chip
fr_ca: Jetons
gl: Etiquetas
gu: ચિપ
he: צ'יפים
hi: चिप
hu: Szelvények
hy: Չիպեր
id: Chip
it: Chip
ja: チップ
ka: ჩიპები
km: ឈីប
kn: ಚಿಪ್‌ಗಳು
ko: 칩
ky: Чиптер
lo: ຊິບ
lt: Fragmentai
lv: Žetoni
mk: Икони
ml: ചിപ്‌സ്
mn: Чипүүд
mr: चिप
ms: Cip
my: ချစ်ပ်များ
nb: Brikker
ne: चिपहरू
pa: ਚਿੱਪਾਂ
pl: Elementy
pt: Ícones
ro: Cipuri
ru: Чипы
si: චිප
sk: Prvky
sq: Çipet
sr: Чипови
sr_latn: Čipovi
sv: Brickor
te: చిప్‌లు
th: ชิป
tr: Çipler
uk: Інтерактивні елементи
ur: چپس
uz: Elementlar
vi: Thẻ
zh_hk: 方塊
zu: Amashipsi

# demoChipSubtitle
source: Compact elements that represent an input, attribute, or action
af: Kompakte elemente wat 'n invoer, kenmerk of handeling verteenwoordig
am: አንድ ግቤት፣ ዓይነት ወይም እርምጃ የሚወክሉ እምቅ ክፍለ-አባላት
ar_eg: العناصر المضغوطة التي تمثل إدخال أو سمة أو إجراء
as: কোনো ইনপুট, বৈশিষ্ট্য অথবা কার্য প্ৰতিনিধিত্ব কৰা সংক্ষিপ্ত উপাদানবোৰ
az: Məlumat, atribut və ya əməliyyatı əks etdirən yığcam elementlər
be: Кампактныя элементы, якія ўвасабляюць увод, атрыбут або дзеянне
bn: সারিবদ্ধ এলিমেন্ট যা ইনপুট, অ্যাট্রিবিউট বা অ্যাকশনকে তুলে ধরে
bs: Kompaktni elementi koji predstavljaju unos, atribut ili radnju
ca: Elements compactes que representen una entrada, un atribut o una acció
da: Kompakte elementer, der repræsenterer et input, en attribut eller en handling
es_ar: Son elementos compactos que representan una entrada, un atributo o una acción
et: Kompaktsed elemendid, mis tähistavad sisendit, atribuuti või toimingut
eu: Sarrera, atributu edo ekintza bat adierazten duten elementu trinkoak
fa: عناصر فشرده که ورودی، ویژگی، یا کنشی را نمایش می‌دهد
fil: Mga compact na elemento na kumakatawan sa isang input, attribute, o pagkilos
fr_ca: Éléments compacts qui représentent une entrée, un attribut ou une action
gl: Elementos compactos que representan atributos, accións ou entradas de texto
gu: સંક્ષિપ્ત ઘટકો કે જે ઇનપુટ, એટ્રિબ્યુટ અથવા ઍક્શનને પ્રસ્તુત કરે છે
he: רכיבים קומפקטיים שמייצגים קלט, מאפיין או פעולה
hi: ऐसे कॉम्पैक्ट एलिमेंट जाे किसी इनपुट, विशेषता या कार्रवाई काे दिखाते हैं
hu: Kompakt elemek, amelyek bevitelt, tulajdonságot vagy műveletet jelölnek
hy: Կոմպակտ տարրեր, որոնք ներկայացնում են մուտքագրում, հատկանիշ կամ գործողություն
id: Elemen ringkas yang merepresentasikan masukan, atribut, atau tindakan
it: Elementi compatti che rappresentano un valore, un attributo o un'azione
ja: 入力、属性、アクションを表すコンパクトな要素
ka: კომპაქტური ელემენტები, რომლებიც წარმოადგენენ შენატანს, ატრიბუტს ან ქმედებას
km: ធាតុ​ចង្អៀតដែល​តំណាងឱ្យ​ធាតុ​បញ្ចូល លក្ខណៈ ឬ​សកម្មភាព
kn: ಇನ್‌ಪುಟ್, ಗುಣಲಕ್ಷಣ ಅಥವಾ ಕ್ರಿಯೆಯನ್ನು ಪ್ರತಿನಿಧಿಸುವ ನಿಬಿಡ ಅಂಶಗಳು
ko: 입력, 속성, 작업을 나타내는 간단한 요소입니다.
ky: Киргизүүнү, атрибутту же аракетти көрсөткөн жыйнактуу элементтер
lo: ອົງປະກອບກະທັດຮັດທີ່ການປ້ອນຂໍ້ມູນ, ຄຸນສົມບັດ ຫຼື ຄຳສັ່ງໃດໜຶ່ງ
lt: Kompaktiški elementai, kuriuose yra įvestis, atributas ar veiksmas
lv: Kompakti elementi, kas apzīmē ievadi, atribūtu vai darbību
mk: Компактни елементи што претставуваат внес, атрибут или дејство
ml: ഇൻപുട്ട്, ആട്രിബ്യൂട്ട് അല്ലെങ്കിൽ ആക്ഷൻ എന്നതിനെ പ്രതിനിധീകരിക്കുന്ന കോംപാക്റ്റ് മൂലകങ്ങൾ
mn: Оруулга, атрибут эсвэл үйлдлийг илэрхийлдэг товч тодорхой элемент
mr: संक्षिप्त घटक इनपुट, विशेषता किंवा क्रिया सादर करतात
ms: Unsur sarat yang mewakili input, atribut atau tindakan
my: အဝင်၊ ရည်ညွှန်းချက် သို့မဟုတ် လုပ်ဆောင်ချက်ကို ကိုယ်စားပြုသည့် ကျစ်လစ်သော အကြောင်းအရာများ
nb: Kompakte elementer som representerer inndata, egenskaper eller handlinger
ne: इनपुट, विशेषता वा एक्सनको प्रतिनिधित्व गर्ने खँदिला तत्वहरू
pa: ਸੰਖਿਪਤ ਤੱਤ ਜੋ ਇਨਪੁੱਟ, ਵਿਸ਼ੇਸ਼ਤਾ ਜਾਂ ਕਰਵਾਈ ਨੂੰ ਦਰਸਾਉਂਦੇ ਹਨ
pl: Drobne elementy reprezentujące atrybut, działanie lub tekst do wpisania
pt: Elementos compactos que representam uma entrada, um atributo ou uma ação
pt_pt: Elementos compactos que representam uma introdução, um atributo ou uma ação.
ro: Elemente compacte care reprezintă o intrare, un atribut sau o acțiune
ru: Компактные элементы, обозначающие объект, атрибут или действие
si: ආදානය, ආරෝපණය හෝ ක්‍රියාව නියෝජනය කරන සංගත අංගයකි
sk: Kompaktné prvky predstavujúce vstup, atribút alebo akciu
sq: Elemente kompakte që paraqesin një hyrje, atribut ose veprim
sr: Компактни елементи који представљају унос, атрибут или радњу
sr_latn: Kompaktni elementi koji predstavljaju unos, atribut ili radnju
sv: Kompakta element som representerar en inmatning, åtgärd eller ett attribut
te: ఇన్‌పుట్, లక్షణం లేదా చర్యలను సూచించే సంక్షిప్త మూలకాలు
th: องค์ประกอบขนาดกะทัดรัดที่แสดงอินพุต แอตทริบิวต์ หรือการทำงาน
tr: Giriş, özellik ve işlem temsil eden kompakt öğeler
uk: Компактні елементи, які представляють введений текст, атрибут або дію
ur: مختصر عناصر وہ ہیں جو ان پٹ، انتساب، یا ایکشن کی نمائندگی کر تے ہیں
uz: Kiritish, xususiyat yoki amalni aks etuvchi ixcham elementlar
vi: Các thành phần rút gọn biểu thị thông tin đầu vào, thuộc tính hoặc hành động
zh_hk: 顯示輸入內容、屬性或動作的精簡元素
zu: Izinto ezihlangene ezimela ukungena, ukuchasisa, noma isenzo

# demoActionChipTitle
source: Action Chip
af: Handelingskyfie
am: የእርምጃ ቺፕ
ar_eg: شريحة الإجراءات
as: কার্যৰ চিপ
az: Əməliyyat Çipi
be: Чып дзеяння
bn: অ্যাকশন চিপ
bs: Čip za radnju
ca: Etiqueta d'acció
da: Handlingstip
es_ar: Chip de acción
et: Toimingukiip
eu: Ekintza-pilula
fa: تراشه کنش
fr_ca: Jeton d'action
gl: Etiqueta de acción
gu: ઍક્શન ચિપ
he: צ'יפ של פעולה
hi: ऐक्शन चिप
hu: Műveletszelvény
hy: Գործողության չիպ
id: Chip Tindakan
it: Chip di azione
ja: アクション チップ
ka: მოქმედების ჩიპი
km: ឈីប​សកម្មភាព
kn: ಆ್ಯಕ್ಷನ್ ಚಿಪ್
ko: 작업 칩
ky: Аракет чиби
lo: ຊິບຄຳສັ່ງ
lt: Veiksmo fragmentas
lv: Darbības žetons
mk: Икона за дејство
ml: ആക്ഷൻ ചിപ്പ്
mn: Үйлдлийн чип
mr: ॲक्शन चिप
ms: Cip Tindakan
my: လုပ်ဆောင်ချက် ချစ်ပ်
nb: Handlingsbrikke
ne: एक्सन चिप
pa: ਐਕਸ਼ਨ ਚਿੱਪ
pl: Ikona działania
pt: Ícone de ação
pt_pt: Chip de ação
ro: Cip de acțiune
ru: Чипы действий
si: ක්‍රියා චිපය
sk: Prvok akcie
sq: Çipi i veprimit
sr: Чип радњи
sr_latn: Čip radnji
sv: Åtgärdsbricka
te: యాక్షన్ చిప్
th: ชิปการทำงาน
tr: İşlem Çipi
uk: Інтерактивний елемент дії
ur: ایکشن چپ
uz: Amal elementi
vi: Thẻ hành động
zh_hk: 動作方塊
zu: I-Chip yesenzo

# demoActionChipDescription
source: Action chips are a set of options which trigger an action related to primary content. Action chips should appear dynamically and contextually in a UI.
af: Handelingskyfies is 'n stel opsies wat 'n handeling wat met primêre inhoud verband hou, veroorsaak. Handelingskyfies behoort dinamies en kontekstueel in 'n UI te verskyn.
am: የእርምጃ ቺፖች ከዋና ይዘት ጋር በተገናኘት አንድ እርምጃን የሚቀሰቅሱ የአማራጮች ስብስብ ናቸው። የእርምጃ ቺፖች በአንድ ዩአይ ላይ በተለዋዋጭ እና አውዳዊ በሆነ መልኩ መታየት አለባቸው።
ar_eg: شرائح الإجراءات هي مجموعة من الخيارات التي تشغّل إجراءً ذا صلة بالمحتوى الأساسي. ينبغي أن يكون ظهور شرائح الإجراءات في واجهة المستخدم ديناميكيًا ومناسبًا للسياق.
as: কার্যৰ চিপসমূহ প্ৰাথমিক সমল সম্পর্কীয় কোনো কার্য সূচনা কৰা বিকল্পসমূহৰ এক ছেট। কার্যৰ চিপসমূহ কোনো ইউআইত পৰিৱৰ্তনশীলভাৱে আৰু প্ৰাসংগিতা অনুসৰি প্ৰদর্শন হোৱা উচিত।
az: Əməliyyat çipləri əsas məzmun ilə əlaqədar əməliyyatı işə salan seçimlər qrupudur. Əməliyyat çipləri İstifadəçi İnterfeysində dinamik və kontekstual tərzdə görünməlidir.
be: Чыпы дзеянняў – гэта набор параметраў, якія запускаюць дзеянне, звязанае з асноўным змесцівам. Чыпы дзеянняў паказваюцца ў карыстальніцкім інтэрфейсе дынамічна і ў залежнасці ад кантэксту.
bn: অ্যাকশন চিপ হল বিকল্পগুলির একটি সেট যা প্রাথমিক কন্টেন্ট সম্পর্কিত অ্যাকশন ট্রিগার করে। অ্যাকশন চিপ নিয়ম করে কতটা প্রাসঙ্গিক সেই হিসেবে UI-তে দেখা যায়।
bs: Čipovi za radnje su skupovi opcija koje aktiviraju određenu radnju povezanu s primarnim sadržajem. Čipovi za radnje trebali bi se prikazivati dinamički i kontekstualno u korisničkom interfejsu.
ca: Les etiquetes d'acció són un conjunt d'opcions que activen una acció relacionada amb el contingut principal. Es mostren de manera dinàmica i contextual a les interfícies d'usuari.
da: Handlingstips er en række muligheder, som udløser en handling relateret til det primære indhold. Handlingstips bør vises på en dynamisk og kontekstafhængig måde på en brugerflade.
es_ar: Los chips de acciones son un conjunto de opciones que activan una acción relacionada al contenido principal. Deben aparecer de forma dinámica y en contexto en la IU.
et: Toimingukiibid on valikukomplekt, mis käivitab primaarse sisuga seotud toimingu. Toimingukiibid peaksid kasutajaliideses ilmuma dünaamiliselt ja kontekstiliselt.
eu: Ekintza-pilulak eduki nagusiarekin erlazionatutako ekintza bat abiarazten duten aukeren multzoa dira. Dinamikoki eta testuinguru egokian agertu behar dute.
fa: تراشه‌های کنش مجموعه‌ای از گزینه‌ها هستند که کنشی مرتبط با محتوای اصلی را راه‌اندازی می‌کنند. تراشه‌های کنش باید به‌صورت پویا و مرتبط با محتوا در واسط کاربر نشان داده شوند.
fil: Ang mga action chip ay isang hanay ng mga opsyon na nagti-trigger ng pagkilos na nauugnay sa pangunahing content. Dapat dynamic at ayon sa konteksto lumabas ang mga action chip sa UI.
fr_ca: Les jetons d'action sont des ensembles d'options qui déclenchent une action relative au contenu principal. Les jetons d'action devraient s'afficher de manière dynamique, en contexte, dans une IU.
gl: As pílulas de acción son un conxunto de opcións que permiten levar a cabo tarefas relacionadas co contido principal. Deberían aparecer de forma dinámica e contextual na IU.
gu: ઍક્શન ચિપ એ વિકલ્પોનો સેટ છે જે મુખ્ય કન્ટેન્ટથી સંબંધિત ઍક્શનને ટ્રિગર કરે છે. ઍક્શન ચિપ, UIમાં ડાયનામિક રીતે અને સાંદર્ભિક રીતે દેખાવા જોઈએ.
he: צ'יפים של פעולה הם קבוצת אפשרויות שמפעילה פעולה כלשהי שקשורה לתוכן עיקרי. צ'יפים של פעולה צריכים להופיע באופן דינמי ולפי הקשר בממשק המשתמש.
hi: ऐक्शन चिप ऐसे विकल्पों का सेट होता है जो मुख्य सामग्री से संबंधित किसी कार्रवाई को ट्रिगर करता है. ऐक्शन चिप किसी यूज़र इंटरफ़ेस (यूआई) में डाइनैमिक तरीके से दिखना चाहिए और मुख्य सामग्री से संबंधित होना चाहिए.
hu: A műveletszelvények olyan beállításcsoportokat jelentenek, amelyek aktiválnak valamilyen műveletet az elsődleges tartalommal kapcsolatban. A műveletszelvényeknek dinamikusan, a kontextusnak megfelelően kell megjelenniük a kezelőfelületen.
hy: Գործողությունների ինտերակտիվ չիպերը կարգավորումների խումբ են, որոնք ակտիվացնում են հիմնական բովանդակության հետ կապված գործողություններ։ Այս չիպերը պետք է հայտնվեն դինամիկ կերպով և լրացնեն միջերեսը։
id: Chip tindakan adalah sekumpulan opsi yang memicu tindakan terkait konten utama. Chip tindakan akan muncul secara dinamis dan kontekstual dalam UI.
it: I chip di azione sono un insieme di opzioni che attivano un'azione relativa ai contenuti principali. I chip di azione dovrebbero essere visualizzati in modo dinamico e in base al contesto in un'interfaccia utente.
ja: アクション チップは、メイン コンテンツに関連するアクションをトリガーするオプションの集合です。アクション チップは UI にコンテキストに基づいて動的に表示されます。
ka: მოქმედების ჩიპები ოფციების ნაკრებია, რომელიც უშვებს ქმედებასთან დაკავშირებულ პირველად შემცველობას. მოქმედების ჩიპები დინამიურად და კონტექსტუალურად უნდა გამოჩნდეს UI-ს სახით.
km: ឈីប​សកម្មភាព​គឺជា​បណ្ដុំ​ជម្រើស ដែល​ជំរុញ​សកម្មភាព​ពាក់ព័ន្ធ​នឹង​ខ្លឹមសារ​ចម្បង​។ ឈីប​សកម្មភាព​គួរតែ​បង្ហាញ​ជា​បន្តបន្ទាប់ និង​តាម​បរិបទ​នៅក្នុង UI​។
kn: ಆ್ಯಕ್ಷನ್ ಚಿಪ್‌ಗಳು ಎನ್ನುವುದು ಪ್ರಾಥಮಿಕ ವಿಷಯಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಕ್ರಿಯೆಯನ್ನು ಟ್ರಿಗರ್ ಮಾಡುವ ಆಯ್ಕೆಗಳ ಒಂದು ಗುಂಪಾಗಿದೆ. ಆ್ಯಕ್ಷನ್ ಚಿಪ್‌ಗಳು UI ನಲ್ಲಿ ಕ್ರಿಯಾತ್ಮಕವಾಗಿ ಮತ್ತು ಸಂದರ್ಭೋಚಿತವಾಗಿ ಗೋಚರಿಸಬೇಕು.
ko: 작업 칩은 주 콘텐츠와 관련된 작업을 실행하는 옵션 세트입니다. 작업 칩은 동적이고 맥락에 맞는 방식으로 UI에 표시되어야 합니다.
ky: Аракет чиптери негизги мазмунга тийиштүү аракетти ишке киргизүүчү параметрлердин топтому. Аракет чиптери колдонуучунун интерфейсинде динамикалык жана мазмундук формада көрүнүшү керек.
lo: ຊິບຄຳສັ່ງເປັນຊຸດຕົວເລືອກທີ່ຈະເອີ້ນຄຳສັ່ງວຽກທີ່ກ່ຽວກັບເນື້ອຫາຫຼັກ. ຊິບຄຳສັ່ງຄວນຈະສະແດງແບບໄດນາມິກ ແລະ ຕາມບໍລິບົດໃນສ່ວນຕິດຕໍ່ຜູ້ໃຊ້.
lt: Veiksmo fragmentai – tai parinkčių rinkiniai, suaktyvinantys su pradiniu turiniu susijusį veiksmą. Veiksmo fragmentai NS turėtų būti rodomi dinamiškai ir pagal kontekstą.
lv: Darbību žetoni ir tādu opciju kopa, kas aktivizē ar primāro saturu saistītu darbību. Darbību žetoniem lietotāja saskarnē jābūt redzamiem dinamiski un atbilstoši kontekstam.
mk: Иконите за дејства се збир на опции коишто активираат дејство поврзано со примарните содржини. Иконите за дејства треба да се појавуваат динамично и контекстуално во корисничкиот интерфејс.
ml: പ്രാഥമിക ഉള്ളടക്കവുമായി ബന്ധപ്പെട്ട ഒരു ആക്ഷനെ ട്രിഗർ ചെയ്യുന്ന ഒരു സെറ്റ് ഓപ്ഷനുകളാണ് ആക്ഷൻ ചിപ്പുകൾ. ആക്ഷൻ ചിപ്പുകൾ UI-യിൽ ചലനാത്മകമായും സന്ദർഭോചിതമായും ദൃശ്യമാകും.
mn: Үйлдлийн чип нь үндсэн контенттой хамааралтай үйлдлийг өдөөдөг сонголтын багц юм. Үйлдлийн чип нь UI-д динамикаар болон хам сэдэвтэй уялдсан байдлаар гарч ирэх ёстой.
mr: अ‍ॅक्शन चिप पर्यायांचा एक समूह आहे जो प्राथमिक आशयाशी संबंधित असणाऱ्या कारवाईला ट्रिगर करतो. अ‍ॅक्शन चिप सतत बदलणानपसार आणि संदर्भानुसार UI मध्ये दिसल्या पाहिजेत.
ms: Cip tindakan ialah satu set pilihan yang mencetuskan tindakan yang berkaitan dengan kandungan utama. Cip tindakan seharusnya dipaparkan secara dinamik dan kontekstual dalam UI.
my: လုပ်ဆောင်ချက်ချစ်ပ်များသည် ရွေးချယ်မှုစနစ်အုပ်စုတစ်ခုဖြစ်ပြီး ပင်မအကြောင်းအရာနှင့် သက်ဆိုင်သော လုပ်ဆောင်ချက်ကို ဆောင်ရွက်ပေးသည်။ လုပ်ဆောင်ချက်ချစ်ပ်များသည် UI တွင် အကြောင်းအရာ အပေါ်မူတည်၍ ပေါ်လာသင့်ပါသည်။
nb: Handlingsbrikker er et sett med alternativer som utløser en handling knyttet til primærinnhold. Handlingsbrikekr skal vises dynamisk og kontekstuelt i et UI.
ne: एक्सन चिपहरू भनेका प्राथमिक सामग्रीसँग सम्बन्धित कुनै कारबाहीमा ट्रिगर गर्ने विकल्पहरूका सेट हुन्। एक्सन चिपहरू UI मा गतिशील र सान्दर्भिक तरिकाले देखिनु पर्छ।
pa: ਐਕਸ਼ਨ ਚਿੱਪਾਂ ਅਜਿਹੇ ਵਿਕਲਪਾਂ ਦਾ ਸੈੱਟ ਹੁੰਦੀਆਂ ਹਨ ਜੋ ਪ੍ਰਮੁੱਖ ਸਮੱਗਰੀ ਨਾਲ ਸੰਬੰਧਿਤ ਕਾਰਵਾਈ ਨੂੰ ਚਾਲੂ ਕਰਦੀਆਂ ਹਨ। ਐਕਸ਼ਨ ਚਿੱਪਾਂ ਗਤੀਸ਼ੀਲ ਢੰਗ ਨਾਲ ਅਤੇ ਸੰਦਰਭੀ ਤੌਰ 'ਤੇ ਕਿਸੇ UI ਵਿੱਚ ਦਿਸਣੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ।
pl: Elementy działań to zestawy opcji, które wywołują określone akcje związane z treścią główną. Wyświetlanie tych elementów w interfejsie powinno następować dynamicznie i zależeć od kontekstu.
pt: Ícones de ação são um conjunto de opções que ativam uma ação relacionada a um conteúdo principal. Eles aparecem de modo dinâmico e contextual em uma IU.
pt_pt: Os chips de ação são um conjunto de opções que acionam uma ação relacionada com o conteúdo principal. Os chips de ação devem aparecer dinâmica e contextualmente numa IU.
ro: Cipurile de acțiune sunt un set de opțiuni care declanșează o acțiune legată de conținutul principal. Ele trebuie să apară dinamic și contextual într-o IU.
ru: Чипы действий представляют собой набор динамических параметров, которые запускают действия, связанные с основным контентом. Как правило, чипы действий отображаются в интерфейсе в зависимости от контекста.
si: ක්‍රියා චිප යනු ප්‍රාථමික අන්තර්ගතයට අදාළ ක්‍රියාවක් ක්‍රියාරම්භ කරන විකල්ප සමූහයකි. ක්‍රියා චිප ගතිකව සහ සංදර්භානුගතය UI එකක දිස් විය යුතුය.
sk: Prvky akcie sú skupina možností spúšťajúcich akcie súvisiace s hlavným obsahom. V používateľskom rozhraní by sa mali zobrazovať dynamicky a v kontexte.
sq: Çipet e veprimit janë një grupim opsionesh që aktivizojnë një veprim që lidhet me përmbajtjen kryesore. Çipet e veprimit duhet të shfaqen në mënyrë dinamike dhe kontekstuale në një ndërfaqe përdoruesi.
sr: Чипови радњи су скуп опција које покрећу радњу повезану са примарним садржајем. Чипови радњи треба да се појављују динамички и контекстуално у корисничком интерфејсу.
sr_latn: Čipovi radnji su skup opcija koje pokreću radnju povezanu sa primarnim sadržajem. Čipovi radnji treba da se pojavljuju dinamički i kontekstualno u korisničkom interfejsu.
sv: Med åtgärdsbrickor får du en uppsättning alternativ som utlöser en åtgärd för huvudinnehållet. Åtgärdsbrickor ska visas dynamiskt och i rätt sammanhang i användargränssnittet.
te: యాక్షన్ చిప్‌లు అనేవి ప్రాథమిక కంటెంట్‌కు సంబంధించిన చర్యను ట్రిగ్గర్ చేసే ఎంపికల సెట్. UIలో యాక్షన్ చిప్‌లు డైనమిక్‌గా, సందర్భానుసారంగా కనిపించాలి.
th: ชิปการทำงานคือชุดตัวเลือกที่จะเรียกใช้การทำงานที่เกี่ยวกับเนื้อหาหลัก ชิปการทำงานควรจะแสดงแบบไดนามิกและตามบริบทใน UI
tr: İşlem çipleri, asıl içerikle ilgili bir işlemi tetikleyen bir dizi seçenektir. İşlem çipleri, kullanıcı arayüzünde dinamik ve içeriğe dayalı olarak görünmelidir.
uk: Інтерактивні елементи дій – це набір параметрів, які активують дії, пов'язані з основним контентом. Вони мають з'являтися динамічно й доповнювати інтерфейс.
ur: ایکشن چپس اختیارات کا ایک سیٹ ہے جو بنیادی مواد سے متعلقہ کارروائی کو متحرک کرتا ہے۔ ایکشن چپس کو متحرک اور سیاق و سباق کے لحاظ سے کسی UI میں ظاہر ہونی چاہیے۔
uz: Amal chiplari asosiy kontentga oid amallarni faollashtiradigan parametrlar toʻplamini ifodalaydi. Amal chiplari dinamik tarzda chiqib, inteyfeysni boyitadi.
vi: Thẻ hành động là một tập hợp các tùy chọn kích hoạt hành động liên quan đến nội dung chính. Thẻ này sẽ hiển thị linh hoạt và theo ngữ cảnh trong giao diện người dùng.
zh_hk: 動作方塊列出一組選項，可觸發與主要內容相關的動作。動作方塊應在使用者介面上以動態和與內容相關的方式顯示。
zu: Ama-chip ayisethi yezinketho acupha isenzo esiphathelene nokuqukethwe okuyinhloko. Ama-chip kufanele abonakale ngokubanzi nangokuqukethwe ku-UI.

# demoChoiceChipTitle
source: Choice Chip
af: Keuseskyfie
am: የምርጫ ቺፕ
ar_eg: شريحة الخيارات
as: পচন্দৰ চিপ
az: Seçim Çipi
be: Чып выбару
bn: পছন্দের চিপ
bs: Čip za odabir
ca: Etiqueta de selecció
da: Valgtip
es_ar: Chip de selección
et: Valikukiip
eu: Aukera-pilula
fa: انتخاب تراشه
fr_ca: Jeton de choix
gl: Etiqueta de elección
gu: ચૉઇસ ચિપ
he: צ'יפ של בחירה
hi: चॉइस चिप
hu: Választószelvény
hy: Ընտրության չիպ
it: Chip di scelta
ja: 選択チップ
km: ឈីប​ជម្រើស
kn: ಚಾಯ್ಸ್ ಚಿಪ್
ko: 선택 칩
ky: Тандоо чиби
lo: ຊິບຕົວເລືອກ
lt: Pasirinkimo fragmentas
lv: Izvēles žetons
mk: Икона за избор
ml: ചോയ്സ് ചിപ്പ്
mn: Сонголтын чип
mr: चॉइस चिप
ms: Cip Pilihan
my: ရွေးချယ်မှု ချစ်ပ်
nb: Valgbrikke
ne: विकल्प चिप
pa: ਚੋਇਸ ਚਿੱਪ
pl: Element wyboru
pt: Ícone de escolha
pt_pt: Chip de escolha
ro: Cip de opțiune
ru: Чип выбора
si: චිපය තේරීම
sk: Prvok výberu
sq: Çipi i zgjedhjes
sr: Чип избора
sr_latn: Čip izbora
sv: Valbricka
te: ఎంపిక చిప్
th: ชิปตัวเลือก
tr: Seçenek Çipi
uk: Інтерактивний елемент вибору
ur: چوائس چپس
uz: Tanlov chipi
vi: Khối lựa chọn
zh_hk: 選擇方塊
zu: I-Chip yenketho
