Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# starterAppTooltipAdd
source: Add
af: Voeg by
am: አክል
ar_eg: إضافة
as: যোগ কৰক
az: Əlavə edin
be: Дадаць
bn: যোগ করুন
bs: Dodajte
ca: Afegeix
da: Tilføj
es_ar: Agregar
et: Lisa
eu: Gehitu
fa: افزودن
fil: Idagdag
fr_ca: Ajouter
gl: Engadir
gu: ઉમેરો
he: הוספה
hi: जोड़ें
hu: Hozzáadás
hy: Ավելացնել
id: Tambahkan
it: Aggiungi
ja: 追加
ka: დამატება
km: បន្ថែម
kn: ಸೇರಿಸಿ
ko: 추가
ky: Кошуу
lo: ເພີ່ມ
lt: Pridėti
lv: Pievienot
mk: Додајте
ml: ചേർക്കുക
mn: Нэмэх
mr: जोडा
ms: Tambah
my: ထည့်ရန်
nb: Legg til
ne: थप्नुहोस्
pa: ਸ਼ਾਮਲ ਕਰੋ
pl: Dodaj
pt: Adicionar
pt_pt: Adicionar
ro: Adăugați
ru: Добавить
si: එක් කරන්න
sk: Pridať
sq: Shto
sr: Додајте
sr_latn: Dodajte
sv: Lägg till
te: జోడిస్తుంది
th: เพิ่ม
tr: Ekle
uk: Додати
ur: شامل کریں
uz: Kiritish
vi: Thêm
zh_hk: 新增
zu: Engeza

# bottomNavigationCalendarTab
source: Calendar
af: Kalender
am: የቀን መቁጠሪያ
ar_eg: التقويم
az: Təqvim
be: Каляндар
bs: Kalendar
ca: Calendari
da: Kalender
es_ar: Calendario
et: Kalender
eu: Egutegia
fa: تقویم
fil: Kalendaryo
fr_ca: Agenda
gl: Calendario
he: יומן Google
hu: Naptár
hy: Օրացույց
id: Kalender
it: Calendario
ja: カレンダー
ka: კალენდარი
km: ប្រតិទិន
ko: 캘린더
ky: Жылнаама
lo: ປະຕິທິນ
lt: Kalendorius
lv: Kalendārs
mk: Календар
mn: Календарь
ms: Kalendar
my: ပြက္ခဒိန်
nb: Kalender
ne: पात्रो
pl: Kalendarz
pt: Agenda
pt_pt: Calendário
ru: Календарь
si: දින දර්ශනය
sk: Kalendár
sq: Kalendari
sr: Календар
sr_latn: Kalendar
sv: Kalender
te: క్యాలెండర్
th: ปฏิทิน
tr: Takvim
uk: Календар
ur: کیلنڈر
uz: Taqvim
vi: Lịch
zh_hk: 日曆
zu: Ikhalenda

# starterAppDescription
source: A responsive starter layout
af: 'n Beginneruitleg wat goed reageer
am: ምላሽ የሚሰጥ የጀማር አቀማመጥ
ar_eg: تطبيق نموذجي يتضمّن تنسيقًا تفاعليًا
as: এটা প্ৰতিক্ৰিয়াশীল ষ্টাৰ্টাৰ লে’আউট
az: Responsiv starter tətbiq düzəni
be: Адаптыўны макет запуску
bn: কাজ করে এমন শুরু করার লেআউট
bs: Prilagodljiv izgled aplikacije za pokretanje
ca: Un disseny d'inici responsiu
da: Et responsivt opstartslayout
es_ar: Diseño de inicio responsivo
et: Automaatselt kohanduva stardirakenduse paigutus
eu: Hasierako diseinu sentikorra
fa: طرح‌بندی راه‌انداز سازگار
fil: Isang responsive na panimulang layout
fr_ca: Une mise en page de base réactive
gl: Deseño para principiantes adaptado
gu: પ્રતિભાવ આપતું સ્ટાર્ટર લેઆઉટ
he: פריסה התחלתית רספונסיבית
hi: शुरू करने पर तुरंत प्रतिक्रिया देने वाला लेआउट
hu: Interaktív kezdő elrendezés
hy: Հարմարվողական մոդել
id: Tata letak awal yang responsif
it: Un layout di base adattivo
ja: レスポンシブ スターター レイアウト
ka: ადაპტირებადი საწყისი განლაგება
km: ស្រទាប់​ចាប់ផ្ដើមដែល​ឆ្លើយតបរហ័ស
kn: ಸ್ಪಂದನಾಶೀಲ ಸ್ಟಾರ್ಟರ್ ಲೇಔಟ್
ko: 반응형 스타터 레이아웃
ky: Адаптивдүү баштапкы калык
lo: ໂຄງຮ່າງເລີ່ມຕົ້ນທີ່ມີການຕອບສະໜອງ
lt: Interaktyvus pradedančiųjų programos išdėstymas
lv: Adaptīvs sākuma izkārtojums
mk: Распоред што овозможува брзо стартување
ml: റെസ്പോൺസിവ് സ്റ്റാർട്ടർ ലേഔട്ട്
mn: Хариу үйлдэл сайтай гарааны бүдүүвч
mr: प्रतिसादात्मक स्टार्टर लेआउट
ms: Reka letak permulaan yang responsif
my: တုံ့ပြန်မှုကောင်းမွန်သော အစပြုရန် အပြင်အဆင်
nb: En responsiv startlayout
ne: सुरु हुँदा स्क्रिनअनुसार समायोजन हुने ढाँचा
pa: ਪ੍ਰਤਿਕਿਰਿਆਤਮਕ ਸਟਾਰਟਰ ਖਾਕਾ
pl: Elastyczny układ początkowy
pt: Um layout inicial responsivo
pt_pt: Um esquema da aplicação de iniciação com boa capacidade de resposta
ro: Un aspect adaptabil pentru Starter
ru: Адаптивный макет
si: ප්‍රතිචාරාත්මක පිරිසැලසුමක්
sk: Responzívne rozloženie štartovacej aplikácie
sq: Strukturë reaguese për aplikacionin nisës
sr: Изглед апликације за покретање која реагује
sr_latn: Izgled aplikacije za pokretanje koja reaguje
sv: En responsiv startlayout
te: ప్రతిస్పందనాత్మక శైలిలోని స్టార్టర్ లేఅవుట్
th: เลย์เอาต์เริ่มต้นที่มีการตอบสนอง
tr: Duyarlı başlangıç düzeni
uk: Адаптивний макет запуску
ur: ایک ذمہ دار اسٹارٹر لے آؤٹ
uz: Moslashuvchan maket
vi: Bố cục thích ứng cho ứng dụng cơ bản
zh_hk: 回應式入門版面配置
zu: Isendlalelo sokuqalisa sokuphendula

# starterAppTitle
source: Starter app
af: Beginnerprogram
am: አስጀማሪ መተግበሪያ
ar_eg: تطبيق نموذجي
as: ষ্টাৰ্টাৰ এপ্‌
az: Starter tətbiq
be: Праграма запуску
bn: শুরু করার অ্যাপ
bs: Aplikacija za pokretanje
ca: Aplicació d'inici
da: Begynderapp
es_ar: App de partida
et: Stardirakendus
eu: Hasiberrientzako aplikazioa
fa: برنامه راه‌انداز
fil: Panimulang app
fr_ca: Application de base
gl: Aplicación de base
gu: સ્ટાર્ટર ઍપ
he: אפליקציה למתחילים
hi: स्टार्टर ऐप्लिकेशन
hu: Kezdőalkalmazás
hy: Գործարկման հավելված
id: Aplikasi awal
it: App di base
ja: スターター アプリ
ka: საწყისი აპი
km: កម្មវិធី​ចាប់ផ្ដើម
kn: ಸ್ಟಾರ್ಟರ್ ಆ್ಯಪ್
ko: 스타터 앱
ky: Жаңы колдонуучулар үчүн даярдалган колдонмо
lo: ແອັບເລີ່ມຕົ້ນ
lt: Pradedančiųjų programa
lv: Sākuma lietotne
mk: Апликација за стартување
ml: സ്റ്റാർട്ടർ ആപ്പ്
mn: Гарааны апп
mr: स्टार्टर अ‍ॅप
ms: Apl permulaan
my: အစပြုအက်ပ်
nb: Startapp
ne: सुरुमा खुल्ने एप
pa: ਸਟਾਰਟਰ ਐਪ
pl: Aplikacja wyjściowa
pt: App Starter
pt_pt: Aplicação de iniciação
ro: Aplicația Starter
ru: Starter
si: ආරම්භක යෙදුම
sk: Štartovacia aplikácia
sq: Aplikacion nisës
sr: Апликација за покретање
sr_latn: Aplikacija za pokretanje
sv: Startapp
te: స్టార్టర్ యాప్
th: แอปเริ่มต้น
tr: Başlangıç uygulaması
uk: Запуск додатка
ur: اسٹارٹر ایپ
uz: Starter ilovasi
vi: Ứng dụng cơ bản
zh_hk: 入門應用程式
zu: Uhlelo lokusebenza lokuqalisa

# bottomNavigationContentPlaceholder
source: Placeholder for {title} tab
af: Plekhouer vir {title}-oortjie
am: የ{title} ትር ቦታ ያዥ
ar_eg: عنصر نائب لعلامة تبويب {title}
as: {title} টেবৰ বাবে প্লে’চহ’ল্ডাৰ
az: {title} tabeli üçün yertutan
be: Запаўняльнік для ўкладкі {title}
bn: {title} ট্যাবের প্লেসহোল্ডার
bs: Rezervirano mjesto za karticu {title}
ca: Espai reservat per a la pestanya {title}
da: Pladsholder for fanen {title}
es_ar: Marcador de posición de la pestaña {title}
et: Vahelehe {title} kohatäide
eu: {title} fitxaren leku-marka
fa: جای‌بان برای برگه {title}
fil: Placeholder para sa tab na {title}
fr_ca: Marque substitutive pour l'onglet {title}
gl: Marcador de posición para a pestana {title}
gu: {title} ટૅબ માટેનું પ્લેસહોલ્ડર
he: Placeholder לכרטיסייה {title}
hi: {title} टैब के लिए प्लेसहोल्डर टैब
hu: Helyőrző a(z) {title} lapnak
hy: Տեղապահ «{title}» ներդիրի համար
id: Placeholder untuk tab {title}
it: Segnaposto per la scheda {title}
ja: {title} タブのプレースホルダ
ka: ჩანაცვლების ველი ჩანართისთვის „{title}“
km: កន្លែងដាក់​សម្រាប់ផ្ទាំង {title}
kn: {title} ಟ್ಯಾಬ್‌ಗಾಗಿ ಪ್ಲೇಸ್‌ಹೋಲ್ಡರ್‌
ko: {title} 탭 자리표시자
ky: {title} өтмөгү үчүн толтургуч
lo: ຕົວແທນບ່ອນສຳລັບແຖບ {title}
lt: Skirtuko {title} rezervuota vieta
lv: Vietturis {title} cilnei
mk: Резервирано место за картичката {title}
ml: {title} ടാബിനുള്ള പ്ലെയ്സ്‌ഹോൾഡർ
mn: Табын {title} орлуулагч
mr: {title} टॅबसाठी प्लेसहोल्डर
ms: Pemegang tempat untuk tab {title}
my: {title} တဘ်အတွက် အစားထိုးရန်နေရာ
nb: Plassholder for {title}-fanen
ne: {title} नामक ट्याबको प्लेसहोल्डर
pa: {title} ਟੈਬ ਲਈ ਪਲੇਸਹੋਲਡਰ
pl: Obiekt zastępczy karty {title}
pt: Marcador para a guia {title}
pt_pt: Marcador de posição para o separador {title}
ro: Substituent pentru fila {title}
ru: Тег для вкладки "{title}"
si: {title} ටැබය සඳහා තැන් දරණුව
sk: Zástupný symbol pre kartu {title}
sq: Vendmbajtësi për skedën {title}
sr: Чувар места за картицу {title}
sr_latn: Čuvar mesta za karticu {title}
sv: Platshållare för fliken {title}
te: {title} ట్యాబ్‌కు సంబంధించిన ప్లేస్‌హోల్డర్
th: ตัวยึดตำแหน่งของแท็บ {title}
tr: {title} sekmesi için yer tutucu
uk: Заповнювач для вкладки "{title}"
ur: {title} ٹیب کے لیے پلیس ہولڈر
uz: {title} sahifasi uchun pleysholder
vi: Phần giữ chỗ cho tab {title}
zh_hk: {title} 分頁嘅佔位符
zu: Isimeli sethebhu ye-{title}

# bottomNavigationCameraTab
source: Camera
af: Kamera
am: ካሜራ
ar_eg: الكاميرا
as: কেমেৰা
az: Kamera
be: Камера
bn: ক্যামেরা
bs: Kamera
ca: Càmera
da: Kamera
es_ar: Cámara
et: Kaamera
eu: Kamera
fa: دوربین
fr_ca: Appareil photo
gl: Cámara
gu: કૅમેરા
he: מצלמה
hi: कैमरा
hu: Kamera
hy: Տեսախցիկ
id: Kamera
it: Fotocamera
ja: カメラ
ka: კამერა
km: កាមេរ៉ា
kn: ಕ್ಯಾಮರಾ
ko: 카메라
ky: Камера
lo: ກ້ອງຖ່າຍຮູບ
lt: Fotoaparatas
lv: Kamera
mk: Камера
ml: ക്യാമറ
mn: Камер
mr: कॅमेरा
ms: Kamera
my: ကင်မရာ
nb: Kamera
ne: क्यामेरा
pa: ਕੈਮਰਾ
pl: Aparat
pt: Câmera
pt_pt: Câmara
ro: Cameră foto
ru: Камера
si: කැමරාව
sk: Fotoaparát
sq: Kamera
sr: Камера
sr_latn: Kamera
sv: Kamera
te: కెమెరా
th: กล้องถ่ายรูป
tr: Kamera
uk: Камера
ur: کیمرا
uz: Kamera
vi: Máy ảnh
zh_hk: 相機
zu: Ikhamera

# bottomNavigationAlarmTab
source: Alarm
af: Wekker
am: ማንቂያ
ar_eg: المنبّه
as: এলাৰ্ম
az: Xəbərdarlıq
be: Будзільнік
bn: অ্যালার্ম
ca: Alarma
es_ar: Alarma
eu: Alarma
fa: زنگ
fr_ca: Alarme
gl: Alarma
gu: એલાર્મ
he: התראה
hi: अलार्म
hu: Ébresztés
hy: Զարթուցիչ
it: Sveglia
ja: アラーム
ka: მაღვიძარა
km: ម៉ោងរោទ៍
kn: ಅಲಾರಾಂ
ko: 알람
ky: Ойготкуч
lo: ໂມງປຸກ
lt: Įspėjimas
lv: Signāls
mk: Аларм
ml: അലാറം
mn: Сэрүүлэг
mr: अलार्म
ms: Penggera
my: နှိုးစက်
ne: अलार्म
pa: ਅਲਾਰਮ
pt: Alarme
pt_pt: Alarme
ro: Alarmă
ru: Будильник
si: එලාමය
sk: Budík
sq: Alarmi
sr: Аларм
te: అలారం
th: การปลุก
uk: Сповіщення
ur: الارم
uz: Signal
vi: Đồng hồ báo thức
zh_hk: 鬧鐘
zu: I-alamu

# bottomNavigationAccountTab
source: Account
af: Rekening
am: መለያ
ar_eg: الحساب
as: একাউণ্ট
az: Hesab
be: Уліковы запіс
bn: অ্যাকাউন্ট
bs: Račun
ca: Compte
da: Konto
es_ar: Cuenta
et: Konto
eu: Kontua
fa: حساب
fr_ca: Compte
gl: Conta
gu: એકાઉન્ટ
he: חשבון
hi: खाता
hu: Fiók
hy: Հաշիվ
id: Akun
ja: 口座
ka: ანგარიში
km: គណនី
kn: ಖಾತೆ
ko: 계정
ky: Аккаунт
lo: ບັນຊີ
lt: Paskyra
lv: Konts
mk: Сметка
ml: അക്കൗണ്ട്
mn: Данс
mr: खाते
ms: Akaun
my: အကောင့်
nb: Konto
ne: खाता
pa: ਖਾਤਾ
pl: Konto
pt: Conta
pt_pt: Conta
ro: Cont
ru: Банковский счет
si: ගිණුම
sk: Účet
sq: Llogaria
sr: Налог
sr_latn: Nalog
sv: Konto
te: ఖాతా
th: บัญชี
tr: Hesap
uk: Рахунок
ur: اکاؤنٹ
uz: Hisob
vi: Tài khoản
zh_hk: 帳戶
zu: I-akhawunti

# demoTextFieldYourEmailAddress
source: Your email address
af: Jou e-posadres
am: የእርስዎ ኢሜል አድራሻ
ar_eg: عنوان بريدك الإلكتروني
as: আপোনাৰ ইমেইল ঠিকনা
az: E-poçt ünvanınız
be: Ваш адрас электроннай пошты
bn: আপনার ইমেল আইডি
bs: Vaša adresa e-pošte
ca: La teva adreça electrònica
da: Din mailadresse
es_ar: Tu dirección de correo electrónico
et: Teie e-posti aadress
eu: Zure helbide elektronikoa
fa: نشانی ایمیل شما
fil: Iyong email address
fr_ca: Votre adresse de courriel
gl: O teu enderezo de correo electrónico
gu: તમારું ઇમેઇલ ઍડ્રેસ
he: כתובת האימייל שלך
hi: आपका ईमेल पता
hu: Az Ön e-mail-címe
hy: Ձեր էլ. հասցեն
id: Alamat email Anda
it: Il tuo indirizzo email
ja: メールアドレス
ka: თქვენი ელფოსტის მისამართი
km: អាសយដ្ឋាន​អ៊ីមែល​របស់អ្នក
kn: ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸ
ko: 이메일 주소
ky: Электрондук почта дарегиңиз
lo: ທີ່ຢູ່ອີເມວຂອງທ່ານ
lt: Jūsų el. pašto adresas
lv: Jūsu e-pasta adrese
mk: Вашата адреса на е-пошта
ml: നിങ്ങളുടെ ഇമെയിൽ വിലാസം
mn: Таны имэйл хаяг
mr: तुमचा ईमेल अ‍ॅड्रेस
ms: Alamat e-mel anda
my: သင့်အီးမေး လိပ်စာ
nb: E-postadressen din
ne: तपाईंको इमेल ठेगाना
pa: ਤੁਹਾਡਾ ਈਮੇਲ ਪਤਾ
pl: Twój adres e-mail
pt: Seu endereço de e-mail
pt_pt: O seu endereço de email
ro: Adresa dvs. de e-mail
ru: Ваш адрес электронной почты
si: ඔබගේ ඉ-තැපැල් ලිපිනය
sk: Vaša e‑mailová adresa
sq: Adresa jote e email-it
sr: Ваша имејл адреса
sr_latn: Vaša imejl adresa
sv: Din e-postadress.
te: మీ ఈమెయిల్‌ అడ్రస్‌
th: อีเมลของคุณ
tr: E-posta adresiniz
uk: Ваша електронна адреса
ur: آپ کا ای میل پتہ
uz: Email manzilingiz
vi: Địa chỉ email của bạn
zh_hk: 您的電郵地址
zu: Ikheli lakho le-imeyili

# demoToggleButtonDescription
source: Toggle buttons can be used to group related options. To emphasize groups of related toggle buttons, a group should share a common container
af: Wisselknoppies kan gebruik word om verwante opsies te groepeer. Om 'n groep verwante wisselknoppies te beklemtoon, moet 'n groep 'n gemeenskaplike houer deel
am: ተዛማጅ አማራጮችን ለመቦደን የቀያይር አዝራሮች ጥቅም ላይ ሊውሉ ይችላሉ። ተዛማጅነት ያላቸው መቀያየሪያ አዝራሮችን ቡድኖች አጽዕኖት ለመስጠት፣ ቡድን የጋራ መያዣን ማጋራት አለበት።
ar_eg: يمكن استخدام أزرار التبديل لتجميع الخيارات المرتبطة. لتأكيد مجموعات أزرار التبديل المرتبطة، يجب أن تشترك إحدى المجموعات في حاوية مشتركة.
as: প্ৰাসংগিক বিকল্পসমূহ একগোট কৰিবলৈ ট’গল বুটামসমূহ ব্যৱহাৰ কৰিব পৰা যায়। প্ৰাসংগিক ট’গল বুটামসমূহৰ গোটসমূহক প্ৰাধান্য দিবলৈ, এটা গোটে এটা সাধাৰণ কণ্টেনাৰ শ্বেয়াৰ কৰা উচিত
az: Dəyişdirici düymələrdən əlaqəli seçimləri qruplaşdırmaq üçün istifadə etmək mümkündür. Əlaqəli dəyişdirici düymələr qrupunu vurğulamaq üçün qrupun ümumi konteyneri olmalıdır
be: Кнопкі пераключэння могуць выкарыстоўвацца для групавання звязаных параметраў. Каб вылучыць групы звязаных кнопак пераключэння, у групы павінен быць абагулены кантэйнер
bn: টগল বোতাম ব্যবহার করে একই ধরনের বিকল্প গ্রুপ করতে পারেন। সম্পর্কিত টগল বোতামের একটি গ্রুপে গুরুত্ব দিতে, সাধারণ কন্টেনার শেয়ার করতে হবে
bs: Dugmad za uključivanje/isključivanje može se koristiti za grupisanje srodnih opcija. Da naglasite grupe srodne dugmadi za uključivanje/isključivanje, grupa treba imati zajednički spremnik
ca: Els botons de commutació poden utilitzar-se per agrupar opcions relacionades. Per destacar grups de botons de commutació relacionats, un grup ha de compartir un contenidor comú.
da: Til/fra-knapper kan bruges til at gruppere relaterede indstillinger. For at fremhæve grupper af relaterede til/fra-knapper bør grupperne dele en fælles container.
es_ar: Puedes usar los botones de activación para agrupar opciones relacionadas. Para destacar los grupos de botones de activación relacionados, el grupo debe compartir un contenedor común.
et: Lülitusnuppe saab kasutada seotud valikute grupeerimiseks. Seotud lülitusnuppude gruppide esiletõstmiseks peab grupp jagama ühist konteinerit
eu: Erlazionatutako aukerak taldekatzeko erabil daitezke etengailuak. Erlazionatutako etengailuen talde bat nabarmentzeko, taldeak edukiontzi bera partekatu beharko luke.
fa: از دکمه‌های تغییر وضعیت می‌توان برای گروه‌بندی گزینه‌های مرتبط استفاده کرد. برای برجسته کردن گروه‌هایی از دکمه‌های تغییر وضعیت مرتبط، گروهی باید محتوی مشترکی را هم‌رسانی کند
fil: Magagamit ang mga toggle button para pagpangkatin ang magkakaugnay na opsyon. Para bigyang-diin ang mga pangkat ng magkakaugnay na toggle button, dapat may iisang container ang isang pangkat
fr_ca: Les boutons Activer/désactiver peuvent servir à grouper des options connexes. Pour mettre l'accent sur les groupes de boutons Activer/désactiver connexes, un groupe devrait partager un conteneur commun.
gl: Os botóns de activación/desactivación poden utilizarse para agrupar opcións relacionadas. Para destacar grupos de botóns de activación/desactivación relacionados, un deles debe ter un contedor común
gu: સંબંધિત વિકલ્પોનું ગ્રૂપ બનાવવા માટે ટૉગલ બટનનો ઉપયોગ કરી શકાય છે. સંબંધિત ટૉગલ બટનના ગ્રૂપ પર ભાર આપવા માટે, ગ્રૂપે એક કૉમન કન્ટેનર શેર કરવું જોઈએ
he: אפשר להשתמש בלחצני החלפת מצב לקיבוץ של אפשרויות קשורות. כדי להדגיש קבוצות של לחצני החלפת מצב קשורים, לקבוצה צריך להיות מאגר משותף
hi: ग्रुप के विकल्पों के लिए टॉगल बटन इस्तेमाल किए जा सकते हैं. मिलते-जुलते टॉगल बटन के एक से ज़्यादा ग्रुप पर ज़ोर देने के लिए, ग्रुप का एक ही कंटेनर में होना ज़रूरी है
hu: A váltógombok kapcsolódó lehetőségek csoportosításához használhatók. A kapcsolódó váltógombok csoportjának kiemeléséhez a csoportnak közös tárolón kell osztoznia
hy: Փոխարկման կոճակների օգնությամբ հնարավոր է խմբավորել նմանատիպ ընտրանքները։ Մեկը մյուսի հետ կապ ունեցող փոխարկման կոճակները պետք է ունենան ընդհանուր զետեղարան։
id: Tombol yang dapat digunakan untuk opsi terkait grup. Untuk mempertegas grup tombol yang terkait, sebuah grup harus berbagi container yang sama
it: I pulsanti di attivazione/disattivazione possono essere usati per raggruppare le opzioni correlate. Per mettere in risalto un gruppo di pulsanti di attivazione/disattivazione correlati, il gruppo deve condividere un container comune.
ja: 切り替えボタンでは、関連するオプションを 1 つのグループにまとめることができます。関連する切り替えボタンのグループを強調するには、グループが共通コンテナを共有する必要があります
ka: გადართვის ღილაკების მეშვეობით შესაძლებელია მსგავსი ვარიანტების დაჯგუფება. გადართვის ღილაკების დაკავშირებული ჯგუფებს უნდა ჰქონდეს საერთო კონტეინერი.
km: អាចប្រើ​ប៊ូតុងបិទ/បើក ដើម្បី​ដាក់ជម្រើស​ដែលពាក់ព័ន្ធ​ជាក្រុមបាន។ ដើម្បីរំលេចក្រុមប៊ូតុងបិទ/បើកដែលពាក់ព័ន្ធ ក្រុមប៊ូតុងគួរតែប្រើទម្រង់ផ្ទុកទូទៅរួមគ្នា
kn: ಗುಂಪು ಸಂಬಂಧಿತ ಆಯ್ಕೆಗಳಿಗೆ ಟಾಗಲ್ ಬಟನ್‌ಗಳನ್ನು ಬಳಸಬಹುದು. ಸಂಬಂಧಿತ ಟಾಗಲ್ ಬಟನ್‌ಗಳ ಗುಂಪುಗಳಿಗೆ ಪ್ರಾಮುಖ್ಯತೆ ನೀಡಲು, ಒಂದು ಗುಂಪು ಸಾಮಾನ್ಯ ಕಂಟೈನರ್ ಅನ್ನು ಹಂಚಿಕೊಳ್ಳಬೇಕು
ko: 전환 버튼은 관련 옵션을 그룹으로 묶는 데 사용할 수 있습니다. 관련 전환 버튼 그룹임을 강조하기 위해 하나의 그룹은 동일한 컨테이너를 공유해야 합니다.
ky: Күйгүзүү/өчүрүү баскычтары тиешелүү варианттарды топтоо үчүн колдонулушу мүмкүн. Тиешелүү күйгүзүү/өчүрүү баскычтарынын топторун белгилөө үчүн топтун жалпы контейнери болушу мүмкүн
lo: ປຸ່ມເປີດ/ປິດອາດໃຊ້ເພື່ອຈັດກຸ່ມຕົວເລືອກທີ່ກ່ຽວຂ້ອງກັນ. ກຸ່ມຂອງປຸ່ມເປີດ/ປິດທີ່ກ່ຽວຂ້ອງກັນຄວນໃຊ້ຄອນເທນເນີຮ່ວມກັນເພື່ອເປັນການເນັ້ນກຸ່ມເຫຼົ່ານັ້ນ
lt: Perjungimo mygtukais galima grupuoti susijusias parinktis. Norint pažymėti susijusių perjungimo mygtukų grupes, turėtų būti bendrinamas bendras grupės sudėtinis rodinys
lv: Pārslēgšanas pogas var izmantot saistītu opciju grupēšanai. Lai uzsvērtu saistītu pārslēgšanas pogu grupas, grupai ir jābūt kopīgam konteineram.
mk: Копчињата за префрлање може да се користат за групирање поврзани опции. За да се нагласат групи на поврзани копчиња за префрлање, групата треба да споделува заеднички контејнер
ml: സമാനമായ ഓപ്ഷനുകൾ ഗ്രൂപ്പ് ചെയ്യാൻ ടോഗിൾ ബട്ടണുകൾ ഉപയോഗിക്കാം. സമാനമായ ടോഗിൾ ബട്ടണുകളുടെ ഗ്രൂപ്പുകൾക്ക് പ്രാധാന്യം നൽകുന്നതിന്, ഒരു ഗ്രൂപ്പ് ഒരു പൊതു കണ്ടെയിനർ പങ്കിടണം
mn: Асаах товчийг холбоотой сонголтыг бүлэглэхэд ашиглаж болно. Асаах товчтой холбоотой бүлгийг онцлохын тулд тухайн бүлэг нийтлэг контэйнер хуваалцсан байх шаардлагатай
mr: संबंधित पर्यायांची गटांमध्ये विभागणी करण्यासाठी टॉगल बटणे वापरली जाऊ शकतात. संबंधित टॉगल बटणांच्या गटांवर लक्ष केंद्रीत करण्यासाठी प्रत्येक गटामध्ये एक समान घटक असणे आवश्यक आहे
ms: Butang togol boleh digunakan untuk mengumpulkan pilihan yang berkaitan. Untuk menekankan kumpulan butang togol yang berkaitan, kumpulan harus berkongsi bekas yang sama
my: သက်ဆိုင်ရာ ရွေးချယ်စရာများကို အုပ်စုဖွဲ့ရန် အဖွင့်အပိတ်ခလုတ်များကို အသုံးပြုနိုင်သည်။ သက်ဆိုင်ရာ အဖွင့်ပိတ်ခလုတ်များကို အထူးပြုရန် အုပ်စုတစ်ခုသည် တူညီသည့် ကွန်တိန်နာကို အသုံးပြုသင့်သည်။
nb: Av/på-knapper kan brukes til å gruppere relaterte alternativer. For å fremheve grupper med relaterte av/på-knapper bør en gruppe dele en felles beholder
ne: सम्बन्धित विकल्पहरूको समूह बनाउन टगल गर्ने बटन प्रयोग गर्न सकिन्छ। सम्बन्धित टगल बटनका समूहहरूलाई जोड दिनका लागि एउटा समूहले साझा कन्टेनर आदान प्रदान गर्नु पर्छ
pa: ਟੌਗਲ ਬਟਨ ਦੀ ਵਰਤੋਂ ਸੰਬੰਧਿਤ ਵਿਕਲਪਾਂ ਨੂੰ ਗਰੁੱਪਬੱਧ ਕਰਨ ਲਈ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ਸੰਬੰਧਿਤ ਟੌਗਲ ਬਟਨਾਂ ਦੇ ਗਰੁੱਪਾਂ 'ਤੇ ਜ਼ੋਰ ਦੇਣ ਲਈ, ਗਰੁੱਪ ਦਾ ਕੋਈ ਸਾਂਝਾ ਕੰਟੇਨਰ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ
pl: Za pomocą przycisków przełączania można grupować powiązane opcje. Aby uwyraźnić grupę powiązanych przycisków przełączania, grupa powinna znajdować się we wspólnej sekcji.
pt: Botões ativar podem ser usados para opções relacionadas a grupos. Para enfatizar grupos de botões ativar relacionados, um grupo precisa compartilhar um mesmo contêiner
pt_pt: Os botões ativar/desativar podem ser utilizados para agrupar opções relacionadas. Para realçar grupos de botões ativar/desativar relacionados, um grupo pode partilhar um contentor comum.
ro: Butoanele de comutare pot fi folosite pentru a grupa opțiunile similare. Pentru a evidenția grupuri de butoane de comutare similare, este necesar ca un grup să aibă un container comun.
ru: С помощью переключателей можно сгруппировать связанные параметры. У группы связанных друг с другом переключателей должен быть общий контейнер.
si: සම්බන්ධිත විකල්ප සමූහගත කිරීමට ටොගල බොත්තම් භාවිත කළ හැකිය. සම්බන්ධිත ටොගල බොත්තම සමූහ අවධාරණය කිරීමට, සමූහයක් පොදු බහාලුමක් බෙදා ගත යුතුය
sk: Pomocou prepínačov môžete zoskupiť súvisiace možnosti. Skupina by mala zdieľať spoločný kontajner na zvýraznenie skupín súvisiacich prepínačov
sq: Butonat e ndërrimit mund të përdoren për të grupuar opsionet e përafërta. Për të theksuar grupet e butonave të përafërt të ndërrimit, një grup duhet të ndajë një mbajtës të përbashkët
sr: Дугмад за укључивање/искључивање може да се користи за груписање сродних опција. Да бисте нагласили групе сродне дугмади за укључивање/искључивање, група треба да има заједнички контејнер
sr_latn: Dugmad za uključivanje/isključivanje može da se koristi za grupisanje srodnih opcija. Da biste naglasili grupe srodne dugmadi za uključivanje/isključivanje, grupa treba da ima zajednički kontejner
sv: På/av-knappar kan användas för grupprelaterade alternativ. En grupp bör finnas i samma behållare för att lyfta fram grupper av relaterade på/av-knappar
te: సంబంధిత ఎంపికలను సమూహపరచడానికి టోగుల్ బటన్‌లను ఉపయోగించవచ్చు. సంబంధిత టోగుల్ బటన్‌ల గ్రూప్‌లను నొక్కడానికి, గ్రూప్‌ సాధారణ కంటైనర్‌ని షేర్ చేయాలి
th: ปุ่มเปิด-ปิดอาจใช้เพื่อจับกลุ่มตัวเลือกที่เกี่ยวข้องกัน กลุ่มของปุ่มเปิด-ปิดที่เกี่ยวข้องกันควรใช้คอนเทนเนอร์ร่วมกันเพื่อเป็นการเน้นกลุ่มเหล่านั้น
tr: Açma/kapatma düğmeleri benzer seçenekleri gruplamak için kullanılabilir. Benzer açma/kapatma düğmesi gruplarını vurgulamak için grubun ortak bir kapsayıcıyı paylaşması gerekir.
uk: Перемикач можна використовувати для групування пов'язаних параметрів. Щоб виділити групу пов'язаних перемикачів, вона повинна мати спільний контейнер
ur: گروپ سے متعلق اختیارات کے لیے ٹوگل بٹنز استعمال کئے جا سکتے ہیں۔ متعلقہ ٹوگل بٹنز کے گروپوں پر زور دینے کے لئے، ایک گروپ کو مشترکہ کنٹینر کا اشتراک کرنا ہوگا
uz: Belgilash/olib tashlash tugmasi bilan oʻxshash parametrlarni guruhlash mumkin. Belgilash/olib tashlash tugmasiga aloqador guruhlar bitta umumiy konteynerda boʻlishi lozim.
vi: Bạn có thể dùng các nút chuyển đổi để nhóm những tùy chọn có liên quan lại với nhau. To emphasize groups of related toggle buttons, a group should share a common container
zh_hk: 切換按鈕可用於將相關的選項分組。為突顯相關的切換按鈕群組，單一群組應共用同一個容器
zu: Izinkinobho zokuguqula zingasetshenziswa ukuze zifake kuqembu izinketho ezihambisanayo. Ukuze kugcizelelwe amaqembu ezinkinobho ezihambisanayo zokuguqula, iqembu kumele labelane ngesiqukathi esijwayelekile

# colorsGrey
source: GREY
af: GRYS
am: ግራጫ
ar_eg: رمادي
as: ধোঁৱাবৰণীয়া
az: BOZ
be: ШЭРЫ
bn: ধূসর
bs: SIVA
ca: GRIS
da: GRÅ
es_ar: GRIS
et: HALL
eu: GRISA
fa: خاکستری
fr_ca: GRIS
gl: GRIS
gu: રાખોડી
he: אפור
hi: स्लेटी
hu: SZÜRKE
hy: ՄՈԽՐԱԳՈՒՅՆ
id: ABU-ABU
it: GRIGIO
ja: グレー
ka: ნაცრისფერი
km: ប្រផេះ
kn: ಬೂದು ಬಣ್ಣ
ko: 회색
ky: БОЗ
lo: ສີເທົາ
lt: PILKA
lv: PELĒKA
mk: СИВА
ml: ചാരനിറം
mn: СААРАЛ
mr: राखाडी
ms: KELABU
my: မီးခိုး
nb: GRÅ
ne: खैरो
pa: ਸਲੇਟੀ
pl: SZARY
pt: CINZA
pt_pt: CINZENTO
ro: GRI
ru: СЕРЫЙ
si: අළු
sk: SIVÁ
sq: GRI
sr: СИВА
sr_latn: SIVA
sv: GRÅ
te: బూడిద రంగు
th: เทา
tr: GRİ
uk: СІРИЙ
ur: خاکستری
uz: KULRANG
vi: MÀU XÁM
zh_hk: 灰色
zu: OKUMPUNGA

# colorsBrown
source: BROWN
af: BRUIN
am: ቡናማ
ar_eg: بني
as: মাটীয়া
az: QƏHVƏYİ
be: КАРЫЧНЕВЫ
bn: বাদামি
bs: SMEĐA
ca: MARRÓ
da: BRUN
es_ar: MARRÓN
et: PRUUN
eu: MARROIA
fa: قهوه‌ای
fr_ca: BRUN
gl: MARRÓN
gu: તપખીરિયો રંગ
he: חום
hi: भूरा
hu: BARNA
hy: ԴԱՐՉՆԱԳՈՒՅՆ
id: COKELAT
it: MARRONE
ja: ブラウン
ka: ყავისფერი
km: ត្នោត
kn: ಕಂದು ಬಣ್ಣ
ko: 갈색
ky: КҮРӨҢ
lo: ສີນ້ຳຕານ
lt: RUDA
lv: BRŪNA
mk: КАФЕАВА
ml: ബ്രൗൺ
mn: БОР
mr: तपकिरी
ms: COKLAT
my: အညို
nb: BRUN
ne: खैरो
pa: ਭੂਰਾ
pl: BRĄZOWY
pt: MARROM
pt_pt: CASTANHO
ro: MARO
ru: КОРИЧНЕВЫЙ
si: දුඹුරු
sk: HNEDÁ
sq: KAFE
sr: БРАОН
sr_latn: BRAON
sv: BRUN
te: గోధుమ రంగు
th: น้ำตาล
tr: KAHVERENGİ
uk: КОРИЧНЕВИЙ
ur: بھورا
uz: JIGARRANG
vi: MÀU NÂU
zh_hk: 啡色
zu: OKUMPOFU
