Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoContextMenuTitle
source: Context menu
af: Kontekskieslys
am: የዓውድ ምናሌ
ar_eg: قائمة السياقات
as: প্ৰসংগ মেনু
az: Kontekst menyusu
be: Кантэкстнае меню
bn: সংশ্লিষ্ট মেনু
bs: Kontekstni meni
ca: Menú contextual
da: Genvejsmenu
es_ar: Menú contextual
et: Kontekstimenüü
eu: Laster-menua
fa: منوی بافت
fil: Menu ng konteksto
fr_ca: Menu contextuel
gl: Menú contextual
gu: સંદર્ભ મેનૂ
he: תפריט הקשר
hi: संदर्भ मेन्यू
hu: Helyi menü
hy: Տեղային ընտրացանկ
id: Menu konteks
it: Menu contestuale
ja: コンテキスト メニュー
ka: კონტექსტური მენიუ
km: ម៉ឺនុយ​បរិបទ
kn: ಸಂದರ್ಭದ ಮೆನು
ko: 컨텍스트 메뉴
ky: Мазмундук меню
lo: ເມນູບໍລິບົດ
lt: Kontekstinis meniu
lv: Kontekstizvēlne
mk: Контекстуално мени
ml: സന്ദർഭ മെനു
mn: Хам сэдэв цэс
mr: काँटेक्स्ट मेनू
ms: Menu konteks
my: အကြောင်းအရာမီနူး
nb: Kontekstuell meny
ne: सन्दर्भ मेनु
pa: ਸੰਦਰਭੀ ਮੀਨੂ
pl: Menu kontekstowe
pt: Menu de contexto
pt_pt: Menu de contexto
ro: Meniu contextual
ru: Контекстное меню
si: සන්දර්භ මෙනුව
sk: Kontextová ponuka
sq: Menyja kontekstuale
sr: Контекстуални мени
sr_latn: Kontekstualni meni
sv: Snabbmeny
te: సందర్భోచిత మెనూ
th: เมนูตามบริบท
tr: İçerik menüsü
uk: Контекстне меню
ur: سیاق و سباق کا مینیو
uz: Kontekst menyusi
vi: Trình đơn ngữ cảnh
zh_hk: 內容選單
zu: Imenyu yokuqukethwe

# demoSectionedMenuTitle
source: Sectioned menu
af: Verdeelde kieslys
am: በክፍል የተከፋፈለ ምናሌ
ar_eg: قائمة ذات أقسام
as: বিভক্ত মেনু
az: Bölməli menyu
be: Меню з раздзеламі
bn: বিভাগ অনুযায়ী ভাগ করা মেনু
bs: Meni s odjeljcima
ca: Menú amb seccions
da: Menu med sektioner
es_ar: Menú dividido
et: Jaotistega menüü
eu: Menu sekzioduna
fa: منوی بخش‌بندی‌شده
fil: Nakaseksyong menu
fr_ca: Menu à sections
gl: Menú con seccións
gu: વિભાગીય મેનૂ
he: תפריט מחולק לקטעים
hi: सेक्शन वाला मेन्यू
hu: Tagolt menü
hy: Բաժիններ պարունակող ընտրացանկ
id: Menu dengan bagian
it: Menu a sezioni
ja: セクション分割メニュー
ka: სექციებად დაყოფილი მენიუ
km: ម៉ឺនុយ​តាមផ្នែក
kn: ವಿಭಾಗದ ಮೆನು
ko: 섹션으로 구분된 메뉴
ky: Бөлүмдөр менюсу
lo: ເມນູແບບພາກສ່ວນ
lt: Į skiltis suskirstytas meniu
lv: Izvēlne ar sadaļām
mk: Мени со секции
ml: വിഭാഗീകരിച്ച മെനു
mn: Хэсэглэсэн цэс
mr: विभागित मेनू
ms: Menu berbahagian
my: အပိုင်းခွဲထားသော မီနူး
nb: Inndelt meny
ne: खण्डमा बाँडिएको मेनु
pa: ਸੈਕਸ਼ਨਬੱਧ ਮੀਨੂ
pl: Menu z podziałem na sekcje
pt: Menu em seções
pt_pt: Menu em secções
ro: Meniu cu secțiuni
ru: Меню с разделами
si: කොටස් කළ මෙනුව
sk: Rozdelená ponuka
sq: Menyja me seksione
sr: Мени са одељцима
sr_latn: Meni sa odeljcima
sv: Meny med avsnitt
te: విభాగాల మెనూ
th: เมนูแบบเป็นส่วน
tr: Bölümlere ayrılmış menü
uk: Меню з розділами
ur: سیکشن کردہ مینیو
uz: Qismli menyular
vi: Trình đơn theo phần
zh_hk: 分類選單
zu: Imenyu efakwe kusigaba

# demoSimpleMenuTitle
source: Simple menu
af: Eenvoudige kieslys
am: ቀላል ምናሌ
ar_eg: قائمة بسيطة
as: সৰল মেনু
az: Sadə menyu
be: Простае меню
bn: সহজ মেনু
bs: Jednostavan meni
ca: Menú senzill
da: Enkel menu
es_ar: Menú simple
et: Lihtne menüü
eu: Menu sinplea
fa: منوی ساده
fil: Simpleng menu
fr_ca: Menu simple
gl: Menú simple
gu: સરળ મેનૂ
he: תפריט פשוט
hi: सरल मेन्यू
hu: Egyszerű menü
hy: Պարզ ընտրացանկ
id: Menu sederhana
it: Menu semplice
ja: シンプル メニュー
ka: მარტივი მენიუ
km: ម៉ឺនុយ​ធម្មតា
kn: ಸರಳ ಮೆನು
ko: 단순 메뉴
ky: Жөнөкөй меню
lo: ເມນູແບບງ່າຍ
lt: Paprastas meniu
lv: Vienkārša izvēlne
mk: Едноставно мени
ml: സിമ്പിൾ മെനു
mn: Энгийн цэс
mr: सोपा मेनू
ms: Menu ringkas
my: ရိုးရှင်းသော မီနူး
nb: Enkel meny
ne: सामान्य मेनु
pa: ਸਧਾਰਨ ਮੀਨੂ
pl: Proste menu
pt: Menu simples
pt_pt: Menu simples
ro: Meniu simplu
ru: Простое меню
si: සරල මෙනුව
sk: Jednoduchá ponuka
sq: Menyja e thjeshtë
sr: Једноставни мени
sr_latn: Jednostavni meni
sv: Enkel meny
te: సరళమైన మెనూ
th: เมนูแบบง่าย
tr: Basit menü
uk: Просте меню
ur: آسان مینیو
uz: Oddiy menyu
vi: Trình đơn đơn giản
zh_hk: 簡單選單
zu: Imenyu elula

# demoChecklistMenuTitle
source: Checklist menu
af: Kontrolelyskieslys
am: የማረጋገጫ ዝርዝር ምናሌ
ar_eg: قائمة التحقّق
as: চেকলিষ্ট মেনু
az: Yoxlama siyahısı menyusu
be: Меню з кантрольным спісам
bn: চেকলিস্ট মেনু
bs: Meni s kontrolnim listama
ca: Menú amb llista de comprovació
da: Tjeklistemenu
es_ar: Menú de lista de tareas
et: Kontroll-lehe menüü
eu: Egiaztapen-zerrendaren menua
fa: منوی بازبینه‌ای
fil: Checklist na menu
fr_ca: Menu de liste de contrôle
gl: Menú con lista de comprobación
gu: ચેકલિસ્ટ મેનૂ
he: תפריט של רשימת משימות
hi: चेकलिस्ट मेन्यू
hu: Ellenőrző listás menü
hy: Ստուգաթերթ պարունակող ընտրացանկ
id: Menu checklist
it: Menu con elenco di controllo
ja: チェックリスト メニュー
ka: საკონტროლო სიის მენიუ
km: ម៉ឺនុយ​បញ្ជី​ត្រួតពិនិត្យ
kn: ಪರಿಶೀಲನೆ ಪಟ್ಟಿಯ ಮೆನು
ko: 체크리스트 메뉴
ky: Тизме менюсу
lo: ເມນູລາຍການກວດສອບ
lt: Kontrolinio sąrašo meniu
lv: Kontrolsaraksta izvēlne
mk: Мени со список за проверка
ml: ചെക്ക്‌ലിസ്റ്റ് മെനു
mn: Шалгах хуудасны цэс
mr: चेकलिस्ट मेनू
ms: Menu senarai semak
my: ဆောင်ရွက်ရန်စာရင်းပါ မီနူး
nb: Sjekklistemeny
ne: चेकलिस्ट मेनु
pa: ਕਾਰਜ-ਸੂਚੀ ਮੀਨੂ
pl: Menu listy kontrolnej
pt: Menu de lista de verificação
pt_pt: Menu da lista de verificação
ro: Meniu cu listă de verificare
ru: Меню с контрольным списком
si: පිරික්සුම් ලැයිස්තු මෙනුව
sk: Ponuka kontrolného zoznamu
sq: Menyja me listë me zgjedhje
sr: Мени са контролним листама
sr_latn: Meni sa kontrolnim listama
sv: Meny med checklista
te: చెక్‌లిస్ట్‌ మెనూ
th: เมนูแบบรายการตรวจสอบ
tr: Liste menü
uk: Меню у вигляді контрольного списку
ur: چیک لسٹ مینیو
uz: Nazoratli roʻyxatlar menyusi
vi: Trình đơn danh sách kiểm tra
zh_hk: 檢查清單選單
zu: Imenyu yohlu lokuhlola

# demoMenuSubtitle
source: Menu buttons and simple menus
af: Kielysknoppies en eenvoudige kieslyste
am: የምናሌ አዝራሮች እና ቀላል ምናሌዎች
ar_eg: أزرار قوائم وقوائم بسيطة
as: মেনুৰ বুটামবোৰ আৰু সৰল মেনুবোৰ
az: Menyu düymələri və sadə menyular
be: Кнопкі меню і простыя меню
bn: মেনু বোতাম এবং সহজ মেনু
bs: Dugmad menija i jednostavni meniji
ca: Botons de menú i menús senzills
da: Menuknapper og enkle menuer
es_ar: Botones de menú y menús simples
et: Menüünupud ja lihtsad menüüd
eu: Menuko botoiak eta menu sinpleak
fa: دکمه‌های منو و منوهای ساده
fil: Mga button ng menu at simpleng menu
fr_ca: Boutons de menu menus simples
gl: Botóns de menú e menús simples
gu: મેનૂ બટન અને સરળ મેનૂ
he: לחצני תפריטים ותפריטים פשוטים
hi: मेन्यू बटन और सरल मेन्यू
hu: Menügombok és egyszerű menük
hy: Ընտրացանկի կոճակներ և պարզ ընտրացանկեր
id: Tombol menu dan menu sederhana
it: Pulsanti di menu e menu semplici
ja: メニューボタンとシンプル メニュー
ka: მენიუს ღილაკები და მარტივი მენიუები
km: ប៊ូតុង​ម៉ឺនុយ និង​ម៉ឺនុយ​ធម្មតា
kn: ಮೆನು ಬಟನ್‌ಗಳು ಮತ್ತು ಸರಳ ಮೆನುಗಳು
ko: 메뉴 버튼 및 단순 메뉴
ky: Менюнун баскычтары жана жөнөкөй менюлар
lo: ປຸ່ມເມນູ ແລະ ເມນູແບບງ່າຍໆ
lt: Meniu mygtukai ir paprasti meniu
lv: Izvēlnes pogas un vienkāršas izvēlnes
mk: Копчиња на мени и едноставни менија
ml: മെനു ബട്ടണുകളും സിമ്പിൾ മെനുകളും
mn: Цэсийн товчлуур болон энгийн цэс
mr: मेनू बटण आणि सोपा मेनू
ms: Butang menu dan menu ringkas
my: မီနူးခလုတ်များနှင့် ရိုးရှင်းသော မီနူး
nb: Menyknapper og enkle menyer
ne: मेनु बटन र सामान्य मेनुहरू
pa: ਮੀਨੂ ਬਟਨ ਅਤੇ ਸਧਾਰਨ ਮੀਨੂ
pl: Przyciski menu i proste menu
pt: Botões de menu e menus simples
pt_pt: Botões de menu e menus simples
ro: Butoane de meniu și meniuri simple
ru: Кнопки меню и простые меню
si: මෙනු බොත්තම් සහ සරල මෙනු
sk: Tlačidlá ponuky a jednoduché ponuky
sq: Butonat e menysë dhe menytë e thjeshta
sr: Дугмад менија и једноставни менији
sr_latn: Dugmad menija i jednostavni meniji
sv: Menyknappar och enkla menyer
te: మెనూ బటన్‌లు, సరళమైన మెనూలు
th: ปุ่มเมนูและเมนูแบบง่าย
tr: Menü düğmeleri ve basit menüler
uk: Кнопки меню та прості меню
ur: مینیو کے بٹنز اور آسان مینیو
uz: Menyu tugmalari va oddiy menyular
vi: Nút trình đơn và trình đơn đơn giản
zh_hk: 選單按鈕和簡單選單
zu: Izinkinobho zemenyu namamenyu alula

# demoMenuDescription
source: A menu displays a list of choices on a temporary surface. They appear when users interact with a button, action, or other control.
af: 'n Kieslys wys 'n lys keuses op 'n tydelike oppervlakte. Hulle verskyn wanneer 'n gebruiker interaksie met 'n knoppie, handeling of ander kontrole het.
am: ምናሌ በጊዜያዊ ቦታ ላይ የምርጫዎችን ዝርዝር ያሳያል። ተጠቃሚዎች ከአዝራር፣ ከድርጊት ወይም ሌላ መቆጣጠሪያ ጋር መስተጋብር ሲፈጽሙ ብቅ ይላሉ።
ar_eg: تعرض القائمة مجموعة من الخيارات على سطح مؤقت، حيث تظهر عندما يتفاعل المستخدمون مع زر أو إجراء أو عنصر تحكم آخر.
as: এখন মেনুয়ে বাছনিসমূহৰ সূচী এখন সমতলত প্ৰদর্শন কৰে। ব্যৱহাৰকাৰীসকলে এটা বুটাম, কার্য অথবা অন্য নিয়ন্ত্ৰণ ব্যৱহাৰ কৰাৰ সময়ত সেইবোৰ প্ৰদর্শিত হয়।
az: Menyu müvəqqəti səthdə seçimlərin siyahısını göstərir. İstifadəçilər düyməyə toxunduqda, əməliyyat etdikdə və ya başqa nizamlayıcıya toxunduqda onlar görünür.
be: Меню ўтрымлівае спіс варыянтаў у асобным акне. Спіс паказваецца, калі карыстальнікі націскаюць кнопку, выконваюць дзеянне ці ўзаемадзейнічаюць з іншым элементам кіравання.
bn: এমন একটি মেনু যা অস্থায়ী সারফেসে পছন্দের তালিকা দেখায়। ব্যবহারকারী কোনও বোতাম, অ্যাকশন বা অন্যান্য নিয়ন্ত্রণ ব্যবহার করলে এগুলি দেখা যায়।
bs: Na meniju se prikazuje lista odabira na privremenoj površini. Oni se prikazuju kada korisnik koristi dugmad, radnje ili druge kontrole.
ca: Un menú mostra una llista d'opcions sobre una superfície temporal. Es mostren quan els usuaris fan determinades accions o interaccionen amb un botó o un altre control.
da: En menu viser en liste over valgmuligheder i en midlertidig rude. De vises, når brugerne interagerer med en knap, en handling eller en anden funktion.
es_ar: Un menú muestra una lista de opciones en una superficie temporal. Aparece cuando los usuarios interactúan con un botón, una acción u otro control.
et: Menüü kuvab ajutisel pinnal valikute loendi. Need kuvatakse siis, kui kasutajad nuppe, toiminguid või muid juhtelemente kasutavad.
eu: Menuek aukera-zerrenda bat erakusten dute aldi batez. Erabiltzaileek botoi, ekintza edo bestelako kontrol-aukera batekin interakzioan jarduten dutenean agertzen dira menuak.
fa: منو، فهرستی از چند انتخاب را در نمایی موقت نمایش می‌دهد. وقتی کاربران با دکمه، کنش، یا کنترل دیگری تعامل داشته باشند، منو ظاهر می‌شود.
fil: Nagpapakita ang menu ng listahan ng mga pagpipilian sa isang pansamantalang lugar. Lumalabas ang mga ito kapag nakipag-ugnayan ang mga user gamit ang button, pagkilos, o iba pang kontrol.
fr_ca: Un menu présente une liste d'options de manière temporaire. Il s'affiche lorsque les utilisateurs interagissent avec un bouton, une action ou un autre type de commande.
gl: Un menú mostra unha lista de opcións nunha superficie temporal e aparece cando os usuarios interactúan cun botón, cunha acción ou con outro control.
gu: મેનૂ હંગામી સપાટી પર પસંદગીઓની સૂચિ બતાવે છે. જ્યારે વપરાશકર્તાઓ બટન, ક્રિયા અથવા અન્ય નિયંત્રણથી ક્રિયાપ્રતિક્રિયા કરે, ત્યારે તે દેખાય છે.
he: בתפריט מוצגת רשימת אפשרויות לבחירה על משטח זמני. הן מופיעות כשמשתמשים מבצעים אינטראקציה עם לחצן, פעולה או פקד אחר.
hi: मेन्यू एक अस्थायी सतह पर विकल्पों की सूची दिखाता है. ये विकल्प तब दिखते हैं, जब उपयोगकर्ता किसी बटन, कार्रवाई या दूसरे नियंत्रण का इस्तेमाल करते हैं.
hu: Egy menü válaszlehetőségek listáját jeleníti meg egy ideiglenes felületen. Akkor jelenik meg, amikor a felhasználó valamilyen gombot, műveletet vagy másféle vezérlőelemet használ.
hy: Ընտրացանկը ցուցադրում է ընտրանքների ցանկ ժամանակավոր մակերեսին։ Դրանք ցուցադրվում են, երբ օգտատերերը սեղմում են կոճակին կամ այլ գործողություն են կատարում։
id: Menu menampilkan daftar pilihan pada permukaan sementara Daftar tersebut muncul ketika pengguna berinteraksi dengan tombol, tindakan, atau kontrol lainnya.
it: Un menu visualizza un elenco di opzioni su una superficie temporanea, che vengono mostrate quando gli utenti interagiscono con un pulsante, un'azione o un altro controllo.
ja: メニューでは、一時的なサーフェス上に選択肢の一覧が表示されます。ユーザーがボタン、アクション、その他のコントロールを操作すると表示されます。
ka: მენიუ აჩვენებს ასარჩევი ვარიანტების სიას დროებით ზედაპირზე. ისინი გამოჩნდება მომხმარებლის ინტერაქციისას ღილაკზე, მოქმედებაზე ან მართვის სხვა საშუალებაზე.
km: ម៉ឺនុយ​បង្ហាញ​បញ្ជី​ជម្រើស​នៅលើ​ផ្ទៃ​បណ្ដោះ​អាសន្ន​។ ជម្រើស​ទាំងនោះ​បង្ហាញ នៅពេល​អ្នកប្រើប្រាស់​ធ្វើអន្តរកម្ម​ជាមួយ​ប៊ូតុង សកម្មភាព ឬ​ការគ្រប់គ្រង​ផ្សេងទៀត​។
kn: ಮೆನು ತಾತ್ಕಾಲಿಕ ಮೇಲ್ಮೈಯಲ್ಲಿ ಆಯ್ಕೆಗಳ ಪಟ್ಟಿಯನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡುತ್ತದೆ. ಬಳಕೆದಾರರು ಬಟನ್‌ಗಳು, ಕ್ರಿಯೆಗಳು ಮತ್ತು ಇತರ ನಿಯಂತ್ರಣಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಸಂವಹನ ನಡೆಸಿದಾಗ ಅವುಗಳು ಗೋಚರಿಸುತ್ತವೆ.
ko: 메뉴에는 일시적으로 나타나는 창에 선택 항목이 목록 형식으로 표시됩니다. 선택 항목은 사용자가 버튼, 작업 또는 기타 컨트롤과 상호작용할 때 표시됩니다.
ky: Менюда убактылуу беттеги тандоолордун тизмеси көрүнөт. Алар колдонуучу баскычты басканда, аракетти аткарганда же башка башкаруу элементтерин колдонгондо көрүнөт.
lo: ເມນູຈະສະແດງລາຍຊື່ຂອງຕົວເລືອກຢູ່ພື້ນຜິວຊົ່ວຄາວ. ພວກມັນຈະປາກົດເມື່ອຜູ້ໃຊ້ໂຕ້ຕອບກັບປຸ່ມ, ຄຳສັ່ງ ຫຼື ການຄວບຄຸມອື່ນໆ.
lt: Meniu pateikiamas laikinai rodomų pasirinkimų sąrašas. Jie rodomi naudotojams naudojant mygtuką, atliekant veiksmą ar naudojant kitą valdiklį.
lv: Izvēlne īslaicīgajā saskarnē attēlo pieejamo opciju sarakstu. Tās tiek parādītas, kad lietotājs mijiedarbojas ar pogu vai vadīklu vai veic darbību.
mk: Менито прикажува список со избори на привремена површина. Тие се појавуваат кога корисникот ќе користи копче, дејство или друга контрола.
ml: മെനു, ഒരു താൽക്കാലിക പ്രതലത്തിൽ ചോയ്‌സുകളുടെ ഒരു ലിസ്റ്റ് പ്രദർശിപ്പിക്കും. ബട്ടൺ, നടപടി, അല്ലെങ്കിൽ മറ്റ് നിയന്ത്രണവുമായി ഉപയോക്താക്കൾ ബന്ധപ്പെടുമ്പോൾ അവ പ്രത്യക്ഷപ്പെടും.
mn: Цэс нь түр зуурын гадаргуу дээр сонголтын жагсаалтыг үзүүлдэг. Энэ нь хэрэглэгчид товчлуур, үйлдэл эсвэл бусад хяналттай харилцах үед харагддаг.
mr: मेनू तात्पुरत्या पृष्ठभागावर निवडींची एक सूची दाखवतो. वापरकर्ते बटण, कृती किंवा अन्य नियंत्रणे वापरून संवाद साधतात तेव्हा ते दिसतात.
ms: Menu memaparkan senarai pilihan pada permukaan sementara. Menu ini muncul apabila pengguna berinteraksi dengan butang, tindakan atau kawalan lain.
my: မီနူးသည် ယာယီမျက်နှာပြင်ပေါ်တွင် ရွေးချယ်စရာစာရင်းတစ်ခုကို ဖော်ပြပေးသည်။ အသုံးပြုသူက ခလုတ်၊ လုပ်ဆောင်ချက် သို့မဟုတ် အခြားထိန်းချုပ်မှုတို့ကို အသုံးပြုသည့်အခါ ၎င်းပေါ်လာပါမည်။
nb: Menyer viser lister over valg på en midlertidig overflate. De vises når brukere samhandler med en knapp, handling eller annen kontroll.
ne: मेनुले अस्थायी सतहमा विकल्पहरूको सूची देखाउँछ। यिनीहरू प्रयोगकर्ताले बटन दबाउँदा, छुँदा वा अन्य नियन्त्रणहरूले प्रतिक्रिया गर्दा देखिन्छन्।
pa: ਮੀਨੂ ਅਸਥਾਈ ਸਤ੍ਹਾ 'ਤੇ ਵਿਕਲਪਾਂ ਦੀ ਸੂਚੀ ਦਿਖਾਉਂਦਾ ਹੈ। ਇਹ ਉਦੋਂ ਦਿਸਦੇ ਹਨ ਜਦੋਂ ਵਰਤੋਂਕਾਰ ਕਿਸੇ ਬਟਨ, ਕਾਰਵਾਈ ਜਾਂ ਹੋਰ ਕੰਟਰੋਲਾਂ ਨਾਲ ਅੰਤਰਕਿਰਿਆ ਕਰਦੇ ਹਨ।
pl: Menu wyświetla listę opcji w tymczasowym interfejsie. Opcje wyświetlają się, gdy użytkownik wejdzie w interakcję z przyciskiem, opcją lub innym elementem sterującym.
pt: Um menu mostra uma lista de escolhas em uma superfície temporária. Eles aparecem quando os usuários interagem com um botão, uma ação ou outro controle.
pt_pt: Um menu apresenta uma lista de opções numa superfície temporária. Estas são apresentadas quando os utilizadores interagem com um botão, uma ação ou outro controlo.
ro: Meniul afișează o listă de opțiuni pe o suprafață temporară. Acestea apar atunci când utilizatorii interacționează cu un buton, o acțiune sau altă comandă.
ru: Меню содержит список вариантов, которые располагаются в отдельном блоке. Список появляется, когда пользователь нажимает кнопку, выполняет действие или взаимодействует с другим элементом управления.
si: මෙනුවක් තාවකාලික මතුපිටක තේරීම් ලැයිස්තුවක් පෙන්වයි. පරිශීලකයන් බොත්තමක්, ක්‍රියාවක් හෝ වෙනත් පාලනයක් සමඟ අන්තර්ක්‍රියා කරන විට ඒවා දිස් වේ.
sk: Ponuka zobrazuje zoznam možností v dočasnom okne. Spustí sa pri interakcii používateľov s tlačidlom, akciou alebo iným ovládacím prvkom.
sq: Një meny shfaq një listë zgjedhjesh në një sipërfaqe të përkohshme. Ato shfaqen kur përdoruesit ndërveprojnë me një buton, veprim ose një kontroll tjetër.
sr: Мени приказује листу опција на привременој површини. Оне се приказују када корисници остварују интеракцију са дугметом, радњом или другом контролом.
sr_latn: Meni prikazuje listu opcija na privremenoj površini. One se prikazuju kada korisnici ostvaruju interakciju sa dugmetom, radnjom ili drugom kontrolom.
sv: En meny visar en lista över alternativ på en tillfällig yta. De syns när användare interagerar med en knapp, åtgärd eller annan kontroll.
te: మెనూ అనేది, ఒక తాత్కాలిక ఉపరితలంపై ఎంపికల లిస్ట్‌ను ప్రదర్శిస్తుంది. యూజర్‌లు ఒక బటన్, చర్య లేదా ఇతర నియంత్రణతో ఇంటరాక్ట్ అయినప్పుడు అవి కనిపిస్తాయి.
th: เมนูจะแสดงรายการตัวเลือกบนพื้นผิวชั่วคราว โดยจะปรากฏขึ้นเมื่อผู้ใช้โต้ตอบกับปุ่ม การดำเนินการ หรือตัวควบคุมอื่นๆ
tr: Menü, geçici bir yüzeyde seçenekler listesini görüntüler. Menüler, kullanıcılar bir düğme, işlem veya başka bir kontrolle etkileşimde bulunduğunda görünür.
uk: У меню показано список варіантів, які з'являються під час взаємодії користувачів із кнопкою, дією чи іншим елементом керування.
ur: مینیو عارضی سطح پر انتخابات کی ایک فہرست ڈسپلے کرتا ہے۔ یہ اس وقت ظاہر ہوتے ہیں جب صارفین بٹن، ایکشن یا دیگر کنٹرول کے ساتھ تعامل کرتے ہیں۔
uz: Menyuda alohida blokda joylashgan variantlar roʻyxati mavjud boʻladi. Foydalanuvchi tugmaga bosganda, biror amalni bajarganda yoki boshqa boshqaruv elementlaridan foydalanganda roʻyxat chiqadi.
vi: Trình đơn sẽ hiển thị một danh sách các lựa chọn trên giao diện tạm thời. Các lựa chọn sẽ xuất hiện khi người dùng tương tác với một nút, hành động hoặc tùy chọn kiểm soát khác.
zh_hk: 選單會在臨時界面中顯示選項清單，並會在使用者與按鈕、操作或其他控制項互動時出現。
zu: Imenyu ibonisa uhlu lwezinketho kundawo yangokwesikhashana. Zivela uma abasebenzisi bahlanganyela nenkinobho, isenzo, noma esinye isilawuli.

# demoMenuItemValueOne
source: Menu item one
af: Kieslysitem een
am: ምናሌ ንጥል አንድ
ar_eg: أول عنصر قائمة
as: মেনুত থকা প্ৰথম বস্তু
az: Birinci menyu elementi
be: Першы пункт меню
bn: মেনুর প্রথম আইটেম
bs: Prva stavka menija
ca: Element de menú u
da: Menupunkt ét
es_ar: Primer elemento del menú
et: Menüü-üksus 1
eu: Menuko lehen aukera
fa: گزینه یک منو
fil: Unang item sa menu
fr_ca: Option de menu un
gl: Elemento do menú un
gu: મેનૂમાં પહેલી આઇટમ
he: אפשרות ראשונה בתפריט
hi: मेन्यू का पहला आइटम
hu: Első menüelem
hy: Ընտրացանկի տարր 1
id: Item menu satu
it: Voce di menu uno
ja: メニュー項目 1
ka: მენიუს პირველი ერთეული
km: ធាតុម៉ឺនុយទីមួយ
kn: ಮೆನುವಿನ ಮೊದಲನೇ ಐಟಂ
ko: 메뉴 항목 1
ky: Менюдагы биринчи элемент
lo: ລາຍການເມນູໜຶ່ງ
lt: Pirmas meniu elementas
lv: Pirmais izvēlnes vienums
mk: Прва ставка од менито
ml: മെനു ഇനം ഒന്ന്
mn: Цэсийн нэгдүгээр зүйл
mr: पहिला मेनू आयटम
ms: Item menu pertama
my: မီနူးအကြောင်းအရာ တစ်
nb: Menyelement én
ne: मेनुको पहिलो वस्तु
pa: ਮੀਨੂ ਵਿਚਲੀ ਪਹਿਲੀ ਆਈਟਮ
pl: Pierwsza pozycja menu
pt: Item um do menu
pt_pt: Primeiro item de menu
ro: Elementul de meniu unu
ru: Первый пункт меню
si: මෙනු අයිතම එක
sk: Prvá položka ponuky
sq: Artikulli i parë i menysë
sr: Прва ставка менија
sr_latn: Prva stavka menija
sv: Menyalternativ ett
te: మొదటి మెనూ అంశం
th: รายการในเมนูที่ 1
tr: Menü öğesi bir
uk: Перший пункт меню
ur: پہلا مینیو آئٹم
uz: Menyuning birinchi bandi
vi: Mục đầu tiên trong trình đơn
zh_hk: 第一個選單項目
zu: Into yemenyu yokuqala

# demoMenuItemValueTwo
source: Menu item two
af: Kieslysitem twee
am: ምናሌ ንጥል ሁለት
ar_eg: ثاني عنصر قائمة
as: মেনুত থকা দ্বিতীয় বস্তু
az: İkinci menyu elementi
be: Другі пункт меню
bn: মেনুর দ্বিতীয় আইটেম
bs: Druga stavka menija
ca: Element de menú dos
da: Menupunkt to
es_ar: Segundo elemento del menú
et: Menüü-üksus 2
eu: Menuko bigarren aukera
fa: گزینه دو منو
fil: Pangalawang item sa menu
fr_ca: Option de menu deux
gl: Elemento do menú dous
gu: મેનૂમાં બીજી આઇટમ
he: אפשרות שנייה בתפריט
hi: मेन्यू का दूसरा आइटम
hu: Második menüelem
hy: Ընտրացանկի տարր 2
id: Item menu dua
it: Voce di menu due
ja: メニュー項目 2
ka: მენიუს მეორე ერთეული
km: ធាតុម៉ឺនុយទីពីរ
kn: ಮೆನುವಿನ ಎರಡನೇ ಐಟಂ
ko: 메뉴 항목 2
ky: Менюдагы экинчи элемент
lo: ລາຍການເມນູສອງ
lt: Antras meniu elementas
lv: Otrais izvēlnes vienums
mk: Втора ставка од менито
ml: മെനു ഇനം രണ്ട്
mn: Цэсийн хоёрдугаар зүйл
mr: दुसरा मेनू आयटम
ms: Item menu kedua
my: မီနူးအကြောင်းအရာ နှစ်
nb: Menyelement to
ne: मेनुको दोस्रो वस्तु
pa: ਮੀਨੂ ਵਿਚਲੀ ਦੂਜੀ ਆਈਟਮ
pl: Druga pozycja menu
pt: Item dois do menu
pt_pt: Segundo item de menu
ro: Elementul de meniu doi
ru: Второй пункт меню
si: මෙනු අයිතම දෙක
sk: Druhá položka ponuky
sq: Artikulli i dytë i menysë
sr: Друга ставка менија
sr_latn: Druga stavka menija
sv: Menyalternativ två
te: రెండవ మెనూ అంశం
th: รายการในเมนูที่ 2
tr: Menü öğesi iki
uk: Другий пункт меню
ur: دوسرا مینیو آئٹم
uz: Menyuning ikkinchi bandi
vi: Mục thứ hai trong trình đơn
zh_hk: 第二個選單項目
zu: Into yemenyu yesibili

# demoMenuItemValueThree
source: Menu item three
af: Kieslysitem drie
am: ምናሌ ንጥል ሦስት
ar_eg: ثالث عنصر قائمة
as: মেনুত থকা তৃতীয় বস্তু
az: Üçüncü menyu elementi
be: Трэці пункт меню
bn: মেনুর তৃতীয় আইটেম
bs: Treća stavka menija
ca: Element de menú tres
da: Menupunkt tre
es_ar: Tercer elemento del menú
et: Menüü-üksus 3
eu: Menuko hirugarren aukera
fa: گزینه سه منو
fil: Pangatlong item sa menu
fr_ca: Option de menu trois
gl: Elemento do menú tres
gu: મેનૂમાં ત્રીજી આઇટમ
he: אפשרות שלישית בתפריט
hi: मेन्यू का तीसरा आइटम
hu: Harmadik menüelem
hy: Ընտրացանկի տարր 3
id: Item menu tiga
it: Voce di menu tre
ja: メニュー項目 3
ka: მენიუს მესამე ერთეული
km: ធាតុម៉ឺនុយទីបី
kn: ಮೆನುವಿನ ಮೂರನೇ ಐಟಂ
ko: 메뉴 항목 3
ky: Менюдагы үчүнчү элемент
lo: ລາຍການເມນູສາມ
lt: Trečias meniu elementas
lv: Trešais izvēlnes vienums
mk: Трета ставка од менито
ml: മെനു ഇനം മൂന്ന്
mn: Цэсийн гуравдугаар зүйл
mr: तिसरा मेनू आयटम
ms: Item menu ketiga
my: မီနူးအကြောင်းအရာ သုံး
nb: Menyelement tre
ne: मेनुको तेस्रो वस्तु
pa: ਮੀਨੂ ਵਿਚਲੀ ਤੀਜੀ ਆਈਟਮ
pl: Trzecia pozycja menu
pt: Item três do menu
pt_pt: Terceiro item de menu
ro: Elementul de meniu trei
ru: Третий пункт меню
si: මෙනු අයිතම තුන
sk: Tretia položka ponuky
sq: Artikulli i tretë i menysë
sr: Трећа ставка менија
sr_latn: Treća stavka menija
sv: Menyalternativ tre
te: మూడవ మెనూ అంశం
th: รายการในเมนูที่ 3
tr: Menü öğesi üç
uk: Третій пункт меню
ur: تیسرا مینیو آئٹم
uz: Menyuning uchinchi bandi
vi: Mục thứ ba trong trình đơn
zh_hk: 第三個選單項目
zu: Into yemenyu yesithathu

# demoMenuOne
source: One
af: Een
am: አንድ
ar_eg: واحد
as: এক
az: Bir
be: Адзін
bn: এক
bs: Jedan
ca: U
da: Ét
es_ar: Uno
et: Üks
eu: Bat
fa: یک
fil: Isa
fr_ca: Un
gl: Un
gu: એક
he: אחת
hi: एक
hu: Egy
hy: մեկ
id: Satu
it: Uno
ka: ერთი
km: មួយ
kn: ಒಂದು
ky: Бир
lo: ໜຶ່ງ
lt: Vienas
lv: Viens
mk: Еден
ml: ഒന്ന്
mn: Нэг
mr: एक
ms: Satu
my: တစ်
nb: Én
ne: एक
pa: ਇੱਕ
pl: Jeden
pt: Um
pt_pt: Um
ro: Unu
si: එක
sk: Jedna
sq: Një
sr: Један
sr_latn: Jedan
sv: Ett
te: ఒకటి
tr: Bir
uk: Один
ur: ایک
uz: Bir
vi: Một
zh_hk: 一
zu: Kunye

# demoMenuTwo
source: Two
af: Twee
am: ሁለት
ar_eg: اثنان
as: দুই
az: İki
be: Два
bn: দুই
bs: Dva
ca: Dos
da: To
es_ar: Dos
et: Kaks
eu: Bi
fa: دو
fil: Dalawa
fr_ca: Deux
gl: Dúas
gu: બે
he: שתיים
hi: दो
hu: Kettő
hy: երկու
id: Dua
it: Due
ka: ორი
km: ពីរ
kn: ಎರಡು
ky: Эки
lo: ສອງ
lt: Du
lv: Divi
mk: Два
ml: രണ്ട്
mn: Хоёр
mr: दोन
ms: Dua
my: နှစ်
nb: To
ne: दुई
pa: ਦੋ
pl: Dwa
pt: Dois
pt_pt: Dois
ro: Doi
si: දෙක
sk: Dve
sq: Dy
sr: Два
sr_latn: Dva
sv: Två
te: రెండు
tr: İki
uk: Два
ur: دو
uz: Ikki
vi: Hai
zh_hk: 二
zu: Kubili

# demoMenuThree
source: Three
af: Drie
am: ሦስት
ar_eg: ثلاثة
as: তিনি
az: Üç
be: Тры
bn: তিন
bs: Tri
ca: Tres
da: Tre
es_ar: Tres
et: Kolm
eu: Hiru
fa: سه
fil: Tatlo
fr_ca: Trois
gl: Tres
gu: ત્રણ
he: שלוש
hi: तीन
hu: Három
hy: երեք
id: Tiga
it: Tre
ka: სამი
km: បី
kn: ಮೂರು
ky: Үч
lo: ສາມ
lt: Trys
lv: Trīs
mk: Три
ml: മൂന്ന്
mn: Гурав
mr: तीन
ms: Tiga
my: သုံး
nb: Tre
ne: तीन
pa: ਤਿੰਨ
pl: Trzy
pt: Três
pt_pt: Três
ro: Trei
si: තුන
sk: Tri
sq: Tre
sr: Три
sr_latn: Tri
sv: Tre
te: మూడు
tr: Üç
uk: Три
ur: تین
uz: Uch
vi: Ba
zh_hk: 三
zu: Kuthathu
