Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoPullToRefreshTitle
source: Pull to refresh
af: Trek om te herlaai
am: ለማደስ ይጎትቱ
ar_eg: سحب لإعادة التحميل
as: ৰিফ্ৰেশ্ব কৰিবলৈ টনা
az: Yeniləmək üçün çəkin
be: Пацягнуць, каб абнавіць
bn: রিফ্রেশ করতে টানুন
bs: Povucite da osvježite
ca: Llisca cap avall per actualitzar
da: Træk for at opdatere
es_ar: Desliza el dedo hacia abajo para actualizar
et: Värskendamiseks allatõmbamine
eu: Tiratu freskatzeko
fa: کشیدن برای بازآوری
fil: Hilahin para i-refresh
fr_ca: Balayez vers le bas pour actualiser
gl: Arrastrar cara abaixo para actualizar
gu: રિફ્રેશ કરવા માટે ખેંચો
he: משיכה לרענון
hi: रीफ़्रेश करने के लिए स्क्रीन को नीचे खींचें
hu: Húzza le a frissítéshez
hy: Քաշել՝ թարմացնելու համար
id: Tarik untuk memuat ulang
it: Trascina per aggiornare
ja: 下方向にスワイプして更新
ka: ჩამოწევით განახლება
km: ទាញ​ដើម្បី​ផ្ទុក​ឡើងវិញ
kn: ರಿಫ್ರೆಶ್ ಮಾಡಲು ಎಳೆಯಿರಿ
ko: 당겨서 새로고침
ky: Жаңыртуу үчүн ылдый тартыңыз
lo: ດຶງເພື່ອໂຫຼດຂໍ້ມູນຄືນໃໝ່
lt: Patraukite, kad atnaujintumėte
lv: Vilkšana, lai atsvaidzinātu
mk: Повлечете за освежување
ml: പുതുക്കിയെടുക്കാൻ വലിക്കുക
mn: Сэргээхийн тулд татах
mr: रिफ्रेश करण्यासाठी ओढा
ms: Tarik untuk memuat semula
my: ပြန်လည်စတင်ရန် ဆွဲချပါ
nb: Sveip ned for å laste inn på nytt
ne: पुनः ताजा गर्न तान्नुहोस्
pa: ਰਿਫ੍ਰੈਸ਼ ਕਰਨ ਲਈ ਖਿੱਚੋ
pl: Przeciągnij w dół, by odświeżyć
pt: Deslize para baixo para atualizar
pt_pt: Puxe para atualizar
ro: Trageți pentru a actualiza
ru: Обновление страницы с помощью движения сверху вниз
si: නැවුම් කිරීමට අදින්න
sk: Obnovenie potiahnutím
sq: Tërhiq për të rifreskuar
sr: Повуците да бисте освежили
sr_latn: Povucite da biste osvežili
sv: Dra för att uppdatera
te: రిఫ్రెష్ చేయడానికి లాగండి
th: ดึงเพื่อรีเฟรช
tr: Yenilemek için aşağı çekin
uk: Потягніть, щоб оновити
ur: ریفریش کرنے کے لیے کھینچیں
uz: Yangilash uchun torting
vi: Kéo để làm mới
zh_hk: 拉動以重新整理
zu: Donsa ukuze uvuselele

# demoCupertinoPullToRefreshSubtitle
source: iOS-style pull to refresh control
af: Trek-om-te-herlaai-kontrole in iOS-styl
am: መቆጣጠሪያን ለማደስ የiOS-ቅጥ መጎተት
ar_eg: عنصر تحكم السحب لإعادة التحميل بنمط iOS
as: iOS-শৈলীৰ ৰিফ্ৰেশ্ব কৰিবলৈ টনাৰ নিয়ন্ত্ৰণ
az: iOS üslublu "yeniləmək üçün çəkin" nizamlayıcısı
be: Элемент кіравання ў стылі iOS "Пацягнуць, каб абнавіць"
bn: iOS-স্টাইলে নিয়ন্ত্রণ রিফ্রেশ করতে টানুন
bs: Kontrola povlačenja za osvježavanje u stilu iOS-a
ca: Control "Llisca cap avall per actualitzar" d'estil iOS
da: iOS-lignende funktion til at trække for at opdatere
es_ar: Control con la función "desliza hacia abajo para actualizar" similar al de iOS
et: Värskendamiseks allatõmbamise iOS-i stiilis juhtelement
eu: Edukia kontrolatzeko iOS estiloko "Tiratu freskatzeko" motako aukera
fa: کنترل «کشیدن برای بازآوری» به سبک iOS
fil: iOS-style na kontrol na hilahin para i-refresh
fr_ca: Commande de style iOS pour balayer l'écran vers le bas afin d'actualiser l'écran
gl: Control de arrastrar para actualizar de tipo iOS
gu: નિયંત્રણ રિફ્રેશ કરવા માટે iOS-શૈલીમાં ખેંચો
he: פקד משיכה לרענון בסגנון iOS
hi: iOS स्टाइल वाला नियंत्रण जिसमें रीफ़्रेश करने के लिए स्क्रीन काे खींचा जाता है
hu: iOS-stílusú vezérlő a lehúzással való frissítéshez
hy: iOS-ի ոճով «Քաշել՝ թարմացնելու համար» կառավար
id: Kontrol tarik untuk memuat ulang gaya iOS
it: Controllo Trascina per aggiornare in stile iOS
ja: iOS スタイルの「下にスワイプして更新」コントロール
ka: მართვა iOS-სტილის ჩამოწევით განახლებით
km: ការគ្រប់គ្រង​ការទាញ​ដើម្បី​ផ្ទុក​ឡើងវិញ​​រចនាប័ទ្ម iOS
kn: ನಿಯಂತ್ರಣವನ್ನು ರಿಫ್ರೆಶ್ ಮಾಡಲು, iOS-ಶೈಲಿ ಎಳೆಯಿರಿ
ko: iOS 스타일의 당겨서 새로고침하는 컨트롤
ky: iOS стилиндеги жаңыртуу үчүн ылдый тартуу көзөмөлү
lo: ການຄວບຄຸມການດຶງເພື່ອໂຫຼດຂໍ້ມູນຄືນໃໝ່ iOS
lt: „iOS“ stiliaus atnaujinimo patraukus valdiklis
lv: iOS stila vadīkla “Vilkt, lai atsvaidzinātu”
mk: Контрола „Повлечете за освежување“ во iOS-стил
ml: നിയന്ത്രണം പുതുക്കിയെടുക്കാനുള്ള OS-സ്റ്റൈലിലുള്ള വലിക്കൽ
mn: iOS загварын татаж сэргээдэг хяналт
mr: iOS शैलीचे रिफ्रेश करण्यासाठी ओढा नियंत्रण
ms: Kawalan tarik untuk muat semula gaya iOS
my: iOS ပုံစံ ဆွဲချ၍ ပြန်လည်စတင်ခြင်း ထိန်းချုပ်မှု
nb: iOS-lignende funksjon for å sveipe nedover for å laste inn på nytt
ne: iOS शैलीको पुनः ताजा गर्न तान्ने नियन्त्रण
pa: iOS-ਸਟਾਈਲ ਵਰਗਾ ਰਿਫ੍ਰੈਸ਼ ਕਰਨ ਲਈ ਖਿੱਚੋ ਕੰਟਰੋਲ
pl: Element sterujący „przeciągnij, by odświeżyć” w stylu iOS
pt: Controle de atualização no estilo iOS
pt_pt: Controlo de puxar para atualizar ao estilo do iOS
ro: Setarea Trageți pentru a actualiza în stil iOS
ru: Элемент управления в стиле iOS для обновления страницы
si: iOS-විලාසයේ නැවුම් කිරීමට ඇදීමේ පාලනය
sk: Potiahnutie v štýle systému iOS na obnovenie riadenia
sq: Kontrolli me tërheqjen për të rifreskuar në stilin e iOS
sr: Контрола за повлачење ради освежавања у iOS стилу
sr_latn: Kontrola za povlačenje radi osvežavanja u iOS stilu
sv: Kontrollen dra för att uppdatera i iOS-stil
te: iOS-శైలిలో 'రిఫ్రెష్ చేయడానికి లాగే నియంత్రణ'
th: ตัวควบคุมแบบ iOS สำหรับดึงเพื่อรีเฟรช
tr: iOS stili yenilemek için aşağı çekme denetimi
uk: Елемент керування в стилі iOS "Потягнути, щоб оновити"
ur: iOS طرز والا کنٹرول کو ریفریش کرنے کے لیے کھینچیں
uz: Sahifalarni yangilash uchun iOS uslubidagi boshqaruv
vi: Tùy chọn kiểm soát kéo để làm mới theo kiểu iOS
zh_hk: iOS 樣式的拉動，用於重新整理控制項
zu: Ulawulo lwesitayela se-iOS lokudonsa ukuze uvuselele

# demoCupertinoPullToRefreshDescription
source: A widget implementing the iOS-style pull to refresh content control.
af: 'n Legstuk wat die trek-om-te-herlaai-inhoudkontrole in iOS-styl instel.
am: የይዘት መቆጣጠሪያን ለማደስ የiOS-ቅጥ መጎተትን ተግባራዊ የሚያደርግ ምግብር።
ar_eg: أداة تنفّذ إعدادات التحكم في المحتوى للسحب لأعادة التحميل بنمط iOS
as: iOS-শৈলীৰ ৰিফ্ৰেশ্ব কৰিবলৈ টনাৰ নিয়ন্ত্ৰণ কার্যকৰী কৰা এটা ৱিজেট।
az: iOS üslublu "yeniləmək üçün çəkin" məzmun nizamlayıcısını tətbiq edən vidcet.
be: Віджэт, які актывуе элемент кіравання змесцівам у стылі iOS "Пацягнуць, каб абнавіць".
bn: iOS-স্টাইলে কন্টেন্টের নিয়ন্ত্রণ রিফ্রেশ করতে টেনে আনার জন্য যে উইজেট ব্যবহার করা হয়।
bs: Vidžet kojim se primjenjuje kontrola povlačenja za osvježavanje u stilu iOS-a.
ca: Un widget que implementa el control de contingut amb la funció "Llisca cap avall per actualitzar" d'estil iOS.
da: En widget, der implementerer den iOS-lignende funktion til at trække for at opdatere.
es_ar: Corresponde a un widget que implementa el control de contenido con la función "desliza hacia abajo para actualizar" similar al de iOS.
et: Vidin, mis juurutab värskendamiseks allatõmbamise iOS-i stiilis juhtelemendi.
eu: Edukia kontrolatzeko iOS estiloko "Tiratu freskatzeko" motako aukera inplementatzeko widget bat.
fa: ابزارکی که از کنترل محتوای «کشیدن برای بازآوری» به سبک iOS استفاده می‌کند
fil: Isang widget na nagpapatupad sa iOS-style na kontrol na hilahin para irefresh
fr_ca: Un widget permettant d'intégrer une commande de style iOS pour balayer l'écran vers le bas afin d'actualiser l'écran.
gl: Un widget que implementa o control de contido de arrastrar para actualizar de tipo iOS.
gu: વિજેટ કે જે કન્ટેન્ટ નિયંત્રણને રિફ્રેશ કરવા માટે iOS-શૈલીમાં ખેંચવાની સુવિધાનો અમલ કરે છે.
he: ווידג'ט שמיישם את פקד התוכן של משיכה לרענון בסגנון iOS
hi: iOS स्टाइल वाले सामग्री नियंत्रण काे लागू करने से जुड़ा विजेट. इसमें रीफ़्रेश करने के लिए स्क्रीन काे खींचा जाता है.
hu: A lehúzással való frissítéshez tartozó iOS-stílusú vezérlőt megvalósító modul.
hy: Վիջեթ, որը կառավարում է iOS-ի ոճով «Քաշել՝ թարմացնելու համար» բովանդակությունը։
id: Widget yang mengimplementasikan kontrol terhadap konten tarik untuk memuat ulang gaya iOS.
it: Un widget che implementa il controllo dei contenuti Trascina per aggiornare in stile iOS.
ja: iOS スタイルの「下にスワイプしてコンテンツを更新」コントロールを実装するウィジェットです。
ka: ვიჯეტი, რომელიც ახორციელებს კონტენტის მართვას iOS-სტილის ჩამოწევით განახლებით.
km: ធាតុ​ក្រាហ្វិក​ដែល​ប្រើ​ការគ្រប់គ្រងខ្លឹមសារ​តាមរយៈ​ការទាញ​ដើម្បី​ផ្ទុក​ឡើងវិញ​​រចនាប័ទ្ម iOS​។
kn: ವಿಷಯದ ನಿಯಂತ್ರಣವನ್ನು ರಿಫ್ರೆಶ್ ಮಾಡಲು, iOS-ಶೈಲಿ ಎಳೆಯಿರಿ ಅನ್ನು ವಿಜೆಟ್ ಕಾರ್ಯಗತಗೊಳಿಸುತ್ತಿದೆ.
ko: iOS 스타일의 콘텐츠를 당겨서 새로고침하는 컨트롤을 구현하는 위젯입니다.
ky: iOS стилиндеги жаңыртуу үчүн ылдый тартуу көзөмөлүн иштеткен виджет
lo: ວິດເຈັດທີ່ນຳໃຊ້ການຄວບຄຸມເນື້ອຫາການໂຫຼດຂໍ້ມູນຄືນໃໝ່ແບບ iOS.
lt: Valdiklis, apimantis „iOS“ stiliaus turinio atnaujinimo patraukus valdymą.
lv: Logrīks iOS stila satura vadīklas “Vilkt, lai atsvaidzinātu” ievietošanai.
mk: Виџет што ја користи контролата на содржини „Повлечете за освежување“ во iOS-стил.
ml: നിയന്ത്രണം പുതുക്കിയെടുക്കാനുള്ള OS-സ്റ്റൈലിലുള്ള വലിക്കൽ നടപ്പാക്കുന്ന വിജറ്റ്.
mn: iOS загварын татаж сэргээдэг хяналтыг хэрэгжүүлдэг жижиг хэрэгсэл
mr: iOS शैलीचे रीफ्रेश करण्यासाठी ओढामधील आशय नियंत्रण याची अंमलबजावणी करणारे विजेट.
ms: Widget yang melaksanakan kawalan kandungan tarik untuk muat semula gaya iOS.
my: iOS ပုံစံ ဆွဲချပြီး ပြန်လည်စတင်ခြင်း အကြောင်းအရာထိန်းချုပ်မှုကို ထည့်သွင်းနေသော ဝိဂျက်။
nb: En modul som implementerer den iOS-lignende funksjonen for å sveipe nedover for å laste inn innhold på nytt.
ne: iOS शैलीको सामग्री पुनः ताजा गर्न तान्ने नियन्त्रण लागू गरिने विजेट।
pa: 'iOS-ਸਟਾਈਲ ਵਰਗਾ ਸਮੱਗਰੀ ਕੰਟਰੋਲ ਨੂੰ ਰਿਫ੍ਰੈਸ਼ ਕਰਨ ਲਈ ਖਿੱਚੋ' ਨੂੰ ਲਾਗੂ ਕਰਨ ਵਾਲਾ ਵਿਜੇਟ।
pl: Widżet z zaimplementowanym elementem sterującym „przeciągnij, by odświeżyć” w stylu iOS.
pt: Um widget que implementa o estilo iOS no controle de atualização de conteúdo.
pt_pt: Um widget que implementa o controlo de puxar para atualizar o conteúdo ao estilo do iOS.
ro: Widget care implementează setarea pentru conținut Trageți pentru a actualiza în stil iOS.
ru: Элемент управления в стиле iOS для обновления страницы с помощью движения сверху вниз.
si: iOS-විලාසයේ නැවුම් කිරීමට ඇදීමේ පාලනය ක්‍රියාත්මක කරන විජට් එකකි.
sk: Miniaplikácia s implementovaným potiahnutím v štýle systému iOS, ktoré umožňuje obnoviť riadenie obsahu.
sq: Një miniaplikacion që zbaton një kontroll të përmbajtjes me tërheqjen për të rifreskuar në stilin e iOS.
sr: Виџет који примењује контролу за повлачење ради освежавања садржаја у iOS стилу.
sr_latn: Vidžet koji primenjuje kontrolu za povlačenje radi osvežavanja sadržaja u iOS stilu.
sv: En widget som implementerar innehållskontrollen dra för att uppdatera i iOS-stil.
te: iOS-శైలిలో 'కంటెంట్ రిఫ్రెష్ చేయడానికి లాగే నియంత్రణ'.
th: วิดเจ็ตที่ใช้ตัวควบคุมเนื้อหาแบบ iOS สำหรับดึงเพื่อรีเฟรช
tr: iOS stili yenilemek için aşağı çekme denetimini uygulayan widget.
uk: Віджет, що реалізує елемент керування в стилі iOS, який дає змогу потягнути, щоб оновити контент.
ur: مواد کے کنٹرول کو ریفریش کرنے کے لیے ویجیٹ iOS طرز کو نافذ کر رہا ہے۔
uz: Sahifani yangilash uchun tepadan pastga tortiladigan iOS uslubidagi boshqaruv.
vi: Một tiện ích giúp kiểm soát thao tác kéo để làm mới nội dung theo kiểu iOS.
zh_hk: 採用 iOS 樣式的拉動以重新整理內容控制項的小工具。
zu: Iwijethi esebenzisa ulawulo lwesitayela se-iOS lokudonsa ukuze uvuselele.

# demoProgressIndicatorTitle
source: Progress indicators
af: Vorderingaanwysers
am: የግስጋሴ ጠቋሚዎች
ar_eg: مؤشرات التقدم
as: অগ্ৰগতিৰ সূচক
az: Gedişat indikatorları
be: Індыкатары выканання
bn: কতটা এগিয়েছে তার নির্দেশক
bs: Pokazatelji napretka
ca: Indicadors de progrés
da: Statusindikatorer
es_ar: Indicadores de progreso
et: Edenemisnäidikud
eu: Garapen-adierazleak
fa: نشانگر پیشرفت
fil: Mga indicator ng pag-usad
fr_ca: Indicateurs de progression
gl: Indicadores de progreso
gu: પ્રગતિ સૂચકો
he: אינדיקטורים של התקדמות
hi: गतिविधि की स्थिति दिखाने वाले इंडिकेटर
hu: Folyamatjelzők
hy: Ընթացքի ցուցիչներ
id: Indikator progres
it: Indicatori di avanzamento
ja: 進行状況インジケーター
ka: პროგრესის ინდიკატორები
km: សូចនាករដំណើរការ
kn: ಪ್ರಗತಿ ಸೂಚಕಗಳು
ko: 진행 상태 표시기
ky: Аткарылыштын индикаторлору
lo: ຕົວຊີ້ບອກການສະຖານະ
lt: Eigos indikatoriai
lv: Norises indikatori
mk: Индикатори на напредок
ml: പ്രോഗ്രസ് ഇൻഡിക്കേറ്ററുകൾ
mn: Үйл явцын заалт
mr: प्रगती इंडिकेटर
ms: Penunjuk kemajuan
my: တိုးတက်မှု အညွှန်းများ
nb: Fremdriftsindikatorer
ne: प्रगति सूचकहरू
pa: ਪ੍ਰਗਤੀ ਸੂਚਕ
pl: Wskaźniki postępu
pt: Indicadores de progresso
pt_pt: Indicadores de progresso
ro: Indicatori de progres
ru: Индикаторы прогресса
si: ප්‍රගති දර්ශක
sk: Indikátory priebehu
sq: Treguesit e progresit
sr: Индикатори напретка
sr_latn: Indikatori napretka
sv: Förloppsindikatorer
te: ప్రోగ్రెస్ సూచీలు
th: สัญญาณบอกสถานะความคืบหน้า
tr: İlerleme durumu göstergeleri
uk: Індикатори перебігу
ur: پیش رفت کے انڈیکیٹرز
uz: Jarayon indikatorlari
vi: Chỉ báo tiến trình
zh_hk: 進度指標
zu: Isikhombisi sokuqhubeka

# demoProgressIndicatorSubtitle
source: Linear, circular, indeterminate
af: Lineêr, sirkelvormig, onbepaald
am: ቀጥታ መስመር፣ ክበባዊ፣ ያልተወሰነ
ar_eg: خطي، دائري، غير نهائي
as: ৰৈখিক, চক্ৰাকাৰ, অনিৰ্ধাৰিত
az: Xətti, dairəvi, qeyri-müəyyən
be: Лінейны, кругавы, нявызначаны
bn: লিনিয়ার, বৃত্তাকার, অনির্দিষ্ট
bs: Linearno, kružno, neodređeno
ca: Lineals, circulars, indeterminats
da: Lineær, cirkulær, ubestemt
es_ar: Lineales, circulares, indeterminados
et: Lineaarne, ringikujuline, määramatu
eu: Lineala, zirkularra, zehaztugabea
fa: خطی، مدور، نامعین
fil: Linear, pabilog, hindi tiyak
fr_ca: Linéaires, circulaires, indéterminés
gl: Lineais, circulares e indeterminados
gu: રેખીય, વર્તુળાકાર, અનિશ્ચિત
he: ליניארי, מעגלי, ביניים
hi: लीनियर, सर्कुलर, इंडेटरमिनेट
hu: Lineáris, körkörös, meghatározatlan ideig tartó
hy: Գծային, շրջանաձև և անորոշ
id: Linear, putar, tidak tentu
it: Lineari, circolari e indeterminati
ja: 線形、円形、不確定
ka: წრფივი, წრიული, განუსაზღვრელი
km: បន្ទាត់ត្រង់ រង្វង់ មិនកំណត់
kn: ಲೀನಿಯರ್, ವೃತ್ತಾಕಾರ, ಅನಿರ್ದಿಷ್ಟ
ko: 선형, 원형, 미확정
ky: Түз кыймыл, тегеренме кыймыл, белгисиз
lo: ເສັ້ນຊື່, ວົງມົນ, ບໍ່ຊັດເຈນ
lt: Linijinis, apskritas, neapibrėžtas
lv: Lineārs, cirkulārs, nenoteikts
mk: Линиски, кружни, неодредени
ml: ലീനിയർ, വൃത്താകൃതിയിലുള്ളത്, അനിശ്ചിതമായത്
mn: Шугаман, эргэлтийн, тогтоогоогүй
mr: लिनिअर, परिपत्रक, अनिश्चित
ms: Linear, bulat, tidak tentu
my: မျဉ်းဖြောင့်၊ စက်ဝိုင်း၊ သတ်မှတ်ချက်မရှိ
nb: Lineær, rund, ukjent
ne: रेखीय, गोलाकार, अस्थिर
pa: ਲੀਨੀਅਰ, ਸਰਕੁਲਰ, ਅਨਿਰਧਾਰਤ
pl: Liniowe, kołowe, nieokreślone
pt: Lineares, circulares, indeterminados
pt_pt: Linear, circular, indeterminado
ro: Liniar, circular, nedeterminat
ru: Линейные, кольцевые и неопределенные
si: රේඛීය, වෘත්තාකාර, අවිනිශ්චිත
sk: Lineárne, kruhové, neurčené
sq: Linear, rrethor, i papërcaktuar
sr: Линеарни, кружни, неодређени
sr_latn: Linearni, kružni, neodređeni
sv: Linjär, cirkulär, obestämd
te: లీనియర్, సర్క్యులర్, అనిర్దిష్టం
th: เชิงเส้น วงกลม ไม่ชัดเจน
tr: Doğrusal, dairesel, belirsiz
uk: Лінійний, циклічний, невизначений
ur: لینئیر، سرکلر، غیر متعین
uz: Chiziqli, doirasimon va noaniq
vi: Tuyến tính, vòng tròn, không xác định
zh_hk: 直線、環形、不確定
zu: I-Linear, circular, indeterminate

# demoCircularProgressIndicatorTitle
source: Circular Progress Indicator
af: Sirkelvormige vorderingaanwyser
am: ክበባዊ የግስጋሴ ጠቋሚ
ar_eg: مؤشر تقدم دائري
as: চক্ৰাকাৰ অগ্ৰগতিৰ সূচক
az: Dairəvi Gedişat İndikatoru
be: Кругавы індыкатар выканання
bn: বৃত্তাকার প্রগ্রেস নির্দেশক
bs: Kružni pokazatelj napretka
ca: Indicador de progrés circular
da: Cirkulær statusindikator
es_ar: Indicador de progreso circular
et: Ringikujuline edenemisnäidik
eu: Garapen-adierazle zirkularra
fa: نشانگر پیشرفت مدور
fil: Pabilog na Indicator ng Pag-usad
fr_ca: Indicateur de progression circulaire
gl: Indicador de progreso circular
gu: વર્તુળાકાર પ્રગતિ સૂચક
he: אינדיקטור של התקדמות מעגלית
hi: गतिविधि की स्थिति सर्कुलर फ़ॉर्मैट में दिखाने वाला इंडिकेटर
hu: Körkörös folyamatjelző
hy: Ընթացքի շրջանաձև ցուցիչ
id: Indikator Progres Putar
it: Indicatore di avanzamento circolare
ja: 円形進行状況インジケーター
ka: პროგრესის წრიული ინდიკატორი
km: សូចនាករដំណើរការរាងរង្វង់
kn: ವೃತ್ತಾಕಾರದ ಪ್ರಗತಿ ಸೂಚಕ
ko: 원형 진행 상태 표시기
ky: Тегеренме кыймылдын аткарылышынын индикатору
lo: ຕົວຊີ້ບອກສະຖານະແບບວົງມົນ
lt: Apskritas eigos indikatorius
lv: Cirkulārs norises indikators
mk: Кружен индикатор на напредок
ml: വൃത്താകൃതിയിലുള്ള പ്രോഗ്രസ് ഇൻഡിക്കേറ്റർ
mn: Эргэлтийн үйл явцын заалт
mr: परिपत्रक प्रगती इंडिकेटर
ms: Penunjuk Kemajuan Bulat
my: စက်ဝိုင်းပုံ တိုးတက်မှု အညွှန်း
nb: Rund fremdriftsindikator
ne: गोलाकार प्रगति सूचक
pa: ਸਰਕੁਲਰ ਪ੍ਰਗਤੀ ਸੂਚਕ
pl: Kołowy wskaźnik postępu
pt: Indicador de progresso circular
pt_pt: Indicador de progresso circular
ro: Indicator de progres circular
ru: Кольцевой индикатор прогресса
si: වෘත්තාකාර ප්‍රගති දර්ශකය
sk: Kruhový indikátor priebehu
sq: Treguesi rrethor i progresit
sr: Кружни индикатор напретка
sr_latn: Kružni indikator napretka
sv: Cirkulär förloppsindikator
te: సర్క్యులర్ ప్రోగ్రెస్ సూచీ
th: สัญญาณบอกสถานะความคืบหน้าแบบวงกลม
tr: Dairesel İlerleme Durumu Göstergesi
uk: Індикатор циклічного перебігу
ur: سرکلر پیش رفت کا انڈیکیٹر
uz: Doirasimon jarayon indikatori
vi: Chỉ báo tiến trình vòng tròn
zh_hk: 環形進度指標
zu: Isikhombisi sokuqhubeka

# demoCircularProgressIndicatorDescription
source: A Material Design circular progress indicator, which spins to indicate that the application is busy.
af: 'n Sirkelvormige materiaalontwerp-vorderingaanwyser wat draai om aan te dui dat die toepassing besig is.
am: መተግበሪያው ባተሌ እንደሆነ ለመጠቆም የሚሽከረከር የቁስ ንድፍ ክበባዊ ግስጋሴ ጠቋሚ።
ar_eg: مؤشر تقدم دائري بتصميم متعدد الأبعاد (Material Design) ويدور ليدل على أن التطبيق مشغول
as: এটা ভৌতিক আৰ্হিৰ চক্ৰাকাৰ সূচক যি এপ্লিকেশ্বনটো ব্যস্ত হৈ থকাটো সূচাবলৈ ঘূৰি থাকে।
az: Fırlanaraq tətbiqin məşğul olduğunu göstərən Material Dizaynlı dairəvi gedişat indikatoru.
be: Кругавы індыкатар выканання Material Design, які круціцца, калі праграма занятая.
bn: একটি বৃত্তাকার মেটেরিয়াল ডিজাইনের প্রগ্রেস নির্দেশক, যেটি অ্যাপ্লিকেশন কাজ করছে কিনা তা বোঝানোর জন্য ঘোরে।
bs: Kružni pokazatelj napretka materijalnog dizajna koji se okreće da pokaže da je aplikacija zauzeta.
ca: Indicador de progrés circular de Material Design; gira per indicar que l'aplicació està ocupada.
da: En cirkulær statusindikator fra Material Design, som drejer for at indikere, at appen arbejder.
es_ar: Corresponde a un indicador de progreso circular de material design que gira para indicar que la aplicación está ocupada.
et: Materiaalse disainiga ringikujuline edenemisnäidik, mille keerlemine näitab, et rakendus on hõivatud.
eu: Material diseinuaren garapen-adierazle zirkular bat, zeinak bira egiten baitu aplikazioa okupatuta dagoela adierazteko.
fa: نشانگر پیشرفت مدور با «طراحی مواد» که می‌چرخد تا نشان دهد که برنامه مشغول است.
fil: Isang Material Design na pabilog na indicator ng pag-usad na umiikot para isaad na abala ang application.
fr_ca: Un indicateur de progression de forme circulaire avec thème Material Design qui tourne pour indiquer que l'application est occupée.
gl: Un indicador de progreso circular de Material Design que xira para indicar que a aplicación está ocupada.
gu: સામગ્રીની ડિઝાઇનનું એક વર્તુળાકાર પ્રગતિ સૂચક, જે ઍપ્લિકેશન વ્યસ્ત છે તેવું બતાવવા માટે ગોળ ફરે છે.
he: אינדיקטור של התקדמות מעגלית בעיצוב חדשני תלת-ממדי, שמסתובב כדי לציין שהאפליקציה עסוקה.
hi: मटीरियल डिज़ाइन सर्कुलर फ़ॉर्मैट में किसी गतिविधि की स्थिति दिखाने वाले इंडिकेटर से यह पता चलता है कि ऐप्लिकेशन पर कोई प्रोसेसिंग चल रही है.
hu: Körkörös Material Design-folyamatjelző, amely forgással jelzi, hogy az alkalmazás dolgozik.
hy: Ընթացքի՝ Material Design-ի ոճով շրջանաձև ցուցիչը ցույց է տալիս, որ հավելվածը մշակում է օգտատիրոջ հարցումը։
id: Indikator progres putar Desain Material, yang berputar untuk menunjukkan bahwa aplikasi sedang sibuk.
it: Un indicatore di avanzamento circolare Material Design che ruota per indicare che l'applicazione è occupata.
ja: くるくる回ることでアプリがビジー状態であることを示す、マテリアル デザインの円形進行状況インジケーター。
ka: Material Design-ის პროგრესის წრიული ინდიკატორი, რომლის ბრუნვაც მიუთითებს, რომ აპლიკაცია დაკავებულია.
km: សូចនាករដំណើរការរាងរង្វង់នៃរចនាប័ទ្មសម្ភារ ដែលវិលដើម្បី​បង្ហាញថា​កម្មវិធី​កំពុងជាប់រវល់។
kn: ವಸ್ತು ವಿನ್ಯಾಸದಲ್ಲಿನ ವೃತ್ತಾಕಾರದ ಪ್ರಗತಿ ಸೂಚಕವು ಅಪ್ಲಿಕೇಶನ್ ಕಾರ್ಯನಿರತವಾಗಿದೆ ಎಂದು ಸೂಚಿಸಲು ಸ್ಪಿನ್ ಆಗುತ್ತದೆ.
ko: 회전하여 애플리케이션이 작업 중임을 나타내는 머티리얼 디자인 원형 진행 상태 표시기입니다.
ky: Material Design тегеренме кыймылдын аткарылышынын индикатору колдонмо иштеп жатканын көрсөтүп, айланат.
lo: ຕົວຊີ້ບອກສະຖານະແບບວົງມົນ Material Design, ເຊິ່ງຈະໝຸນເພື່ອບອກວ່າແອັບພລິເຄຊັນກຳລັງເຮັດວຽກຢູ່.
lt: Trimačių objektų dizaino apskritas eigos indikatorius, kuris sukasi nurodydamas, kad programa užimta.
lv: Cirkulārs materiāla dizaina norises indikators, kas griežas, lai norādītu, ka lietojumprogramma ir aizņemta.
mk: Кружен индикатор на напредок во Material Design, којшто се врти за да покаже дека апликацијата работи.
ml: ആപ്പ് തിരക്കിലാണെന്ന് സൂചിപ്പിക്കാൻ കറങ്ങുന്ന, മെറ്റീരിയൽ രൂപകൽപ്പനയായ വൃത്താകൃതിയിലുള്ള പ്രോഗ്രസ് ഇൻഡിക്കേറ്റർ.
mn: Материалын загварын эргэлтийн үйл явцын заалт нь аппликэйшн ажиллаж байгаа гэдгийг зааж эргэлддэг.
mr: अ‍ॅप्लिकेशन काम करत आहे हे दाखवण्यासाठी गोल फिरणारे मटेरिअल डिझाइन परिपत्रक प्रगती इंडिकेटर आहे.
ms: Penunjuk kemajuan bulat bagi Reka Bentuk Bahan, yang berputar untuk menunjukkan bahawa aplikasi sedang sibuk.
my: အပလီကေးရှင်းတစ်ခုက အလုပ်လုပ်နေကြောင်း ပြသရန် 'ရုပ်ဝတ္ထုဒီဇိုင်း' စက်ဝိုင်းပုံ တိုးတက်မှုအညွှန်းက လည်ပတ်သည်။
nb: En rund fremdriftsindikator for «material design», som snurrer for å indikere at appen er opptatt.
ne: एप कार्यरत छ भनेर सूचित गर्न घुम्ने सामग्री डिजाइनको गोलाकार प्रगति सूचक।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਦਾ ਸਰਕੁਲਰ ਪ੍ਰਗਤੀ ਸੂਚਕ, ਜਿਹੜਾ ਇਹ ਦਰਸਾਉਂਦਾ ਹੈ ਕਿ ਐਪਲੀਕੇਸ਼ਨ ਵਿਅਸਤ ਹੈ।
pl: Kołowy wskaźnik postępu w stylu Material Design, który poprzez obracanie się sygnalizuje, że aplikacja jest zajęta.
pt: Um indicador de progresso circular com Material Design que gira para indicar que o aplicativo está ocupado.
pt_pt: Um indicador de progresso circular de material design, que gira para indicar que uma aplicação está ocupada.
ro: Indicator de progres circular pentru design material, care se rotește pentru a indica faptul că aplicația este ocupată.
ru: Кольцевой индикатор прогресса в стиле Material Design показывает, что приложение обрабатывает запрос пользователя.
si: යෙදුම කාර්ය බහුල බව දැක්වීමට භ්‍රමණය වන ද්‍රව්‍ය සැලසුම් වෘත්තාකාර ප්‍රගති දර්ශකයකි.
sk: Kruhový indikátor priebehu so vzhľadom Material Design, ktorý sa otáča, keď je aplikácia zaneprázdnená.
sq: Një tregues rrethor i progresit i dizajnit të materialit, i cili rrotullohet për të treguar që aplikacioni është i zënë.
sr: Кружни индикатор напретка материјалног дизајна који се окреће да би показао да је апликација заузета.
sr_latn: Kružni indikator napretka materijalnog dizajna koji se okreće da bi pokazao da je aplikacija zauzeta.
sv: En cirkulär förloppsindikator i Material Design som visar att appen är upptagen genom att snurra.
te: మెటీరియల్ డిజైన్ సర్క్యులర్ ప్రోగ్రెస్ సూచీ అనేది యాప్ బిజీగా ఉందని సూచించడానికి తిరుగుతుంది.
th: สัญญาณบอกสถานะความคืบหน้าแบบวงกลมของดีไซน์ Material ที่หมุนเพื่อบอกให้ทราบว่าแอปพลิเคชันยังไม่พร้อมทำงาน
tr: Dönerek uygulamanın meşgul olduğunu gösteren Materyal Tasarıma sahip dairesel ilerleme durumu göstergesi
uk: Індикатор циклічного перебігу з матеріальним дизайном обертається, вказуючи на роботу додатка.
ur: مٹیریل ڈیزائن سرکلر پیش رفت کا انڈیکیٹر، جو ایپلیکیشن کو مصروف بتانے کے لیے گھومتا ہے۔
uz: MD uslubidagi doirasimon jarayon indikatori, ilova bandligini aylantirib tasvirlaydi.
vi: Chỉ báo tiến trình vòng tròn trong Material Design, quay vòng để chỉ ra rằng ứng dụng đang bận.
zh_hk: 一種 Material Design 環形進度指標，轉動時即表示應用程式忙碌中。
zu: Isikhombisi sokuqhubeka se-Material Design, okuphendukisa ukubonisa ukuthi uhlelo lokusebenza lumatasatasa.

# demoMenuFour
source: Four
af: Vier
am: አራት
ar_eg: أربعة
as: চাৰি
az: Dörd
be: Чатыры
bn: চার
bs: Četiri
ca: Quatre
da: Fire
es_ar: Cuatro
et: Neli
eu: Lau
fa: چهار
fil: Apat
fr_ca: Quatre
gl: Catro
gu: ચાર
he: ארבע
hi: चार
hu: Négy
hy: չորս
id: Empat
it: Quattro
ka: ოთხი
km: បួន
kn: ನಾಲ್ಕು
ky: Төрт
lo: ສີ່
lt: Keturi
lv: Četri
mk: Четири
ml: നാല്
mn: Дөрөв
mr: चार
ms: Empat
my: လေး
nb: Fire
ne: चार
pa: ਚਾਰ
pl: Cztery
pt: Quatro
pt_pt: Quatro
ro: Patru
si: හතර
sk: Štyri
sq: Katër
sr: Четири
sr_latn: Četiri
sv: Fyra
te: నాలుగు
tr: Dört
uk: Чотири
ur: چار
uz: Toʻrt
vi: Bốn
zh_hk: 四
zu: Kune
