Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoChoiceChipDescription
source: Choice chips represent a single choice from a set. Choice chips contain related descriptive text or categories.
af: Keuseskyfies verteenwoordig 'n enkele keuse van 'n stel af. Keuseskyfies bevat beskrywende teks of kategorieë.
am: የምርጫ ቺፖች ከአንድ ስብስብ ውስጥ አንድ ነጠላ ምርጫን ይወክላሉ። የምርጫ ቺፖች ገላጭ ጽሁፍ ወይም ምድቦችን ይይዛሉ።
ar_eg: تمثل شرائح الخيارات خيارًا واحدًا من بين مجموعة. تتضمن شرائح الخيارات النصوص الوصفية ذات الصلة أو الفئات.
as: পচন্দৰ চিপসমূহে এটা ছেটৰ পৰা এটা একক পচন্দ প্ৰতিনিধিত্ব কৰে। পচন্দৰ চিপসমূহত সমল সম্পর্কীয় বিৱৰণমূলক পাঠ অথবা শিতানসমূহ অন্তর্ভুক্ত হয়।
az: Seçim çipləri qrupun içindən tək bir seçimi təqdim edir. Seçim çipləri əlaqədar təsviri mətn və ya kateqoriyalar ehtiva edir.
be: Чыпы выбару дазваляюць выбраць з набору адзін варыянт. Чыпы выбару змяшчаюць звязаны апісальны тэкст або катэгорыі.
bn: পছন্দের চিপ সেটের থেকে একটি পছন্দকে তুলে ধরে। পছন্দের চিপে প্রাসঙ্গিক বর্ণনামূলক টেক্সট বা বিভাগ থাকে।
bs: Čipovi za odabir predstavljaju izbor jedne stavke iz ponuđenog skupa. Čipovi za odabir sadrže povezani tekst s opisom ili kategorije.
ca: Les etiquetes de selecció representen una opció única d'entre les d'un conjunt i contenen text descriptiu relacionat o categories.
da: Valgtips repræsenterer et enkelt valg fra et sæt. Valgtips indeholder relateret beskrivende tekst eller relaterede kategorier.
es_ar: Los chips de selecciones representan una única selección de un conjunto. Estos incluyen categorías o texto descriptivo relacionado.
et: Valikukiibid tähistavad komplektist ühte valikut. Valikukiibid sisaldavad seotud kirjeldavat teksti või kategooriaid.
eu: Aukera-pilulek multzo bateko aukera bakarra erakusten dute. Erlazionatutako testu deskribatzailea edo kategoriak ere badauzkate.
fa: تراشه‌های انتخاب، تک انتخابی از یک مجموعه را نمایش می‌دهند. تراشه‌های انتخاب، نوشتار توصیفی یا دسته‌بندی‌های مرتبط را شامل می‌شوند.
fil: Kumakatawan ang mga choice chip sa isang opsyon sa isang hanay. Naglalaman ng nauugnay na naglalarawang text o mga kategorya ang mga choice chip.
fr_ca: Les jetons de choix représentent un choix unique dans un ensemble. Ils contiennent du texte descriptif ou des catégories.
gl: As pílulas de elección representan unha opción dun conxunto de opcións. Inclúen descricións ou categorías relacionadas.
gu: ચૉઇસ ચિપ એ કોઈ સેટની એકલ પસંદગીને પ્રસ્તુત કરે છે. ચૉઇસ ચિપમાં સંબંધિત વર્ણનાત્મક ટેક્સ્ટ અથવા શ્રેણીઓ શામેલ હોય છે.
he: צ'יפים של בחירה מייצגים בחירה יחידה מתוך קבוצה. צ'יפים של בחירה מכילים קטגוריות או טקסט תיאורי קשורים.
hi: चॉइस चिप किसी सेट में से पसंद किए गए चिप होते हैं. चॉइस चिप में मुख्य सामग्री से संबंधित जानकारी देने वाला टेक्स्ट या कोई श्रेणी शामिल होती है.
hu: A választószelvények egy konkrét választást jelölnek egy csoportból. A választószelvények kapcsolódó leíró szöveget vagy kategóriákat is tartalmaznak.
hy: Ընտրության ինտերակտիվ չիպերը ներկայացնում են հավաքածուից ընտրված մեկ տարբերակ։ Այս չիպերը պարունակում են առնչվող նկարագրական տեքստ կամ կատեգորիաներ։
id: Choice chip merepresentasikan satu pilihan dari sekumpulan pilihan. Choice chip berisi teks deskriptif atau kategori yang terkait.
it: I chip di scelta rappresentano una singola scelta di un insieme di scelte. I chip di scelta contengono categorie o testi descrittivi correlati.
ja: 選択チップは、集合からの 1 つの選択肢を表すものです。選択チップには、関連する説明テキストまたはカテゴリが含まれます。
ka: არჩევანის ჩიპები წარმოადგენს ნაკრებიდან ერთ არჩევანს. არჩევანის ჩიპები შეიცავს დაკავშირებულ აღმნიშვნელ ტექსტს ან კატეგორიას.
km: ឈីប​ជម្រើស​តំណាងឱ្យ​ជម្រើស​តែមួយ​ពី​បណ្ដុំ​មួយ​។ ឈីប​ជម្រើស​មាន​ប្រភេទ ឬ​អត្ថបទ​បែប​ពណ៌នា​ដែល​ពាក់ព័ន្ធ​។
kn: ಚಾಯ್ಸ್ ಚಿಪ್‌ಗಳು ಗುಂಪೊಂದರಲ್ಲಿನ ಒಂದೇ ಆಯ್ಕೆಯನ್ನು ಪ್ರತಿನಿಧಿಸುತ್ತವೆ. ಚಾಯ್ಸ್ ಚಿಪ್‌ಗಳು ಸಂಬಂಧಿತ ವಿವರಣಾತ್ಮಕ ಪಠ್ಯ ಅಥವಾ ವರ್ಗಗಳನ್ನು ಒಳಗೊಂಡಿರುತ್ತವೆ.
ko: 선택 칩은 세트 중 하나의 선택지를 나타냅니다. 선택 칩은 관련 설명 텍스트 또는 카테고리를 포함합니다.
ky: Тандоо чиптери топтомдогу бир тандоону көрсөтөт. Тандоо чиптери тийиштүү сүрөттөөчү текстти же категорияларды камтыйт.
lo: ຊິບຕົວເລືອກຈະສະແດງຕົວເລືອກດ່ຽວຈາກຊຸດໃດໜຶ່ງ. ຊິບຕົວເລືອກມີຂໍ້ຄວາມຄຳອະທິບາຍ ຫຼື ການຈັດໝວດໝູ່ທີ່ກ່ຽວຂ້ອງ.
lt: Pasirinkimo fragmentai nurodo vieną pasirinkimą iš rinkinio. Pasirinkimo fragmentuose įtraukiamas susijęs aprašomasis tekstas ar kategorijos.
lv: Izvēles žetons apzīmē vienu izvēli no kopas. Izvēles žetoni satur saistītu aprakstošo tekstu vai kategorijas.
mk: Иконите за избор прикажуваат еден избор од збир избори. Иконите за избор содржат поврзан описен текст или категории.
ml: ചോയ്‌സ് ചിപ്പുകൾ, ഒരു സെറ്റിൽ നിന്നുള്ള ഒരൊറ്റ ചോയ്‌സിനെ പ്രതിനിധീകരിക്കുന്നു. ചോയ്‌സ് ചിപ്പുകളിൽ ബന്ധപ്പെട്ട വിവരണാത്മക ടെക്‌സ്‌റ്റോ വിഭാഗങ്ങളോ അടങ്ങിയിരിക്കുന്നു.
mn: Сонголтын чип нь багцаас нэг сонголтыг илэрхийлдэг. Сонголтын чип нь контенттой холбоотой тайлбарласан текст эсвэл ангиллыг агуулдаг.
mr: चॉईस चिप सेटमधून एकच निवड दाखवते. चॉइस चिपमध्ये संबंधित असणारा वर्णनात्मक मजकूर किंवा वर्गवाऱ्या असतात.
ms: Cip pilihan mewakili satu pilihan daripada satu set. Cip pilihan mengandungi teks atau kategori deskriptif yang berkaitan.
my: ရွေးချယ်မှုချစ်ပ်များသည် အစုတစ်ခုရှိ ရွေးချယ်မှုတစ်ခုကို ကိုယ်စားပြုသည်။ ရွေးချယ်မှုချစ်ပ်များတွင် သက်ဆိုင်ရာ အကြောင်းအရာစာသား သို့မဟုတ် အမျိုးအစားများပါဝင်သည်။
nb: Valgbrikker representerer et enkelt valg fra et sett. Valgbrikker inneholder tilknyttet beskrivende tekst eller kategorier.
ne: विकल्पसम्बन्धी चिपहरूले सेटबाट एउटा चयन गर्ने विकल्पको प्रतिनिधित्व गर्दछन्। विकल्पसम्बन्धी चिपहरूमा यिनीहरूसँग सम्बन्धित वर्णनात्मक पाठ वा कोटीहरू हुन्छन्।
pa: ਚੋਇਸ ਚਿੱਪਾਂ ਕਿਸੇ ਸੈੱਟ ਵਿੱਚ ਇਕਹਿਰੀ ਚੋਣ ਨੂੰ ਦਰਸਾਉਂਦੀਆਂ ਹਨ। ਚੋਇਸ ਚਿੱਪਾਂ ਵਿੱਚ ਸੰਬੰਧਿਤ ਵਰਣਨਾਤਮਿਕ ਲਿਖਤ ਜਾਂ ਸ਼੍ਰੇਣੀਆਂ ਸ਼ਾਮਲ ਹੁੰਦੀਆਂ ਹਨ।
pl: Elementy wyboru reprezentują poszczególne opcje z grupy. Elementy te zawierają powiązany z nimi opis lub kategorię.
pt: Os ícones de escolha representam uma única escolha de um conjunto. Eles contêm categorias ou textos descritivos relacionados.
pt_pt: Os chips de escolha representam uma única escolha num conjunto. Os chips de escolha contêm texto descritivo ou categorias.
ro: Cipurile de opțiune reprezintă o singură opțiune dintr-un set. Ele conțin categorii sau texte descriptive asociate.
ru: Каждый чип выбора представляет собой один из вариантов выбора. Чип выбора может содержать описание или название категории.
si: තේරීම් චිප කට්ටලයකින් තනි තේරීමක් නියෝජනය කරයි. තේරීම් චිප අදාළ විස්තරාත්මක පෙළ හෝ කාණ්ඩ අඩංගු වේ.
sk: Prvky výberu predstavujú jednotlivé možnosti z určitej skupiny. Obsahujú súvisiaci popisný text alebo kategórie.
sq: Çipet e zgjedhjes paraqesin një zgjedhje të vetme nga një grupim. Çipet e zgjedhjes përmbajnë tekst ose kategori të lidhura përshkruese.
sr: Чипови избора представљају појединачну изабрану ставку из скупа. Чипови избора садрже повезани описни текст или категорије.
sr_latn: Čipovi izbora predstavljaju pojedinačnu izabranu stavku iz skupa. Čipovi izbora sadrže povezani opisni tekst ili kategorije.
sv: Valbrickor representerar ett av valen i en uppsättning. Valbrickor har relaterad beskrivande text eller kategorier.
te: ఎంపిక చిప్‌లు సెట్‌లోని ఒక ఎంపికను సూచిస్తాయి. ఎంపిక చిప్‌లు సంబంధిత వివరణాత్మక వచనం లేదా కేటగిరీలను కలిగి ఉంటాయి.
th: ชิปตัวเลือกแสดงตัวเลือกเดียวจากชุดตัวเลือก ชิปตัวเลือกมีข้อความคำอธิบายหรือการจัดหมวดหมู่ที่เกี่ยวข้อง
tr: Seçenek çipleri, bir dizi seçenekten tek bir seçeneği temsil eder. Seçenek çipleri ilgili açıklayıcı metin veya kategoriler içerir.
uk: Інтерактивні елементи вибору представляють один варіант із кількох доступних. Вони містять пов'язаний описовий текст або категорії.
ur: چوائس چپس ایک ہی سیٹ کے واحد چوائس کی نمائندگی کرتا ہے۔ چوائس چپس میں متعلقہ وضاحتی ٹیکسٹ یا زمرے ہوتے ہیں۔
uz: Tanlov chiplari toʻplamdagi variantlardan birini aks ettiradi. Ular tavsif matni yoki turkumdan iborat boʻladi.
vi: Thẻ lựa chọn biểu thị một lựa chọn trong nhóm. Thẻ này chứa văn bản mô tả hoặc danh mục có liên quan.
zh_hk: 選擇方塊從一組選項中顯示單一選項。選擇方塊載有相關的說明文字或類別。
zu: Ama-chips amela inketho eyodwa kusuka kusethi. Ama-chip enketho aphathelene nombhalo wencazelo noma izigaba.

# demoFilterChipTitle
source: Filter Chip
af: Filterskyfie
am: የማጣሪያ ቺፕ
ar_eg: شريحة الفلتر
as: ফিল্টাৰ চিপ
az: Filtr Çipi
be: Чып фільтра
bn: ফিল্টার চিপ
bs: Čip za filtriranje
ca: Etiqueta de filtre
da: Filtertip
es_ar: Chip de filtro
et: Filtrikiip
eu: Iragazteko pilula
fa: تراشه فیلتر
fr_ca: Jeton de filtre
gl: Etiqueta de filtro
gu: ફિલ્ટર ચિપ
he: סמל מסנן
hi: फ़िल्टर चिप
hu: Szűrőszelvény
hy: Զտիչի չիպ
it: Chip di filtro
ja: フィルタチップ
ka: ფილტრის ჩიპი
km: ឈីប​តម្រង
kn: ಫಿಲ್ಟರ್ ಚಿಪ್
ko: 필터 칩
ky: Чыпкалоо чиби
lo: ຊິບຕົວກັ່ນຕອງ
lt: Filtro fragmentas
lv: Filtra žetons
mk: Икона за филтер
ml: ഫിൽട്ടർ ചിപ്പ്
mn: Шүүлтүүрийн чип
mr: फिल्टर चिप
ms: Cip Penapis
my: ချစ်ပ်ကို စစ်‌ထုတ်ခြင်း
nb: Filterbrikke
ne: फिल्टरको चिप
pa: ਫਿਲਟਰ ਚਿੱਪ
pl: Ikona filtra
pt: Ícone de filtro
pt_pt: Chip de filtro
ro: Cip de filtrare
ru: Чип фильтра
si: පෙරහන් චිපය
sk: Prvok filtra
sq: Çipi i filtrit
sr: Чип филтера
sr_latn: Čip filtera
sv: Filterbricka
te: ఫిల్టర్ చిప్
th: ชิปตัวกรอง
tr: Filtre çipi
uk: Інтерактивний елемент фільтра
ur: فلٹر چِپ
uz: Filtr chipi
vi: Thẻ bộ lọc
zh_hk: 篩選器方塊
zu: I-chip yesihlungi

# demoFilterChipDescription
source: Filter chips use tags or descriptive words as a way to filter content.
af: Filterskyfies gebruik merkers of beskrywende woorde om inhoud te filtreer.
am: የማጣሪያ ቺፖች መለያዎችን ወይም ገላጭ ቃላት እንደ ይዘት የሚያጣሩበት መንገድ ይጠቀሙባቸዋል።
ar_eg: تستخدم شرائح الفلتر العلامات أو الكلمات الوصفية باعتبارها طريقة لفلترة المحتوى.
as: ফিল্টাৰ চিপসমূহে সমল ফিল্টাৰ কৰাৰ উপায় হিচাপে টেগসমূহ অথবা বিৱৰণমূলক শব্দবোৰ ব্যৱহাৰ কৰে।
az: Filtr çipləri məzmunu filtrləmək üçün teqlərdən və ya təsviri sözlərdən istifadə edir.
be: Чыпы фільтраў выкарыстоўваюць цэтлікі ці апісальныя словы для фільтравання змесціва.
bn: কন্টেন্ট ফিল্টার করার একটি পদ্ধতি হিসেবে ফিল্টার চিপ ট্যাগ বা বর্ণনামূলক শব্দ ব্যবহার করে।
bs: Čipovi za filtriranje koriste oznake ili opisne riječi kao način za filtriranje sadržaja.
ca: Les etiquetes de filtre utilitzen etiquetes o paraules descriptives per filtrar contingut.
da: Filtertips bruger tags eller beskrivende ord til at filtrere indhold.
es_ar: Los chips de filtros usan etiquetas o palabras descriptivas para filtrar contenido.
et: Filtreerimiskiibid kasutavad sisu filtreerimiseks märgendeid või kirjeldavaid sõnu.
eu: Iragazteko pilulek etiketak edo hitz deskribatzaileak erabiltzen dituzte edukia iragazteko.
fa: تراشه‌های فیلتر از برچسب‌ها یا واژه‌های توصیفی برای فیلتر کردن محتوا استفاده می‌کنند.
fil: Gumagamit ang mga filter chip ng mga tag o naglalarawang salita para mag-filter ng content.
fr_ca: Les jetons de filtre utilisent des balises ou des mots descriptifs comme méthode de filtrage du contenu.
gl: As pílulas de filtro serven para filtrar contido por etiquetas ou palabras descritivas.
gu: ફિલ્ટર ચિપ, કન્ટેન્ટને ફિલ્ટર કરવા માટે ટૅગ અથવા વર્ણનાત્મક શબ્દોનો ઉપયોગ કરે છે.
he: צ'יפים של סינון משתמשים בתגים או במילות תיאור כדרך לסינון תוכן.
hi: फ़िल्टर चिप, सामग्री को फ़िल्टर करने के लिए, टैग या जानकारी देने वाले शब्दों का इस्तेमाल करते हैं.
hu: A szűrőszelvények címkék vagy leíró jellegű szavak segítségével szűrik a tartalmat.
hy: Զտիչների ինտերակտիվ չիպերը պիտակներ կամ նկարագրող բառեր են օգտագործում՝ բովանդակությունը զտելու համար։
id: Filter chip menggunakan tag atau kata deskriptif sebagai cara memfilter konten.
it: I chip di filtro consentono di filtrare i contenuti in base a tag o parole descrittive.
ja: フィルタチップは、コンテンツをフィルタする方法としてタグやキーワードを使用します。
ka: ფილტრის ჩიპები იყენებს თეფებს ან აღმნიშვნელ სიტყვებს, შემცველობის დასაფილტრად.
km: ឈីប​តម្រង​ប្រើ​ស្លាក ឬ​ពាក្យ​បែប​ពណ៌នា​ជា​វិធី​ក្នុងការ​ត្រង​ខ្លឹមសារ​។
kn: ಫಿಲ್ಟರ್ ಚಿಪ್‌ಗಳು ವಿಷಯವನ್ನು ಫಿಲ್ಟರ್ ಮಾಡುವ ಸಲುವಾಗಿ ಟ್ಯಾಗ್‌ಗಳು ಅಥವಾ ವಿವರಣಾತ್ಮಕ ಶಬ್ಧಗಳನ್ನು ಬಳಸುತ್ತವೆ.
ko: 필터 칩은 태그 또는 설명을 사용해 콘텐츠를 필터링합니다.
ky: Чыпка чиптери мазмунду чыпкалоо үчүн тэгдерди же сүрөттөөчү сөздөрдү колдонот.
lo: ຊິບຕົວກັ່ນຕອງໃຊ້ແທັກ ຫຼື ຄຳອະທິບາຍລາຍລະອຽດເປັນວິທີກັ່ນຕອງເນື້ອຫາ.
lt: Turiniui filtruoti filtro fragmentai naudoja žymas ar aprašomuosius žodžius.
lv: Filtra žetoni satura filtrēšanai izmanto atzīmes vai aprakstošos vārdus.
mk: Иконите за филтри користат ознаки или описни зборови за филтрирање содржини.
ml: ഫിൽട്ടർ ചിപ്പുകൾ ഉള്ളടക്കം ഫിൽട്ടർ ചെയ്യാൻ ടാഗുകളോ വിവരണാത്മക വാക്കുകളോ ഉപയോഗിക്കുന്നു.
mn: Шүүлтүүрийн чип нь шошго эсвэл тайлбарласан үгийг контентыг шүүх арга болгон ашигладаг.
mr: फिल्टर चिप टॅग किंवा वर्णनात्मक शब्दांचा वापर आशय फिल्टर करण्याचा एक मार्ग म्हणून करतात.
ms: Cip penapis menggunakan teg atau perkataan deskriptif sebagai cara untuk menapis kandungan.
my: အကြောင်းအရာကို စစ်ထုတ်သည့်နည်းလမ်းတစ်ခုအဖြစ် တဂ်များ သို့မဟုတ် ဖော်ပြချက် စကားလုံးများသုံးပြီး ချစ်ပ်များကို စစ်ထုတ်သည်။
nb: Filterbrikker bruker etiketter eller beskrivende ord for å filtrere innhold.
ne: फिल्टर चिपहरूले सामग्री फिल्टर गर्न ट्याग वा वर्णनात्मक शब्दहरूको प्रयोग गर्दछन्।
pa: ਫਿਲਟਰ ਚਿੱਪਾਂ ਸਮੱਗਰੀ ਨੂੰ ਫਿਲਟਰ ਕਰਨ ਲਈ ਟੈਗਾਂ ਜਾਂ ਵਰਣਨਾਤਮਿਕ ਸ਼ਬਦਾਂ ਦੀ ਵਰਤੋਂ ਕਰਦੀਆਂ ਹਨ।
pl: Ikony filtrów korzystają z tagów lub słów opisowych do filtrowania treści.
pt: Os ícones de filtro usam tags ou palavras descritivas para filtrar conteúdo.
pt_pt: Os chips de filtro utilizam etiquetas ou palavras descritivas como uma forma de filtrar conteúdo.
ro: Cipurile de filtrare folosesc etichete sau termeni descriptivi pentru a filtra conținutul.
ru: Чипы фильтров содержат теги и описания, которые помогают отсеивать ненужный контент.
si: පෙරහන් චිප අන්තර්ගතය පෙරීමට ක්‍රමයක් ලෙස ටැග හෝ විස්තරාත්මක වචන භාවිත කරයි.
sk: Prvky filtra odfiltrujú obsah pomocou značiek alebo popisných slov.
sq: Çipet e filtrit përdorin etiketime ose fjalë përshkruese si mënyrë për të filtruar përmbajtjen.
sr: Чипови филтера користе ознаке или описне речи као начин да филтрирају садржај.
sr_latn: Čipovi filtera koriste oznake ili opisne reči kao način da filtriraju sadržaj.
sv: Med filterbrickor filtreras innehåll efter taggar eller beskrivande ord.
te: ఫిల్టర్ చిప్‌లు అనేవి కంటెంట్‌ను ఫిల్టర్ చేయడం కోసం ఒక మార్గంగా ట్యాగ్‌లు లేదా వివరణాత్మక పదాలను ఉపయోగిస్తాయి.
th: ชิปตัวกรองใช้แท็กหรือคำอธิบายรายละเอียดเป็นวิธีกรองเนื้อหา
tr: Filtre çipleri, içeriği filtreleme yöntemi olarak etiketler ve açıklayıcı kelimeler kullanır.
uk: Інтерактивні елементи фільтрів використовують теги або описові слова для фільтрування контенту.
ur: فلٹر چپس مواد فلٹر کرنے کے طریقے سے ٹیگز یا وضاحتی الفاظ کا استعمال کرتے ہیں۔
uz: Filtr chiplari kontentni teglar yoki tavsif soʻzlar bilan filtrlaydi.
vi: Thẻ bộ lọc sử dụng thẻ hoặc từ ngữ mô tả để lọc nội dung.
zh_hk: 篩選器方塊使用標籤或說明文字篩選內容。
zu: Hlunga ama-chip wokusebenzisa noma amagama okuchaza njengendlela yokuhlunga okuqukethwe.

# demoInputChipTitle
source: Input Chip
af: Invoerskyfie
am: የግቤት ቺፕ
ar_eg: شريحة الإدخال
as: ইনপুট চ্চিপ
az: Məlumat Çipi
be: Чып уводу
bn: ইনপুট চিপ
bs: Čip unosa
ca: Etiqueta d'entrada
da: Inputtip
es_ar: Chip de entrada
et: Sisendkiip
eu: Sarrera-pilula
fa: تراشه ورودی
fr_ca: Jeton d'entrée
gl: Etiqueta de entrada
gu: ઇનપુટ ચિપ
he: צ'יפ קלט
hi: इनपुट चिप
hu: Beviteli szelvény
hy: Մուտքագրման չիպ
it: Chip di input
ja: 入力チップ
ka: შეყვანის ჩიპი
km: ឈីប​ធាតុ​បញ្ចូល
kn: ಇನ್‌ಪುಟ್ ಚಿಪ್
ko: 입력 칩
ky: Киргизүү чиби
lo: ຊິບອິນພຸດ
lt: Įvesties fragmentas
lv: Ievades žetons
mk: Икона за внесување
ml: ഇൻപുട്ട് ചിപ്പ്
mn: Оруулгын чип
mr: इनपुट चिप
ms: Cip Input
my: အဝင်ချစ်ပ်
nb: Inndatabrikke
ne: इनपुट चिप
pa: ਇਨਪੁੱਟ ਚਿੱਪ
pl: Element wprowadzania tekstu
pt: Ícone de entrada
pt_pt: Chip de introdução
ro: Cip de intrare
ru: Чип записи
si: ආදාන චිපය
sk: Prvok vstupu
sq: Çipi i hyrjes
sr: Чип уноса
sr_latn: Čip unosa
sv: Inmatningsbricka
te: ఇన్‌పుట్ చిప్
th: ชิปอินพุต
tr: Giriş Çipi
uk: Інтерактивний елемент введення
ur: ان پٹ چپ
uz: Kiritish chipi
vi: Thẻ thông tin đầu vào
zh_hk: 輸入方塊
zu: I-Chip yokungena
