Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoNavigationDrawerDescription
source: A Material Design panel that slides in horizontally from the edge of the screen to show navigation links in an application.
af: 'n Materiaalontwerppaneel wat horisontaal van die rand van die skerm af gly om navigasieskakels in 'n program te wys.
am: በመተግበሪያው ውስጥ የአሰሳ አገናኞችን ለማሳየት ከማያ ገጹ ጠርዝ ላይ በአግድም የሚንሸራተት የቁሳዊ ንድፍ ፓነል።
ar_eg: لوحة تصميم متعدد الأبعاد تتحرك أفقيًا من حافة الشاشة لعرض روابط التنقّل في تطبيق.
as: এটা এপ্লিকেশ্বনত নেভিগেশ্বনৰ লিংকবোৰ প্ৰদৰ্শন কৰিবলৈ এটা বস্তুৰ ডিজাইন পেনেল যিটো স্ক্ৰীনৰ কাষৰ পৰা আনুভূমিকভাৱে শ্লাইড হয়।
az: Tətbiqdə naviqasiya keçidlərini göstərmək üçün ekranın kənarından üfüqi şəkildə sürüşən Material Dizayn paneli.
be: Панэль "Матэрыяльны дызайн" высоўваецца па гарызанталі з краю экрана і змяшчае спасылкі для навігацыі па праграме.
bn: কোনও অ্যাপ্লিকেশনে নেভিগেশন লিঙ্ক দেখানোর জন্য স্ক্রিনের বর্ডার থেকে অনুভূমিকভাবে স্লাইড হয় এমন মেটেরিয়াল ডিজাইন প্যানেল।
bs: Panel materijalnog dizajna koji se privuče horizontalno od ruba ekrana da prikaže linkove za navigaciju u aplikaciji.
ca: Tauler de Material Design que llisca horitzontalment des de la vora cap a la part interior de la pantalla per mostrar enllaços de navegació en una aplicació.
da: Et Material Design-panel, der kan skubbes ind horisontalt fra kanten af skærmen for at vise navigationslinks i en app.
es_ar: Un panel de Material Design que se desliza horizontalmente desde el borde de la pantalla para mostrar vínculos de navegación en una aplicación.
et: Materiaalse disaini paneel, mis libiseb horisontaalselt välja ekraani servast ja näitab rakenduse navigeerimislinke.
eu: Aplikazio bateko nabigazio-estekak bistaratzeko pantailaren ertzetik horizontalean lerratzen den Material diseinudun panela.
fa: پانل «طراحی مواد» که از لبهٔ صفحه به‌صورت افقی به‌داخل می‌لغزد و پیوندهای پیمایش را در برنامه نشان می‌دهد.
fil: Isang panel ng Material Design na nagsa-slide pahalang mula sa dulo ng screen para magpakita ng mga link ng navigation sa application.
fr_ca: Panneau Material Design à faire glisser horizontalement vers l'intérieur à partir du bord de l'écran pour afficher les liens de navigation dans une application.
gl: Un panel de Material Design que aparece desprazándose horizontalmente desde o bordo da pantalla para mostrar ligazóns de navegación nunha aplicación.
gu: એક મટિરિયલ ડિઝાઇનની પૅનલ, જે ઍપ્લિકેશનમાં નૅવિગેશનની લિંક બતાવવા માટે, સ્ક્રીનની કિનારી પરથી આડી રીતે સ્લાઇડ થઈને આવે છે.
he: פאנל של Material Design שמוסטת אופקית מקצה המסך ומציגה קישורי ניווט באפליקציה.
hi: मटीरियल डिज़ाइन पैनल का इस्तेमाल किसी ऐप्लिकेशन में नेविगेशन वाले लिंक दिखाने के लिए किया जाता है. यह पैनल स्क्रीन के बाएं या दाएं किनारे से स्लाइड करने पर दिखता है.
hu: Material Design panel, amely vízszintesen húzódik befelé a képernyő szélétől, és navigációs linkeket jelenít meg az adott alkalmazásban.
hy: Material Design ոճի հորիզոնական վահանակ, որը սահում է էկրանի եզրից և պարունակում է հավելվածում նավիգացիայի հղումներ։
id: Panel Desain Material yang dapat digeser secara horizontal dari pinggir layar untuk menampilkan link navigasi dalam aplikasi.
it: Un riquadro di Material Design che scorre in orizzontale dal bordo dello schermo per mostrare link di navigazione in un'applicazione.
ja: 画面の端から横方向にスライドしてアプリのナビゲーション リンクを表示するマテリアル デザイン パネル。
ka: Material Design-ის არე, რომელიც გასრიალდება ჰორიზონტალურად ეკრანის კიდიდან შიგნით და აჩვენებს აპლიკაციაში არსებულ ნავიგაციის ბმულებს.
km: ផ្ទាំងរចនាសំយោគ ដែលរំកិលចូលក្នុងទិសដៅផ្ដេកពីគែមអេក្រង់ ដើម្បីបង្ហាញតំណរុករកនៅក្នុងកម្មវិធី។
kn: ಅಪ್ಲಿಕೇಶನ್‌ನಲ್ಲಿ ನ್ಯಾವಿಗೇಶನ್ ಲಿಂಕ್‌ಗಳನ್ನು ತೋರಿಸಲು, ಒಂದು ವಸ್ತು ವಿನ್ಯಾಸದ ಫಲಕವು ಸ್ಕ್ರೀನ್‌ನ ತುದಿಯಿಂದ ಅಡ್ಡಲಾಗಿ ಸ್ಲೈಡ್ ಆಗುತ್ತದೆ.
ko: 화면 가장자리에서 수평으로 슬라이드해서 표시되는 머티리얼 디자인 패널로, 애플리케이션의 탐색 링크를 표시합니다.
ky: Колдонмодогу шилтемелер көрсөтүлгөн, экрандын кырында жайгашан горизонталдык багытта сүрүлгөн Material Design панели.
lo: ແຜງ Material Design ທີ່ເລື່ອນເຂົ້າມາທາງລວງນອນຈາກຂອບຈໍເພື່ອສະແດງລິ້ງການນຳທາງໃນແອັບພລິເຄຊັນໃດໜຶ່ງ.
lt: Trimačių objektų dizaino skydelis, pateikiamas horizontaliai nuo ekrano krašto. Jame rodomos naršymo nuorodos programoje.
lv: Šis materiāla dizaina panelis horizontāli ieslīd no ekrāna malas, lai parādītu lietojumprogrammas navigācijas saites.
mk: Табла на Material Design што се отвора хоризонтално со лизгање од работ на екранот за да ви ги прикаже линковите за навиигација во апликацијата.
ml: ഒരു ആപ്പിലെ നാവിഗേഷൻ ലിങ്കുകൾ കാണിക്കാൻ സ്ക്രീനിന്റെ അരികിൽ നിന്ന് തിരശ്ചീനമായി സ്ലൈഡ് ചെയ്യുന്ന മെറ്റീരിയൽ ഡിസൈൻ പാനൽ.
mn: Аппликэйшн дахь навигацын холбоосыг харуулахын тулд дэлгэцийн захаас хөндлөнгөөр гулсуулдаг Материалын загварын түр зуурын самбар юм.
mr: मटेरिअल डिझाइन पॅनल हे एखाद्या अ‍ॅप्लिकेशनमधील नेव्हिगेशन लिंक दाखवतात, जे स्क्रीनच्या डाव्या किंंवा उजव्या कडेने स्लाइड केल्यावर दिसते.
ms: Panel Reka Bentuk Bahan yang diluncurkan secara mendatar dari tepi skrin untuk menunjukkan pautan navigasi dalam aplikasi.
my: အက်ပ်တစ်ခုတွင် လမ်းညွှန်မှုလင့်ခ်များကို ပြရန် ဖန်သားပြင်၏ အနားစွန်းမှ ရေပြင်ညီအတိုင်း ပြသသော Material Design အကန့်။
nb: Et Material Design-panel som kommer inn horisontalt fra kanten av skjermen for å vise navigeringslinker i en app.
ne: स्क्रिनको किनाराबाट तेर्सो गरी स्लाइड गर्दा देखिने मटरियल डिजाइन प्यानल कुनै एप्लिकेसनमा भएका नेभिगेसन लिंकहरू देखाउन प्रयोग गरिन्छ।
pa: ਅਜਿਹਾ ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਪੈਨਲ ਜੋ ਐਪਲੀਕੇਸ਼ਨ ਵਿੱਚ ਨੈਵੀਗੇਸ਼ਨ ਲਿੰਕ ਦਿਖਾਉਣ ਲਈ ਸਕ੍ਰੀਨ ਦੇ ਕਿਨਾਰੇ ਤੋਂ ਲੇਟਵੇਂ ਰੂਪ ਵਿੱਚ ਸਲਾਈਡ ਕਰਦਾ ਹੈ।
pl: Panel Material Design, który wysuwa się poziomo od krawędzi ekranu. Zawiera linki nawigacyjne do różnych sekcji w aplikacji.
pt: Um painel do Material Design que desliza horizontalmente de fora para dentro na tela para mostrar links de navegação em um aplicativo.
pt_pt: Um painel Material Design que desliza lentamente na horizontal a partir da extremidade do ecrã para apresentar links de navegação numa aplicação.
ro: Un panou pentru design material care glisează pe orizontală dinspre marginea ecranului pentru a afișa linkuri de navigare într-o aplicație.
ru: Горизонтальная панель в стиле Material Design, которая выдвигается от края экрана и содержит навигационные ссылки приложения.
si: යෙදුමක සංචාලන සබැඳි පෙන්වීම සඳහා තිරයේ දාරයේ සිට තිරස් අතට ලිස්සා යන Material Design පැනලය.
sk: Panel so vzhľadom Material Design, ktorý sa vysúva vodorovne smerom od okraja obrazovky a zobrazuje odkazy na navigáciu v aplikácii.
sq: Një panel me "Dizajn material" që hyn me rrëshqitje horizontale nga skaji i ekranit për të shfaqur lidhjet e shfletimit në një aplikacion.
sr: Окно Материјални дизајн које се превлачи хоризонтално од ивице екрана ради приказивања линкова за навигацију у апликацији.
sr_latn: Okno Materijalni dizajn koje se prevlači horizontalno od ivice ekrana radi prikazivanja linkova za navigaciju u aplikaciji.
sv: En Material Design-panel som kommer in horisontellt från skärmens kant för att visa navigeringslänkar i en app.
te: ఒక యాప్‌లో నావిగేషన్ లింక్‌లను చూపించడానికి స్క్రీన్ అంచు నుండి సమాంతరంగా స్లయిడ్‌ అయ్యే విశేష రూపకల్పన ప్యానెల్.
th: แผงแบบ Material Design ที่เลื่อนในแนวนอนจากขอบของหน้าจอเพื่อแสดงลิงก์ไปยังส่วนต่างๆ ในแอปพลิเคชัน
tr: Uygulamada gezinme bağlantılarını göstermek için ekranın köşesinden yatay olarak kayan Materyal Tasarım paneli.
uk: Панель матеріального дизайну, яка висувається горизонтально від краю екрана й показує навігаційні посилання в додатку.
ur: مٹیریل ڈیزائن پینل جو ایپلیکیشن میں نیوی گیشن لنکس دکھانے کے لیے اسکرین کے کونے سے افقی طور پر سلائیڈ ہوتا ہے۔
uz: Ekranning chetidan siljitiladigan va ilovaning navigatsiya havolalarini oʻz ichiga olgan gorizontal Material Design paneli.
vi: Bảng điều khiển Material Design trượt theo chiều ngang từ cạnh màn hình để hiển thị đường liên kết điều hướng trong một ứng dụng.
zh_hk: 從螢幕邊緣水平滑入以在應用程式中顯示導覽連結的 Material Design 面板。
zu: Iphaneli Yedizayini Ebalulekile eslayida ngokuvundlile kusuka onqenqemeni lwesikrini ukubonisa izixhumanisi zokuzulazula kuhlelo lokusebenza.

# replyDraftsLabel
source: Drafts
af: Konsepte
am: ረቂቆች
ar_eg: المسودات
as: খচৰা
az: Qaralamalar
be: Чарнавікі
bn: ড্রাফ্ট
bs: Nedovršene verzije
ca: Esborranys
da: Kladder
es_ar: Borradores
et: Mustandid
eu: Zirriborroak
fa: پیش‌نویس‌ها
fil: Mga Draft
fr_ca: Brouillons
gl: Borradores
gu: ડ્રાફ્ટ
he: טיוטות
hi: ड्राफ़्ट
hu: Piszkozatok
hy: Սևագրեր
id: Draf
it: Bozze
ja: 下書き
ka: მონახაზები
km: ព្រាង
kn: ಡ್ರಾಫ್ಟ್‌‌ಗಳು
ko: 임시보관함
ky: Долбоорлор
lo: ສະບັບຮ່າງ
lt: Juodraščiai
lv: Melnraksti
mk: Нацрти
ml: ഡ്രാഫ്റ്റുകൾ
mn: Ноорог
mr: मसुदे
ms: Draf
my: မူကြမ်းများ
nb: Utkast
ne: मस्यौदाहरू
pa: ਡਰਾਫਟ
pl: Wersje robocze
pt: Rascunhos
pt_pt: Rascunhos
ro: Mesaje nefinalizate
ru: Черновики
si: කෙටුම්පත්
sk: Koncepty
sq: Draftet
sr: Радне верзије
sr_latn: Radne verzije
sv: Utkast
te: డ్రాఫ్ట్‌లు
th: ร่างจดหมาย
tr: Taslaklar
uk: Чернетки
ur: مسودے
uz: Qoralamalar
vi: Thư nháp
zh_hk: 草稿
zu: Okusalungiswa

# demoNavigationDrawerToPageOne
source: Item One
af: Item een
am: ንጥል አንድ
ar_eg: العنصر الأول
as: প্ৰথম বস্তু
az: Birinci element
be: Першы элемент
bn: প্রথম আইটেম
bs: 1. stavka
ca: Element 1
da: Element ét
es_ar: Elemento uno
et: Esimene üksus
eu: Lehenengo elementua
fa: مورد یک
fil: Unang Item
fr_ca: Élément un
gl: Elemento un
gu: આઇટમ એક
he: פריט ראשון
hi: पहला आइटम
hu: Első elem
hy: Կետ մեկ
id: Item Satu
it: Elemento uno
ja: 項目 1
ka: ერთეული ერთი
km: ធាតុ​ទីមួយ
kn: ಮೊದಲನೇ ಐಟಂ
ko: 항목 1
ky: Биринчи нерсе
lo: ລາຍການໜຶ່ງ
lt: Pirmas elementas
lv: Pirmais vienums
mk: Ставка еден
ml: ഇനം ഒന്ന്
mn: Нэгдүгээр зүйл
mr: पहिला आयटम
ms: Item Satu
my: အံဆွဲအကြောင်းအရာ တစ်
nb: Element nummer én
ne: पहिलो वस्तु
pa: ਆਈਟਮ ਇੱਕ
pl: Pierwszy element
pt: Item um
pt_pt: Item um
ro: Primul element
ru: Пункт один
si: පළමු අයිතමය
sk: Prvá položka
sq: Artikulli një
sr: Прва ставка
sr_latn: Prva stavka
sv: Objekt ett
te: ఒకటవ ఐటెమ్
th: รายการที่ 1
tr: Birinci Öğe
uk: Перший пункт
ur: پہلا آئٹم
uz: Birinchisi
vi: Mục một
zh_hk: 第一個項目
zu: Into Yokuqala

# replyInboxLabel
source: Inbox
af: Inkassie
am: የገቢ መልዕክት ሳጥን
ar_eg: البريد الوارد
as: ইনবক্স
az: Gələnlər
be: Уваходныя
bn: ইনবক্স
bs: Pristigla pošta
ca: Safata d'entrada
da: Indbakke
es_ar: Recibidos
et: Postkast
eu: Sarrera-ontzia
fa: صندوق ورودی
fr_ca: Boîte de réception
gl: Caixa de entrada
gu: ઇનબૉકસ
he: תיבת דואר נכנס
hi: इनबॉक्स
hu: Beérkezett üzenetek
hy: Մուտքային
id: Kotak masuk
it: Posta in arrivo
ja: 受信トレイ
ka: შემოსულები
km: ប្រអប់សារ
ko: 받은편지함
ky: Келген каттар кутусу
lo: ອິນບັອກ
lt: Gautieji
lv: Iesūtne
mk: Приемно сандаче
ml: ഇൻബോക്‌സ്
mn: Ирсэн имэйл
mr: इनबॉक्स
ms: Peti masuk
my: ဝင်စာများ
nb: Innboks
ne: इनबक्स
pa: ਇਨਬਾਕਸ
pl: Odebrane
pt: Caixa de entrada
pt_pt: Caixa de entrada
ro: Mesaje primite
ru: Входящие
si: එන ලිපි
sk: Doručené
sq: Kutia hyrëse
sr: Пријемно сандуче
sr_latn: Prijemno sanduče
sv: Inkorg
te: ఇన్‌బాక్స్
th: กล่องจดหมาย
tr: Gelen Kutusu
uk: Вхідні
ur: ان باکس
uz: Kiruvchi
vi: Hộp thư đến
zh_hk: 收件箱
zu: Ibhokisi lokungenayo

# demoSharedXAxisDemoInstructions
source: Next and Back Buttons
af: Volgende- en Terugknoppie
am: ቀጣይ እና ተመለስ አዘራሮች
ar_eg: زرّا التالي والرجوع
as: পৰৱৰ্তী আৰু উভতি যাওক বুটাম
az: Növbəti və Geri Düymələri
be: Кнопкі "Далей" і "Назад"
bn: 'পরবর্তী' এবং 'ফিরে যান' বোতাম
bs: Dugmad "Naprijed" i "Nazad"
ca: Botons Següent i Enrere
da: Knapperne Næste og Tilbage
es_ar: Botones Atrás y Siguiente
et: Edasi- ja tagasiliikumise nupud
eu: Hurrengoa eta Atzera botoiak
fa: دکمه‌های بعدی و قبلی
fil: Button ng Susunod at Button na Bumalik
fr_ca: Boutons Suivant et Retour
gl: Botóns Seguinte e Atrás
gu: આગળ અને પાછળ બટન
he: לחצני הבא והקודם
hi: 'आगे बढ़ें' और 'वापस जाएं' बटन
hu: Következő és Vissza gomb
hy: «Առաջ» և «Հետ» կոճակներ
id: Tombol Berikutnya dan Kembali
it: Pulsanti Avanti e Indietro
ja: 次へボタン、戻るボタン
ka: ღილაკები „შემდეგი“ და „უკან“
km: ប៊ូតុងបន្ទាប់ និងថយក្រោយ
kn: ಮುಂದಿನ ಮತ್ತು ಹಿಂದಿರುಗಲು ಇರುವ ಬಟನ್‌ಗಳು
ko: 다음 및 뒤로 버튼
ky: Кийинки жана артка баскычтары
lo: ປຸ່ມຕໍ່ໄປ ແລະ ກັບຄືນ
lt: Mygtukai „Kitas“ ir „Atgal“
lv: Pogas “Nākamā” un “Atpakaļ”
mk: Копчиња за следно и назад
ml: അടുത്തത്, മടങ്ങുക ബട്ടണുകൾ
mn: Дараах болон буцах товчлуур
mr: पुढील आणि मागील बटणे
ms: Butang Seterusnya dan Kembali
my: ရှေ့သို့နှင့် နောက်သို့ ခလုတ်များ
nb: Neste- og Tilbake-knapper
ne: 'अर्को' र 'पछाडि' बटन
pa: 'ਅੱਗੇ' ਅਤੇ 'ਪਿੱਛੇ' ਬਟਨ
pl: Przyciski Dalej i Wstecz
pt: Botões "Avançar" e "Voltar"
pt_pt: Botões Seguinte e Anterior
ro: Butoanele Înainte și Înapoi
ru: Кнопки "Далее" и "Назад"
si: ඊළඟ සහ ආපසු බොත්තම්
sk: Tlačidlá Ďalej a Späť
sq: Butonat "Vijo" dhe "Pas"
sr: Дугмад Даље и Назад
sr_latn: Dugmad Dalje i Nazad
sv: Knapparna Nästa och Tillbaka
te: తర్వాత, వెనుకకు బటన్‌లు
th: ปุ่มถัดไปและย้อนกลับ
tr: İleri ve Geri Düğmeleri
uk: Кнопки "Назад" і "Далі"
ur: آگے اور پیچھے جانے کے بٹنز
uz: Keyingisi va orqaga tugmalari
vi: Nút Tiếp theo và nút Quay lại
zh_hk: 「繼續」和「返回」按鈕
zu: Inkinobho Yokulandelayo Neyasemuva

# replySpamLabel
source: Spam
af: Strooipos
am: አይፈለጌ መልዕክት
ar_eg: الرسائل غير المرغوب فيها
as: স্পাম
be: Спам
bn: স্প্যাম
bs: Neželjena pošta
ca: Correu brossa
et: Rämpspost
eu: Spama
fa: هرزنامه
fr_ca: Pourriel
gu: સ્પામ
he: ספאם
hi: स्पैम
hy: Սպամ
ja: 迷惑メール
ka: სპამი
km: សារឥតបានការ
kn: ಸ್ಪ್ಯಾಮ್
ko: 스팸
ky: Спам
lo: ສະແປມ
lt: Šlamštas
lv: Mēstules
mk: Спам
ml: സ്‌പാം
mn: Спам
mr: स्पॅम
my: စပမ်း
nb: Nettsøppel
ne: स्प्याम
pa: ਸਪੈਮ
ru: Спам
si: අයාචිත
sq: Postë e bezdisshme
sr: Непожељно
sr_latn: Nepoželjno
te: స్పామ్
th: จดหมายขยะ
uk: Спам
ur: اسپام
vi: Thư rác
zh_hk: 垃圾內容
zu: Ugaxekile

# replyTrashLabel
source: Trash
af: Asblik
am: መጣያ
ar_eg: المهملات
as: ট্ৰেশ্ব
az: Zibil qutusu
be: Сметніца
bn: ট্র্যাশ
bs: Otpad
ca: Paperera
da: Papirkurv
es_ar: Papelera
et: Prügikast
eu: Zaborrontzia
fa: حذف‌شده‌ها
fr_ca: Corbeille
gl: Papeleira
gu: ટ્રેશ
he: אשפה
hi: ट्रैश
hu: Kuka
hy: Աղբարկղ
id: Sampah
it: Cestino
ja: ゴミ箱
ka: წაშლილები
km: ធុង​សំរាម
kn: ಟ್ರ್ಯಾಶ್
ko: 휴지통
ky: Таштанды
lo: ຖັງຂີ້ເຫຍື້ອ
lt: Šiukšliadėžė
lv: Atkritne
mk: Корпа
ml: ട്രാഷ്
mn: Хогийн сав
mr: ट्रॅश
ms: Sampah
my: အမှိုက်ပုံး
nb: Papirkurv
ne: ट्र्यास
pa: ਰੱਦੀ
pl: Kosz
pt: Lixeira
pt_pt: Lixo
ro: Coș de gunoi
ru: Корзина
si: කුණු කූඩය
sk: Kôš
sq: Koshi
sr: Отпад
sr_latn: Otpad
sv: Papperskorgen
te: ట్రాష్
th: ถังขยะ
tr: Çöp Kutusu
uk: Кошик
ur: کوڑے دان
uz: Chiqitdon
vi: Thùng rác
zh_hk: 垃圾桶
zu: Udoti

# replySentLabel
source: Sent
af: Gestuur
am: ተልኳል
ar_eg: الرسائل المرسلة
as: পঠিওৱা
az: Göndərilənlər
be: Адпраўленыя
bn: পাঠানো হয়েছে
bs: Poslano
ca: Enviats
da: Sendt
es_ar: Enviados
et: Saadetud
eu: Bidalitakoak
fa: ارسال‌شده
fil: Naipadala
fr_ca: Envoyés
gl: Enviados
gu: મોકલેલા
he: נשלח
hi: भेजे गए
hu: Elküldve
hy: Ուղարկված
id: Terkirim
it: Inviati
ja: 送信済み
ka: გაგზავნილები
km: បាន​ផ្ញើ
kn: ಕಳುಹಿಸಲಾಗಿದೆ
ko: 보낸편지함
ky: Жөнөтүлдү
lo: ສົ່ງແລ້ວ
lt: Išsiųsta
lv: Nosūtītie
mk: Испратено
ml: അയച്ചു
mn: Илгээсэн
mr: पाठवले
ms: Dihantar
my: ပို့ပြီး
nb: Sendt
ne: पठाइएको
pa: ਭੇਜਿਆ ਗਿਆ
pl: Wysłane
pt: Enviado
pt_pt: Enviado
ro: Trimise
ru: Отправленные
si: යවන ලද
sk: Odoslané
sq: Dërguar
sr: Послато
sr_latn: Poslato
sv: Skickat
te: పంపినవి
th: ส่งแล้ว
tr: Gönderilmiş
uk: Надіслані
ur: بھیج دیا گیا
uz: Yuborilgan
vi: Đã gửi
zh_hk: 已傳送
zu: Kuthunyelwe

# demoNavigationRailSecond
source: Second
af: Tweede
am: ሰከንድ
ar_eg: الثاني
as: দ্বিতীয়
az: İkinci
be: Другая
bn: দ্বিতীয়
bs: Drugo
ca: Segona
da: Anden
es_ar: Segunda
et: Teine
eu: Bigarrena
fa: دومین
fil: Ikalawa
fr_ca: Deuxième
gl: Segundo
gu: બીજું
he: השני
hi: दूसरा
hu: Második
hy: Երկրորդ
id: Kedua
it: Seconda etichetta
ja: 2 つ目
ka: მეორე
km: ទីពីរ
kn: ಎರಡನೆಯ
ko: 두 번째
ky: Экинчи
lo: ສອງ
lt: Antra
lv: Otrais galamērķis
mk: Втора
ml: രണ്ടാമത്തെ
mn: Хоёр дахь
mr: दुसरे
ms: Kedua
my: ဒုတိယ
nb: Andre
ne: दोस्रो
pa: ਦੂਜਾ
pl: Drugi
pt: Segundo
pt_pt: Segundo
ro: A doua
ru: Вторая
si: තත්පරය
sk: Druhý
sq: E dyta
sr: Друга
sr_latn: Druga
sv: Andra
te: రెండవ
th: อันดับที่ 2
tr: İkinci
uk: Другий елемент
ur: دوسرا
uz: Ikkinchi
vi: Thứ hai
zh_hk: 第二個
zu: Okwesibili

# demoNavigationDrawerToPageTwo
source: Item Two
af: Item twee
am: ንጥል ሁለት
ar_eg: العنصر الثاني
as: দ্বিতীয় বস্তু
az: İkinci element
be: Другі элемент
bn: দ্বিতীয় আইটেম
bs: 2. stavka
ca: Element 2
da: Element to
es_ar: Elemento dos
et: Teine üksus
eu: Bigarren elementua
fa: مورد دو
fil: Ikalawang Item
fr_ca: Élément deux
gl: Elemento dous
gu: આઇટમ બે
he: פריט שני
hi: दूसरा आइटम
hu: Második elem
hy: Կետ երկու
id: Item Dua
it: Elemento due
ja: 項目 2
ka: ერთეული ორი
km: ធាតុទី​ពីរ
kn: ಎರಡನೇ ಐಟಂ
ko: 항목 2
ky: Экинчи нерсе
lo: ລາຍການສອງ
lt: Antras elementas
lv: Otrais vienums
mk: Ставка два
ml: ഇനം രണ്ട്
mn: Хоёрдугаар зүйл
mr: दुसरा आयटम
ms: Item Dua
my: အံဆွဲအကြောင်းအရာ နှစ်
nb: Element nummer to
ne: दोस्रो वस्तु
pa: ਆਈਟਮ ਦੋ
pl: Drugi element
pt: Item dois
pt_pt: Item dois
ro: Al doilea element
ru: Пункт два
si: දෙවැනි අයිතමය
sk: Druhá položka
sq: Artikulli dy
sr: Друга ставка
sr_latn: Druga stavka
sv: Objekt två
te: రెండవ ఐటెమ్
th: รายการที่ 2
tr: İkinci Öğe
uk: Другий пункт
ur: دوسرا آئٹم
uz: Ikkinchisi
vi: Mục hai
zh_hk: 第二個項目
zu: Into Yesibili

# demoFadeScaleDemoInstructions
source: Modal and FAB
af: Modaal en FAB
am: ሞዳል እና FAB
ar_eg: مربّع الحوار المشروط وزر الإجراء الرئيسي (FAB)
as: মডেল আৰু FAB
az: Modal və FAB
be: Мадальная кнопка і рухомая кнопка дзеяння
bn: মোডাল ও এফএবি
bs: Modal i FAB
ca: Modal i BAF
da: Modal og svævende handlingsknap
es_ar: Modal y BAF
et: Modaalleht ja hõljuv toimingunupp
eu: Leiho gainerakorra eta EBG
fa: مودال و دکمه کنش شناور
fil: Modal at FAB
fr_ca: Fenêtre modale et bouton d'action flottant
gl: Modal e botón de acción flotante
gu: મોડલ અને FAB
he: לחצני FAB ודיאלוג מודאלי
hi: मोडल और एफ़एबी
hu: Modális ablak és lebegő műveletgomb
hy: Մոդալ և լողացող կոճակներ
id: Modal dan FAB
it: Modale e FAB
ja: モーダル、FAB
ka: მოდალური ფანჯარა და მოქმედების მოლივლივე ღილაკი
km: ម៉ូដល និង FAB
kn: ಮೋಡಲ್ ಮತ್ತು FAB
ko: 모달 및 FAB
ky: Модалдык тилке жана КАБ
lo: Modal ແລະ FAB
lt: Modulis ir SVM
lv: Modālais lodziņš un PDP
mk: Модален и лебдечко копче за дејство
ml: മോഡൽ, FAB
mn: Зайлшгүй харилцах цонх болон FAB
mr: मोडल आणि FAB
ms: Mod dan FAB
my: Modal နှင့် FAB
nb: Modalfelt og svevende handlingsknapper
ne: मोडल र FAB
pa: ਮਾਡਲ ਅਤੇ FAB
pl: Okno modalne i FAB
pt: Modal e FAB
pt_pt: Modal e BAF
ro: Modal și Butonul de acțiune flotant
ru: Модальные и плавающие кнопки
si: Modal සහ FAB
sk: Modálne a plávajúce tlačidlo akcie
sq: Modal dhe FAB
sr: Модално и плутајуће дугме за радњу
sr_latn: Modalno i plutajuće dugme za radnju
sv: Modal och flytande åtgärdsknapp
te: మోడల్, FAB
th: รูปแบบและ FAB
tr: Kalıcı iletişim kutusu ve FAB
uk: Вікно та плаваюча командна кнопка
ur: ماڈل اور FAB
uz: Modal va suzuvchi harakat tugmalari
vi: Hộp thoại và FAB
zh_hk: 強制回應和懸浮動作按鈕
zu: I-Modal ne-FAB

# demoFadeThroughDemoInstructions
source: Bottom navigation
af: Navigasie onder
am: የታች ዳሰሳ
ar_eg: شريط التنقّل السفلي
as: একেবাৰে নিম্নাংশৰ নেভিগেশ্বন
az: Alt naviqasiya
be: Навігацыя ўнізе экрана
bn: নিচের দিকে নেভিগেশন
bs: Donja navigacija
ca: Navegació inferior
da: Navigation i bunden
es_ar: Navegación inferior
et: Alumine navigeerimine
eu: Beheko nabigazioa
fa: پیمایش پایین صفحه
fil: Navigation sa ibaba
fr_ca: Barre de navigation inférieure
gl: Navegación da parte inferior
gu: બોટમ નૅવિગેશન
he: ניווט בחלק התחתון
hi: बॉटम नेविगेशन
hu: Alsó navigáció
hy: Նավիգացիա էկրանի ներքևի հատվածում
id: Navigasi bawah
it: Navigazione in basso
ja: ボトム ナビゲーション
ka: ნავიგაცია ქვედა ნაწილში
km: ការរុករក​ខាងក្រោម
kn: ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್
ko: 하단 탐색
ky: Ылдый өтүү
lo: ການນຳທາງລຸ່ມສຸດ
lt: Apatinė naršymo juosta
lv: Apakšējās navigācijas vadīklas
mk: Долна навигација
ml: ബോട്ടം നാവിഗേഷൻ
mn: Доод навигац
mr: तळाचे नेव्हिगेशन
ms: Navigasi bawah
my: အောက်ခြေတွင် လမ်းညွှန်ခြင်း
nb: Navigering nederst
ne: फेदको नेभिगेसन
pa: ਹੇਠਾਂ ਵੱਲ ਨੈਵੀਗੇਸ਼ਨ
pl: Dolna nawigacja
pt: Navegação inferior
pt_pt: Navegação inferior
ro: Navigarea în partea de jos
ru: Навигация внизу экрана
si: පහළ සංචාලනය
sk: Dolná navigácia
sq: Shfletimi poshtë
sr: Доња навигација
sr_latn: Donja navigacija
sv: Navigering längst ned på skärmen
te: దిగువ నావిగేషన్
th: การไปยังส่วนต่างๆ ด้านล่าง
tr: Alt gezinme
uk: Навігація в нижній частині екрана
ur: نیچے نیویگیشن
uz: Ekran pastidagi navigatsiya
vi: Thanh điều hướng dưới cùng
zh_hk: 底部導覽
zu: Ukuzulela phansi

# demoSharedZAxisDemoInstructions
source: Settings icon button
af: Instellingsikoonknoppie
am: የቅንብሮች አዶ አዝራር
ar_eg: زر رمز الإعدادات
as: ছেটিং চিহ্নৰ বুটাম
az: "Ayarlar ikonası" düyməsi
be: Кнопка са значком налад
bn: সেটিংস আইকন বোতাম
bs: Dugme ikone postavki
ca: Botó de la icona de configuració
da: Knap med ikon for Indstillinger
es_ar: Botón de ícono de configuración
et: Seadete ikooninupp
eu: Ezarpenen ikonoaren botoia
fa: دکمه نماد تنظیمات
fil: Button ng icon ng mga setting
fr_ca: Bouton de l'icône des paramètres
gl: Botón da icona de configuración
gu: સેટિંગ આઇકનનું બટન
he: סמל של לחצן ההגדרות
hi: सेटिंग आइकॉन का बटन
hu: Beállítások ikon gombja
hy: «Կարգավորումներ» կոճակ
id: Tombol ikon setelan
it: Pulsante dell'icona Impostazioni
ja: 設定アイコン ボタン
ka: პარამეტრების ხატულის ღილაკი
km: ប៊ូតុងរូបការកំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳ ಐಕಾನ್ ಬಟನ್
ko: 설정 아이콘 버튼
ky: Параметрлердин сүрөтчөсү баскычы
lo: ປຸ່ມໄອຄອນການຕັ້ງຄ່າ
lt: Nustatymų piktogramos mygtukas
lv: Iestatījumu ikonas poga
mk: Копче за иконата за „Поставки“
ml: ക്രമീകരണ ഐക്കൺ ബട്ടൺ
mn: Дүрс тэмдгийн товчлуурын тохиргоо
mr: सेटिंग्ज आयकन बटण
ms: Butang ikon tetapan
my: ဆက်တင်များ သင်္ကေတ ခလုတ်
nb: Knapp for Innstillinger-ikon
ne: सेटिङ आइकनको बटन
pa: ਸੈਟਿੰਗਾਂ ਪ੍ਰਤੀਕ ਬਟਨ
pl: Przycisk ikony Ustawienia
pt: Botão do ícone "Configurações"
pt_pt: Botão de ícone de Definições
ro: Butonul cu pictograma Setări
ru: Кнопка "Настройки"
si: සැකසීම් නිරූපක බොත්තම
sk: Tlačidlo ikony nastavení
sq: Butoni i ikonës së "Cilësimeve"
sr: Дугме иконе Подешавања
sr_latn: Dugme ikone Podešavanja
sv: Knapp med ikon för Inställningar
te: సెట్టింగ్‌ల చిహ్నం బటన్
th: ปุ่มไอคอนการตั้งค่า
tr: Ayarlar simge düğmesi
uk: Значок налаштувань
ur: ترتیبات کے آئیکن کا بٹن
uz: Sozlamalar tugmasi
vi: Nút biểu tượng Cài đặt
zh_hk: 設定圖示按鈕
zu: Inkinobho yesithonjana samasethingi
