Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoLinearProgressIndicatorDescription
source: A Material Design linear progress indicator, also known as a progress bar.
af: 'n Lineêre materiaalontwerp-vorderingaanwyser, ook bekend as 'n vorderingsbalk.
am: የቁስ ንድፍ የቀጥታ መስመር የግስጋሴ ጠቋሚ፣ በተጨማሪ የግስጋሴ አሞሌ በመባል የሚታወቅ
ar_eg: مؤشر تقدم خطي بتصميم متعدد الأبعاد ويُعرَف أيضًا بشريط التقدم
as: এটা ভৌতিক আৰ্হিৰ চক্ৰাকাৰ সূচক যাক অগ্ৰগতি সূচক হিচাপেও জনা যায়।
az: Gedişat paneli olaraq da tanınan Material Dizaynlı xətti gedişat indikatoru.
be: Лінейны індыкатар прагрэсу Material Design, таксама вядомы як індыкатар выканання.
bn: একটি মেটেরিয়াল ডিজাইন লিনিয়ার প্রগ্রেস নির্দেশক, যেটি প্রগ্রেস বার হিসেবেও পরিচিত।
bs: Linearni pokazatelj napretka materijalnog dizajna, također poznat kao traka napretka.
ca: Indicador de progrés lineal de Material Design; també es coneix com a barra de progrés.
da: En lineær statusindikator fra Material Design, også kaldet en statuslinje.
es_ar: Corresponde a un indicador de progreso lineal de material design, también conocido como barra de progreso.
et: Materiaalse disainiga lineaarne edenemisnäidik, mida nimetatakse ka edenemisribaks.
eu: Material diseinuaren garapen-adierazle lineal bat; garapen-barra ere baderitzo.
fa: نشانگر پیشرفت خطی با «طراحی مواد» که با عنوان نوار پیشرفت نیز شناخته شده است.
fil: Isang Material Design na linear na indicator ng pag-usad, na kilala rin bilang progress bar.
fr_ca: Un indicateur de progression de forme linéaire avec thème Material Design, aussi connu sous le nom de barre de progression.
gl: Un indicador de progreso lineal de Material Design, tamén coñecido como barra de progreso.
gu: સામગ્રીની ડિઝાઇનનું એક રેખીય પ્રગતિ સૂચક, જે પ્રોગ્રેસ બાર તરીકે પણ ઓળખાય છે.
he: אינדיקטור של התקדמות ליניארית בעיצוב חדשני תלת-ממדי, שנקרא גם סרגל התקדמות.
hi: मटीरियल डिज़ाइन लीनियर फ़ॉर्मैट में किसी गतिविधि की स्थिति दिखाने वाले इंडिकेटर को प्रगति बार भी कहते हैं.
hu: Lineáris Material Design-folyamatjelző, amely folyamatjelző sávként is ismert.
hy: Ընթացքի՝ Material Design-ի ոճով գծային ցուցիչ, որը նաև անվանում են ընթացագոտի։
id: Indikator progres linear Desain Material, disebut juga status progres.
it: Un indicatore di avanzamento lineare Material Design, anche noto come barra di avanzamento.
ja: マテリアル デザインの線形進行状況インジケーター。進行状況バーとも呼ばれます。
ka: Material Design-ის პროგრესის წრფივი ინდიკატორი, რომელიც ასევე ცნობილია როგორც პროგრესის ზოლი.
km: សូចនាករដំណើរការរាងបន្ទាត់ត្រង់នៃរចនាប័ទ្មសម្ភារ ដែលអាចហៅម្យ៉ាងទៀតថារបារ​ដំណើរការ។
kn: ಪ್ರಗತಿ ಬಾರ್ ಎಂದೂ ಸಹ ಕರೆಯಲಾಗುವ, ವಸ್ತು ವಿನ್ಯಾಸ ಲೀನಿಯರ್ ಪ್ರಗತಿ ಸೂಚಕ.
ko: 머티리얼 디자인 선형 진행 상태 표시기로 진행률 표시줄이라고도 합니다.
ky: Material Design түз кыймылдын аткарылышынын индикатору "аткаруу көрсөткүчү" катары да белгилүү.
lo: ຕົວຊີ້ບອກສະຖານະແບບເສັ້ນຊື່ Material Design, ເອີ້ນອີກຢ່າງໜຶ່ງວ່າແຖບສະຖານະ.
lt: Trimačių objektų dizaino linijinis eigos indikatorius, taip pat vadinamas eigos juosta.
lv: Lineārs materiāla dizaina norises indikators, zināms arī kā norises josla.
mk: Линиски индикатор на напредок во Material Design, познат и како лента за напредок.
ml: മെറ്റീരിയൽ രൂപകൽപ്പനയായ ലീനിയർ പ്രോഗ്രസ് ഇൻഡിക്കേറ്റർ, പ്രോഗ്രസ് ബാർ എന്നും ഇതിന് പേരുണ്ട്.
mn: Материалын загварын шугаман үйл явцын заалт нь мөн явцын заалт гэж танигдсан.
mr: प्रगती बारला मटेरिअल डिझाइन लिनिअर प्रगती इंडिकेटर म्हणूनदेखील ओळखले जाते.
ms: Penunjuk kemajuan linear Reka Bentuk Bahan, juga dikenali sebagai bar kemajuan.
my: 'ရုပ်ဝတ္ထုဒီဇိုင်း' မျဉ်းဖြောင့် တိုးတက်မှုအညွှန်းကို တိုးတက်မှုဘားဟုလည်း ခေါ်သည်။
nb: En lineær fremdriftsindikator for «material design», som også kalles en fremdriftslinje.
ne: प्रगति पट्टि भनेर पनि जानिने सामग्री डिजाइनको गोलाकार प्रगति सूचक।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਲੀਨੀਅਰ ਪ੍ਰਗਤੀ ਸੂਚਕ, ਪ੍ਰਗਤੀ ਬਾਰ ਵਜੋਂ ਵੀ ਜਾਣਿਆ ਜਾਂਦਾ ਹੈ।
pl: Liniowy wskaźnik postępu w stylu Material Design, nazywany też paskiem postępu.
pt: Um indicador de progresso linear do Material Design, também conhecido como barra de progresso.
pt_pt: Um indicador de progresso linear de material design, também denominado de barra de progresso.
ro: Indicator de progres liniar pentru design material, numit și bară de progres.
ru: Линейный индикатор прогресса в стиле Material Design, который также называют индикатором выполнения.
si: ද්‍රව්‍ය සැලසුම් රේඛීය ප්‍රගති දර්ශකයකි, එය ප්‍රගති තීරුවක් ලෙස ද හැඳින්වේ.
sk: Lineárny indikátor priebehu so vzhľadom Material Design, ktorý sa nazýva aj ukazovateľ priebehu.
sq: Një tregues linear i progresit i dizajnit të materialit, i njohur edhe si një shirit progresi.
sr: Линеарни индикатор напретка материјалног дизајна, познат и као трака напретка.
sr_latn: Linearni indikator napretka materijalnog dizajna, poznat i kao traka napretka.
sv: En linjär förloppsindikator i Material Design.
te: మెటీరియల్ డిజైన్ లీనియర్ ప్రోగ్రెస్ సూచీని పురోగతి బార్ అని కూడా అంటారు.
th: สัญญาณบอกสถานะความคืบหน้าแบบเชิงเส้นของดีไซน์ Material หรือเรียกอีกอย่างว่าแถบความคืบหน้า
tr: İlerleme çubuğu olarak da bilinen, Materyal Tasarıma sahip doğrusal ilerleme durumu göstergesi
uk: Індикатор лінійного перебігу з матеріальним дизайном також називають панеллю перебігу.
ur: مٹیریل ڈیزائن لینئیر پیش رفت کا انڈیکیٹر، جسے پیش رفت بار کے نام سے بھی جانا جاتا ہے۔
uz: MD uslubidagi chiziqli jarayon indikatori holat paneli deb ham ataladi.
vi: Chỉ báo tiến trình tuyến tính trong Material Design, còn được gọi là thanh tiến trình.
zh_hk: 一種 Material Design 直線進度指標，亦稱為進度列。
zu: Isikhombisi sokuqhubeka se-Material Design linear, futhi saziwa ngebha yokuqhubeka.

# demoTooltipTitle
source: Tooltips
af: Nutswenke
am: የመሣሪያ ጥቆማዎች
ar_eg: التلميحات
as: টুলটিপসমূহ
az: İpucular
be: Падказкі
bn: টুলটিপ
bs: Opisi
ca: Descripcions emergents
da: Værktøjstips
es_ar: Información sobre la herramienta
et: Kohtspikrid
eu: Aholkuak
fa: نکته‌ابزارها
fil: Mga Tooltip
fr_ca: Infobulles
gl: Cadros de información
gu: ટૂલટિપ
he: הסברים קצרים
hi: टूलटिप
hu: Elemleírások
hy: Հուշումներ
id: Tooltip
it: Descrizioni comandi
ja: ツールチップ
ka: მინიშნებები
km: កំណត់​ពន្យល់
kn: ಟೂಲ್‌ಟಿಪ್‌ಗಳು
ko: 도움말
ky: Калкып чыгуучу кеңештер
lo: ຄຳແນະນຳ
lt: Patarimai
lv: Rīka padomi
mk: Совети за алатки
ml: ടൂൾടിപ്പുകൾ
mn: Зөвлөмж
mr: टूलटिप
ms: Tip alat
my: အကြံပြုချက်ပြ ပေါ့အပ် ဝင်းဒိုး
nb: Verktøytips
ne: उपकरण वर्णनहरू
pa: ਟੂਲ-ਟਿੱਪ
pl: Etykietki
pt: Dicas
pt_pt: Sugestões
ro: Baloane explicative
ru: Подсказки
si: මෙවලම් ඉඟි
sk: Popisy
sq: Këshillat për veglat
sr: Објашњења
sr_latn: Objašnjenja
sv: Beskrivningar
te: ఉపకరణ చిట్కాలు
th: เคล็ดลับเครื่องมือ
tr: İpuçları
uk: Спливаючі підказки
ur: ٹول ٹپس
uz: Qalqib chiquvchi maslahat oynalari
vi: Chú giải công cụ
zh_hk: 提示
zu: Amathulithiphu

# demoTooltipSubtitle
source: Short message displayed on long press or hover
af: Kort boodskap wat gewys word wanneer daar lank gedruk of gehou word
am: በረዥም መጫን ወይም ማንዣበብ ላይ የሚታይ አጭር መልዕክት
ar_eg: رسالة قصيرة تُعرَض عند الضغط مع الاستمرار أو تمرير مؤشر الماوس
as: দীঘলীয়াকৈ টিপা অথবা টিপি ধৰি থকাত প্ৰদর্শিত চমু বার্তা
az: Basıb saxladıqda və ya üzərində sürüşdürdükdə göstərilən qısa mesaj
be: Кароткае паведамленне, якое паказваецца падчас доўгага націскання ці навядзення на яго курсора
bn: অনেকক্ষণ বোতাম প্রেস করে রাখলে বা উপরে নিয়ে গেলে একটি ছোট মেসেজ দেখায়
bs: Kratka poruka koja se prikazuje dugim pritiskom ili postavljanjem kursora iznad elementa
ca: Missatge breu que es mostra en mantenir premuda una opció o en passar el cursor per sobre
da: Kort meddelelse, der vises ved langt tryk, eller når markøren holdes over et element
es_ar: Mensaje breve que se muestra cuando se mantiene presionado o se coloca el cursor sobre un elemento
et: Lühike sõnum, mis kuvatakse pika vajutuse või kursori hõljutamise korral
eu: Luze sakatzean edo gainetik pasatzean erakusten den mezu laburra
fa: پیام کوتاهی که هنگام فشار طولانی یا نگه داشتن نشانگر نمایش داده می‌شود
fil: Maikling mensaheng ipinapakita kapag pumindot nang matagal o nag-hover
fr_ca: Court message qui s'affiche lors d'un appui prolongé ou du passage de la souris sur un élément
gl: Mensaxe curta que se mostra ao manter premido un elemento ou ao pasar por enriba del
gu: ટૂંકા સંદેશ પર થોડીવાર દબાવી રાખવાથી અથવા તેના પર લઈ જવાથી તે પ્રદર્શિત થાય છે
he: הודעה קצרה שמוצגת בלחיצה ארוכה או העברת העכבר מעל פריט
hi: किसी आइटम पर माउस घुमाने या उसे दबाकर रखने पर एक छोटा मैसेज दिखता है
hu: Rövid üzenet, amely a kapcsolódó elem hosszú megnyomásakor vagy az egérrel való rámutatáskor jelenik meg
hy: Կարճ հաղորդագրություն, որը ցուցադրվում է երկար սեղմման կամ նշորդն անցկացնելու դեպքում
id: Pesan singkat yang ditampilkan saat menekan lama atau mengarahkan kursor
it: Breve messaggio visualizzato in caso di pressione prolungata o di posizionamento del puntatore del mouse sopra un elemento
ja: 長押しするかカーソルを合わせると表示される短いメッセージ
ka: მოკლე შეტყობინება, რომელიც გამოჩნდება ხანგრძლივი დაჭერით ან გადატარებით
km: សារ​ខ្លី​ដែលបង្ហាញ​នៅពេល​ចុច​ឱ្យយូរ ឬ​ដាក់ព្រួញ
kn: ನೀವು ಕರ್ಸರ್ ಅನ್ನು ಒತ್ತಿಹಿಡಿದಾಗ ಅಥವಾ ಹೋವರ್ ಮಾಡಿದಾಗ ಸಂದೇಶ ಡಿಸ್‌ಪ್ಲೇ ಆಗುತ್ತದೆ
ko: 길게 누르거나 마우스를 가져가면 표시되는 짧은 메시지
ky: Коё бербей басып турганда же үстүнө алып келгенде көрсөтүлгөн кыска билдирүү
lo: ຂໍ້ຄວາມສັ້ນໆທີ່ສະແດງເມື່ອກົດຄ້າງໄວ້ ຫຼື ເມື່ອເລື່ອນໄປໃສ່
lt: Trumpas pranešimas, pateikiamas ilgai paspaudus arba užvedus pelės žymeklį
lv: Īss ziņojums, kas tiek parādīts, kad lietotājs nospiež elementu un to tur vai virza kursoru virs elementa.
mk: Кратка порака што се прикажува при долго притискање или местење на глушецот над елементот
ml: 'ദീർഘനേരം അമർത്തുക' അല്ലെങ്കിൽ 'ഹോവർ ചെയ്യുക' എന്നിവയുടെ മുകളിൽ പ്രദർശിപ്പിക്കുന്ന ചെറിയ സന്ദേശം
mn: Удаан дарах эсвэл зөөхөд үзүүлдэг богино мессеж
mr: प्रेस करून ठेवल्यावर किंवा फिरवल्यावर लहान मेसेज दाखवला जाईल
ms: Mesej ringkas dipaparkan apabila tekan lama atau tuding
my: ကြာရှည်စွာ ဖိထားလျှင် သို့မဟုတ် အပေါ်တွင် အုပ်လိုက်လျှင် မက်ဆေ့ဂျ်တိုတစ်စောင် ဖော်ပြပေးသည်
nb: En kort melding som vises ved et langt trykk eller når markøren holdes over
ne: केही बेरसम्म थिच्दा वा होभर गर्दा देखाउने छोटो सन्देश
pa: ਦਬਾਈ ਰੱਖਣ ਜਾਂ ਉੱਤੇ ਘੁੰਮਾਉਣ ਨਾਲ ਛੋਟਾ ਸੁਨੇਹਾ ਦਿਖਾਇਆ ਜਾਂਦਾ ਹੈ
pl: Krótki komunikat wyświetlany po najechaniu na element lub przytrzymaniu go
pt: Mensagem curta exibida ao tocar em um elemento e mantê-lo pressionado ou passar o cursor sobre ele
pt_pt: Mensagem curta apresentada ao manter premido ou ao colocar o cursor do rato sobre um elemento.
ro: Scurt mesaj afișat la apăsarea lungă sau la plasarea cursorului
ru: Короткое сообщение, которое появляется при долгом нажатии или наведении указателя
si: දිගු එබීමක හෝ උඩින් තබා ගැනීමක සංදර්ශනය වන කෙටි පණිවිඩය
sk: Krátka správa zobrazujúca sa po dlhom stlačení alebo umiestnení kurzora myši
sq: Mesazh i shkurtër që shfaqet pas një shtypjeje të gjatë ose një qëndrimi pezull
sr: Кратка порука која се приказује при дугом притиску или преласку курсором
sr_latn: Kratka poruka koja se prikazuje pri dugom pritisku ili prelasku kursorom
sv: Kort meddelande som visas när användaren trycker länge eller håller muspekaren över ett element
te: ఎక్కువసేపు నొక్కితే లేదా దాని మీద కర్సర్ ఉంచితే సంక్షిప్త మెసేజ్‌ ప్రదర్శించబడుతుంది
th: ข้อความสั้นๆ ที่แสดงเมื่อกดค้างหรือวางเมาส์เหนือองค์ประกอบ
tr: Uzun basmada veya fareyle üzerine gelmede görüntülenen kısa mesaj
uk: Коротке повідомлення, що з'являється під час утримування елемента або наведення на нього курсора
ur: لانگ پریس یا کرسر گھمانے پر مختصر پیغام ڈسپلے کر دیا گیا
uz: Bosib turganda yoki kursorni ustiga olib borganda chiqadigan qisqa xabar
vi: Hiện thông báo ngắn khi nhấn và giữ hoặc di chuột
zh_hk: 長按或將滑鼠游標懸停時顯示的短訊息
zu: Umlayezo omfushane uboniswa ekucindezeleni kwesikhathi eside noma ekuhambiseni phezulu
