Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoContainerTransformDescription
source: The container transform pattern is designed for transitions between UI elements that include a container. This pattern creates a visible connection between two UI elements
af: Die houeromskeppingpatroon is ontwerp vir oorgang tussen UI-elemente wat 'n houer insluit. Die patroon skep 'n sigbare verbinding tussen twee UI-elemente
am: የመያዣው መቀየር ስርዓተ-ጥለት መያዣን በሚያካትቱ ዩአይ አካላት መካከል ላሉት ሽግግሮች የተነደፈ ነው። ይህ ስርዓተ-ጥለት በሁለት ዩአይ አካላት መካከል የሚታይ ግንኙነትን ይፈጥራል
ar_eg: تم تصميم نمط تحويل الحاوية لتأثيرات الانتقال بين العناصر في واجهة المستخدم التي تتضمّن حاوية. ينشئ هذا النمط تأثير ربط مرئي بين عنصرين في واجهة المستخدم.
as: কন্টেইনাৰৰ ৰূপান্তৰণ আৰ্হিটো এটা কন্টেইনাৰ অন্তৰ্ভুক্ত হোৱা ইউআই উপাদানসমূহৰ মাজত হোৱা ট্ৰানজিশ্বনসমূহৰ বাবে ডিজাইন কৰা হৈছে। এই আৰ্হিটোৱে দুটা ইউআই উপাদানৰ মাজত এটা দৃশ্যমান সংযোগ স্থাপন কৰে
az: Konteyner transformasiya modeli konteyner ehtiva edən UI elementləri arasında keçid üçün nəzərdə tutulmuşdur. Bu model iki UI elementi arasında görünən bağlantı yaradır
be: Шаблон пераўтварэння кантэйнера распрацаваны для пераходаў паміж элементамі карыстальніцкага інтэрфейсу, якія ўтрымліваюць кантэйнер. Гэты шаблон стварае бачнае злучэнне паміж двума элементамі карыстальніцкага інтэрфейсу
bn: কন্টেনার যুক্ত আছে এমন UI এলিমেন্টের মধ্যে ট্রানজিশন করতে কন্টেনার পরিবর্তন করার প্যাটার্ন ডিজাইন করা হয়েছে। এই প্যাটার্ন দুটি UI এলিমেন্টের মধ্যে এমন কানেকশন তৈরি করে যা দেখা যায়
bs: Obrazac transformiranja spremnika je dizajniran za prijelaze između elemenata korisničkog interfejsa koji uključuju spremnik. Ovim obrascem se kreira vidljiva veza između dva elementa korisničkog interfejsa
ca: El patró de transformació de contenidors està dissenyat per a transicions entre elements de la IU que inclouen un contenidor. Aquest patró crea una connexió visible entre 2 elements de la IU.
da: Mønsteret til containeromdannelse er udviklet til overgange mellem brugerfladeelementer, der indeholder en container. Dette mønster opretter en synlig forbindelse mellem to brugerfladeelementer
es_ar: El patrón de transformación de contenedores está diseñado para hacer transiciones entre elementos de la IU que incluyen un contenedor. Este patrón crea una conexión visible entre dos elementos de la IU
et: Konteineri ülemineku muster on loodud konteinerit sisaldavate kasutajaliidese elementide vaheliste üleminekute jaoks. Muster loob kahe kasutajaliidese elemendi vahel nähtava sideme
eu: Edukiontzi bat daukaten erabiltzaile-interfazeen arteko trantsizioetarako diseinatuta dago edukiontzien itxuraldaketaren eredua. Ereduak ikusizko konexio bat sortzen du erabiltzaile-interfazeko bi elementuren artean.
fa: الگوی تبدیل محتوی برای انتقال بین عناصر واسط کاربر طراحی شده است که حاوی محتوی است. این الگو اتصالی نمایان بین دو عنصر واسط کاربر ایجاد می‌کند
fil: Idinisenyo ang pattern ng pag-iiba ng anyo ng container para sa mga transition sa pagitan ng mga element ng UI na may container. Gumagawa ang pattern na ito ng nakikitang koneksyon sa pagitan ng dalawang element ng UI
fr_ca: Le motif de transformation de conteneur est conçu pour les éléments d'IU qui comprennent un conteneur. Ce motif crée une connexion visible entre deux éléments d'IU
gl: O padrón de transformación de contedores está deseñado para transicións entre elementos da IU que inclúen un contedor. Este padrón crea unha conexión visible entre dous elementos da IU
gu: કન્ટેનર ટ્રાંસ્ફોર્મ પૅટર્નની રચના કન્ટેનર સમાવતા UI ઘટકોની વચ્ચે ટ્રાંઝિશન માટે થઈ છે. આ પૅટર્ન બે UI ઘટકોની વચ્ચે એક દેખાતું કનેક્શન બનાવે છે
he: דפוס הטרנספורמציה של הקונטיינר תוכנן למעברים בין רכיבי ממשק משתמש שמכילים קונטיינר. דפוס זה יוצר חיבור גלוי בין שני רכיבי ממשק משתמש
hi: कंटेनर ट्रांसफ़ॉर्म वाला पैटर्न, उन यूज़र इंटरफ़ेस (यूआई) एलिमेंट के बीच ट्रांज़िशन के लिए डिज़ाइन किया जाता है जिनमें कंटेनर शामिल होता है. इस पैटर्न से दो यूआई एलिमेंट के बीच, दिखने वाला कनेक्शन बनाने में मदद मिलती है
hu: A tároló átalakulása minta a tárolót tartalmazó UI-elemek közötti áttűnések megvalósítására szolgál. Ez a minta látható kapcsolatot hoz létre két UI-elem között
hy: Զետեղարանի փոխակերպումը նախատեսված է միջերեսի՝ զետեղարան պարունակող տարրերի միջև անցումների համար։ Այս էֆեկտը տեսանելի կապ է հաստատում միջերեսի երկու տարրերի միջև։
id: Pola transformasi container didesain untuk transisi antara elemen UI yang mencakup sebuah container. Pola ini menghasilkan hubungan yang terlihat di antara dua elemen UI
it: Il pattern di trasformazione del contenitore è progettato per le transizioni tra elementi UI che includono un contenitore. Questo pattern crea un collegamento visibile tra due elementi UI
ja: コンテナ変換パターンは、コンテナを含む UI 要素間の移行に使用することを目的としています。このパターンでは、2 つの UI 要素間に表示可能な接続が作成されます。
ka: კონტეინერის გარდაქმნის ნიმუში შექმნილია UI-ის ელემენტებს შორის გადასვლისთვის, რომლებიც კონტეინერს შეიცავს. ეს ნიმუში ხილულ კავშირს ამყარებს UI-ის ორ ელემენტს შორის
km: លំនាំ​នៃការប្រែក្លាយ​ទម្រង់ផ្ទុក​ត្រូវបានរចនាឡើង​សម្រាប់ការផ្លាស់ប្ដូរ​រវាងធាតុ UI ដែលមានទម្រង់ផ្ទុក។ លំនាំនេះ​បង្កើត​ការតភ្ជាប់​ដែលអាច​មើលឃើញ​រវាងធាតុ UI ពីរ
kn: ಕಂಟೈನರ್ ಪರಿವರ್ತನೆಯ ಪ್ಯಾಟರ್ನ್ ಅನ್ನು ಕಂಟೈನರ್ ಅನ್ನು ಒಳಗೊಂಡಿರುವ UI ಅಂಶಗಳ ನಡುವಿನ ಪರಿವರ್ತನೆಗಾಗಿ ವಿನ್ಯಾಸಗೊಳಿಸಲಾಗಿದೆ. ಇದು ಎರಡು UI ಅಂಶಗಳ ನಡುವೆ ಗೋಚರಿಸುವ ಸಂಪರ್ಕವನ್ನು ರಚಿಸುತ್ತದೆ
ko: 컨테이너 변환 패턴은 컨테이너가 포함된 UI 요소 간의 전환을 위해 디자인되었습니다. 이 패턴은 두 UI 요소 간 시각적인 연결을 만들어 줍니다.
ky: Контейнерди өзгөртүү шаблону колдонуучу интерфейсинин контейнер камтылган элементтерин өзгөртүү үчүн түзүлгөн. Бул шаблон колдонуучу интерфейсинин элементтеринин ортосундагы көрүнүктүү байланышты түзөт
lo: ຮູບແບບການປ່ຽນຕົວບັນຈຸແມ່ນອອກແບບມາສຳລັບການປ່ຽນລະຫວ່າງອົງປະກອບສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ທີ່ມີກ່ອງບັນຈຸໃດໜຶ່ງ. ຮູບແບບນີ້ຈະສ້າງການເຊື່ອມຕໍ່ທີ່ເບິ່ງເຫັນໄດ້ລະຫວ່າງອົງປະກອບສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ສອງອັນ
lt: Sudėtinio rodinio transformavimo šablonas skirtas NS elementams, apimantiems sudėtinį rodinį, perkelti. Naudojant šį šabloną sukuriamas matomas dviejų NS elementų ryšys
lv: Konteinera pārveidošana ir forma, kas paredzēta pārejai starp lietotāja saskarnes elementiem, kuros ir ietverti konteineri. Izmantojot šo pārejas formu, tiek izveidota redzama saikne starp diviem lietotāja saskarnes elementiem.
mk: Шемата за траснформирање контајнер е дизајнирана за транзиции меѓу елементи на корисничкиот интерфејс што вклучуваат контејнер. Шемава создава видлива врска помеѓу два елемента на корисничкиот интерфејс
ml: കണ്ടെയ്‌നർ ഉൾപ്പെടുന്ന UI ഘടകങ്ങൾ തമ്മിലുള്ള പരിവർത്തനത്തിനായാണ് കണ്ടെയ്‌നർ ട്രാൻസ്ഫോം പാറ്റേൺ രൂപകൽപ്പന ചെയ്‌തിരിക്കുന്നത്. രണ്ട് UI ഘടകങ്ങൾക്കിടയിൽ കാണാനാകുന്ന തരത്തിലുള്ള ഒരു കണക്ഷൻ ഈ പാറ്റേൺ സൃഷ്‌ടിക്കുന്നു
mn: Контейнерын хэлбэр өөрчлөх загварыг контейнерыг багтаадаг UI элементүүдийн хоорондын шилжилтэд зориулан бүтээсэн. Энэ загвар нь хоёр UI элементийн хооронд харагдахуйц холболт үүсгэдэг
mr: कंटेनर ट्रान्सफॉर्म पॅटर्न हा कंटेनरचा समावेश असलेल्या UI घटकांदरम्यान बदल करण्यासाठी तयार केला आहे. हा पॅटर्न दोन UI घटकांदरम्यान दृश्यमान कनेक्शन तयार करतो
ms: Corak pengubahan bekas direka bentuk untuk peralihan antara unsur UI yang merangkumi bekas. Corak ini mewujudkan hubungan yang boleh dilihat antara dua unsur UI
my: ကွန်တိန်နာ အသွင်ပြောင်းရန်ပုံစံကို ကွန်တိန်နာတစ်ခုပါသော UI အစိတ်အပိုင်းများကြားတွင် ကူးပြောင်းမှုများအတွက် ပုံစံထုတ်ထားခြင်းဖြစ်သည်။ ဤပုံစံများသည် UI အစိတ်အပိုင်းနှစ်ခုကြားတွင် မြင်နိုင်သောချိတ်ဆက်မှုတစ်ခုကို ဖန်တီးပေးသည်
nb: Forvandlingsmønsteret til beholderen er utviklet for overganger mellom elementer i brukergrensesnittet som inkluderer en beholder. Dette mønsteret oppretter en synlig forbindelse mellom to elementer i brukergrensesnittet.
ne: कन्टेनर ट्रान्सफर्म प्याटर्न कन्टेनर भएका UI एलिमेन्टहरूबिच हुने ट्रान्जिसनका लागि प्रयोग गर्न बनाइएको हो। यो प्याटर्नले दुई UI एलिमेन्टबिच देखिने खाले सम्बन्ध सिर्जना गर्छ
pa: ਕੰਟੇਨਰ ਰੁਪਾਂਤਰਣ ਪੈਟਰਨ UI ਤੱਤਾਂ ਦੇ ਵਿਚਾਲੇ ਅਜਿਹੇ ਪਰਿਵਰਤਨਾਂ ਲਈ ਡਿਜ਼ਾਈਨ ਕੀਤਾ ਗਿਆ ਹੈ ਜਿਸ ਵਿੱਚ ਕੰਟੇਨਰ ਸ਼ਾਮਲ ਹੈ। ਇਹ ਪੈਟਰਨ ਦੋ UI ਤੱਤਾਂ ਵਿਚਾਲੇ ਦਿਖਣਯੋਗ ਕਨੈਕਸ਼ਨ ਬਣਾਉਂਦਾ ਹੈ
pl: Wzorzec przekształcenia kontenera jest przeznaczony dla przejść między elementami interfejsu, które zawierają kontener. Tworzy on widoczne połączenie między dwoma elementami interfejsu.
pt: O padrão de transformação de contêiner foi projetado para transições entre elemento da IU que incluem um contêiner. Ele cria uma conexão visível entre dois elementos da IU
pt_pt: O padrão de transformação do contentor foi concebido para transições entre elementos da IU que incluem um contentor. Este padrão cria uma ligação visível entre dois elementos da IU.
ro: Modelul cu transformarea containerului este creat pentru tranziții între elementele IU care includ un container. Acest model creează o legătură vizibilă între două elemente IU.
ru: Преобразование с контейнером предназначено для переходов между элементами пользовательского интерфейса, содержащими контейнер. Этот эффект устанавливает видимую связь между двумя элементами интерфейса.
si: බහාලුම් පරිණාමන රටාව නිර්මාණය කර ඇත්තේ බහාලුමක් ඇතුළත් UI මූලාංග අතර සංක්‍රාන්ති සඳහාය. මෙම රටාව UI මූලාංග දෙකක් අතර දෘශ්‍ය සම්බන්ධතාවක් නිර්මාණය කරයි
sk: Vzor transformácie kontajnera je určený pre prechody medzi prvkami používateľského rozhrania, ktoré obsahujú kontajner. Tento vzor vytvára viditeľné spojenie medzi dvoma prvkami používateľského rozhrania
sq: Motivi i transformimit të kontejnerit është projektuar për kalime mes elementeve të ndërfaqes së përdoruesit që përfshijnë një kontejner. Ky motiv krijon një lidhje të dukshme mes dy elementeve të ndërfaqes së përdoruesit
sr: Шаблон трансформисања контејнера је направљен за прелаз између елемената корисничког интерфејса који садрже контејнер. Овај шаблон прави видљиву везу између два елемента корисничког интерфејса
sr_latn: Šablon transformisanja kontejnera je napravljen za prelaz između elemenata korisničkog interfejsa koji sadrže kontejner. Ovaj šablon pravi vidljivu vezu između dva elementa korisničkog interfejsa
sv: Mönstret med behållartransformering är avsett för övergångar mellan element i användargränssnittet där en behållare är inblandad. Mönstret ger en synlig koppling mellan två element i användargränssnittet
te: కంటైనర్ కలిగి ఉన్న UI మూలకాల మధ్య పరివర్తనలు చేయడానికి కంటైనర్ పరివర్తన ఆకృతి రూపొందించబడింది. ఈ ఆకృతి రెండు UI మూలకాల మధ్య కనిపించే కనెక్షన్‌ను క్రియేట్ చేస్తుంది
th: รูปแบบ "เปลี่ยนรูปแบบคอนเทนเนอร์" ออกแบบมาสำหรับการเปลี่ยนระหว่างองค์ประกอบ UI ที่มีคอนเทนเนอร์ รูปแบบนี้สร้างการเชื่อมต่อที่มองเห็นได้ระหว่างองค์ประกอบ UI 2 รายการ
tr: Kapsayıcı dönüşüm deseni, kapsayıcı içeren kullanıcı arayüzü öğeleri arasındaki geçişler için tasarlanmıştır. Bu desen, iki kullanıcı arayüzü öğesi arasında görünür bir bağlantı oluşturur
uk: Стиль "Перетворення контейнера" призначений для переходів між елементами інтерфейсу, які містять контейнер. Такий перехід створює візуальний зв'язок між двома елементами інтерфейсу.
ur: کنٹینر ٹرانسفارم پیٹرن UI عناصر کے درمیان ٹرانزٹزیشن کے لیے ڈیزائن کیا گیا ہے جس میں کنٹینر شامل ہے۔ یہ پیٹرن دو UI عناصر کے درمیان نظر آنے والا کنکشن تخلیق کرتا ہے
uz: Konteyner bilan oʻzgartirish konteynerdan iborat foydalanuvchi interfeysi elementlari orasidagi oʻtishlarga moʻljallangan. Bu effekt interfeysning ikki elementi orasiga koʻrinarli aloqa oʻrnatadi.
vi: Mẫu biến đổi vùng chứa được thiết kế cho quá trình chuyển đổi giữa các thành phần giao diện người dùng có vùng chứa. Mẫu này tạo ra sự kết nối dễ thấy giữa 2 thành phần giao diện người dùng
zh_hk: 容器變形模式用於轉移包含容器的使用者介面元素。此模式以視覺元素連結兩個不同使用者介面元素
zu: Iphethini yokuguqulwa kwesiqukathi idizayinelwe ukudlula phakathi kwama-elementi e-UI afaka isiqukathi. Le phethini idala ukuxhumana okubonakalayo phakathi kwama-elementi amabili e-UI

# demoContainerTransformModalBottomSheetTitle
source: Fade mode
af: Doofmodus
am: የአደብዝዝ ሁነታ
ar_eg: وضع التلاشي
as: অনুজ্জ্বল ম’ড
az: Solğunlaşma rejimi
be: Рэжым затухання
bn: অস্পষ্ট মোড
bs: Način rada za iščezavanje
ca: Mode d'atenuació
da: Fortoningstilstand
es_ar: Modo de atenuación
et: Hajutusrežiim
eu: Apurka desagertzearen modua
fa: حالت محو کردن
fr_ca: Mode Atténuation
gl: Modo de esvaecemento
gu: ઝાંખો મોડ
he: מצב 'להפוך לשקוף בהדרגה'
hi: फ़ेड मोड
hu: Halványítás mód
hy: Սահուն հայտնվելու կամ անհետանալու ռեժիմ
id: Mode memudar dan memperjelas
it: Modalità Dissolvenza
ja: フェードモード
ka: მილევის რეჟიმი
km: មុខងារ​លេចឡើង
kn: ಫೇಡ್ ಮೋಡ್
ko: 페이드 모드
ky: Бозоруу режими
lo: ໂໝດຈາງ
lt: Išblukimo režimas
lv: Pakāpeniskas parādīšanās/izzušanas režīms
mk: Режим на избледување
ml: ഫേഡ് മോഡ്
mn: Уусах горим
mr: फेड मोड
ms: Mod lenyap
my: အမှိန်မုဒ်
nb: Modus for å tone ut
ne: फेड मोड
pa: ਫੇਡ ਮੋਡ
pl: Tryb zanikania
pt: Modo esmaecer
pt_pt: Modo desvanecer
ro: Modul Afișare gradată/Estompare
ru: Режим плавного появления или исчезновения
si: මැකී යන ප්‍රකාරය
sk: Režim miznutia
sq: Modaliteti i zbehjes
sr: Режим постепеног појављивања и нестајања
sr_latn: Režim postepenog pojavljivanja i nestajanja
sv: Intoningsläge
te: ఫేడ్ మోడ్
th: โหมดจาง
tr: Şeffaflaştırma modu
uk: Режим появи та зникнення
ur: فیڈ موڈ
uz: Shaffoflashuv rejimi
vi: Chế độ làm mờ
zh_hk: 淡出模式
zu: Imodi yokufiphala

# demoContainerTransformTypeFade
source: FADE
af: DOOF
am: አደብዝዝ
ar_eg: التلاشي
as: অনুজ্জ্বল
az: SOLĞUNLAŞMA
be: ЗАТУХАННЕ
bn: অস্পষ্ট
bs: IŠČEZAVANJE
ca: ATENUACIÓ
da: FORTONING
es_ar: ATENUACIÓN
et: HAJUTUS
eu: APURKA DESAGERTZEA
fa: محو کردن
fr_ca: ATTÉNUATION
gl: ATENUAR
gu: ઝાંખો
he: להפוך לשקוף בהדרגה
hi: फ़ेड
hu: HALVÁNYÍTÁS
hy: ՍԱՀՈՒՆ ՀԱՅՏՆՎՈՒՄ ԿԱՄ ԱՆՀԵՏԱՑՈՒՄ
id: MEMPERJELAS
it: DISSOLVENZA
ja: フェード
ka: მილევა
km: លេច​ឡើង
kn: ಫೇಡ್
ko: 페이드
ky: БОЗОРУУ
lo: ຈາງ
lt: IŠBLUKIMAS
lv: PAKĀPENISKA PARĀDĪŠANĀS/IZZUŠANA
mk: ИЗБЛЕДУВАЊЕ
ml: ഫേഡ്
mn: УУСАХ
mr: फेड
ms: LENYAP
my: မှိန်ရန်
nb: TON UT
ne: फेड
pa: ਫੇਡ
pl: ZANIKANIE
pt: ESMAECER
pt_pt: DESVANECER
ro: AFIȘARE GRADATĂ/ESTOMPARE
ru: ПЛАВНОЕ ПОЯВЛЕНИЕ ИЛИ ИСЧЕЗНОВЕНИЕ
si: මැකී යාම
sk: MIZNUTIE
sq: ZBEHJE
sr: ПОСТЕПЕНО ПОЈАВЉИВАЊЕ И НЕСТАЈАЊЕ
sr_latn: POSTEPENO POJAVLJIVANJE I NESTAJANJE
sv: TONA IN/UT
te: ఫేడ్
th: จางลง
tr: ŞEFFAFLAŞTIRMA
uk: ПОЯВА ТА ЗНИКНЕННЯ
ur: فیڈ
uz: SHAFFOFLASHUV
vi: LÀM MỜ
zh_hk: 淡出
zu: UKUFIPHALA

# demoSharedYAxisAlbumTileDurationUnit
source: min
am: ደቂቃ
ar_eg: دقيقة
as: মিনিট
az: dəq
be: хв
bn: মিনিট
fa: دقیقه
fil: minuto
gu: મિનિટ
he: דקה
hi: मिनट
hu: p
hy: ր
id: mnt
ja: 分
ka: წთ
km: ន
kn: ನಿಮಿ
ko: 분
ky: мүн
lo: ນທ
mk: мин.
ml: മിനിറ്റ്
mn: минут
mr: मिनिट
my: မိနစ်
ne: मिनेट
pa: ਮਿੰਟ
ru: мин.
si: මිනි
sr: мин
te: నిమిషం
th: นาที
tr: dk.
uk: хв
ur: منٹ
uz: daqiqa
vi: phút
zh_hk: 分鐘
zu: iminithi

# demoMotionPlaceholderTitle
source: Title
af: Titel
am: ርዕስ
ar_eg: عنوان
as: শিৰোনাম
az: Ad
be: Назва
bn: নাম
bs: Naslov
ca: Títol
da: Titel
es_ar: Título
et: Pealkiri
eu: Izena
fa: عنوان
fil: Pamagat
fr_ca: Titre
gl: Título
gu: શીર્ષક
he: שם
hi: टाइटल
hu: Cím
hy: Անվանում
id: Judul
it: Titolo
ja: タイトル
ka: სათაური
km: ចំណងជើង
kn: ಶೀರ್ಷಿಕೆ
ko: 제목
ky: Аталышы
lo: ຫົວຂໍ້
lt: Pavadinimas
lv: Virsraksts
mk: Наслов
ml: പേര്
mn: Нэр
mr: शीर्षक
ms: Tajuk
my: ခေါင်းစဉ်
nb: Tittel
ne: शीर्षक
pa: ਸਿਰਲੇਖ
pl: Tytuł
pt: Título
pt_pt: Título
ro: Titlu
ru: Название
si: මාතෘකාව
sk: Názov
sq: Titulli
sr: Наслов
sr_latn: Naslov
sv: Namn
te: శీర్షిక
th: ชื่อ
tr: Başlık
uk: Назва
ur: عنوان
uz: Nomi
vi: Tiêu đề
zh_hk: 標題
zu: Isihloko

# demoSharedXAxisForgotEmailButtonText
source: FORGOT EMAIL?
af: E-POSADRES VERGEET?
am: ኢሜይል ረስተዋል?
ar_eg: هل نسيت البريد الإلكتروني؟
as: ইমেইল পাহৰিলে নেকি?
az: E-POÇTUNUZU UNUTMUSUNUZ?
be: ЗАБЫЛІ АДРАС ЭЛЕКТРОННАЙ ПОШТЫ?
bn: ইমেল আইডি ভুলে গেছেন?
bs: ZABORAVILI STE ADRESU E-POŠTE?
ca: HAS OBLIDAT L'ADREÇA ELECTRÒNICA?
da: HAR DU GLEMT MAILADRESSEN?
es_ar: ¿OLVIDASTE EL CORREO ELECTRÓNICO?
et: KAS UNUSTASITE E-POSTI AADRESSI?
eu: HELBIDE ELEKTRONIKOA AHAZTU DUZU?
fa: ایمیلتان را فراموش کرده‌اید؟
fil: NAKALIMUTAN ANG EMAIL?
fr_ca: ADRESSE DE COURRIEL OUBLIÉE?
gl: ESQUECICHES O CORREO ELECTRÓNICO?
gu: ઇમેઇલ ભૂલી ગયાં છો?
he: שכחת את כתובת האימייל?
hi: ईमेल पता भूल गए?
hu: ELFELEJTETTE AZ E-MAIL-CÍMÉT?
hy: ԷԼ․ ՀԱՍՑԵՆ ՄՈՌԱՑԵ՞Լ ԵՔ
id: LUPA EMAIL?
it: NON RICORDI L'INDIRIZZO EMAIL?
ja: メールアドレスをお忘れの場合
ka: დაგავიწყდათ ელფოსტა?
km: ភ្លេច​អ៊ីមែលឬ?
kn: ಇಮೇಲ್ ಮರೆತಿರುವಿರಾ?
ko: 이메일을 잊으셨나요?
ky: ЭЛЕКТРОНДУК ПОЧТА ДАРЕГИН УНУТУП КАЛДЫҢЫЗБЫ?
lo: ລືມ​ອີ​ເມວ​ບໍ?
lt: PAMIRŠOTE EL. PAŠTO ADRESĄ?
lv: VAI AIZMIRSĀT E-PASTA ADRESI?
mk: ЈА ЗАБОРАВИВТЕ ЛИ Е-ПОШТАТА?
ml: ഇമെയിൽ മറന്നോ?
mn: ИМЭЙЛЭЭ МАРТСАН УУ?
mr: ईमेल विसरलात का?
ms: TERLUPA E-MEL?
my: အီးမေးလ်ကို မေ့နေပါသလား။
nb: HAR DU GLEMT E-POSTADRESSEN?
ne: इमेल ठेगाना बिर्सनुभयो?
pa: ਕੀ ਈਮੇਲ ਭੁੱਲ ਗਏ ਹੋ?
pl: NIE PAMIĘTASZ ADRESU?
pt: ESQUECEU O E-MAIL?
pt_pt: ESQUECEU-SE DO EMAIL?
ro: AȚI UITAT ADRESA DE E-MAIL?
ru: ЗАБЫЛИ ЭЛЕКТРОННУЮ ПОЧТУ?
si: ඉ-තැපෑල අමතක වුණාද?
sk: ZABUDLI STE E‑MAIL?
sq: HARROVE ADRESËN E EMAIL-IT?
sr: ЗАБОРАВИЛИ СТЕ ИМЕЈЛ?
sr_latn: ZABORAVILI STE IMEJL?
sv: HAR DU GLÖMT DIN E-POSTADRESS?
te: ఈమెయిల్‌ను మర్చిపోయారా?
th: หากลืมอีเมล
tr: E-POSTA ADRESİNİZİ Mİ UNUTTUNUZ?
uk: ЗАБУЛИ ЕЛЕКТРОННУ АДРЕСУ?
ur: ای میل بھول گئے؟
uz: EMAIL MANZILINGIZNI UNUTDINGIZMI?
vi: BẠN QUÊN EMAIL?
zh_hk: 忘記電郵地址嗎？
zu: UKHOHLWE I-IMEYILI?

# demoMotionSmallPlaceholderSubtitle
source: Secondary
af: Sekondêr
am: ሁለተኛ
ar_eg: ثانوي
as: গৌণ
az: İkinci dərəcəli
be: Другасны
bn: সেকেন্ডারি
bs: Sekundarno
ca: Secundari
da: Sekundær
es_ar: Secundario
et: Teisene
eu: Bigarrena
fa: ثانویه
fil: Pangalawa
fr_ca: Secondaire
gl: Secundario
gu: ગૌણ
he: משני
hi: छोटा किया गया सबटाइटल टेक्स्ट
hu: Másodlagos
hy: Լրացուցիչ
id: Sekunder
it: Secondario
ja: サブ
ka: დამხმარე
km: អក្សររត់
kn: ದ್ವಿತೀಯ
ko: 보조
ky: Кошумча
lo: ສຳຮອງ
lt: Antrinis
lv: Sekundārais
mk: Секундарен
ml: ദ്വിതീയം
mn: Хоёр дахь мөр
mr: दुय्यम
ms: Sekunder
my: ဒုတိယ ဦးစားပေး
nb: Sekundær
ne: छोट्याइएको सबटाइटलको पाठ
pa: ਸੈਕੰਡਰੀ
pl: Dodatkowy
pt: Secundário
pt_pt: Secundário
ro: Secundar
ru: Дополнительно
si: ද්විතීයික
sk: Sekundárne
sq: Dytësor
sr: Секундарнo
sr_latn: Sekundarno
sv: Sekundärt
te: రెండవ
th: รอง
tr: İkincil
uk: Другорядний
ur: ثانوی
uz: Qoʻshimcha
vi: Thứ cấp
zh_hk: 次行
zu: Okwesibili

# demoMotionDetailsPageTitle
source: Details Page
af: Besonderhedebladsy
am: የዝርዝሮች ገፅ
ar_eg: صفحة تفاصيل
as: সবিশেষ পৃষ্ঠা
az: Detallar Səhifəsi
be: Старонка падрабязных звестак
bn: বিবরণের পৃষ্ঠা
bs: Stranica s detaljima
ca: Pàgina de detalls
da: Infoside
es_ar: Página de detalles
et: Üksikasjade leht
eu: Xehetasunen orria
fa: صفحه جزئیات
fil: Page ng Mga Detalye
fr_ca: Page de renseignements
gl: Páxina de detalles
gu: વિગતોનું પેજ
he: דף הפרטים
hi: ज़्यादा जानकारी वाला पेज
hu: Részletek oldal
hy: Մանրամասների էջ
id: Halaman Detail
it: Pagina dei dettagli
ja: 詳細ページ
ka: დეტალების გვერდი
km: ទំព័រ​ព័ត៌មាន​លម្អិត
kn: ವಿವರಗಳ ಪುಟ
ko: 세부정보 페이지
ky: Чоо-жайынын баракчасы
lo: ໜ້າລາຍລະອຽດ
lt: Puslapis „Išsami informacija“
lv: Detalizētās informācijas lapa
mk: Страница со детали
ml: വിശദാംശങ്ങൾ പേജ്
mn: Дэлгэрэнгүй мэдээллийн хуудас
mr: तपशीलांचे पेज
ms: Halaman Butiran
my: အသေးစိတ် စာမျက်နှာ
nb: Detaljside
ne: विवरण पृष्ठ
pa: ਵੇਰਵੇ ਦਾ ਪੰਨਾ
pl: Strona z informacjami
pt: Página de detalhes
pt_pt: Página de detalhes
ro: Pagina cu detalii
ru: Страница сведений
si: විස්තර පිටුව
sk: Podrobná stránka
sq: Faqja e detajeve
sr: Страница са детаљима
sr_latn: Stranica sa detaljima
sv: Informationssida
te: వివరాల పేజీ
th: หน้ารายละเอียด
tr: Ayrıntılar Sayfası
uk: Сторінка з інформацією
ur: تفصیلات کا صفحہ
uz: Tafsilotlar sahifasi
vi: Trang chi tiết
zh_hk: 詳情頁面
zu: Ikhasi Lemininingwane

# demoMotionListTileTitle
source: List item
af: Lysitem
am: የዝርዝር ንጥል
ar_eg: عنصر قائمة
as: সূচীৰ বস্তু
az: Siyahı elementi
be: Элемент спіса
bn: তালিকার আইটেম
bs: Stavka liste
ca: Element de llista
da: Listepunkt
es_ar: Elemento de la lista
et: Loendiüksus
eu: Zerrendako elementua
fa: مورد فهرست
fil: Item sa listahan
fr_ca: Élément de liste
gl: Elemento de lista
gu: સૂચિ આઇટમ
he: פריט ברשימה
hi: आइटम की सूची
hu: Listaelem
hy: Ցանկի կետ
id: Item daftar
it: Voce elenco
ja: リストアイテム
ka: სიის ერთეული
km: ធាតុក្នុងបញ្ជី
kn: ಪಟ್ಟಿ ಐಟಂ
ko: 목록 항목
ky: Тизмедеги нерсе
lo: ລາຍການລາຍຊື່
lt: Sąrašo elementas
lv: Saraksta vienums
mk: Ставка во список
ml: ലിസ്‌റ്റ് ഇനം
mn: Жагсаалтын зүйл
mr: सूची आयटम
ms: Item senarai
my: စာရင်းပါ အရာ
nb: Listeelement
ne: सूचीमा रहेको वस्तु
pa: ਸੂਚੀ ਆਈਟਮ
pl: Element listy
pt: Item da lista
pt_pt: Item de lista
ro: Articol din listă
ru: Пункт списка
si: ලැයිස්තු අයිතමය
sk: Položka zoznamu
sq: Artikulli i listës
sr: Ставка листе
sr_latn: Stavka liste
sv: Post i lista
te: లిస్ట్ ఐటెమ్
th: รายการย่อย
tr: Liste öğesi
uk: Пункт списку
ur: فہرست آئٹم
uz: Roʻyxat bandi
vi: Mục danh sách
zh_hk: 清單項目
zu: Into yohlu
