Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoPickerSubtitle
source: iOS-style pickers
af: Kiesers in iOS-styl
am: የiOS-ቅጥ መራጮች
ar_eg: أدوات الاختيار بنمط iOS
as: iOS-শৈলী বাছনি কৰোঁতা
az: iOS üslubunda seçicilər
be: Інструменты выбару ў стылі iOS
bn: iOS-স্টাইল বাছাইকারী
bs: Odabirači u stilu iOS-a
ca: Selectors d'estil iOS
da: Vælgere i iOS-format
es_ar: Selectores similares a los de iOS
et: iOS-stiilis valikuvidinad
eu: iOS estiloko hautatzailea
fa: انتخاب‌گران سبک iOS
fil: Mga picker na may istilong pang-iOS
fr_ca: Sélecteurs de style iOS
gl: Selectores de tipo iOS
gu: iOS-શૈલીના પિકર
he: בוררים בסגנון iOS
hi: iOS-स्टाइल पिकर
hu: iOS-stílusú választók
hy: iOS-ի ոճով ընտրիչներ
id: Alat pilih bergaya iOS
it: Selettori in stile iOS
ja: iOS スタイルの選択ツール
ka: iOS-სტილის ამომრჩევი
km: ផ្ទាំងជ្រើសរើស​ដែលមានរចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿಯ ಪಿಕರ್‌ಗಳು
ko: iOS 스타일 선택 도구
ky: iOS стилиндеги тандагыч
lo: ຕົວເລືອກຮູບແບບ iOS
lt: „iOS“ stiliaus rinkikliai
lv: iOS stila atlasītāji
mk: Виџети за избор во iOS-стил
ml: iOS-സ്റ്റൈൽ പിക്കറുകൾ
mn: iOS-загварын сонгогчид
mr: iOS च्या शैलीतील पिकर
ms: Pemilih gaya iOS
my: iOS-ပုံစံ ရွေးချယ်ရေးစနစ်များ
nb: Velgere i iOS-stil
ne: iOS शैलीका पिकरहरू
pa: iOS-ਸਟਾਈਲ ਚੋਣਕਾਰ
pl: Selektory w stylu iOS
pt: Seletores no estilo do iOS
pt_pt: Selecionadores ao estilo do iOS
ro: Selectoare de stil iOS
ru: Окна выбора в стиле iOS
si: iOS-විලාසයේ තෝරක
sk: Výbery v štýle systému iOS
sq: Zgjedhësit i stilit të iOS
sr: Бирачи у iOS стилу
sr_latn: Birači u iOS stilu
sv: Väljare i iOS-stil
te: iOS-స్టయిల్ పికర్‌లు
th: เครื่องมือเลือกรูปแบบ iOS
tr: iOS stili seçiciler
uk: Засоби вибору в стилі iOS
ur: iOS طرز کے منتخب کنندگان
uz: iOS uslubidagi tanlash oynasi
vi: Bộ chọn kiểu iOS
zh_hk: iOS 樣式點選器
zu: Isikhi Sesitayela se-iOS

# demoCupertinoPickerTitle
source: Pickers
af: Kiesers
am: መራጮች
ar_eg: أدوات اختيار الوقت
as: বাছনি কৰোঁতাসকল
az: Seçicilər
be: Інструменты выбару
bn: চয়নকারী
bs: Birači
ca: Selectors
da: Vælgere
es_ar: Selectores
et: Valijad
eu: Hautatzaileak
fa: انتخابگر
fil: Mga Picker
fr_ca: Sélecteurs
gl: Selectores
gu: પિકર
he: בוררים
hi: तारीख और समय चुनने वाले टूल
hu: Választók
hy: Ընտրիչներ
id: Alat Pilih
it: Selettori
ja: 選択ツール
ka: ამომრჩევები
km: ផ្ទាំងជ្រើសរើស
kn: ಪಿಕರ್‌ಗಳು
ko: 선택도구
ky: Тандагычтар
lo: ຕົວເລືອກ
lt: Rinkikliai
lv: Atlasītāji
mk: Избирачи
ml: പിക്കറുകൾ
mn: Сонгогч
mr: पिकर
ms: Pemilih
my: ရွေးချယ်ရေးစနစ်များ
nb: Velgere
ne: चयनकर्ता
pa: ਚੋਣਕਾਰ
pl: Selektory
pt: Seletores
pt_pt: Selecionadores
ro: Selectori
ru: Окна выбора
si: තෝරක
sk: Výbery
sq: Zgjedhësit
sr: Бирачи
sr_latn: Birači
sv: Väljare
te: పికర్‌లు
th: เครื่องมือเลือก
tr: Seçiciler
uk: Засоби вибору
ur: تاریخ اور وقت منتخب کرنے والے ٹولز
uz: Tanlash oynasi
vi: Bộ chọn
zh_hk: 點選器
zu: Izikhi

# dataTableRowWithHoney
source: {value} with honey
af: {value} met heuning
am: {value} ከማር ጋር
ar_eg: {value} بالعسل
as: মৌযুক্ত {value}
az: Ballı {value}
be: {value} з мёдам
bn: মধু সহ {value}
bs: {value} s medom
ca: {value} amb mel
da: {value} med honning
es_ar: {value} con miel
et: {value} koos meega
eu: {value} eztiarekin
fa: {value} با عسل
fil: {value} na may honey
fr_ca: {value} avec du miel
gl: {value} con mel
gu: મધની સાથે {value}
he: {value} עם דבש
hi: {value} शहद के साथ
hu: {value} mézzel
hy: {value} մեղրով
id: {value} dengan madu
it: {value} con miele
ja: {value}（ハチミツ使用）
ka: {value} თაფლით
km: {value} មានទឹកឃ្មុំ
kn: {value} ಜೇನುತುಪ್ಪ ಹೊಂದಿದೆ
ko: 꿀이 든 {value}
ky: Бал кошулган {value}
lo: {value} ໃສ່ນ້ຳເຜິ້ງ
lt: {value} su medumi
lv: {value} ar medu
mk: {value} со мед
ml: {value} തേൻ ചേർത്തത്
mn: Зөгийн балтай {value}
mr: मधाचा समावेश असलेले {value}
ms: {value} bermadu
my: ပျားရည်နှင့် {value}
nb: {value} med honning
ne: महसहितको {value}
pa: ਸ਼ਹਿਦ ਨਾਲ {value}
pl: {value} z miodem
pt: {value} com mel
pt_pt: {value} com mel
ro: {value} cu miere
ru: {value} с медом
si: පැණි සහිත {value}
sk: {value} s medom
sq: {value} me mjaltë
sr: {value} са медом
sr_latn: {value} sa medom
sv: {value} med honung
te: తేనెతో {value}
th: {value} ใส่น้ำผึ้ง
tr: Ballı {value}
uk: {value} з медом
ur: شہد کے ساتھ {value}
uz: {value} asal bilan
vi: {value} phủ mật ong
zh_hk: {value} 伴蜜糖
zu: {value} enoju

# cardsDemoTravelDestinationCity2
source: Chettinad
am: ቼቲናድ
ar_eg: تشيتيناد
as: চেটিনাদ
az: Çettinad
be: Чэцінад
bn: চেট্টিনাড
bs: Chettinada
fa: چتیناد
gu: ચેટ્ટીનાડ
he: צ'טינאד
hi: चेट्टीनाड
hy: Չետինադ
ja: チェティナード
ka: ჩეტინადი
km: ចិត្តធីណាដ
kn: ಚೆಟ್ಟಿನಾಡ್
ko: 체티나드
ky: Четтинад
lo: ເຊຕິນາດ
lt: Četinadas
lv: Četinada
mk: Четинад
ml: ചെട്ടിനാട്
mn: Четтинад хот
mr: चेट्टीनाड
my: ချတ်တီနတ်
ne: चेट्टिनाड
pa: ਚੇਟੀਨਾਡ
ru: Четтинад
si: චෙට්ටිනාඩ්
sq: Çetinad
sr: Четинад
sr_latn: Četinad
te: చెట్టినాడ్
th: เมืองเชตินาถ
uk: Четтінад
ur: چیتیناد
zh_hk: 切蒂納德
zu: E-Chettinad

# bannerDemoResetText
source: Reset the banner
af: Stel die banier terug
am: ሰንደቁን ዳግም ያስጀምሩት
ar_eg: إعادة ضبط البانر
as: বেনাৰখন ৰিছেট কৰক
az: Banneri sıfırlayın
be: Скінуць банер
bn: ব্যানার রিসেট করুন
bs: Poništi prikaz banera
ca: Restableix el bàner
da: Nulstil banneret
es_ar: Restablecer el banner
et: Lähtesta bänner
eu: Berrezarri banda
fa: بازنشانی برنما
fil: I-reset ang banner
fr_ca: Réinitialiser la bannière
gl: Restablecer o báner
gu: બૅનરને રીસેટ કરો
he: איפוס של הבאנר
hi: बैनर रीसेट करें
hu: Üzenetszalag visszaállítása
hy: Վերակայել ազդերիզը
id: Reset banner
it: Reimposta il banner
ja: バナーをリセット
ka: ბანერის გადაყენება
km: កំណត់​ផ្ទាំងផ្សាយ​ពាណិជ្ជកម្ម​ឡើងវិញ
kn: ಬ್ಯಾನರ್ ಮರುಹೊಂದಿಸಿ
ko: 배너 재설정
ky: Көрнөк-жарнакты баштапкы абалга келтирүү
lo: ຣີເຊັດແບນເນີ
lt: Iš naujo nustatyti reklamjuostę
lv: Atiestatīt joslu
mk: Ресетирај го рекламниот натпис
ml: ബാനർ റീസെറ്റ് ചെയ്യുക
mn: Баннерыг шинэчлэх
mr: बॅनर रीसेट करा
ms: Tetapkan semula sepanduk
my: နဖူးစည်းကို ပြင်ဆင်သတ်မှတ်ရန်
nb: Tilbakestill banneret
ne: ब्यानर रिसेट गर्नुहोस्
pa: ਬੈਨਰ ਰੀਸੈੱਟ ਕਰੋ
pl: Zresetuj baner
pt: Redefinir banner
pt_pt: Repor a faixa
ro: Resetați bannerul
ru: Показать баннер ещё раз
si: බැනරය යළි සකසන්න
sk: Resetovať banner
sq: Rivendos banderolën
sr: Ресетуј банер
sr_latn: Resetuj baner
sv: Återställ bannern
te: బ్యానర్‌ను రీసెట్ చేయండి
th: รีเซ็ตแบนเนอร์
tr: Banner'ı sıfırla
uk: Скинути банер
ur: بینر ری سیٹ کریں
uz: Bannerni yana bir marta chiqarish
vi: Đặt lại biểu ngữ
zh_hk: 重設橫額
zu: Setha kabusa isibhengenzo

# bannerDemoMultipleText
source: Multiple actions
af: Veelvuldige handelinge
am: በርካታ እርምጃዎች
ar_eg: إعدادات متعددة
as: একাধিক কাৰ্য
az: Bir neçə əməliyyat
be: Некалькі дзеянняў
bn: বহুমুখী অ্যাকশন
bs: Više radnji
ca: Diverses accions
da: Flere handlinger
es_ar: Varias acciones
et: Mitu toimingut
eu: Ekintza bat baino gehiago
fa: چند کنش
fil: Maraming pagkilos
fr_ca: Plusieurs actions
gl: Varias accións
gu: એકથી વધુ ક્રિયાઓ
he: פעולות מרובות
hi: कई कार्रवाइयां
hu: Több művelet
hy: Մի քանի գործողություն
id: Beberapa tindakan
it: Più azioni
ja: 複数のアクション
ka: მრავლობითი მოქმედება
km: សកម្មភាព​ច្រើន
kn: ಬಹು ಕ್ರಿಯೆಗಳು
ko: 여러 작업
ky: Бир нече аракет
lo: ຄຳສັ່ງຫຼາຍອັນ
lt: Keli veiksmai
lv: Vairākas darbības
mk: Повеќе дејства
ml: ഒന്നിലധികം നടപടികൾ
mn: Олон үйлдэл
mr: एकाहून अधिक कृती
ms: Pelbagai tindakan
my: အမျိုးစုံသော လုပ်ဆောင်ချက်များ
nb: Flere handlinger
ne: एकभन्दा धेरै कारबाहीहरू
pa: ਇੱਕ ਤੋਂ ਵੱਧ ਕਾਰਵਾਈਆਂ
pl: Wiele działań
pt: Várias ações
pt_pt: Várias ações
ro: Mai multe acțiuni
ru: Несколько действий
si: බහුවිධ ක්‍රියා
sk: Viacero akcií
sq: Shumë veprime
sr: Више радњи
sr_latn: Više radnji
sv: Flera åtgärder
te: అనేక చర్యలు
th: การดำเนินการหลายรายการ
tr: Birden çok işlem
uk: Кілька дій
ur: متعدد کارروائیاں
uz: Bir nechta amal
vi: Nhiều hành động
zh_hk: 多項操作
zu: Izenzo eziningi

# bannerDemoLeadingText
source: Leading Icon
af: Eerste ikoon
am: መሪ አዶ
ar_eg: رمز سابق
as: শীৰ্ষ স্থানত থকা আইকন
az: Əsas ikona
be: Пачатковы значок
bn: লিডিং আইকন
bs: Početna ikona
ca: Icona inicial
da: Indledende ikon
es_ar: Ícono inicial
et: Juhtikoon
eu: Aurreko ikonoa
fa: نماد ابتدایی
fil: Nangungunang Icon
fr_ca: Icône précédant le texte
gl: Icona que precede o texto
gu: લીડિંગ આઇકન
he: סמל מוביל
hi: लीडिंग आइकॉन
hu: Bevezető ikon
hy: Առաջատար պատկերակ
id: Ikon Utama
it: Icona iniziale
ja: 先頭のアイコン
ka: წამყვანი ხატულა
km: រូបតំណាងនៅពីមុខ
kn: ಲೀಡಿಂಗ್ ಐಕಾನ್
ko: 앞부분 아이콘
ky: Көрсөтмө сүрөтчөсү
lo: ໄອຄອນນຳ
lt: Pradinė piktograma
lv: Sākuma ikona
mk: Икона на почетокот
ml: മുൻനിര ഐക്കൺ
mn: Эхлэх дүрс тэмдэг
mr: सुरुवातीचा आयकन
ms: Ikon Mendahulu
my: ရှေ့ပြေးသင်္ကေတ
nb: Ledende ikon
ne: सुरुको आइकन
pa: ਪ੍ਰਮੁੱਖ ਪ੍ਰਤੀਕ
pl: Ikona główna
pt: Ícone principal
pt_pt: Ícone principal
ro: Pictograma Principal
ru: Значок перед текстом
si: යොමු අයිකනය
sk: Začiatočná ikona
sq: Ikona kryesore
sr: Почетна икона
sr_latn: Početna ikona
sv: Ikon före
te: ఆధిక్యత చిహ్నం
th: ไอคอนแสดงอันดับที่นำอยู่
tr: Ön Simge
uk: Значок на початку
ur: اشاراتی آئیکن
uz: Matn ustidagi belgi
vi: Biểu tượng hàng đầu
zh_hk: 開頭圖示
zu: Isithonjana esiholayo

source: DISMISS
af: MAAK TOE
am: አሰናብት
ar_eg: رفض
as: অগ্ৰাহ্য কৰক
az: RƏDD EDİN
be: АДХІЛІЦЬ
bn: খারিজ করুন
bs: ODBACI
ca: IGNORA
da: LUK
es_ar: DESCARTAR
et: LOOBU
eu: BAZTERTU
fa: رد کردن
fil: I-DISMISS
fr_ca: IGNORER
gl: IGNORAR
gu: છોડી દો
he: סגירה
hi: खारिज करें
hu: ELVETÉS
hy: ՓԱԿԵԼ
id: TUTUP
it: IGNORA
ja: 閉じる
ka: დახურვა
km: ច្រានចោល
kn: ವಜಾಗೊಳಿಸಿ
ko: 닫기
ky: ЧЕТКЕ КАГУУ
lo: ປິດໄວ້
lt: ATSISAKYTI
lv: NERĀDĪT
mk: ОТФРЛИ
ml: ഡിസ്‌മിസ് ചെയ്യുക
mn: ҮЛ ХЭРЭГСЭХ
mr: डिसमिस करा
ms: KETEPIKAN
my: ပယ်ရန်
nb: AVVIS
ne: हटाउनुहोस्
pa: ਖਾਰਜ ਕਰੋ
pl: ZAMKNIJ
pt: DISPENSAR
pt_pt: IGNORAR
ro: ÎNCHIDEȚI
ru: ЗАКРЫТЬ
si: ඉවත ලන්න
sk: ZAVRIEŤ
sq: HIQ
sr: ОДБАЦИ
sr_latn: ODBACI
sv: STÄNG
te: తీసివేయండి
th: ปิด
tr: KAPAT
uk: ЗАКРИТИ
ur: مسترد کریں
uz: YOPISH
vi: BỎ QUA
zh_hk: 關閉
zu: CASHISA

# cardsDemoTappable
source: Tappable
af: Tikbaar
am: መታ ሊደረግ የሚችል
ar_eg: قابل للنقر عليه
as: টিপিব পৰা
az: Toxunula bilən
be: Можна націснуць
bn: ট্যাপ করতে পারেন
bs: Moguće je dodirnuti
ca: Es pot tocar
da: Kan trykkes på
es_ar: Se puede presionar
et: Puudutatav
eu: Sakatu egin daiteke
fa: قابل ضربه زدن
fil: Nata-tap
fr_ca: Peut être touché
gl: Pódese tocar
gu: ટૅપ કરવા યોગ્ય
he: ניתן להקשה
hi: टैप किया जा सकने वाला बटन
hu: Rá lehet koppintani
hy: Հպելի
id: Dapat diketuk
it: Abilitato per il tocco
ja: タップ可能
ka: შეხებადი
km: អាចចុចបាន
kn: ಟ್ಯಾಪ್ ಮಾಡಬಹುದಾದ
ko: 탭 가능
ky: Таптап коюу мүмкүн
lo: ສາມາດແຕະໄດ້
lt: Liečiamasis
lv: Var pieskarties
mk: Може да се допре
ml: ടാപ്പ് ചെയ്യാവുന്നത്
mn: Товших боломжтой
mr: टॅप करण्‍यायोग्य
ms: Boleh ketik
my: တို့နိုင်သည်
nb: Kan trykkes
ne: ट्याप गर्न मिल्ने
pa: ਟੈਪ ਕਰਨਯੋਗ
pl: Przycisk do kliknięcia
pt: Tocável
pt_pt: Tátil
ro: Poate fi atins
ru: Нажмите
si: ටැප් කළ හැකි
sk: Môžete klepnúť
sq: Mund të trokitet
sr: Може да се додирне
sr_latn: Može da se dodirne
sv: Tryckbar
te: నొక్కగలిగేది
th: แตะได้
tr: Dokunulabilen
uk: Можна натискати
ur: تھپتھپانے کے قابل بٹن
uz: Bosing
vi: Có thể nhấn
zh_hk: 可輕按
zu: Iyathepheka

# cardsDemoExplore
source: Explore
af: Verken
am: አስስ
ar_eg: معرفة المزيد
as: অন্বেষণ কৰক
az: Araşdırın
be: Агляд
bn: কী কী আছে দেখুন
bs: Istraži
ca: Explora
da: Udforsk
es_ar: Explorar
et: Avastage
eu: Arakatu
fa: کاوش
fil: I-explore
fr_ca: Explorer
gl: Explorar
gu: શોધખોળ કરો
he: גילוי וחיפוש
hi: ज़्यादा जानें
hu: Felfedezés
hy: Իմանալ ավելին
id: Temukan
it: Esplora
ja: 詳細
ka: გაცნობა
km: រុករក
kn: ಎಕ್ಸ್‌ಪ್ಲೋರ್‌‌
ko: 살펴보기
ky: Изилдөө
lo: ສຳຫຼວດ
lt: Naršyti
lv: Izpētīt
mk: Истражете
ml: അടുത്തറിയുക
mn: Судлах
mr: एक्सप्लोर करा
ms: Teroka
my: လေ့လာရန်
nb: Utforsk
ne: अन्वेषण गर्नुहोस्
pa: ਪੜਚੋਲ ਕਰੋ
pl: Zobacz więcej
pt: Confira
pt_pt: Explorar
ro: Explorați
ru: Обзор
si: ගවේෂණය කරන්න
sk: Preskúmať
sq: Eksploro
sr: Истражите
sr_latn: Istražite
sv: Utforska
te: అన్వేషించు
th: สำรวจ
tr: Keşfet
uk: Огляд
ur: دریافت کریں
uz: Ochish
vi: Khám phá
zh_hk: 探索
zu: Hlola

# cardsDemoExploreSemantics
source: Explore {destinationName}
af: Verken {destinationName}
am: አስስ {destinationName}
ar_eg: معرفة المزيد عن {destinationName}
as: {destinationName} অন্বেষণ কৰক
az: {destinationName} məkanını araşdırın
be: Азнаёмцеся з: {destinationName}
bn: দেখুন {destinationName}
bs: Istražite: {destinationName}
ca: Explora {destinationName}
da: Udforsk {destinationName}
es_ar: Explorar {destinationName}
et: Avastage sihtkohta {destinationName}
eu: Arakatu {destinationName}
fa: کاوش {destinationName}
fil: I-explore ang {destinationName}
fr_ca: Explorer {destinationName}
gl: Explorar: {destinationName}
gu: {destinationName}ની શોધખોળ કરો
he: גילוי וחיפוש {destinationName}
hi: {destinationName} के बारे में ज़्यादा जानें
hu: {destinationName} felfedezése
hy: {destinationName}․ իմանալ ավելին
id: Jelajahi {destinationName}
it: Esplora {destinationName}
ja: {destinationName}を探索
ka: გაიცანით {destinationName}
km: រុករក {destinationName}
kn: ಎಕ್ಸ್‌ಪ್ಲೋರ್‌‌ {destinationName}
ko: {destinationName} 살펴보기
ky: Төмөнкүнү изилдөө: {destinationName}
lo: ສຳຫຼວດ {destinationName}
lt: Naršyti: {destinationName}
lv: Izpētīt: {destinationName}
mk: Истражете го местото {destinationName}
ml: {destinationName} അടുത്തറിയുക
mn: {destinationName}-г судлах
mr: एक्सप्लोर करा {destinationName}
ms: Teroka {destinationName}
my: {destinationName} ကို လေ့လာရန်
nb: Utforsk {destinationName}
ne: {destinationName} अन्वेषण गर्नुहोस्
pa: {destinationName} ਦੀ ਪੜਚੋਲ ਕਰੋ
pl: {destinationName} – zobacz to miejsce
pt: Confira o destino: {destinationName}
pt_pt: Explorar {destinationName}
ro: Explorați {destinationName}
ru: Посмотреть: {destinationName}
si: {destinationName} ගවේෂණය කරන්න
sk: Preskúmať {destinationName}
sq: Eksploro {destinationName}
sr: Истражите: {destinationName}
sr_latn: Istražite: {destinationName}
sv: Utforska {destinationName}
te: '{destinationName}'ను అన్వేషించు
th: สำรวจ {destinationName}
tr: Keşfedin: {destinationName}
uk: Ознайомтеся з таким місцем: {destinationName}
ur: دریافت کریں {destinationName}
uz: Ochish: {destinationName}
vi: Khám phá {destinationName}
zh_hk: 探索 {destinationName}
zu: Hlola i-{destinationName}

# cardsDemoShareSemantics
source: Share {destinationName}
af: Deel {destinationName}
am: አጋራ {destinationName}
ar_eg: مشاركة {destinationName}
as: {destinationName} শ্বেয়াৰ কৰক
az: {destinationName} məkanını paylaşın
be: Абагульце: {destinationName}
bn: শেয়ার করুন {destinationName}
bs: Dijelite: {destinationName}
ca: Comparteix {destinationName}
da: Del {destinationName}
es_ar: Compartir {destinationName}
et: Jagage sihtkohta {destinationName}
eu: Partekatu {destinationName}
fa: هم‌رسانی {destinationName}
fil: Ibahagi ang {destinationName}
fr_ca: Partager {destinationName}
gl: Compartir: {destinationName}
gu: {destinationName}ને શેર કરો
he: שיתוף {destinationName}
hi: {destinationName} की जानकारी शेयर करें
hu: {destinationName} megosztása
hy: {destinationName}․ կիսվել
id: Bagikan {destinationName}
it: Condividi {destinationName}
ja: {destinationName}を共有
ka: გააზიარეთ {destinationName}
km: ចែករំលែក {destinationName}
kn: ಹಂಚಿಕೊಳ್ಳಿ {destinationName}
ko: {destinationName} 공유하기
ky: Төмөнкүнү бөлүшүү: {destinationName}
lo: ແບ່ງປັນ {destinationName}
lt: Bendrinti: {destinationName}
lv: Kopīgot: {destinationName}
mk: Споделете го местото {destinationName}
ml: {destinationName} പങ്കിടുക
mn: {destinationName}-г хуваалцах
mr: शेअर करा {destinationName}
ms: Kongsi {destinationName}
my: {destinationName} ကို မျှဝေရန်
nb: Del {destinationName}
ne: {destinationName} सेयर गर्नुहोस्
pa: {destinationName} ਨੂੰ ਸਾਂਝਾ ਕਰੋ
pl: {destinationName} – udostępnij informacje o tym miejscu
pt: Compartilhar o destino: {destinationName}
pt_pt: Partilhar {destinationName}
ro: Trimiteți {destinationName}
ru: Поделиться: {destinationName}
si: {destinationName} බෙදා ගන්න
sk: Zdieľať {destinationName}
sq: Ndaj {destinationName}
sr: Делите: {destinationName}
sr_latn: Delite: {destinationName}
sv: Dela {destinationName}
te: '{destinationName}'ను షేర్ చేయి
th: แชร์ {destinationName}
tr: Paylaşın: {destinationName}
uk: Поділіться таким місцем: {destinationName}
ur: اشتراک کریں {destinationName}
uz: Ulashish: {destinationName}
vi: Chia sẻ {destinationName}
zh_hk: 分享 {destinationName}
zu: Yabelana nge-{destinationName}

# cardsDemoTravelDestinationTitle1
source: Top 10 Cities to Visit in Tamil Nadu
af: Top-10-stede om te besoek in Tamil Nadu
am: በታሚል ናዱ ውጽጥ የሚጎበኙ ከፍተኛዎቹ 10 ከተማዎች
ar_eg: أهم 10 مدن يمكن زيارتها في تاميل نادو
as: তামিলনাডুত ফুৰিবলগীয়া শীৰ্ষৰ ১০ খন চহৰ
az: Tamil Nadu ştatında gəzməli ən populyar 10 şəhər
be: 10 самых папулярных гарадоў у штаце Тамілнад, якія варта наведаць
bn: তামিলনাড়ুতে যে ১০টি শহরে অবশ্যই ভ্রমণ করতে হবে
bs: Deset gradova koje trebate posjetiti u Tamil Naduu
ca: Les 10 ciutats de Tamil Nadu que has de visitar
da: De ti bedste byer at besøge i Tamil Nadu
es_ar: Las 10 ciudades de Tamil Nadu que debes visitar
et: 10 populaarseimat linna, mida Tamil Nadus külastada
eu: Tamil Nadun bisitatu beharreko hamar hiri nagusiak
fa: ۱۰ شهر برتر برای بازدید در تامیل نادو
fil: Nangungunang 10 Lungsod na Mabibisita sa Tamil Nadu
fr_ca: Palmarès des 10 villes à visiter dans l'État du Tamil Nadu
gl: 10 cidades de visita obrigada en Tamil Nadu
gu: તમિળનાડુના મુલાકાત લેવા માટેના લોકપ્રિય 10 શહેર
he: 10 הערים המובילות שצריך לבקר בהן בטמיל נאדו
hi: तमिलनाडु में घूमने के लिए 10 सबसे अच्छे शहर
hu: Tíz város, amelyet érdemes felkeresni Tamilnáduban
hy: Այցելելու լավագույն 10 քաղաքները Թամիլ Նադուում
id: 10 Kota Terpopuler yang Harus Dikunjungi di Tamil Nadu
it: Le 10 città principali da visitare nel Tamil Nadu
ja: タミルナードゥ州のおすすめ都市トップ 10
ka: 10 ქალაქი, რომელიც ტამილნადუში უნდა მოინახულოთ
km: ទីក្រុង​ពេញនិយម​ចំនួន 10 សម្រាប់​ទៅលេងនៅរដ្ឋតាមីល​ណាឌូ
kn: ತಮಿಳುನಾಡಿನಲ್ಲಿ ಭೇಟಿ ನೀಡಬೇಕಾದ ಪ್ರಮುಖ 10 ನಗರಗಳು
ko: 타밀 나두에서 가 봐야 할 도시 10곳
ky: Тамилнадда бара турган мыкты 10 шаар
lo: 10 ເມືອງຕິດອັນດັບໃຫ້ໄປທ່ອງທ່ຽວໃນທະມິນນາດູ
lt: 10 populiariausių lankytinų miestų Tamilnade
lv: 10 populārākās pilsētas, ko apmeklēt Tamilnādā
mk: 10 најдобри града што може да ги посетите во Тамил Наду
ml: തമിഴ്‌നാട്ടിൽ സന്ദർശിക്കേണ്ട മികച്ച 10 നഗരങ്ങൾ
mn: Тамилнаду мужид зочлох шилдэг 10 хот
mr: तामिळनाडू मध्ये भेट देण्यासाठी टॉप १० शहरे
ms: 10 Bandar Paling Popular untuk Dilawati di Tamil Nadu
my: 'တမီးလ်နာဒူ' တွင် လည်ပတ်ရန် ထိပ်တန်းမြို့ ၁၀ မြို့
nb: Topp 10 byer du kan besøke i Tamil Nadu
ne: तामिल नाडुमा घुम्नै पर्ने शीर्ष १० सहरहरू
pa: ਤਮਿਲ ਨਾਡੂ ਵਿੱਚ ਜਾਣ ਲਈ 10 ਪ੍ਰਮੁੱਖ ਸ਼ਹਿਰ
pl: 10 najciekawszych miast w Tamilnadu
pt: 10 principais cidades para visitar em Tamil Nadu
pt_pt: As 10 melhores cidades a visitar em Tâmil Nadu
ro: Top 10 orașe de vizitat în Tamil Nadu
ru: 10 городов в штате Тамилнад, которые стоит посетить
si: තමිල්නාඩුවේ සංචාරය කිරීමට ඇති හොඳම නගර 10
sk: 10 naj miest v štáte Tamil Nadu, ktoré by ste mali navštíviť
sq: 10 qytetet kryesore për të vizituar në Tamil Nadu
sr: Најпопуларнијих 10 градова које треба да посетите у Тамил Надуу
sr_latn: Najpopularnijih 10 gradova koje treba da posetite u Tamil Naduu
sv: 10 städer att besöka i Tamil Nadu
te: తమిళనాడులో చూడదగిన 10 ప్రధాన నగరాలు
th: 10 อันดับเมืองน่าไปเยือนในทมิฬนาฑู
tr: Tamil Nadu'da Gezilecek İlk 10 Şehir
uk: 10 найпопулярніших міст штату Тамілнад
ur: تمل ناڈو میں گھومنے کے لیے سرفہرست 10 شہر
uz: Tamilnadu hududidagi 10 ta borish tavsiya qilinadigan shahar
vi: 10 thành phố hàng đầu phải ghé thăm ở Tamil Nadu
zh_hk: 泰米爾納德邦必到 10 大城市
zu: Amadolobha aphezulu angu-10 ongawavakashela e-Tamil Nadu

# cardsDemoTravelDestinationDescription1
source: Number 10
af: Nommer 10
am: 10 ቁጥር
ar_eg: رقم 10
as: সংখ্যা ১০
az: Nömrə 10
be: Нумар 10
bn: ১০ নম্বর
bs: Na 10. mjestu
ca: Número 10
da: Nummer 10
es_ar: Número 10
fa: شماره ۱۰
fil: Ika-10
fr_ca: Numéro 10
gl: Número 10
gu: નંબર 10
he: מספר 10
hi: नंबर 10
hu: Tízes szám
hy: Համար 10
id: Nomor 10
it: Numero 10
ja: ナンバー 10
ka: ნომერი 10
km: លេខ 10
kn: ಸಂಖ್ಯೆ 10
ko: 10번
ky: 10-номер
lo: ໝາຍເລກ 10
lt: Skaičius 10
lv: Nr. 10
mk: Број 10
ml: നമ്പർ 10
mn: Дугаар 10
mr: नंबर १०
ms: Nombor 10
my: နံပါတ် ၁၀
nb: Nummer 10
ne: नम्बर १०
pa: ਨੰਬਰ 10
pl: Numer 10
pt: Número 10
pt_pt: Número 10
ro: Numărul 10
ru: Номер 10
si: අංක 10
sk: Číslo 10
sq: Numri 10
sr: 10. место
sr_latn: 10. mesto
sv: Nummer 10
te: సంఖ్య 10
th: หมายเลข 10
tr: 10 Numara
uk: Номер 10
ur: نمبر 10
uz: 10 raqami
vi: Số 10
zh_hk: 第 10 位
zu: Inombolo engu-10

# cardsDemoTravelDestinationCity1
source: Thanjavur
am: ታንጃቩር
ar_eg: ثنجفور
as: তাঞ্জাভুৰ
az: Tancavur
be: Танджавур
bn: তাঞ্জাভুর
fa: تانجاوور
gu: તંજાવુર
he: טאנג'וור
hi: तंजावुर
hu: Tandzsávúr
hy: Թանջավուր
ja: タンジャーヴール
ka: ტანჯავური
km: ថាន់ចាវួរ
kn: ತಂಜಾವೂರು
ko: 탄자부르
ky: Танжавур
lo: ທານຈາວູ
lt: Tandžavūras
lv: Thandžāvūra
mk: Танџавур
ml: തഞ്ചാവൂർ
mn: Танжавур хот
mr: तंजावर
my: သန်ဂျီဗာ
ne: तन्जावुर
pa: ਤੰਜਾਵਰ
pl: Tańdźawur
ru: Танджавур
si: තන්ජාවූර්
sr: Танџавур
sr_latn: Tandžavur
te: తంజావూర్
th: เมืองตัญชาวร์
uk: Тханджавур
ur: تھنجاور
zh_hk: 坦賈武爾
zu: E-Thanjavur

# dataTableColumnProtein
source: Protein (g)
af: Proteïen (g)
am: ፕሮቲን (ግ)
ar_eg: البروتينات (بالغرام)
as: প্ৰ'টিন (গ্ৰাম)
az: Zülal (q)
be: Бялкі (г)
bn: প্রোটিন (g)
bs: Proteini (g)
ca: Proteïnes (g)
es_ar: Proteínas (g)
et: Valgud ( g)
eu: Proteinak (g)
fa: پروتئین (گرم)
fr_ca: Protéines (g)
gl: Proteínas (g))
gu: પ્રોટિન (ગ્રા)
he: חלבונים (ג')
hi: प्रोटीन (ग्रा.)
hu: Fehérje (g)
hy: Սպիտակուցներ (գ)
it: Proteine (g)
ja: タンパク質（g）
ka: ცილა (გ)
km: ប្រូតេអ៊ីន (g)
kn: ಪ್ರೋಟೀನ್ (ಗ್ರಾಂ)
ko: 단백질(g)
ky: Протеин (г.)
lo: ໂປຣຕີນ (g)
lt: Baltymai (g)
lv: Olbaltumvielas (g)
mk: Протеини (гр.)
ml: പ്രോട്ടീൻ (ഗ്രാം)
mn: Уураг (гр)
mr: प्रथिने (ग्रॅ)
my: အသားဓာတ် (g)
nb: Proteiner (g)
ne: प्रोटिन (ग्राम)
pa: ਪ੍ਰੋਟੀਨ (ਗ੍ਰਾ.)
pl: Białka (g)
pt: Proteína (g)
pt_pt: Proteína (g)
ro: Proteine (g)
ru: Белки (г)
si: ප්‍රෝටීන (ග්‍රෑම්)
sk: Bielkoviny (g)
sq: Proteina (g)
sr: Протеини (g)
sr_latn: Proteini (g)
te: ప్రొటీన్ (గ్రా)
th: โปรตีน (ก.)
uk: Білки (г)
ur: پروٹین (گرام)
uz: Oqsillar ( g)
vi: Chất đạm (g)
zh_hk: 蛋白質 (克)
zu: Amaphrotheni (g)

# cardsDemoTravelDestinationTitle2
source: Artisans of Southern India
af: Ambagslui van Suid-Indië
am: የደቡባዊ ህንድ ጠቢባን
ar_eg: حرفيون من جنوب الهند
as: দক্ষিণ ভাৰতৰ শিল্পীসকল
az: Cənubi Hindistandan olan sənətkarlar
be: Рамеснікі Паўднёвай Індыі
bn: দক্ষিণ ভারতের কারিগর
bs: Obrtnici južne Indije
ca: Artesans del sud de l'Índia
da: Kunsthåndværkere fra det sydlige Indien
es_ar: Artesanos del sur de India
et: Lõuna-India kunstkäsitöölised
eu: Indiaren hegoaldeko artisauak
fa: صنعتگران هند شرقی
fil: Mga Artisan ng Southern India
fr_ca: Artisans du sud de l'Inde
gl: Artesáns da India meridional
gu: દક્ષિણ ભારતના કલાકાર
he: אנשי המלאכה המיומנים של דרום הודו
hi: दक्षिण भारत के कलाकार
hu: Kézművesek Dél-Indiából
hy: Հարավային Հնդկաստանի արհեստավորները
id: Pengrajin dari India Selatan
it: Artigiani dell'India meridionale
ja: 南インドのアーティスト
ka: სამხრეთ ინდოეთის ხელოსნები
km: សិល្បករ​មកពីឥណ្ឌា​ភាគខាងត្បូង
kn: ದಕ್ಷಿಣ ಭಾರತದ ಕುಶಲಕರ್ಮಿಗಳು
ko: 인도 남부의 장인들
ky: Түштүк Индиянын усталары
lo: ຊ່າງສີມືແຫ່ງອິນເດຍໃຕ້
lt: Pietų Indijos amatininkai
lv: Dienvidindijas amatnieki
mk: Занаетчии од јужна Индија
ml: തെക്കൻ ഇന്ത്യയിൽ നിന്നുള്ള കരകൗശല വിദഗ്‌ദ്ധർ
mn: Энэтхэгийн өмнөд хэсгээс гаралтай уран бүтээлчид
mr: दक्षिण भारतातील कारागीर
ms: Tenaga Mahir dari India Selatan
my: တောင်အိန္ဒိယ၏ လက်မှုပညာသည်များ
nb: Håndverkere sør i India
ne: दक्षिण भारतका हस्तकला कर्मी
pa: ਦੱਖਣੀ ਭਾਰਤ ਦੇ ਸ਼ਿਲਪਕਾਰ
pl: Rzemieślnicy z południowych Indii
pt: Artesãos do sul da Índia
pt_pt: Artesãos do sul da Índia
ro: Artizani din India de Sud
ru: Мастера Южной Индии
si: දකුණු ඉන්දියාවේ ශිල්පීන්
sk: Umelci južnej Indie
sq: Artizanë në Indinë Jugore
sr: Занатлије јужне Индије
sr_latn: Zanatlije južne Indije
sv: Hantverkare från södra Indien
te: దక్షిణ భారత దేశంలోని శిల్ప కళాకారులు
th: ช่างฝีมือแห่งอินเดียใต้
tr: Güney Hindistan'ın Zanaatkarları
uk: Ремісники Південної Індії
ur: جنوبی ہندوستان کے کاریگران
uz: Janubiy Hindiston sanʼat ustalari
vi: Thợ thủ công ở Nam Ấn Độ
zh_hk: 印度南部的工匠
zu: Izingcwethi zase-Southern India
