Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# shrineProductKitchenQuattro
source: Kitchen quattro
af: Kombuiskwartet
am: የወጥ ቤት ኳትሮ
ar_eg: طقم أدوات للمطبخ من أربع قطع
az: Quattro mətbəxi
be: Кухонны набор
bn: কিচেন কোয়াট্রো
bs: Četverodijelni kuhinjski set
ca: Estris de cuina
es_ar: Cocina quattro
eu: Sukaldeko tresnak
fil: Quattro sa kusina
fr_ca: Quatre accessoires de cuisine
gl: Cociña quattro
hi: किचन क्वॉट्रो
hy: Խոհանոցային հավաքածու
ja: キッチン クアトロ
ka: სამზარეულოს კვატრო
km: quattro ផ្ទះបាយ
kn: ಕಿಚನ್ ಕ್ವಾಟ್ರೋ
ko: 키친 콰트로
ky: Кватро ашканасы
lo: Quattro ຫ້ອງຄົວ
lt: Keturių dalių virtuvės komplektas
lv: Virtuves komplekts
mk: Кујнски сет од 4 парчиња
ml: കിച്ചൻ ക്വാത്രോ
mn: Гал тогооны куватро
ne: Quattro किचन
pa: ਕਿਚਨ ਕਵਾਤਰੋ
pl: Kuchenne quattro
pt: Conjunto com quatro itens para cozinha
pt_pt: Quattro de cozinha
ro: Bucătărie Quattro
ru: Кухонный набор
sk: Kuchynská skrinka
sq: Kuzhinë quattro
sr: Кухињски сет из четири дела
sr_latn: Kuhinjski set iz četiri dela
sv: Kök – Quattro
te: కిచెన్ క్వాట్రొ
tr: Quattro mutfak
uk: Кухня Quattro
ur: کچن کواترو
uz: Oshxona jamlanmasi
vi: Bộ bốn đồ dùng nhà bếp
zh_hk: 廚房用品 4 件裝
zu: I-quattro yasekhishini

# shrineProductClaySweater
source: Clay sweater
af: Clay-oortrektrui
am: የሸክላ ሹራብ
ar_eg: بلوزة بلون الطين
az: Gil rəngli sviter
be: Бэжавы світар
bn: ক্লে সোয়েটার
bs: Džemper boje gline
ca: Jersei color teula
es_ar: Suéter color arcilla
eu: Buztin-koloreko jertsea
fa: ژاکت کلِی
fil: Clay na sweater
fr_ca: Chandail couleur argile
gl: Xersei de cor arxila
he: סוודר Clay
hi: क्ले स्वेटर
hu: „Clay” pulóver
hy: Բեժ սվիտեր
id: Sweter warna tanah liat
it: Felpa Clay
ja: セーター（クレイ）
ka: Clay-ს სვიტერი
km: អាវយឺត​ដៃវែង Clay
kn: ಕ್ಲೇ ಸ್ವೆಟರ್
ko: 클레이 스웨터
ky: Свитер
lo: ເສື້ອກັນໜາວສີຕັບໝູ
lt: „Willow & Clay“ megztinis
lv: Māla krāsas džemperis
mk: Џемпер Clay
ml: ക്ലേ സ്വെറ്റർ
mn: Шаврын өнгөтэй цамц
nb: Leirefarget genser
ne: क्ले स्विटर
pa: ਪੂਰੀ ਬਾਹਾਂ ਵਾਲਾ ਸਵੈਟਰ
pl: Sweter dziergany
pt: Suéter na cor argila
pt_pt: Camisola em cor de barro
ro: Pulover Clay
ru: Бежевый свитер
si: මැටි ස්වීටරය
sk: Terakotový sveter
sq: Triko ngjyrë balte
sr: Џемпер боје глине
sr_latn: Džemper boje gline
sv: Lerfärgad tröja
te: క్లే స్వెటర్
th: สเวตเตอร์สีดินเหนียว
tr: Kil kazak
uk: Коричневий светр
ur: مٹی کے رنگ کے سویٹر
uz: Och jigarrang sviter
vi: Áo len dài tay màu nâu đất sét
zh_hk: 淺啡色毛衣
zu: I-Clay sweater

# shrineProductSeaTunic
source: Sea tunic
af: Seetuniek
am: የባህር ሸማ
ar_eg: بلوزة بلون أزرق فاتح
az: Dəniz koftası
be: Пляжная туніка
bn: সি টিউনিক
bs: Morska tunika
ca: Samarreta llarga blau clar
da: Havblå tunika
es_ar: Vestido de verano
eu: Tunika urdin argia
fa: تونیک ساحلی
fr_ca: Tunique de plage
gl: Chaqueta cor mar
he: טוניקה לים
hi: सी ट्यूनिक
hu: „Sea” tunika
hy: Թեթև սվիտեր
id: Tunik warna laut
it: Vestito da mare
ja: シー タニック
ka: ზღვის ტუნიკა
kn: ಸೀ ಟ್ಯೂನಿಕ್
ko: 시 튜닉
ky: Деңиз туникасы
lo: ຊຸດກະໂປງຫາດຊາຍ
lt: Paplūdimio tunika
lv: Zila tunika
mk: Туника во морски тонови
ml: സീ ട്യൂണിക്
mn: Нимгэн даашинз
nb: Havblå bluse
ne: सी ट्युनिक
pa: ਸੀ ਟਿਊਨਿਕ
pl: Tunika kąpielowa
pt: Túnica azul-mar
pt_pt: Túnica cor de mar
ro: Tunică Sea
ru: Легкий свитер
sk: Plážová tunika
sq: Tunikë plazhi
sr: Тамноплава туника
sr_latn: Tamnoplava tunika
sv: Havsblå tunika
te: సీ ట్యూనిక్
th: ชุดกระโปรงเดินชายหาด
tr: Deniz tuniği
uk: Туніка в пляжному стилі
ur: سمندری سرنگ
uz: Yengil sviter
vi: Áo dài qua hông màu xanh biển
zh_hk: 海藍色長袍
zu: I-Sea tunic

# shrineProductPlasterTunic
source: Plaster tunic
af: Gipstuniek
am: ፕላስተር ሸማ
ar_eg: بلوزة من نوع "بلاستر"
az: Açıq rəngli kofta
be: Крэмавая туніка
bn: প্লাস্টার টিউনিক
bs: Tunika boje gipsa
ca: Túnica color guix
da: Beige tunika
es_ar: Túnica color yeso
eu: Igeltsu-koloreko tunika
fa: نیم‌تنه پلاستر
fil: Plaster na tunic
fr_ca: Tunique couleur plâtre
gl: Chaqueta cor xeso
he: טוניקה
hi: प्लास्टर ट्यूनिक
hu: „Plaster” tunika
hy: Մարմնագույն տունիկա
id: Tunik plaster
it: Abito plaster
ja: チュニック（パステル）
ka: თაბაშირისფერი ტუნიკა
kn: ಪ್ಲಾಸ್ಟರ್ ಟ್ಯೂನಿಕ್
ko: 플라스터 튜닉
ky: Туника
lo: ເສື້ອຄຸມສີພລາສເຕີ
lt: Lengvo audinio tunika
lv: Ģipša krāsas tunika
mk: Туника Plaster
ml: പ്ലാസ്‌റ്റർ ട്യൂണിക്
mn: Нимгэн урт цамц
nb: Gipsfarget bluse
ne: प्लास्टर ट्युनिक
pa: ਪਲਾਸਟਰ ਟਿਊਨਿਕ
pl: Tunika
pt: Túnica na cor gesso
pt_pt: Túnica cor de gesso
ro: Tunică Plaster
ru: Кремовая туника
sk: Tunika
sq: Tunikë allçie
sr: Туника боје гипса
sr_latn: Tunika boje gipsa
sv: Gipsvit tunika
te: ప్లాస్టర్ ట్యూనిక్
th: เสื้อคลุมสีปูนปลาสเตอร์
tr: İnce tunik
uk: Туніка бежевого кольору
ur: پلاسٹر ٹیونک
uz: Plaster tunika
vi: Áo dài qua hông màu thạch cao
zh_hk: 灰色長袍
zu: I-Plaster tunic

# rallyBudgetCategoryRestaurants
source: Restaurants
af: Restaurante
am: ምግብ ቤቶች
ar_eg: المطاعم
as: ৰেষ্টুৰেণ্টসমূহ
az: Restoranlar
be: Рэстараны
bn: রেস্তোরাঁ
bs: Restorani
da: Restauranter
es_ar: Restaurantes
et: Restoranid
eu: Jatetxeak
fa: رستوران‌ها
fil: Mga Restaurant
gl: Restaurantes
gu: રેસ્ટોરન્ટ
he: מסעדות
hi: रेस्टोरेंट
hu: Éttermek
hy: Ռեստորաններ
id: Restoran
it: Ristoranti
ja: レストラン
ka: რესტორნები
km: ភោជនីយដ្ឋាន
kn: ರೆಸ್ಟೋರೆಂಟ್‌ಗಳು
ko: 음식점
ky: Ресторандар
lo: ຮ້ານອາຫານ
lt: Restoranai
lv: Restorāni
mk: Ресторани
ml: റെസ്റ്റോറന്റുകൾ
mn: Ресторан
mr: रेस्टॉरंट
ms: Restoran
my: စားသောက်ဆိုင်များ
nb: Restauranter
ne: भोजनालयहरू
pa: ਰੈਸਟੋਰੈਂਟ
pl: Restauracje
pt: Restaurantes
pt_pt: Restaurantes
ro: Restaurante
ru: Рестораны
si: අවන්හල්
sk: Reštaurácie
sq: Restorantet
sr: Ресторани
sr_latn: Restorani
sv: Restauranger
te: రెస్టారెంట్‌లు
th: ร้านอาหาร
tr: Restoranlar
uk: Ресторани
ur: ریستوراں
uz: Restoranlar
vi: Nhà hàng
zh_hk: 餐廳
zu: Amarestshurenti

# shrineProductChambrayShirt
source: Chambray shirt
af: Chambray-hemp
am: Chambray ሸሚዝ
ar_eg: قميص من نوع "شامبراي"
az: Mavi kətan köynək
be: Ільняная клятчастая кашуля
bn: শ্যামব্র্যয় শার্ট
bs: Košulja od chambraya
ca: Camisa cambrai
da: Chambrayskjorte
es_ar: Camisa de chambray
eu: Chambray estiloko alkandora
fa: پیراهن چمبری
fil: Chambray na shirt
fr_ca: Chemise chambray
gl: Camisa de chambray
he: חולצת שמבריי
hi: शैम्ब्रे शर्ट
hu: Chambray anyagú ing
hy: Բամբակյա վերնաշապիկ
id: Kemeja chambray
it: Maglia Chambray
ja: シャンブレー シャツ
ka: შამბრის მაისური
km: អាវ Chambray
kn: ಶ್ಯಾಂಬ್ರೇ ಶರ್ಟ್
ko: 샴브레이 셔츠
ky: Пахта көйнөгү
lo: ເສື້ອແຊມເບຣ
lt: Džinso imitacijos marškiniai
lv: Auduma krekls
mk: Kошула Chambray
ml: ചേമ്പ്രേ ഷർട്ട്
mn: Тааран даавуун цамц
nb: Chambray-skjorte
ne: स्याम्ब्रे सर्ट
pa: ਸ਼ੈਂਬਰੇ ਕਮੀਜ਼
pl: Koszula batystowa
pt: Camisa em chambray
pt_pt: Camisa Chambray
ro: Cămașă din Chambray
ru: Хлопковая рубашка
sk: Košeľa Chambray
sq: Këmishë Chambray
sr: Платнена мајица
sr_latn: Platnena majica
sv: Chambrayskjorta
te: ఛాంబ్రే షర్ట్
th: เสื้อแชมเบรย์
tr: Patiska gömlek
uk: Сорочка з тканини шамбре
ur: چمبری شرٹ
uz: Paxtali koʻylak
vi: Áo sơ mi vải chambray
zh_hk: 水手布恤衫
zu: Ishedi le-Chambray

# shrineProductSeabreezeSweater
source: Seabreeze sweater
af: Sea Breeze-trui
am: Seabreeze ሹራብ
ar_eg: سترة بلون أزرق بحري
az: Dəniz mavisi rəngində sviter
be: Джэмпер
bn: সিব্রিজ সোয়েটার
bs: Džemper boje mora
ca: Jersei color blau clar
es_ar: Suéter de hilo liviano
eu: Jertse fina
fa: پلیور سی‌بریز
fil: Seabreeze na sweater
fr_ca: Chandail brise marine
gl: Xersei de cor celeste
he: סוודר בסגנון ימי
hi: सीब्रीज़ स्वेटर
hu: „Seabreeze” pulóver
hy: Ծովի ալիքների գույնի սվիտեր
id: Sweter warna laut
it: Felpa Seabreeze
ja: セーター（シーブリーズ）
ka: Seabreeze-ის სვიტერი
km: អាវយឺតដៃវែង Seabreeze
kn: ಸೀಬ್ರೀಜ್ ಸ್ವೆಟರ್
ko: 시 브리즈 스웨터
ky: Деңиз свитери
lo: ເສື້ອກັນໜາວແບບຖັກຫ່າງ
lt: Megztinis „Seabreeze“
lv: Jūras krāsas džemperis
mk: Џемпер Seabreeze
ml: സീബ്രീസ് സ്വറ്റർ
mn: Сүлжмэл цамц
nb: Havblå genser
ne: सिब्रिज स्विटर
pa: ਸੀਬ੍ਰੀਜ਼ ਸਵੈਟਰ
pl: Sweter z oczkami
pt: Suéter na cor brisa do mar
pt_pt: Camisola fresca
ro: Pulover Seabreeze
ru: Мятный свитер
sk: Sveter na chladný vánok
sq: Triko e hollë
sr: Џемпер са шаблоном морских таласа
sr_latn: Džemper sa šablonom morskih talasa
sv: Havsblå tröja
te: సీబ్రీజ్ స్వెటర్
th: สเวตเตอร์ถักแบบห่าง
tr: Deniz esintisi kazağı
uk: Светр кольору морської хвилі
ur: بحریہ کے نیلے رنگ کا سویٹر
uz: Yalpizli sviter
vi: Áo len dài tay màu xanh lơ
zh_hk: 海藍色毛衣
zu: I-Seabreeze sweater

# shrineProductGentryJacket
source: Gentry jacket
af: Herebaadjie
am: Gentry ጃኬት
ar_eg: سترة رجالية باللون الأخضر الداكن
az: Centri gödəkcəsi
be: Куртка ў стылі джэнтры
bn: জেন্ট্রি জ্যাকেট
bs: Jakna Gentry
ca: Jaqueta noble
da: Gentry-jakke
es_ar: Chaqueta estilo gentry
eu: Gentry jaka
fa: ژاکت جنتری
fil: Gentry na jacket
fr_ca: Veste aristo
gl: Chaqueta estilo gentry
he: ז'קט יוקרתי
hi: जेंट्री जैकेट
hu: „Gentry” dzseki
hy: Ջենթրի ոճի բաճկոն
id: Jaket gentry
it: Giacca Gentry
ja: ジェントリー ジャケット
ka: ჟენტრის ჟაკეტი
km: អាវក្រៅ Gentry
kn: ಜೆಂಟ್ರಿ ಜಾಕೆಟ್
ko: 젠트리 재킷
ky: Жентри кемсели
lo: ແຈັກເກັດແບບຄົນຊັ້ນສູງ
lt: „Gentry“ švarkelis
lv: Gentry stila jaka
mk: Јакна Gentry
ml: ജന്റ്രി ജാക്കറ്റ്
mn: Жентри хүрэм
nb: Gentry-jakke
ne: जेन्ट्री ज्याकेट
pa: ਜੈਨਟਰੀ ਜੈਕਟ
pl: Kurtka męska
pt: Casaco chique
pt_pt: Casaco Gentry
ro: Jachetă Gentry
ru: Куртка в стиле джентри
sk: Kabátik
sq: Xhaketë serioze
sr: Gentry јакна
sr_latn: Gentry jakna
sv: Jacka – Gentry
te: మగాళ్లు ధరించే జాకట్
th: แจ็กเก็ต Gentry
tr: Gentry ceket
uk: Піджак
ur: جنٹری جیکٹ
uz: Jentri kurtka
vi: Áo khoác gentry
zh_hk: 紳士風格外套
zu: Ijakethi ye-Gentry

# shrineProductNavyTrousers
source: Navy trousers
af: Vlootblou broek
am: ኔቪ ሱሪ
ar_eg: سروال بلون أزرق داكن
az: Tünd mavi şalvar
be: Цёмна-сінія штаны
bn: নীল পায়জামা
bs: Tamnoplave hlače
ca: Pantalons blau marí
da: Marineblå bukser
es_ar: Pantalones azul marino
eu: Galtza urdin ilunak
fa: شلوار سورمه‌ای
fil: Navy na pantalon
fr_ca: Pantalons bleu marine
gl: Pantalóns azul mariño
he: מכנסיים בכחול כהה
hi: नेवी ट्राउज़र
hu: Matrózkék nadrág
hy: Մուգ կապույտ տաբատ
id: Celana panjang navy
it: Pantaloni navy
ja: ズボン（ネイビー）
ka: მუქი ლურჯი შარვალი
km: ខោជើងវែង Navy
kn: ನೇವಿ ಟ್ರೌಸರ್ಸ್
ko: 네이비 트라우저
ky: Кара-көк шым
lo: ໂສ້ງຂາຍາວສີຟ້າແກ່
lt: Tamsiai mėlynos kelnės
lv: Tumši zilas bikses
mk: Панталони во морско сина
ml: നേവി ട്രൗസേഴ്‌സ്
mn: Цэнхэр өмд
nb: Marineblå bukser
ne: गाढा निलो रङको पाइन्ट
pa: ਗੂੜ੍ਹੀਆਂ ਨੀਲੀਆਂ ਪੈਂਟਾਂ
pl: Granatowe spodnie
pt: Calças azul-marinho
pt_pt: Calças em azul-marinho
ro: Pantaloni bleumarin
ru: Короткие брюки клеш
sk: Námornícke nohavice
sq: Pantallona blu
sr: Тамноплаве панталоне
sr_latn: Tamnoplave pantalone
sv: Marinblå byxor
te: నేవీ ట్రౌజర్లు
th: กางเกงขายาวสีน้ำเงินเข้ม
tr: Lacivert pantolon
uk: Штани темно-синього кольору
ur: نیوی پتلونیں
uz: Kalta klesh shimlari
vi: Quần màu xanh tím than
zh_hk: 軍藍色長褲
zu: Amabhulukwe anevi

# shrineProductWalterHenleyWhite
source: Walter henley (white)
af: Walter henley (wit)
am: Walter henley (ነጭ)
ar_eg: والتر هينلي (أبيض)
az: Gündəlik kişi koftası (ağ)
be: Лёгкая кофта (белая)
bn: ওয়াল্টার হেনলি (সাদা)
bs: Majica s Henley ovratnikom (bijela)
ca: Samarreta de ratlles (blanc)
da: Walter-henley (hvid)
es_ar: Camiseta con botones (blanca)
eu: Walter Henley (zuria)
fa: والتر هنلی (سفید)
fil: Walter henley (puti)
fr_ca: Walter Henley (blanc)
gl: Camiseta henley (branca)
he: Walter henley (לבן)
hi: वॉल्टर हेनली (सफ़ेद)
hu: „Walter” henley stílusú póló (fehér)
hy: Սպիտակ թեթև բաճկոն
id: Walter henley (putih)
it: Walter Henley (bianco)
ja: ウォルター ヘンレイ（ホワイト）
ka: Walter Henley (თეთრი)
km: Walter henley (ស)
kn: ವಾಲ್ಟರ್ ಹೆನ್ಲೇ (ಬಿಳಿ)
ko: 월터 헨리(화이트)
ky: Walter henley (ак)
lo: ເສື້ອເຮນຣີ Walter (ຂາວ)
lt: „Walter“ prasegami marškinėliai (balti)
lv: Walter stila tops (balts)
mk: Walter Henley (бела)
ml: വാൾട്ടർ ഹെൻലി (വൈറ്റ്)
mn: Вальтер хэнли (цагаан)
nb: Walter henley (hvit)
ne: वाल्टर हेन्ली (सेतो)
pa: ਵਾਲਟਰ ਹੈਨਲੀ (ਚਿੱਟਾ)
pl: Koszulka Walter Henley (biała)
pt: Camiseta de manga longa (branca)
pt_pt: Walter Henley (branco)
ro: Walter Henley (alb)
ru: Белая легкая кофта
si: Walter henley (සුදු)
sk: Tričko bez límca so zapínaním Walter (biele)
sq: Walter Henley (e bardhë)
sr: Мајица са изрезом у облику слова v (беле боје)
sr_latn: Majica sa izrezom u obliku slova v (bele boje)
sv: Henley-tröja – Walter (vit)
te: వాల్టర్ హెనెలి (వైట్)
th: เสื้อเฮนลีย์ Walter (ขาว)
tr: Walter Henley (beyaz)
uk: Футболка Walter Henley (біла)
ur: والٹر ہینلے (سفید)
uz: Oq yengil kofta
vi: Áo Walter henley (màu trắng)
zh_hk: Walter 亨利衫 (白色)
zu: I-Walter henley (emhlophe)

# shrineProductSurfAndPerfShirt
source: Surf and perf shirt
af: "Surf and perf"-t-hemp
am: Surf and perf ቲሸርት
ar_eg: قميص سيرف آند بيرف
az: Sörf koftası
be: Бірузовая футболка
bn: সার্ফ এবং পার্ফ শার্ট
bs: Surferska majica
ca: Samarreta surfera
da: Surfertrøje
es_ar: Camiseta estilo surf and perf
eu: Surf-estiloko alkandora
fa: پیراهن سرف‌اندپرف
fil: Surf and perf na t-shirt
fr_ca: T-shirt d'été
gl: Camiseta Surf and perf
he: חולצה בסגנון גלישה
hi: सर्फ़ ऐंड पर्फ़ शर्ट
hu: „Surf and perf” póló
hy: Ծովի ալիքների գույնի շապիկ
id: Kaus surf and perf
it: Maglietta Surf and perf
ja: サーフ アンド パーフ シャツ
ka: Surf and perf მაისური
km: អាវ Surf and perf
kn: ಸರ್ಫ್ ಮತ್ತು ಪರ್ಫ್ ಶರ್ಟ್
ko: 서프 앤 퍼프 셔츠
ky: Серфинг футболкасы
lo: ເສື້ອ Surf and perf
lt: Sportiniai ir kiti marškinėliai
lv: Sērfošanas krekls
mk: Маица Surf and perf
ml: സർഫ് ആന്റ് പെർഫ് ഷർട്ട്
mn: Бэлтгэлийн цамц
nb: Surf and perf-skjorte
ne: सर्फ एन्ड पर्फ सर्ट
pa: ਸਰਫ ਅਤੇ ਪਰਫ ਕਮੀਜ਼
pl: Sportowa bluza do surfingu
pt: Camiseta de surfista
pt_pt: Camisa Surf and perf
ro: Bluză Surf and perf
ru: Футболка цвета морской волны
sk: Surferské tričko
sq: Këmishë sërfi
sr: Сурферска мајица
sr_latn: Surferska majica
sv: Tröja – Surf and perf
te: సర్ఫ్ అండ్ పర్ఫ్ షర్ట్
th: เสื้อ Surf and Perf
tr: "Surf and perf" gömlek
uk: Футболка Surf and Perf
ur: سرف اور پرف شرٹ
uz: Dengiz toʻlqinlari rangidagi futbolka
vi: Áo Surf and perf
zh_hk: Surf and perf 恤衫
zu: Ishedi le-Surf and perf

# shrineProductGingerScarf
source: Ginger scarf
af: Gemmerkleurige serp
am: Ginger ሻርብ
ar_eg: وشاح بألوان الزنجبيل
az: Zəncəfil rəngində şərf
be: Рыжы шаль
bn: জিনজার স্কার্ফ
bs: Šal boje đumbira
ca: Bufanda ataronjada
da: Rødt halstørklæde
es_ar: Pañuelo color tierra
eu: Bufanda gorrixka
fa: شال‌گردن جینجر
fil: Ginger na scarf
fr_ca: Foulard gingembre
gl: Bufanda alaranxada
he: צעיף חום
hi: जिंजर स्कार्फ़
hu: Vörös sál
hy: Կոճապղպեղի գույնի շարֆ
id: Syal warna jahe
it: Sciarpa rossa
ja: スカーフ（ジンジャー）
ka: ჯანჯაფილისფერი შარფი
km: កន្សែងបង់ក Ginger
kn: ಜಿಂಜರ್ ಸ್ಕಾರ್ಫ್
ko: 진저 스카프
ky: Шарф
lo: ຜ້າພັນຄໍສີເຫຼືອອົມນ້ຳຕານແດງ
lt: Rusvai gelsvas šalikėlis
lv: Ruda šalle
mk: Шал во боја на ѓумбир
ml: ജിൻജർ സ്കാഫ്
mn: Шаргал өнгийн ороолт
nb: Rødgult skjerf
ne: जिन्जर स्कार्फ
pa: Ginger ਸਕਾਰਫ਼
pl: Rudy szalik
pt: Cachecol laranja
pt_pt: Cachecol ruivo
ro: Fular Ginger
ru: Имбирный шарф
sk: Zázvorový šál
sq: Shall ngjyrë xhenxhefili
sr: Црвени шал
sr_latn: Crveni šal
sv: Rödgul halsduk
te: జింజర్ స్కార్ఫ్
th: ผ้าพันคอสีเหลืองอมน้ำตาลแดง
tr: Kırmızı eşarp
uk: Шарф світло-коричневого кольору
ur: ادرک اسٹائل کا اسکارف
uz: Sariq sharf
vi: Khăn quàng màu nâu cam
zh_hk: 橙褐色圍巾
zu: I-Ginger scarf

# shrineProductRamonaCrossover
source: Ramona crossover
af: Ramona-oorkruissak
am: የራሞና ተሻጋሪ ስራ
ar_eg: قميص "رامونا" على شكل الحرف X
az: Ramona krossover
be: Жаноцкая блузка з захватам
bn: রামোনা ক্রসওভার
ca: Camisa encreuada Ramona
da: Ramona-samarbejde
es_ar: Mezcla de estilos Ramona
eu: Ramona poltsa gurutzatua
fa: پیراهن یقه ضربدری رامونا
fr_ca: Mélange de différents styles Ramona
gl: Blusa cruzada Ramona
hi: रमोना क्रॉसओवर
hy: Ramona բլուզ
id: Crossover Ramona
it: Crossover Ramona
ja: ラモナ クロスオーバー
ka: Ramona-ს გადასაკიდი ჩანთა
kn: ರಮೋನಾ ಕ್ರಾಸ್ಓವರ್
ko: 라모나 크로스오버
ky: Рамона кроссовери
lo: Ramona ຄຣອສໂອເວີ
lt: „Ramona“ rankinė per petį
lv: Ramona krosovers
mk: Женска блуза Ramona
ml: റമോണാ ക്രോസോവർ
mn: Рамона кроссовер
ne: रामोना क्रसओभर
pa: ਰਮੋਨਾ ਕ੍ਰਾਸਓਵਰ
pl: Torebka na ramię Ramona Crossover
pt: Camiseta estilo crossover Ramona
pt_pt: Ramona transversal
ro: Geantă crossover Ramona
ru: Женственная блузка с запахом
sk: Prechodné šaty Ramona
sq: Crossover-i i Ramona-s
sr: Женска блуза Ramona
sr_latn: Ženska bluza Ramona
sv: Axelremsväska – Ramona
te: రమోనా క్రాస్ఓవర్
th: Ramona ครอสโอเวอร์
uk: Кросовер Ramona
ur: رومانا کراس اوور
uz: Ayollar bluzkasi
vi: Áo đắp chéo Ramona
zh_hk: 與 Ramona 跨界合作
zu: I-Ramona crossover

# shrineProductClassicWhiteCollar
source: Classic white collar
af: Klassieke wit kraag
am: የሚታወቅ ነጭ ኮሌታ
ar_eg: ياقة بيضاء كلاسيكية
az: Klassik ağ yaxalıq
be: Класічная белая блузка
bn: ক্লাসিক হোয়াইট কলার
bs: Klasična bijela košulja
ca: Coll blanc clàssic
da: Klassisk hvid krave
es_ar: Camisa clásica de cuello blanco
eu: Alkandora zuri klasikoa
fa: یقه سفید کلاسیک
fil: Classic na puting kwelyo
fr_ca: Col blanc classique
gl: Colo branco clásico
he: חולצת כפתורים קלאסית לבנה
hi: क्लासिक सफ़ेद कॉलर
hu: Klasszikus fehér gallér
hy: Դասական սպիտակ բլուզ
id: Kemeja kerah putih klasik
it: Colletto classico
ja: クラッシック ホワイトカラー シャツ
ka: კლასიკური თეთრსაყელოიანი
km: អាវ​ពណ៌សចាស់
kn: ಕ್ಲಾಸಿಕ್ ವೈಟ್ ಕಾಲರ್
ko: 클래식 화이트 칼라
ky: Классикалык ак жака
lo: ເສື້ອເຊີດສີຂາວແບບຄລາດສິກ
lt: Klasikinis kvalifikuotas darbas
lv: Klasiska balta apkaklīte
mk: Класична бела јака
ml: ക്ലാസിക് വൈറ്റ് കോളർ
mn: Сонгодог цагаан зах
nb: Klassisk hvit krage
ne: क्लासिक शैलीको कलर भएको सेतो सर्ट
pa: ਕਲਾਸਿਕ ਵਾਇਟ ਕਾਲਰ
pl: Klasyczna z białym kołnierzykiem
pt: Gola branca clássica
pt_pt: Colarinho branco clássico
ro: Guler alb clasic
ru: Классическая белая блузка
sk: Klasická košeľa s bielym límcom
sq: Jakë e bardhë klasike
sr: Класична бела кошуља
sr_latn: Klasična bela košulja
sv: Klassisk vit krage
te: క్లాసిక్ వైట్ కాలర్
th: เสื้อเชิ้ตสีขาวแบบคลาสสิก
tr: Klasik beyaz yaka
uk: Класичний білий комірець
ur: کلاسک سفید کالر
uz: Klassik oq bluzka
vi: Áo sơ mi cổ trắng cổ điển
zh_hk: 經典白領上衣
zu: Ikhola emhlophe yakudala

# shrineProductSunshirtDress
source: Sunshirt dress
af: Sunshirt-rok
am: የጸሐይ ሸሚዝ ቀሚስ
ar_eg: فستان يعكس أشعة الشمس
az: Günəş libası
be: Летняя сукенка
bn: সানশার্ট ড্রেস
bs: Haljina za plažu
ca: Vestit estiuenc
da: Kjole, der beskytter mod solen
es_ar: Camisa larga de verano
eu: Udako soinekoa
fa: پیراهن سان‌شرت
fil: Sunshirt na dress
fr_ca: Robe d'été
gl: Vestido Sunshirt
he: שמלה קצרה לחוף הים
hi: सनशर्ट ड्रेस
hu: „Sunshirt” ruha
hy: Ամառային զգեստ
id: Baju terusan sunshirt
it: Abito prendisole
ja: サンシャツ ドレス
ka: საზაფხულო კაბა-მაისური
km: សម្លៀកបំពាក់​ស្ដើងៗ
kn: ಸನ್‌ಶರ್ಟ್ ಡ್ರೆಸ್
ko: 선셔츠 드레스
ky: Жайкы көйнөк
lo: ຊຸດກະໂປງ Sunshirt
lt: Vasariniai drabužiai
lv: Krekla kleita
mk: Фустан за на плажа
ml: സൺഷർട്ട് ഡ്രസ്
mn: Нарны хамгаалалттай даашинз
nb: Sunshirt-kjole
ne: सनसर्ट ड्रेस
pa: ਸਨਸ਼ਰਟ ਡ੍ਰੈੱਸ
pl: Sukienka plażowa
pt: Vestido Sunshirt
pt_pt: Vestido Sunshirt
ro: Rochie Sunshirt
ru: Летнее платье
sk: Slnečné šaty
sq: Fustan veror
sr: Хаљина за заштиту од сунца
sr_latn: Haljina za zaštitu od sunca
sv: Solklänning
te: సన్‌షర్ట్ దుస్తులు
th: ชุดกระโปรง Sunshirt
tr: Yazlık elbise
uk: Вільна сукня
ur: سنشرٹ ڈریس
uz: Yozgi koʻylak
vi: Áo váy đi biển
zh_hk: 防曬長裙
zu: Ingubo ye-Sunshirt

# rallyAccountDetailDataInterestRate
source: Interest Rate
af: Rentekoers
am: የወለድ ተመን
ar_eg: سعر الفائدة
as: সুদৰ হাৰ
az: Faiz Norması
be: Працэнтная стаўка
bn: সুদের হার
bs: Kamatna stopa
ca: Taxa d'interès
da: Rentesats
es_ar: Tasa de interés
et: Intressimäär
eu: Interes-tasa
fa: نرخ بهره
fil: Rate ng Interes
fr_ca: Taux d'intérêt
gl: Tipo de interese
gu: વ્યાજનો દર
he: שיעור ריבית
hi: ब्याज दर
hu: Kamatláb
hy: Տոկոսադրույք
id: Suku Bunga
it: Tasso di interesse
ja: 利率
ka: საპროცენტო განაკვეთი
km: អត្រា​ការប្រាក់
kn: ಬಡ್ಡಿದರ
ko: 이율
ky: Үстөк баасы
lo: ອັດຕາດອກເບ້ຍ
lt: Palūkanų norma
lv: Procentu likme
mk: Каматна стапка
ml: പലിശനിരക്ക്
mn: Хүүгийн хэмжээ
mr: व्याज दर
ms: Kadar Faedah
my: အတိုးနှုန်း
nb: Rentesats
ne: ब्याज दर
pa: ਵਿਆਜ ਦੀ ਦਰ
pl: Stopa procentowa
pt: Taxa de juros
pt_pt: Taxa de juro
ro: Rata dobânzii
ru: Процентная ставка
si: පොලී අනුපාතය
sk: Úroková sadzba
sq: Norma e interesit
sr: Каматна стопа
sr_latn: Kamatna stopa
sv: Ränta
te: వడ్డీ రేటు
th: อัตราดอกเบี้ย
tr: Faiz Oranı
uk: Процентна ставка
ur: سود کی شرح
uz: Foiz stavkasi
vi: Lãi suất
zh_hk: 利率
zu: Isilinganiso senzalo

# rallyAccountDetailDataAnnualPercentageYield
source: Annual Percentage Yield
af: Jaarpersentasie-opbrengs
am: ዓመታዊ የመቶኛ ትርፍ
ar_eg: النسبة المئوية للعائد السنوي
as: বাৰ্ষিক আয়ৰ শতাংশ
az: İllik faiz gəliri
be: Гадавая працэнтная даходнасць
bn: বার্ষিক লাভের শতাংশ
bs: Godišnji procenat prinosa
ca: Percentatge de rendiment anual
da: Årligt afkast i procent
es_ar: Porcentaje de rendimiento anual
et: Aastane tuluprotsent
eu: Urtean ordaindutako interesaren ehunekoa
fa: درصد سالانه بازگشت سرمایه
fil: Taunang Percentage Yield
fr_ca: Pourcentage annuel de rendement
gl: Interese porcentual anual
gu: વાર્ષિક ઉપજની ટકાવારી
he: תשואה שנתית באחוזים
hi: सालाना फ़ायदे का प्रतिशत
hu: Éves százalékos hozam
hy: Տարեկան տոկոսային եկամտաբերությունը
id: Persentase Hasil Tahunan
it: Rendimento annuale percentuale
ja: 年利回り
ka: წლიური პროცენტული სარგებელი
km: ផល​ជាភាគរយ​ប្រចាំឆ្នាំ
kn: ವಾರ್ಷಿಕ ಶೇಕಡಾವಾರು ಲಾಭ
ko: 연이율
ky: Жылдык пайыздык киреше
lo: ຜົນຕອບແທນລາຍປີເປັນເປີເຊັນ
lt: Metinis pelningumas procentais
lv: Gada peļņa procentos
mk: Годишен принос во процент
ml: വാർഷിക വരുമാന ശതമാനം
mn: Жилийн өгөөжийн хувь
mr: वार्षिक टक्केवारी उत्‍पन्न
ms: Peratus Hasil Tahunan
my: တစ်နှစ်တာ ထွက်ရှိမှုရာခိုင်နှုန်း
nb: Årlig avkastning i prosent
ne: वार्षिक प्राप्तिफलको प्रतिशत
pa: ਸਲਾਨਾ ਫ਼ੀਸਦ ਮੁਨਾਫਾ
pl: Roczny zysk procentowo
pt: Porcentagem de rendimento anual
pt_pt: Percentagem do rendimento anual
ro: Randamentul anual procentual
ru: Годовая процентная доходность
si: වාර්ෂික ප්‍රතිශත අස්වැන්න
sk: Ročný percentuálny výnos
sq: Rendimenti vjetor në përqindje
sr: Годишњи проценат добити
sr_latn: Godišnji procenat dobiti
sv: Årlig avkastning i procent
te: వార్షిక రాబడి శాతం
th: ผลตอบแทนรายปีเป็นเปอร์เซ็นต์
tr: Yıllık Faiz Getirisi
uk: Річний дохід у відсотках
ur: سالانہ فی صد منافع
uz: Yillik foiz daromadi
vi: Phần trăm lợi nhuận hằng năm
zh_hk: 每年收益率
zu: Ukuvuma kwephesenti kwangonyaka

# rallyAccountDataVacation
source: Vacation
af: Vakansie
am: ሽርሽር
ar_eg: عطلة
as: বন্ধৰ দিন
az: Tətil
be: Адпачынак
bn: ছুটি
bs: Odmor
ca: Vacances
da: Ferie
es_ar: Vacaciones
et: Puhkusekonto
eu: Oporrak
fa: تعطیلات
fil: Bakasyon
fr_ca: Vacances
gl: Vacacións
gu: વેકેશન
he: חופשה
hi: छुट्टियां
hu: Szabadság
hy: Արձակուրդ
id: Liburan
it: Vacanza
ja: バケーション
ka: დასვენება
km: វិស្សមកាល
kn: ರಜಾಕಾಲ
ko: 휴가 대비 저축
ky: Эс алуу
lo: ມື້ພັກ
lt: Atostogos
lv: Atvaļinājums
mk: Одмор
ml: അവധിക്കാലം
mn: Амралт
mr: सुट्टी
ms: Percutian
my: အားလပ်ရက်
nb: Ferie
ne: बिदा
pa: ਛੁੱਟੀਆਂ
pl: Urlop
pt: Férias
pt_pt: Férias
ro: Vacanță
ru: Отпуск
si: නිවාඩුව
sk: Dovolenka
sq: Pushime
sr: Одмор
sr_latn: Odmor
sv: Semester
te: విహారయాత్ర
th: วันหยุดพักผ่อน
tr: Tatil
uk: Відпустка
ur: تعطیل
uz: Taʼtil
vi: Kỳ nghỉ
zh_hk: 度假
zu: Uhambo
