Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneEat0SemanticLabel
source: Pizza in a wood-fired oven
af: Pizza in 'n houtoond
am: በእንጨት በሚነድድ ምድጃ ውስጥ ፒዛ
ar_eg: بيتزا في فرن يُشعَل بالأخشاب
as: খৰিৰ ভাতীত থকা পিজ্জা
az: Odun sobasında pizza
be: Піца ў дрывяной печы
bn: কাঠের চুলায় পিৎজা
bs: Pizza u krušnoj peći
ca: Pizza al forn de llenya
da: En pizza i en træfyret ovn
es_ar: Pizza en un horno de leña
et: Kiviahjus olev pitsa
eu: Pizza bat egurrezko labe batean
fa: پیتزا در تنور هیزمی
fil: Pizza sa loob ng oven na ginagamitan ng panggatong
fr_ca: Pizza dans un four à bois
gl: Pizza nun forno de leña
gu: ચૂલામાં લાકડાથી પકાવેલા પિઝા
he: פיצה בתנור עצים
hi: लकड़ी जलाने से गर्म होने वाले अवन में पिज़्ज़ा
hu: Pizza egy fatüzelésű sütőben
hy: Պիցցա՝ փայտի վառարանում
id: Pizza dalam oven berbahan bakar kayu
it: Pizza in un forno a legna
ja: ウッドファイヤー オーブン内のピザ
ka: პიცა შეშის ღუმელში
km: ភីហ្សា​នៅក្នុង​ឡដុតអុស
kn: ಕಟ್ಟಿಗೆ ಒಲೆಯ ಮೇಲಿನ ಪಿಜ್ಜಾ
ko: 화덕 오븐 속 피자
ky: Жыгач отун менен меште бышырылган пицца
lo: ພິດຊ່າໃນເຕົາອົບຟືນ
lt: Pica malkinėje krosnyje
lv: Pica malkas krāsnī
mk: Пица во фурна на дрва
ml: വിറക് ഉപയോഗിക്കുന്ന അടുപ്പിലുണ്ടാക്കുന്ന പിസ
mn: Модоор галласан зуухан дахь пицца
mr: लाकडाचे इंधन असलेल्या ओव्हनमधील पिझ्झा
ms: Pizza dalam ketuhar menggunakan kayu
my: ထင်းမီးဖိုရှိ ပီဇာ
nb: Pizza i en vedfyrt ovn
ne: दाउरा बाल्ने भट्टीमा बनाइएको पिज्जा
pa: ਤੰਦੂਰ ਵਿੱਚ ਲੱਕੜ ਦੀ ਅੱਗ ਨਾਲ ਬਣਿਆ ਪੀਜ਼ਾ
pl: Pizza w piecu opalanym drewnem
pt: Pizza em um fogão à lenha
pt_pt: Piza num forno a lenha
ro: Pizza într-un cuptor pe lemne
ru: Пицца в дровяной печи
si: දර උඳුනක ඇති පිට්සාව
sk: Pizza v peci na drevo
sq: Pica në furrë druri
sr: Пица у пећи на дрва
sr_latn: Pica u peći na drva
sv: Pizza i en vedeldad ugn
te: చెక్క పొయ్యిలో పిజ్జా
th: พิซซ่าในเตาอบฟืนไม้
tr: Odun fırınında pişmiş pizza
uk: Піца в печі на дровах
ur: لکڑی سے جلنے والے اوون میں پزا
uz: Yogʻoch oʻtinli oʻchoqdagi pitsa
vi: Bánh pizza trong một lò nướng bằng củi
zh_hk: 柴火焗爐中的薄餅
zu: I-pizza kuwovini onomlilo wezinkuni

# craneSleep11SemanticLabel
source: Taipei 101 skyscraper
af: Taipei 101-wolkekrabber
am: ታይፔይ 101 ሰማይ ጠቀስ ህንፃ
ar_eg: مركز تايبيه المالي 101
as: টাইপেই ১০১ স্কাইস্ক্ৰেপাৰ
az: Taybey 101 göydələni
be: Небаскроб Тайбэй 101
bn: তাইপেই ১০১ স্কাই স্ক্র্যাপার
bs: Neboder Taipei 101
ca: Gratacel Taipei 101
da: Taipei 101-skyskraber
es_ar: Rascacielos Taipei 101
et: Taipei 101 pilvelõhkuja
eu: Taipei 101 etxe-orratza
fa: آسمان‌خراش ۱۰۱ تایپه
fr_ca: Gratte-ciel Taipei 101
gl: Rañaceos Taipei 101
gu: તાઇપેઇ 101 સ્કાયસ્ક્રેપર
he: גורד השחקים טאיפיי 101
hi: ताइपेई 101 स्काइस्क्रेपर
hu: A Taipei 101 felhőkarcoló
hy: Թայբեյ 101 երկնաքեր
id: Gedung pencakar langit Taipei 101
it: Grattacielo Taipei 101
ja: 台北 101（超高層ビル）
ka: ცათამბჯენი ტაიბეი 101
km: អគារ​កប់ពពក Taipei 101
kn: ಎತ್ತರದ ಕಟ್ಟಡ ತೈಪೆ 101
ko: 타이베이 101 마천루
ky: Тайпейдеги 101 кабаттан турган асман тиреген бийик имарат
lo: ຕຶກໄທເປ 101
lt: Taipėjaus dangoraižis 101
lv: Debesskrāpis Taipei 101
mk: Облакодерот Тајпеј 101
ml: തായ്പേയ് 101 സ്കൈസ്ക്രാപ്പർ
mn: Тайбэй 101 тэнгэр баганадсан барилга
mr: गगनचुंबी तैपेई १०१ इमारत
ms: Pencakar langit Taipei 101
my: တိုင်ပေ 101 မိုးမျှော်တိုက်
nb: Taipei 101-skyskraper
ne: ताइपेइ १०१ स्काइस्क्रेपर
pa: ਤਾਈਪੇ 101 ਉੱਚੀ ਇਮਾਰਤ
pl: Wieżowiec Taipei 101
pt: Arranha-céu Taipei 101
pt_pt: Arranha-céus Taipei 101
ro: Clădirea zgârie-nori Taipei 101
ru: Небоскреб Тайбэй 101
si: තාය්පේයි 101 උස් ගොඩනැගිල්ල
sk: Mrakodrap Taipei 101
sq: Qiellgërvishtësi Taipei 101
sr: Небодер Тајпеј 101
sr_latn: Neboder Tajpej 101
sv: Skyskrapan Taipei 101
te: తైపీ 101 ఆకాశహర్మ్యం
th: ตึกระฟ้าไทเป 101
tr: Taipei 101 gökdeleni
uk: Хмарочос Тайбей 101
ur: اسکائی اسکریپر 101 تائی پے
uz: Taypey 101 minorasi
vi: Tòa nhà chọc trời Đài Bắc 101
zh_hk: 台北 101 摩天大樓
zu: I-Taipei 101 skyscraper

# craneSleep10SemanticLabel
source: Al-Azhar Mosque towers during sunset
af: Al-Azhar-moskeetorings tydens sonsondergang
am: የአል-አዝሃር መስጊድ ማማዎች በጸሐይ መጥለቂያ ጊዜ
ar_eg: مآذن الجامع الأزهر أثناء الغروب
as: অল-আঝাৰ মছজিদটো সূৰ্যাস্তৰ সময়ত সুউচ্চ দেখা গৈছে
az: Gün batımı zamanı Əl-Əzhər Məscidinin minarələri
be: Мінарэты мячэці аль-Азхар на захадзе сонца
bn: সূর্যাস্তের সময় আল-আজহার মসজিদের টাওয়ার
bs: Minareti džamije Al-Azhar u suton
ca: Torres de la mesquita d'Al-Azhar durant la posta de sol
da: Al-Azhar-moskéens tårne ved solnedgang
es_ar: Torres de la mezquita de al-Azhar durante una puesta de sol
et: Al-Azhari mošee tornid päikeseloojangus
eu: Al-Azhar meskitaren dorreak ilunabarrean
fa: مناره‌های مسجد الازهر در غروب
fil: Mga tore ng Al-Azhar Mosque habang papalubog ang araw
fr_ca: Tours de la mosquée Al-Azhar au coucher du soleil
gl: Minaretes da mesquita de al-Azhar ao solpor
gu: સૂર્યાસ્ત પછી અલ-અઝહર મસ્જિદના ટાવર
he: המגדלים של מסגד אל-אזהר בשקיעה
hi: सूर्यास्त के दौरान अल-अज़हर मस्ज़िद के टावर
hu: Az Al-Azhar mecset tornyai a lemenő nap fényében
hy: Ալ-Ազհարի մզկիթի մինարեթները մայրամուտին
id: Menara Masjid Al-Azhar saat matahari terbenam
it: Torri della moschea di Al-Azhar al tramonto
ja: 日没時のアズハルモスク
ka: ალ-აზჰარის მეჩეთის კოშკები მზის ჩასვლისას
km: ប៉មវិហារ​អ៊ិស្លាម Al-Azhar អំឡុងពេល​ថ្ងៃលិច
kn: ಸೂರ್ಯಾಸ್ತದ ಸಮಯದಲ್ಲಿ ಅಲ್-ಅಜರ್ ಮಸೀದಿ ಗೋಪುರಗಳು
ko: 해질녘의 알아즈하르 모스크 탑
ky: Аль-Ажар мечитинин мунаралары күн баткан учурда
lo: Al-Azhar Mosque ໃນຕອນຕາເວັນຕົກ
lt: Al Azharo mečetės bokštai per saulėlydį
lv: Al-Azhara mošejas minareti saulrietā
mk: Минарињата на џамијата Ал-Азар на зајдисонце
ml: സൂര്യാസ്‌തമയ സമയത്ത് അൽ-അസ്ഹർ പള്ളിയുടെ മിനാരങ്ങൾ
mn: Нар жаргах үеийн Аль-Азхар сүмийн цамхгууд
mr: सूर्यास्ताच्या वेळी दिसणारे अल-अजहर मशिदीचे मिनार
ms: Menara Masjid Al-Azhar semasa matahari terbenam
my: နေဝင်ချိန် Al-Azhar Mosque မျှော်စင်များ
nb: Tårnene til Al-Azhar-moskeen ved solnedgang
ne: घाम अस्ताउँदै गरेका बेला अल-अजहर मस्जिदका टावरहरू
pa: ਸੂਰਜ ਡੁੱਬਣ ਦੌਰਾਨ ਅਲ-ਅਜ਼ਹਰ ਮਸੀਤ ਦੀਆਂ ਮੀਨਾਰਾਂ
pl: Wieże meczetu Al-Azhar w promieniach zachodzącego słońca
pt: Torres da mesquita de Al-Azhar no pôr do sol
pt_pt: Torres da Mesquita de Al-Azhar durante o pôr do sol
ro: Turnurile moscheii Al-Azhar la apus
ru: Минареты мечети аль-Азхар на закате
si: ඉර බසින අතරතුර අල් අසාර් පල්ලයේ කුළුණු
sk: Veže mešity Al-Azhar pri západe slnka
sq: Minaret e Xhamisë së Al-Azharit në perëndim të diellit
sr: Минарети џамије Ал-Аџар у сумрак
sr_latn: Minareti džamije Al-Adžar u sumrak
sv: Al-Azhar-moskéns torn i solnedgången
te: సూర్యాస్తమయం సమయంలో అల్-అజార్ మసీదు టవర్‌లు
th: มัสยิดอัลอัซฮัรช่วงพระอาทิตย์ตก
tr: Gün batımında El-Ezher Camisi'nin minareleri
uk: Мечеть аль-Азхар під час заходу сонця
ur: غروب آفتاب کے دوران ازہر مسجد کے ٹاورز
uz: Kun botayotganda Al-Azhar masjidi minoralari
vi: Tháp Al-Azhar Mosque lúc hoàng hôn
zh_hk: 夕陽下的愛資哈爾清真寺
zu: I-Al-Azhar Mosque towers ngesikhathi sokushona kwelanga

# craneSleep9SemanticLabel
source: Brick lighthouse at sea
af: Baksteenvuurtoring by die see
am: ባህር ላይ ያለ ባለጡብ ፋኖ ቤት
ar_eg: منارة من الطوب على شاطئ البحر
as: সাগৰত থকা ইটাৰ আলোকস্তম্ভ
az: Dənizdə kərpic dəniz fənəri
be: Цагельны маяк на моры
bn: সমুদ্রে ইটের বাতিঘর
bs: Svjetionik od cigle na moru
ca: Far de maons al mar
da: Murstensfyrtårn ved havet
es_ar: Faro de ladrillos en el mar
et: Kivimajakas merel
eu: Adreiluzko itsasargia
fa: فانوس دریایی آجری کنار دریا
fil: Brick na parola sa may dagat
fr_ca: Phare en briques en haute mer
gl: Faro de ladrillos xunto ao mar
gu: સમુદ્ર કિનારે ઈંટથી બનાવેલી દીવાદાંડી
he: מגדלור שבנוי מלבנים בים
hi: समुद्र तट पर ईंट से बना लाइटहाउस
hu: Téglaépítésű világítótorony a tengeren
hy: Աղյուսե փարոս՝ ծովի ֆոնի վրա
id: Mercusuar bata di laut
it: Faro di mattoni sul mare
ja: レンガ作りの海の灯台
ka: აგურის შუქურა ზღვაზე
km: ប៉មភ្លើង​នាំផ្លូវ​ធ្វើពី​ឥដ្ឋ​នៅសមុទ្រ
kn: ಸಮುದ್ರದಲ್ಲಿರುವ ಇಟ್ಟಿಗೆಯ ಲೈಟ್‌ ಹೌಸ್‌
ko: 벽돌로 지은 바다의 등대
ky: Деңиздеги кирпичтен курулган маяк
lo: ປະພາຄານດິນຈີ່ກາງທະເລ
lt: Mūrinis švyturys jūroje
lv: Ķieģeļu bāka jūrā
mk: Светилник од тули на море
ml: ഇഷ്‌ടിക കൊണ്ട് ഉണ്ടാക്കിയ കടലിലെ ലൈറ്റ്ഹൗസ്
mn: Далай дахь тоосгон гэрэлт цамхаг
mr: समुद्रात असलेले विटांचे दीपगृह
ms: Rumah api bata di laut
my: ပင်လယ်ရှိ အုတ်ဖြင့်တည်ဆောက်ထားသော မီးပြတိုက်
nb: Fyrtårn av murstein til sjøs
ne: समुद्रमा इटाले बनेको दीपगृह
pa: ਸਮੁੰਦਰ ਵਿੱਚ ਇੱਟਾਂ ਦਾ ਬਣਿਆ ਚਾਨਣ ਮੁਨਾਰਾ
pl: Ceglana latarnia na tle morza
pt: Farol de tijolos no mar
pt_pt: Farol de tijolo no mar
ro: Far din cărămidă pe malul mării
ru: Кирпичный маяк на фоне моря
si: මුහුදේ ඇති ගඩොල් ප්‍රදීපාගාරය
sk: Tehlový maják pri mori
sq: Far prej tulle buzë detit
sr: Светионик од цигала на мору
sr_latn: Svetionik od cigala na moru
sv: Tegelfyr i havet
te: సముద్రం వద్ద ఇటుకలతో నిర్మించబడిన లైట్ హౌస్
th: ประภาคารอิฐกลางทะเล
tr: Denizde tuğla deniz feneri
uk: Цегляний маяк біля моря
ur: سمندر کے کنارے برک لائٹ ہاؤس
uz: Dengiz boʻyidagi gʻishtdan qurilgan mayoq
vi: Ngọn hải đăng xây bằng gạch trên biển
zh_hk: 海上的磚燈塔
zu: Indlu enesibani yesitina esolwandle

# craneEat8SemanticLabel
source: Plate of crawfish
af: Bord met varswaterkreef
am: የክሮውፊሽ ሳህን
ar_eg: طبق جراد البحر
as: ক্ৰ’ফিশ্বৰ প্লেট
az: Bir boşqab xərçəng
be: Талерка з ракамі
bn: প্লেট ভর্তি চিংড়ি মাছ
bs: Tanjir s rečnim rakovima
ca: Plat de cranc de riu
da: Tallerken med krebs
es_ar: Plato de langosta
et: Taldrik vähkidega
eu: Otarrain-platera
fa: بشقاب شاه‌میگو
fil: Pinggan ng crawfish
fr_ca: Plateau de langoustes
gl: Prato con caranguexos de río
gu: ક્રોફિશથી ભરેલી પ્લેટ
he: צלחת של סרטני נהרות
hi: प्लेट में रखी झींगा मछली
hu: Languszták egy tányéron
hy: Խեցգետինների ափսե
id: Sepiring udang laut
it: Piatto di gamberi d'acqua dolce
ja: ザリガニが載った皿
ka: თეფში ლანგუსტებით
km: បង្កង​ទឹកសាប​ដែលមាន​ទំហំតូច​មួយចាន
kn: ಕ್ರಾಫಿಷ್ ಪ್ಲೇಟ್
ko: 민물 가재 요리
ky: Лангуст табагы
lo: ຈານໃສ່ກຸ້ງນ້ຳຈືດ
lt: Vėžių lėkštė
lv: Šķīvis ar vēžiem
mk: Чинија со ракови
ml: ഒരു പ്ലേറ്റ് ക്രോഫിഷ്
mn: Хавчны таваг
mr: क्रॉफिशने भरलेली प्लेट
ms: Sepinggan udang krai
my: ကျောက်ပုစွန် ဟင်းလျာ
nb: Fat med kreps
ne: क्रफिसको प्लेट
pa: ਕ੍ਰਾਫਿਸ਼ ਨਾਲ ਭਰੀ ਪਲੇਟ
pl: Talerz pełen raków
pt: Prato de lagostim
pt_pt: Prato de lagostins
ro: Platou cu languste
ru: Тарелка раков
si: පොකිරිස්සෝ පිඟාන
sk: Tanier s rakmi
sq: Pjatë me karavidhe
sr: Тањир са речним раковима
sr_latn: Tanjir sa rečnim rakovima
sv: Fat med kräftor
te: ప్లేట్‌లో క్రాఫిష్
th: จานใส่กุ้งน้ำจืด
tr: Kerevit tabağı
uk: Тарілка раків
ur: پلیٹ میں رکھی جھینگا مچھلی
uz: Qisqichbaqalar likopchasi
vi: Đĩa tôm hùm đất
zh_hk: 一碟小龍蝦
zu: Ipuleti le-crawfish

# craneSleep7SemanticLabel
source: Colorful apartments at Riberia Square
af: Kleurryke woonstelle by Riberia Square
am: በሪቤሪያ አደባባይ ላይ ያሉ ባለቀለም አፓርታማዎች
ar_eg: شُقق ملونة في ميدان ريبيارا
as: ৰাইবেৰিয়া স্কুয়েৰত ৰঙীন আবাস
az: Ribeyra Meydanında rəngarəng mənzillər
be: Каляровыя дамы на плошчы Рыбейра
bn: রিবেরিয়া স্কোয়ারে রঙিন অ্যাপার্টমেন্ট
bs: Šareni stanovi na Trgu Riberia
ca: Apartaments acolorits a la Praça da Ribeira
da: Farverige lejligheder på Ribeira Square
es_ar: Casas coloridas en la Plaza Ribeira
et: Värvikirevad korterid Riberia väljakul
eu: Eraikin koloretsuak Ribeira plazan
fa: آپارتمان‌های رنگی در میدان ریبریا
fil: Makukulay na apartment sa Riberia Square
fr_ca: Appartements colorés sur la Place Ribeira
gl: Casas coloridas na Praza da Ribeira
gu: રિબેરિયા સ્ક્વેરમાં રંગીન એપાર્ટમેન્ટ
he: דירות צבעוניות בכיכר ריברה
hi: राईबेरिया स्क्वायर में रंगीन अपार्टमेंट
hu: Színes lakóházak a Ribeira-téren
hy: Վառ տներ Ռիբեյրա հրապարակում
id: Apartemen warna-warni di Ribeira Square
it: Appartamenti colorati a piazza Ribeira
ja: リベイラ広場のカラフルなアパートメント
ka: ფერადი საცხოვრებელი სახლები რიბეირას მოედანზე
km: ផ្ទះល្វែង​ចម្រុះពណ៌​នៅ Ribeira Square
kn: ರಿಬೇರಿಯಾ ಸ್ಕ್ವೇರ್‌ನಲ್ಲಿನ ವರ್ಣರಂಜಿತ ಅಪಾರ್ಟ್‌ಮೆಂಟ್‌ಗಳು
ko: 히베이라 광장의 알록달록한 아파트
ky: Рибейра аянтындагы түстүү батирлер
lo: ຫ້ອງພັກທີ່ມີສີສັນສົດໃສຢູ່ຈະຕຸລັດ Ribeira
lt: Spalvingi apartamentai Ribeiro aikštėje
lv: Krāsainas mājas Ribeiras laukumā
mk: Живописни апартмани на плоштадот Рибеира
ml: റിബേറിയ സ്ക്വയറിലെ വർണ്ണശബളമായ അപ്പാർട്ട്മെന്റുകൾ
mn: Riberia Square дахь өнгөлөг орон сууцууд
mr: रिबेरिया स्क्वेअरमधील रंगीत अपार्टमेंट
ms: Pangsapuri berwarna-warni di Ribeira Square
my: Riberia Square ရှိ ရောင်စုံတိုက်ခန်းများ
nb: Fargerike leiligheter i Riberia Square
ne: रिबेरिया स्क्वायरका रङ्गीचङ्गी अपार्टमेन्टहरू
pa: ਰਾਈਬੇਰੀਆ ਸਕਵੇਅਰ 'ਤੇ ਰੰਗ-ਬਿਰੰਗੇ ਅਪਾਰਟਮੈਂਟ
pl: Kolorowe domy na placu Ribeira
pt: Apartamentos coloridos na Praça da Ribeira
pt_pt: Apartamentos coloridos na Praça Ribeira
ro: Apartamente colorate în Riberia Square
ru: Яркие дома на площади Рибейра
si: රයිබේරියා චතුරස්‍රයේ ඇති වර්ණවත් බද්ධ නිවාස
sk: Pestrofarebné byty na námestí Riberia
sq: Apartamente shumëngjyrëshe në Sheshin Ribeira
sr: Шарени станови на тргу Рибеира
sr_latn: Šareni stanovi na trgu Ribeira
sv: Färgglada byggnader vid Praça da Ribeira
te: రిబీరియా స్క్వేర్ వద్ద రంగురంగుల అపార్టుమెంట్‌లు
th: อพาร์ตเมนต์สีสันสดใสที่จัตุรัส Ribeira
tr: Ribeira Meydanı'nda renkli apartmanlar
uk: Барвисті будинки на площі Рібейра
ur: رائبیریا اسکوائر میں رنگین اپارٹمنٹس
uz: Riberiya maydonidagi rang-barang xonadonlar
vi: Những ngôi nhà rực rỡ sắc màu tại Quảng trường Riberia
zh_hk: 里貝拉廣場的彩色公寓
zu: Izindawo zokuhlala ezinemibalabala e-Riberia Square

# craneSleep6SemanticLabel
source: Pool with palm trees
af: Swembad met palmbome
am: ዘንባባ ዛፎች ያለው መዋኛ
ar_eg: بركة ونخيل
as: তাল গছৰ সৈতে সাঁতোৰা পুখুৰী
az: Palma ağacları olan hovuz
be: Басейн з пальмамі
bn: তাল গাছ সহ পুল
bs: Bazen okružen palmama
ca: Piscina amb palmeres
da: Swimmingpool med palmetræer
es_ar: Piscina con palmeras
et: Bassein ja palmid
eu: Igerileku bat palmondoekin
fa: استخر با درختان نخل
fil: Pool na may mga palm tree
fr_ca: Piscine avec des palmiers
gl: Piscina con palmeiras
gu: પામના વૃક્ષોવાળો પૂલ
he: עצי דקל לצד בריכה
hi: ताड़ के पेड़ों के साथ पूल
hu: Medence pálmafákkal
hy: Արմավենիներով շրջապատված լողավազան
id: Kolam renang yang terdapat pohon palem
it: Piscina con palme
ja: ヤシの木があるプール
ka: აუზი პალმის ხეებით
km: អាងហែលទឹក​ដែលមាន​ដើមត្នោត
kn: ತಾಳೆ ಮರಗಳ ಜೊತೆಗೆ ಈಜುಕೊಳ
ko: 야자수가 있는 수영장
ky: Пальмалары бар бассейн
lo: ສະລອຍນ້ຳທີ່ມີຕົ້ນປາມ
lt: Baseinas su palmėmis
lv: Peldbaseins ar palmām
mk: Базен со палми
ml: ഈന്തപ്പനകളോടുകൂടിയ പൂൾ
mn: Далдуу модтой усан сан
mr: पामच्या झाडांच्या सान्निध्यातील पूल
ms: Kolam renang dengan pokok palma
my: ထန်းပင်များနှင့် ရေကူးကန်
nb: Basseng med palmer
ne: खजुरको रूख भएको पोखरी
pa: ਖਜੂਰ ਦੇ ਦਰੱਖਤਾਂ ਵਾਲਾ ਪੂਲ
pl: Basen z palmami
pt: Piscina com palmeiras
pt_pt: Piscina com palmeiras
ro: Piscină cu palmieri
ru: Бассейн, окруженный пальмами
si: තල් ගස් සහිත නාන තටාකය
sk: Bazén s palmami
sq: Pishinë me palma
sr: Базен са палмама
sr_latn: Bazen sa palmama
sv: Pool och palmer
te: తాటి చెట్ల పక్కన ఈత కొలను
th: สระว่ายน้ำที่มีต้นปาล์ม
tr: Palmiye ağaçlarıyla havuz
uk: Басейн із пальмами
ur: کھجور کے درختوں کے ساتھ پول
uz: Atrofida palmalari bor hovuz
vi: Bể bơi xung quanh là những cây cọ
zh_hk: 樹影婆娑的泳池
zu: Iphuli enezihlahla zamasundu

# craneSleep5SemanticLabel
source: Tent in a field
af: Tent in 'n veld
am: በአንድ ሜዳ ላይ ድንኳን
ar_eg: خيمة في حقل
as: পথাৰত থকা তম্বু
az: Sahədə çadır
be: Палатка ў полі
bn: ফিল্ডে টেন্ট
bs: Šator u polju
ca: Tenda de campanya al camp
da: Telt på en mark
es_ar: Tienda en un campo
et: Telk väljal
eu: Denda bat zelai batean
fa: چادری در مزرعه
fil: Tent sa isang parang
fr_ca: Tente dans un champ
gl: Tenda de campaña nun campo
gu: ફીલ્ડમાં તંબુ
he: אוהל בשדה
hi: मैदान में टेंट
hu: Sátor egy mezőn
hy: Վրան դաշտում
id: Tenda di lapangan
it: Tenda in un campo
ja: 野に張られたテント
ka: კარავი ველზე
km: តង់​នៅវាល
kn: ಮೈದಾನದಲ್ಲಿ ಹಾಕಿರುವ ಟೆಂಟ್
ko: 들판의 텐트
ky: Талаадагы чатыр
lo: ເຕັ້ນພັກແຮມໃນທົ່ງ
lt: Palapinė lauke
lv: Telts laukā
mk: Шатор на поле
ml: ഫീൽഡിലെ ടെന്റ്
mn: Талбай дээрх майхан
mr: माळरानावरचा टेंट
ms: Khemah di padang
my: လယ်ကွင်းတစ်ခုရှိတဲ
nb: Telt i en mark
ne: मैदानमा लगाइएको टेन्ट
pa: ਕਿਸੇ ਮੈਦਾਨ ਵਿੱਚ ਟੈਂਟ
pl: Namiot w polu
pt: Barraca em um campo
pt_pt: Tenda num campo
ro: Cort pe un câmp
ru: Палатка в поле
si: පිට්ටනියක ඇති කුඩාරම
sk: Stan na poli
sq: Tendë në fushë
sr: Шатор у пољу
sr_latn: Šator u polju
sv: Tält på ett fält
te: మైదానంలో గుడారం
th: เต็นท์ในทุ่ง
tr: Bir arazideki çadır
uk: Намет у полі
ur: میدان میں ٹینٹ
uz: Daladagi chodir
vi: Chiếc lều giữa cánh đồng
zh_hk: 田野中的帳篷
zu: Itende kunkambu

# settingsButtonCloseLabel
source: Close settings
af: Maak instellings toe
am: ቅንብሮችን ዝጋ
ar_eg: إغلاق الإعدادات
as: ছেটিংসমূহ বন্ধ কৰক
az: Ayarları qapadın
be: Закрыць налады
bn: সেটিংস বন্ধ করুন
bs: Zatvori postavke
ca: Tanca la configuració
da: Luk indstillinger
es_ar: Cerrar configuración
et: Sule seaded
eu: Itxi ezarpenak
fa: بستن تنظیمات
fil: Isara ang mga setting
fr_ca: Fermer les paramètres
gl: Pechar configuración
gu: સેટિંગ બંધ કરો
he: סגירת ההגדרות
hi: सेटिंग बंद करें
hu: Beállítások bezárása
hy: Փակել կարգավորումները
id: Tutup setelan
it: Chiudi impostazioni
ja: 設定を閉じる
ka: პარამეტრების დახურვა
km: បិទ​ការ​កំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳನ್ನು ಮುಚ್ಚಿರಿ
ko: 설정 닫기
ky: Параметрлерди жабуу
lo: ປິດການຕັ້ງຄ່າ
lt: Uždaryti nustatymus
lv: Aizvērt iestatījumus
mk: Затвори ги поставките
ml: ക്രമീകരണം അടയ്ക്കുക
mn: Тохиргоог хаах
mr: सेटिंग्ज बंद करा
ms: Tutup tetapan
my: ဆက်တင်အားပိတ်ရန်
nb: Lukk innstillingene
ne: सेटिङ बन्द गर्नुहोस्
pa: ਸੈਟਿੰਗਾਂ ਬੰਦ ਕਰੋ
pl: Zamknij ustawienia
pt: Fechar configurações
pt_pt: Fechar definições
ro: Închideți setările
ru: Закрыть настройки
si: සැකසීම් වසන්න
sk: Zavrieť nastavenia
sq: Mbyll "Cilësimet"
sr: Затворите подешавања
sr_latn: Zatvorite podešavanja
sv: Stäng inställningar
te: సెట్టింగ్‌లను మూసివేయి
th: ปิดการตั้งค่า
tr: Ayarları kapat
uk: Закрити налаштування
ur: ترتیبات بند کریں
uz: Sozlamalarni yopish
vi: Đóng phần cài đặt
zh_hk: 閂咗設定
zu: Vala izilungiselelo
