Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# rallyBudgetAmount
source: {budgetName} budget with {amountUsed} used of {amountTotal}, {amountLeft} left
af: {budgetName}-begroting met {amountUsed} gebruik van {amountTotal}; {amountLeft} oor
am: {budgetName} በጀት {amountUsed} ከ{amountTotal} ጥቅም ላይ ውሏል፣ {amountLeft} ይቀራል
ar_eg: ميزانية {budgetName} مع استخدام {amountUsed} من إجمالي {amountTotal}، المبلغ المتبقي {amountLeft}
as: {budgetName}ৰ {amountTotal}ৰ ভিতৰত {amountUsed} ব্যৱহাৰ কৰা হৈছে, {amountLeft} বাকী আছে
az: {budgetName} büdcəsi {amountUsed}/{amountTotal} istifadə edilib, {amountLeft} qalıb
be: Бюджэт {budgetName}: выкарыстана {amountUsed} з {amountTotal}, засталося {amountLeft}
bn: {budgetName} বাজেটের {amountTotal}-এর মধ্যে {amountUsed} খরচ হয়েছে, {amountLeft} বাকি আছে
bs: Od ukupnog budžeta ({budgetName}) od {amountTotal} iskorišteno je {amountUsed}, a preostalo je {amountLeft}
ca: Has gastat {amountUsed} de {amountTotal} del pressupost {budgetName}; import restant: {amountLeft}
da: Budgettet {budgetName}, hvor {amountUsed} ud af {amountTotal} er brugt, og der er {amountLeft} tilbage
es_ar: Se usó un total de {amountUsed} de {amountTotal} del presupuesto {budgetName}; el saldo restante es {amountLeft}
et: Eelarve {budgetName} summast {amountTotal} on kasutatud {amountUsed}, järel on {amountLeft}
eu: "{budgetName}" izeneko aurrekontua: {amountUsed}/{amountTotal} erabilita; {amountLeft} gelditzen da
fa: بودجه {budgetName} با مبلغ کلی {amountTotal} که {amountUsed} از آن مصرف‌شده و {amountLeft} باقی‌مانده است
fil: Badyet sa {budgetName} na may nagamit nang {amountUsed} sa {amountTotal}, {amountLeft} ang natitira
fr_ca: Dans le budget {budgetName}, {amountUsed} a été utilisé sur {amountTotal} (il reste {amountLeft})
gl: O orzamento {budgetName} é de {amountTotal}; utilizouse un importe de {amountUsed} e queda unha cantidade de {amountLeft}
gu: {budgetName}ના {amountTotal}ના બજેટમાંથી {amountUsed} વપરાયા, {amountLeft} બાકી છે
he: בתקציב {budgetName} הייתה הוצאה של {amountUsed} מתוך {amountTotal} ונותר הסכום {amountLeft}
hi: {budgetName} के {amountTotal} के बजट में से {amountUsed} इस्तेमाल किए गए और {amountLeft} बचे हैं
hu: {amountTotal} összegű {budgetName} költségkeret, amelyből felhasználásra került {amountUsed}, és maradt {amountLeft}
hy: Բյուջե՝ {budgetName}։ Ծախսվել է {amountUsed}՝ {amountTotal}-ից։ Մնացել է՝ {amountLeft}։
id: Anggaran {budgetName} dengan {amountUsed} yang digunakan dari jumlah total {amountTotal}, tersisa {amountLeft}
it: Budget {budgetName} di cui è stato usato un importo pari a {amountUsed} su {amountTotal}; {amountLeft} ancora disponibile
ja: {budgetName}、使用済み予算 {amountUsed}、総予算 {amountTotal}、予算残高 {amountLeft}
ka: {budgetName} ბიუჯეტი, დახარჯული თანხა: {amountUsed} / {amountTotal}-დან, დარჩენილი თანხა: {amountLeft}
km: ថវិកា {budgetName} ដែលចំណាយអស់ {amountUsed} នៃទឹកប្រាក់សរុប {amountTotal} ហើយនៅសល់ {amountLeft}
kn: {amountTotal} ರಲ್ಲಿನ {budgetName} ಬಜೆಟ್‌ನ {amountUsed} ಮೊತ್ತವನ್ನು ಬಳಸಲಾಗಿದೆ, {amountLeft} ಬಾಕಿಯಿದೆ
ko: {budgetName} 예산 {amountTotal} 중 {amountUsed} 사용, {amountLeft} 남음
ky: {budgetName} бюджетинен {amountUsed} өлчөмүндөгү сумма {amountTotal} үчүн сарпталып, {amountLeft} калды
lo: ງົບປະມານ {budgetName} ໃຊ້ໄປແລ້ວ {amountUsed} ຈາກຈຳນວນ {amountTotal}, ເຫຼືອ {amountLeft}
lt: Biudžetas „{budgetName}“, kurio išnaudota suma: {amountUsed} iš {amountTotal}; likusi suma: {amountLeft}
lv: Budžets {budgetName} ar iztērētu summu {amountUsed} no {amountTotal}, atlikusī summa: {amountLeft}
mk: {budgetName} буџет со искористени {amountUsed} од {amountTotal}, преостануваат {amountLeft}
ml: മൊത്തം {amountTotal} തുകയിൽ {amountUsed} നിരക്ക് ഉപയോഗിച്ച {budgetName} ബജറ്റ്, {amountLeft} ശേഷിക്കുന്നു
mn: {budgetName} төсвийн {amountTotal}-с {amountUsed}-г ашигласан, {amountLeft} үлдсэн
mr: {budgetName} च्या बजेटच्या एकूण {amountTotal} मधून {amountUsed} वापरले गेले आणि {amountLeft} शिल्लक आहे
ms: Belanjawan {budgetName} dengan {amountUsed} digunakan daripada {amountTotal}, baki {amountLeft}
my: {amountTotal} အနက် {amountUsed} အသုံးပြုထားသော {budgetName} အသုံးစရိတ်တွင် {amountLeft} ကျန်ပါသည်
nb: Budsjettet {budgetName} med {amountUsed} brukt av {amountTotal}, {amountLeft} gjenstår
ne: {amountTotal} कुल रकम भएको, {amountUsed} चलाइएको र {amountLeft} छाडिएको {budgetName} बजेट
pa: {budgetName} ਦੇ ਬਜਟ {amountTotal} ਵਿੱਚੋਂ {amountUsed} ਵਰਤੇ ਗਏ ਹਨ, {amountLeft} ਬਾਕੀ
pl: Budżet {budgetName}: wykorzystano {amountUsed} z {amountTotal}, pozostało: {amountLeft}
pt: O orçamento {budgetName} com {amountUsed} usados de {amountTotal}. Valor restante: {amountLeft}
pt_pt: Orçamento {budgetName} com {amountUsed} utilizado(s) de {amountTotal}, com {amountLeft} restante(s).
ro: Bugetul pentru {budgetName} cu {amountUsed} cheltuiți din {amountTotal}, {amountLeft} rămași
ru: Бюджет "{budgetName}". Израсходовано: {amountUsed} из {amountTotal}. Осталось: {amountLeft}.
si: {amountTotal} කින් {amountUsed}ක් භාවිත කළ {budgetName} අයවැය, ඉතිරි {amountLeft}
sk: Rozpočet {budgetName} s minutou sumou {amountUsed} z {amountTotal} a zostatkom {amountLeft}
sq: Buxheti {budgetName} me {amountUsed} të përdorura nga {amountTotal}, {amountLeft} të mbetura
sr: Буџет за {budgetName}, потрошено је {amountUsed} од {amountTotal}, преостало је {amountLeft}
sr_latn: Budžet za {budgetName}, potrošeno je {amountUsed} od {amountTotal}, preostalo je {amountLeft}
sv: {budgetName}-budget med {amountUsed} använt av {amountTotal}, {amountLeft} kvar
te: మొత్తంగా {amountTotal} కలిగిన {budgetName} బడ్జెట్‌లో {amountUsed} ఉపయోగించబడింది, అందు వల్ల {amountLeft} మిగిలి ఉంది
th: ใช้งบประมาณ{budgetName}ไปแล้ว {amountUsed} จากทั้งหมด {amountTotal} เหลืออีก {amountLeft}
tr: Toplamı {amountTotal} olan ve {amountUsed} kullanıldıktan sonra {amountLeft} kalan {budgetName} bütçesi
uk: З бюджету "{budgetName}" ({amountTotal}) використано {amountUsed}, залишок – {amountLeft}
ur: {budgetName} بجٹ جس کا {amountUsed} استعمال کیا گیا {amountTotal} ہے، {amountLeft} باقی ہے
uz: {budgetName} uchun ajratilgan {amountTotal} dan {amountUsed} ishlatildi, qolgan balans: {amountLeft}
vi: Đã dùng hết {amountUsed}/{amountTotal} ngân sách {budgetName}, số tiền còn lại là {amountLeft}
zh_hk: {budgetName}財務預算已使用 {amountTotal} 中的 {amountUsed}，尚餘 {amountLeft}
zu: {budgetName} ibhajethi enokungu-{amountUsed} okusetshenzisiwe kokungu-{amountTotal}, {amountLeft} okusele

# shrineTooltipRemoveItem
source: Remove item
af: Verwyder item
am: ንጥል ያስወግዱ
ar_eg: إزالة العنصر
as: বস্তু আঁতৰাওক
az: Elementi silin
be: Выдаліць элемент
bn: আইটেম সরান
bs: Uklanjanje stavke
ca: Suprimeix l'article
da: Fjern varen
es_ar: Quitar elemento
et: Eemalda üksus
eu: Kendu produktua
fa: برداشتن مورد
fil: Alisin ang item
fr_ca: Supprimer l'élément
gl: Quitar o artigo
gu: આઇટમ કાઢી નાખો
he: הסרת פריט
hi: आइटम हटाएं
hu: Tétel eltávolítása
hy: Հեռացնել ապրանքը
id: Hapus item
it: Rimuovi articolo
ja: アイテムを削除します
ka: ერთეულის ამოშლა
km: ដក​ទំនិញ​ចេញ
kn: ಐಟಂ ತೆಗೆದುಹಾಕಿ
ko: 항목 삭제
ky: Нерсени алып салуу
lo: ລຶບລາຍການ
lt: Pašalinti elementą
lv: Noņemt vienumu
mk: Отстрани ја ставката
ml: ഇനം നീക്കം ചെയ്യുക
mn: Зүйлийг хасах
mr: आयटम काढून टाका
ms: Alih keluar item
my: ပစ္စည်းကို ဖယ်ရှားရန်
nb: Fjern varen
ne: वस्तु हटाउनुहोस्
pa: ਆਈਟਮ ਹਟਾਓ
pl: Usuń element
pt: Remover item
pt_pt: Remover item
ro: Eliminați articolul
ru: Удалить товар
si: අයිතමය ඉවත් කරන්න
sk: Odstrániť položku
sq: Hiq artikullin
sr: Уклоните ставку
sr_latn: Uklonite stavku
sv: Ta bort objektet
te: అంశాన్ని తీసివేయండి
th: นำสินค้าออก
tr: Öğeyi kaldır
uk: Вилучити товар
ur: آئٹم ہٹائیں
uz: Elementni olib tashlash
vi: Xóa mặt hàng
zh_hk: 移除項目
zu: Susa into

# rallyAccountAmount
source: {accountName} account {accountNumber} with {amount}.
af: {accountName}-rekening {accountNumber} met {amount}.
am: {accountName} መለያ {accountNumber} በ {amount}።
ar_eg: الحساب {accountName} رقم {accountNumber} بمبلغ {amount}.
as: {accountName} একাউণ্ট {accountNumber}ত {amount} জমা কৰা হৈছে।
az: {amount} ilə {accountName} hesabı {accountNumber}.
be: Рахунак {accountName} {accountNumber} з {amount}.
bn: {accountName} অ্যাকাউন্ট {accountNumber}-এ {amount}।
bs: Na račun ({accountName}) s brojem {accountNumber} je uplaćen iznos od {amount}.
ca: Import al compte {accountName} amb el número {accountNumber}: {amount}.
da: Kontoen "{accountName}" {accountNumber} med saldoen {amount}.
es_ar: Cuenta {accountName} {accountNumber} con {amount}
et: Konto {accountName} ({accountNumber}) – {amount}.
eu: {accountName} bankuko {accountNumber} kontua ({amount}).
fa: حساب {accountName} به شماره {accountNumber} با موجودی {amount}.
fil: {accountName} account {accountNumber} na may {amount}.
fr_ca: Compte {accountName} {accountNumber} dont le solde est de {amount}.
gl: A conta {accountNumber} ({accountName}) contén {amount}.
gu: {accountName}ના એકાઉન્ટ નંબર {accountNumber}માં {amount} જમા કર્યાં.
he: בחשבון {accountName} עם המספר {accountNumber} יש {amount}.
hi: {accountName} खाता संख्या {accountNumber} में {amount} की रकम जमा की गई.
hu: {accountName} bankszámla ({accountNumber}) {amount} összeggel.
hy: {amount} գումարի {accountName} հաշիվ ({accountNumber})։
id: Rekening atas nama {accountName} dengan nomor {accountNumber} sejumlah {amount}.
it: Conto {accountName} {accountNumber} con {amount}.
ja: {accountName}、口座番号 {accountNumber}、残高 {amount}。
ka: {accountName} ანგარიში {accountNumber}, თანხა {amount}.
km: គណនី {accountName} {accountNumber} ដែលមាន​ទឹកប្រាក់ {amount}។
kn: {accountName} ಖಾತೆ {accountNumber} {amount} ಮೊತ್ತದೊಂದಿಗೆ.
ko: {accountName} 계좌 {accountNumber}의 잔액은 {amount}입니다.
ky: {accountNumber} номериндеги {accountName} аккаунтунда {amount} бар.
lo: ບັນຊີ {accountName} ໝາຍເລກ {accountNumber} ຈຳນວນ {amount}.
lt: {accountName} sąskaita ({accountNumber}), kurioje yra {amount}.
lv: Kontā ({accountName}; numurs: {accountNumber}) ir šāda summa: {amount}.
mk: {accountName} сметка {accountNumber} со {amount}.
ml: {amount} നിരക്കുള്ള, {accountNumber} എന്ന അക്കൗണ്ട് നമ്പറോട് കൂടിയ {accountName} അക്കൗണ്ട്.
mn: {amount}-тай {accountName}-н {accountNumber} дугаартай данс.
mr: {amount} {accountName} चे खाते नंबर {accountNumber} मध्ये जमा केले.
ms: Akaun {accountName} bagi {accountNumber} sebanyak {amount}.
my: {amount} ထည့်ထားသော {accountName} အကောင့် {accountNumber}။
nb: {accountName}-kontoen, {accountNumber}, med {amount}.
ne: {amount} रकम सहितको {accountName} खाता {accountNumber}।
pa: {amount} ਦੀ ਰਕਮ {accountName} ਦੇ ਖਾਤਾ ਨੰਬਰ {accountNumber} ਵਿੱਚ ਜਮ੍ਹਾ ਕਰਵਾਈ ਗਈ।
pl: Nazwa konta: {accountName}, nr konta {accountNumber}, kwota {amount}.
pt: Conta {accountName} {accountNumber} com {amount}.
pt_pt: Conta {accountName} {accountNumber} com {amount}.
ro: Contul {accountName} {accountNumber} cu {amount}.
ru: Счет "{accountName}" с номером {accountNumber}. Баланс: {amount}.
si: {accountName} ගිණුම {accountNumber} {amount}කි.
sk: Účet {accountName} {accountNumber} má zostatok {amount}.
sq: Llogaria {accountName} {accountNumber} me {amount}.
sr: {accountName} рачун {accountNumber} са {amount}.
sr_latn: {accountName} račun {accountNumber} sa {amount}.
sv: {accountName}-kontot {accountNumber} med {amount}.
te: {accountNumber} నంబర్ కలిగిన {accountName} అకౌంట్‌లో {amount}.
th: บัญชี{accountName} เลขที่ {accountNumber} จำนวน {amount}
tr: Bakiyesi {amount} olan {accountNumber} numaralı {accountName} hesabı.
uk: Рахунок "{accountName}" ({accountNumber}), на якому зберігається {amount}.
ur: {amount} کے ساتھ {accountName} اکاؤنٹ {accountNumber}۔
uz: {accountNumber} raqamli {accountName} hisobida {amount} bor.
vi: Số dư tài khoản {accountName} {accountNumber} là {amount}.
zh_hk: {accountName}帳戶 ({accountNumber}) 存入 {amount}。
zu: {accountName} i-akhawunti engu-{accountNumber} enokungu-{amount}.

# rallySeeAllBudgets
source: See all budgets
af: Sien alle begrotings
am: ሁሉንም በጀቶች ይመልከቱ
ar_eg: عرض جميع الميزانيات
as: সকলো বাজেট চাওক
az: Bütün büdcələrə baxın
be: Прагледзець усе бюджэты
bn: সব বাজেট দেখুন
bs: Vidi sve budžete
ca: Mostra tots els pressupostos
da: Se alle budgetter
es_ar: Ver todos los presupuestos
et: Kuva kõik eelarved
eu: Ikusi aurrekontu guztiak
fa: دیدن کل بودجه
fil: Tingnan ang lahat ng badyet
fr_ca: Voir tous les budgets
gl: Ver todos os orzamentos
gu: બધા બજેટ જુઓ
he: הצגת כל התקציבים
hi: सभी बजट देखें
hu: Összes költségkeret megtekintése
hy: Դիտել բոլոր բյուջեները
id: Lihat semua anggaran
it: Visualizza tutti i budget
ja: 予算をすべて表示
ka: ყველა ბიუჯეტის ნახვა
km: មើល​ថវិកា​ទាំងអស់
kn: ಎಲ್ಲಾ ಬಜೆಟ್‌ಗಳನ್ನು ನೋಡಿ
ko: 모든 예산 보기
ky: Бардык бюджеттерди көрүү
lo: ເບິ່ງງົບປະມານທັງໝົດ
lt: Peržiūrėti visus biudžetus
lv: Skatīt visus budžetus
mk: Прикажи ги сите буџети
ml: എല്ലാ ബജറ്റുകളും കാണുക
mn: Бүх төсвийг харах
mr: सर्व बजेट पहा
ms: Lihat semua belanjawan
my: အသုံးစရိတ်အားလုံးကို ကြည့်ရန်
nb: Se alle budsjettene
ne: सबै बजेटहरू हेर्नुहोस्
pa: ਸਾਰੇ ਬਜਟ ਦੇਖੋ
pl: Wyświetl wszystkie budżety
pt: Ver todos os orçamentos
pt_pt: Ver todos os orçamentos
ro: Vedeți toate bugetele
ru: Показать все бюджеты
si: සියලු අයවැය බලන්න
sk: Zobraziť všetky rozpočty
sq: Shiko të gjitha buxhetet
sr: Прикажи све буџете
sr_latn: Prikaži sve budžete
sv: Visa alla budgetar
te: అన్ని బడ్జెట్‌లనూ చూడండి
th: ดูงบประมาณทั้งหมด
tr: Tüm bütçeleri göster
uk: Переглянути всі бюджети
ur: سبھی بجٹس دیکھیں
uz: Barcha budjetlar
vi: Xem tất cả ngân sách
zh_hk: 查看所有財務預算
zu: Bona wonke amabhajethi

# rallySeeAllBills
source: See all bills
af: Sien alle rekeninge
am: ሁሉንም ክፍያ መጠየቂያዎች ይመልከቱ
ar_eg: عرض كل الفواتير
as: সকলো বিল চাওক
az: Bütün fakturalara baxın
be: Паказаць усе рахункі
bn: সব বিল দেখুন
bs: Prikaži sve račune
ca: Mostra totes les factures
da: Se alle regninger
es_ar: Ver todas las facturas
et: Kuva kõik arved
eu: Ikusi faktura guztiak
fa: دیدن همه صورت‌حساب‌ها
fil: Tingnan ang lahat ng bill
fr_ca: Voir toutes les factures
gl: Ver todas as facturas
gu: બધા બિલ જુઓ
he: הצגת כל החיובים
hi: सभी बिल देखें
hu: Összes számla megtekintése
hy: Դիտել բոլոր վճարումները
id: Lihat semua tagihan
it: Visualizza tutte le fatture
ja: 請求をすべて表示
ka: ყველა გადასახდელი ანგარიშის ნახვა
km: មើល​វិក្កយបត្រ​ទាំងអស់
kn: ಎಲ್ಲಾ ಬಿಲ್‌ಗಳನ್ನು ನೋಡಿ
ko: 모든 청구서 보기
ky: Бардык эсептерди көрүү
lo: ເບິ່ງບິນທັງໝົດ
lt: Peržiūrėti visas sąskaitas
lv: Skatīt visus rēķinus
mk: Прикажи ги сите сметки
ml: എല്ലാ ബില്ലുകളും കാണുക
mn: Бүх тооцоог харах
mr: सर्व बिल पहा
ms: Lihat semua bil
my: ငွေတောင်းခံလွှာအားလုံး ကြည့်ရန်
nb: Se alle regningene
ne: सबै बिलहरू हेर्नुहोस्
pa: ਸਾਰੇ ਬਿੱਲ ਦੇਖੋ
pl: Wyświetl wszystkie rachunki
pt: Ver todas as faturas
pt_pt: Ver todas as faturas
ro: Vedeți toate facturile
ru: Показать все счета
si: සියලු බිල්පත් බලන්න
sk: Zobraziť všetky faktúry
sq: Shiko të gjitha faturat
sr: Прикажи све рачуне
sr_latn: Prikaži sve račune
sv: Visa alla fakturor
te: అన్ని బిల్‌లను చూడండి
th: ดูบิลทั้งหมด
tr: Tüm faturaları göster
uk: Переглянути всі платежі
ur: سبھی بلس دیکھیں
uz: Hisob-varaqlari
vi: Xem tất cả các hóa đơn
zh_hk: 查看所有帳單
zu: Bona zonke izinkokhelo

# craneFormDate
source: Select Date
af: Kies datum
am: ቀን ይምረጡ
ar_eg: اختيار التاريخ
as: তাৰিখ বাছনি কৰক
az: Tarix seçin
be: Выберыце дату
bn: তারিখ বেছে নিন
bs: Odaberite datum
ca: Selecciona la data
da: Vælg dato
es_ar: Seleccionar fecha
et: Valige kuupäev
eu: Hautatu data
fa: انتخاب تاریخ
fil: Pumili ng Petsa
fr_ca: Sélectionner la date
gl: Seleccionar data
gu: તારીખ પસંદ કરો
he: בחירת תאריך
hi: तारीख चुनें
hu: Dátum kiválasztása
hy: Ընտրել ամսաթիվ
id: Pilih Tanggal
it: Seleziona data
ja: 日付を選択
ka: აირჩიეთ თარიღი
km: ជ្រើសរើស​កាល​បរិច្ឆេទ
kn: ದಿನಾಂಕವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 날짜 선택
ky: Күн тандоо
lo: ເລືອກວັນທີ
lt: Pasirinkite datą
lv: Atlasiet datumu
mk: Изберете датум
ml: തീയതി തിരഞ്ഞെടുക്കുക
mn: Огноо сонгох
mr: तारीख निवडा
ms: Pilih Tarikh
my: ရက်စွဲရွေးပါ
nb: Velg dato
ne: मिति चयन गर्नुहोस्
pa: ਤਾਰੀਖ ਚੁਣੋ
pl: Wybierz datę
pt: Selecionar data
pt_pt: Selecionar data
ro: Selectați data
ru: Выберите дату
si: දිනය තෝරන්න
sk: Vyberte dátum
sq: Zgjidh datën
sr: Изаберите датум
sr_latn: Izaberite datum
sv: Välj datum
te: తేదీ ఎంచుకోండి
th: เลือกวันที่
tr: Tarih Seçin
uk: Виберіть дату
ur: تاریخ منتخب کریں
uz: Sanani tanlang
vi: Chọn ngày
zh_hk: 選取日期
zu: Khetha idethi

# craneFormOrigin
source: Choose Origin
af: Kies oorsprong
am: ምንጭ ይምረጡ
ar_eg: اختيار نقطة انطلاق الرحلة
as: যাত্ৰা আৰম্ভ কৰাৰ স্থান বাছনি কৰক
az: Səyahətin başladığı yeri seçin
be: Выберыце пункт адпраўлення
bn: উৎপত্তি স্থল বেছে নিন
bs: Odaberite polazište
ca: Tria l'origen
da: Vælg afrejsested
es_ar: Seleccionar origen
et: Valige lähtekoht
eu: Aukeratu abiapuntua
fa: انتخاب مبدأ
fil: Piliin ang Pinagmulan
fr_ca: Choisir le lieu de départ
gl: Escoller orixe
gu: મૂળ સ્ટેશન પસંદ કરો
he: בחירת מוצא
hi: शुरुआत की जगह चुनें
hu: Kiindulási pont kiválasztása
hy: Ընտրել սկզբնակետ
id: Pilih Asal
it: Scegli origine
ja: 出発地を選択
ka: აირჩიეთ მგზავრობის დაწყების ადგილი
km: ជ្រើសរើស​ប្រភពដើម
kn: ಆರಂಭದ ಸ್ಥಳವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 출발지 선택
ky: Учуп чыккан шаарды тандоо
lo: ເລືອກຕົ້ນທາງ
lt: Pasirinkite išvykimo vietą
lv: Izvēlieties sākumpunktu
mk: Изберете место на поаѓање
ml: പുറപ്പെടുന്ന സ്ഥലം തിരഞ്ഞെടുക്കുക
mn: Эхлэх цэг сонгох
mr: सुरुवातीचे स्थान निवडा
ms: Pilih Tempat Berlepas
my: မူရင်းနေရာကို ရွေးပါ
nb: Velg avreisested
ne: प्रस्थान विन्दु छनौट गर्नुहोस्
pa: ਮੂਲ ਥਾਂ ਚੁਣੋ
pl: Wybierz miejsce wylotu
pt: Escolha a origem
pt_pt: Escolher origem
ro: Alegeți originea
ru: Выберите пункт отправления
si: ආරම්භය තෝරන්න
sk: Vyberte východiskové miesto
sq: Zgjidh origjinën
sr: Одаберите место поласка
sr_latn: Odaberite mesto polaska
sv: Välj plats för avresa
te: బయలుదేరే ప్రదేశాన్ని ఎంచుకోండి
th: เลือกต้นทาง
tr: Kalkış Noktası Seçin
uk: Виберіть пункт відправлення
ur: مقام روانگی منتخب کریں
uz: Boshlangʻich manzilni tanlang
vi: Chọn điểm khởi hành
zh_hk: 選取出發點
zu: Khetha okoqobo

# craneFly2
source: Khumbu Valley, Nepal
af: Khumbu-vallei, Nepal
am: ኩምቡ ሸለቆ፣ ኔፓል
ar_eg: وادي خومبو، نيبال
as: খুমবু ভেলী, নেপাল
az: Xumbu vadisi, Nepal
be: Кхумбу, Непал
bn: কুম্ভ উপত্যকা, নেপাল
bs: Dolina Khumbu, Nepal
ca: Vall del Khumbu, Nepal
es_ar: Khumbu, Nepal
eu: Khumbu bailara (Nepal)
fa: دره خومبو، نپال
fr_ca: Vallée du Khumbu, Népal
gl: Val de Khumbu, Nepal
gu: ખુમ્બુ વેલી, નેપાળ
he: עמק קומבו, נפאל
hi: खुम्बु वैली, नेपाल
hu: Khumbu-völgy, Nepál
hy: Կհումբու հովիտ, Նեպալ
it: Valle di Khumbu, Nepal
ja: クンブ渓谷（ネパール）
ka: კუმბუს მინდორი, ნეპალი
km: ជ្រលង​ខាំប៊្យូ នេប៉ាល់
kn: ಖುಂಬು ಕಣಿವೆ, ನೇಪಾಳ
ko: 네팔 쿰부 밸리
ky: Хумбу өрөөнү, Непал
lo: ຫຸບເຂົາແຄມບູ, ເນປານ
lt: Kumbu slėnis, Nepalas
lv: Khumbu ieleja, Nepāla
mk: Долина Кумбу, Непал
ml: കുംബു വാലി, നേപ്പാൾ
mn: Балба, Хумбу хөндий
mr: खुम्बू व्हॅली, नेपाळ
my: ကွန်ဘူတောင်ကြား၊ နီပေါ
ne: खुम्बु उपत्यका, नेपाल
pa: ਖੁੰਬੂ ਘਾਟੀ, ਨੇਪਾਲ
pl: Khumbu, Nepal
pt: Vale do Khumbu, Nepal
pt_pt: Vale de Khumbu, Nepal
ro: Valea Khumbu, Nepal
ru: Долина Кхумбу, Непал
si: කුම්බු නිම්නය, නේපාලය
sk: Dolina Khumbu, Nepál
sq: Lugina Khumbu, Nepal
sr: Долина Кумбу, Непал
sr_latn: Dolina Kumbu, Nepal
sv: Khumbudalen, Nepal
te: ఖుంబు లోయ, నేపాల్
th: หุบเขาคุมบู เนปาล
tr: Khumbu Vadisi, Nepal
uk: Долина Кхумбу, Непал
ur: خومبو ویلی، نیپال
uz: Xumbu vodiysi, Nepal
vi: Thung lũng Khumbu, Nepal
zh_hk: 尼泊爾坤布山谷
zu: I-Khumbu Valley, Nepal

# craneFly3
source: Machu Picchu, Peru
am: ማቹ ፒቹ፣ ፔሩ
ar_eg: ماتشو بيتشو، بيرو
as: মাশ্বু পিচশ্বু, পেৰু
az: Maçu Pikçu, Peru
be: Мачу-Пікчу, Перу
bn: মাচু পিচ্চু, পেরু
ca: Machu Picchu, Perú
es_ar: Machu Picchu, Perú
et: Machu Picchu, Peruu
fa: ماچوپیچو، پرو
fr_ca: Machu Picchu, Pérou
gl: Machu Picchu, Perú
gu: માચુ પિચ્ચુ, પેરુ
he: מאצ'ו פיצ'ו, פרו
hi: माचू पिच्चू, पेरू
hy: Մաչու Պիկչու, Պերու
it: Machu Picchu, Perù
ja: マチュピチュ（ペルー）
ka: მაჩუ-პიკჩუ, პერუ
km: ម៉ាឈូភីឈូ ប៉េរូ
kn: ಮಾಚು ಪಿಚು, ಪೆರು
ko: 페루 마추픽추
ky: Мачу-Пичу, Перу
lo: ມາຈູ ພິຈູ​, ເປ​ຣູ
lt: Maču Pikču, Peru
lv: Maču Pikču, Peru
mk: Мачу Пикчу, Перу
ml: മാച്ചു പിച്ചു, പെറു
mn: Перу, Мачу Пикчу
mr: माचू पिचू, पेरू
my: မာချူ ပီချူ၊ ပီရူး
ne: माचू पिक्चू, पेरु
pa: ਮਾਚੂ ਪਿਕਚੂ, ਪੇਰੂ
ru: Мачу-Пикчу, Перу
si: මාචු පික්කූ, පේරු
sq: Maçu Piçu, Peru
sr: Мачу Пикчу, Перу
sr_latn: Maču Pikču, Peru
te: మాచు పిచ్చు, పెరూ
th: มาชูปิกชู เปรู
uk: Мачу-Пікчу, Перу
ur: ماچو پچو، پیرو
uz: Machu-Pikchu, Peru
zh_hk: 秘魯馬丘比丘
zu: I-Machu Picchu, Peru

# craneFly4
source: Malé, Maldives
af: Malé, Maledive
am: ማሌ፣ ማልዲቭስ
ar_eg: ماليه، جزر المالديف
as: মালে, মালদ্বীপ
az: Male, Maldiv adaları
be: Мале, Мальдывы
bn: মালে, মালদ্বীপ
bs: Malé, Maldivi
ca: Male, Maldives
da: Malé, Maldiverne
es_ar: Malé, Maldivas
et: Malé, Maldiivid
eu: Malé (Maldivak)
fa: ماله، مالدیو
gl: Malé, Maldivas
gu: માલી, માલદીવ્સ
he: מאלה, האיים המלדיביים
hi: माले, मालदीव
hu: Malé, Maldív-szigetek
hy: Մալե, Մալդիվներ
id: Malé, Maladewa
it: Malé, Maldive
ja: マレ（モルディブ）
ka: მალე, მალდივები
km: ម៉ាល ម៉ាល់ឌីវ
kn: ಮಾಲೆ, ಮಾಲ್ಡೀವ್ಸ್
ko: 몰디브 말레
ky: Мале, Мальдив аралдары
lo: ມາເລ່​, ມັລດີຟ
lt: Malė, Maldyvai
lv: Male, Maldīvu salas
mk: Мале, Малдиви
ml: മാലി, മാലദ്വീപുകൾ
mn: Мальдив, Мале
mr: मेल, मालदीव
my: မာလီ၊ မော်လဒိုက်
nb: Malé, Maldivene
ne: मेल, माल्दिभ्स
pa: ਮਾਲੇ, ਮਾਲਦੀਵ
pl: Malé, Malediwy
pt: Malé, Maldivas
pt_pt: Malé, Maldivas
ro: Malé, Maldive
ru: Мале, Мальдивы
si: මාලේ, මාලදිවයින
sk: Malé, Maldivy
sr: Мале, Малдиви
sr_latn: Male, Maldivi
sv: Malé, Maldiverna
te: మాలే, మాల్దీవులు
th: มาเล มัลดีฟส์
tr: Malé, Maldivler
uk: Мале, Мальдіви
ur: مالے، مالدیپ
uz: Male, Maldiv orollari
zh_hk: 馬爾代夫馬累
zu: I-Malé, Maldives

# craneFly5
source: Vitznau, Switzerland
af: Vitznau, Switserland
am: ቪትዝናው፣ ስዊዘርላንድ
ar_eg: فيتزناو، سويسرا
as: ভিজনাও, ছুইজাৰলেণ্ড
az: Vitznau, İsveçrə
be: Віцнау, Швейцарыя
bn: ভিতজানাউ, সুইজারল্যান্ড
bs: Vitznau, Švicarska
ca: Vitznau, Suïssa
da: Vitznau, Schweiz
es_ar: Vitznau, Suiza
et: Vitznau, Šveits
eu: Vitznau (Suitza)
fa: ویتسناو، سوئیس
fr_ca: Vitznau, Suisse
gl: Vitznau, Suíza
gu: વિઝનાઉ, સ્વિટ્ઝરલૅન્ડ
he: ויצנאו, שווייץ
hi: वित्ज़नेउ, स्विट्ज़रलैंड
hu: Vitznau, Svájc
hy: Վիցնաու, Շվեյցարիա
id: Vitznau, Swiss
it: Vitznau, Svizzera
ja: ヴィッツナウ（スイス）
ka: ვიცნაუ, შვეიცარია
km: វីតស្នោវ ស្វ៊ីស
kn: ವಿಟ್ಜನೌ, ಸ್ವಿಟ್ಜರ್‌ಲ್ಯಾಂಡ್
ko: 스위스 비츠나우
ky: Витзнау, Швейцария
lo: ວິຊເນົາ, ສະວິດເຊີແລນ
lt: Vicnau, Šveicarija
lv: Vicnava, Šveice
mk: Вицнау, Швјцарија
ml: വിറ്റ്‌സ്നോ, സ്വിറ്റ്സർലൻഡ്
mn: Швейцар, Вицнау
mr: फिट्सनाऊ, स्वित्झर्लंड
my: ဗစ်ဇ်နောင်၊ ဆွစ်ဇာလန်
nb: Vitznau, Sveits
ne: भिज्नाउ, स्विट्जरल्यान्ड
pa: ਵਿਟਸਨਾਊ, ਸਵਿਟਜ਼ਰਲੈਂਡ
pl: Vitznau, Szwajcaria
pt: Vitznau, Suíça
pt_pt: Vitznau, Suíça
ro: Vitznau, Elveția
ru: Вицнау, Швейцария
si: විට්ස්නෝ, ස්විට්සර්ලන්තය
sk: Vitznau, Švajčiarsko
sq: Vitznau, Zvicër
sr: Вицнау, Швајцарска
sr_latn: Vicnau, Švajcarska
sv: Vitznau, Schweiz
te: విట్నావ్, స్విట్జర్లాండ్
th: วิทซ์นาว สวิตเซอร์แลนด์
tr: Vitznau, İsviçre
uk: Віцнау, Швейцарія
ur: وٹزناؤ، سوئٹزر لینڈ
uz: Vitsnau, Shveytsariya
vi: Vitznau, Thụy Sĩ
zh_hk: 瑞士維茨瑙
zu: I-Vitznau, Switzerland
