Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# replyStarredLabel
source: Starred
af: Gester
am: ኮከብ የተደረገባቸው
ar_eg: الرسائل المميّزة بنجمة
as: তৰাযুক্ত
az: Ulduzlu
be: Пазначаныя
bn: তারা চিহ্নিত
bs: Označeno zvjezdicom
ca: Destacats
da: Stjernemarkeret
es_ar: Destacados
et: Tärniga
eu: Izardunak
fa: ستاره‌دار
fil: Naka-star
fr_ca: Marqués d'une étoile
gl: Con estrela
gu: તારાંકિત
he: מסומן בכוכב
hi: स्टार के निशान वाले
hu: Csillagozva
hy: Աստղանշված
id: Berbintang
it: Speciali
ja: スター付き
ka: ვარსკვლავით მონიშნულები
km: មានផ្កាយ
kn: ನಕ್ಷತ್ರ ಹಾಕಲಾಗಿದೆ
ko: 별표편지함
ky: Белгиленгендер
lo: ຕິດດາວ
lt: Pažymėta žvaigždute
lv: Ar zvaigznīti
mk: Означено со ѕвезда
ml: നക്ഷത്രചിഹ്നമിട്ടവ
mn: Одтой
mr: तारांकित
ms: Berbintang
my: ကြယ်ပွင့်ပြ
nb: Stjernemerket
ne: ताराङ्कित
pa: ਤਾਰਾਬੱਧ
pl: Oznaczone gwiazdką
pt: Com estrela
pt_pt: Marcado com uma estrela
ro: Cu stea
ru: Помеченные
si: තරු ලකුණු යෙදූ
sk: S hviezdičkou
sq: Me yll
sr: Са звездицом
sr_latn: Sa zvezdicom
sv: Stjärnmärkt
te: స్టార్ ఉన్నవి
th: ที่ติดดาว
tr: Yıldızlı
uk: Із зірочкою
ur: ستارہ لگا ہوا
uz: Yulduzchali
vi: Có gắn dấu sao
zh_hk: 已加星號
zu: Okunenkanyezi

# demoTextButtonDescription
source: A text button displays an ink splash on press but does not lift. Use text buttons on toolbars, in dialogs and inline with padding
af: 'n Teksknoppie wys 'n inkspatsel wanneer dit gedruk word maar word nie gelig nie. Gebruik teksknoppies op nutsbalke, in dialoë en inlyn met opvulling
am: በመጫን ጊዜ የጽሑፍ አዝራር የቀለም ርጭትን ያሳያል ነገር ግን አያነሳም። የጽሑፍ አዝራሮችን በመሳሪያ አሞሌዎች ላይ፣ በንግግሮች እና በመስመር ውስጥ ከድብዳብ ጋር ይጠቀሙ።
ar_eg: يتلوّن الزر النصي عند الضغط عليه ولكن لا يرتفع. ينصح باستخدام الأزرار النصية على أشرطة الأدوات وفي مربّعات الحوار وداخل المساحات المتروكة
as: এটা পাঠ বুটাম টিপিলে চিয়াঁহী পৰাৰ দৰে দৃশ্য প্ৰদৰ্শন কৰে কিন্তু তুলি নধৰে। পাঠ বুটাম টুলবাৰত, ডায়ল’গত আৰু পেডিঙৰ সৈতে ইনলাইনত ব্যৱহাৰ কৰক
az: Mətn düyməsinə basdıqda mürəkkəb rəngi alır, lakın yuxarı qalxmır. Mətn düymələrindən alətlər panelində, dialoqlarda və sətir içlərində dolğu ilə istifadə edin
be: Пры націсканні тэкставай кнопкі паказваецца эфект чарніла, і кнопка не падымаецца ўверх. Выкарыстоўвайце тэкставыя кнопкі на панэлі інструментаў, у дыялогавых вокнах і ў тэксце з палямі
bn: টেক্সট বোতাম প্রেস করলে কালি ছড়িয়ে পড়ে কিন্তু লিফ্ট করে না। প্যাডিং সহ টেক্সট বোতাম টুলবারে, ডায়ালগে এবং ইনলাইনে ব্যবহার করুন
bs: Dugme za tekst prikazuje mrlju od tinte kada ga pritisnete, ali se ne podiže. Koristite dugmad za tekst na alatnim trakama, u dijaloškim okvirima i u ravni s razmakom od ruba
ca: Els botons de text mostren un esquitx de tinta en prémer-los, però no s'eleven. Utilitza els botons de text en barres d'eines, en quadres de diàleg i entre línies amb farciment.
da: En tekstknap viser en blækklat, når der trykkes på den, men den hæves ikke. Brug tekstknapper på værktøjslinjer, i dialogbokse og indlejret i den indre margen
es_ar: Un botón plano que muestra una gota de tinta cuando se lo presiona, pero que no tiene sombra. Usa los botones planos en barras de herramientas, diálogos y también intercalados con el relleno.
et: Tekstinupp kuvab vajutamisel tindipleki, kuid ei tõuse ülespoole. Kasutage tekstinuppe tööriistaribadel, dialoogides ja tekstisiseselt koos täidisega
eu: Botoi lauak kolorez aldatzen dira sakatzean, baina ez dira altxatzen. Erabili botoi lauak tresna-barretan, leihoetan eta betegarriak txertatzean.
fa: دکمه‌ای نوشتاری که با فشار دادن، پاشیدن جوهر را نمایش می‌دهد، اما بالا نمی‌رود. از دکمه‌های نوشتاری در نوارابزار، کادر گفتگو، و به‌صورت به‌خط در کنار فاصله‌گذاری استفاده کنید
fil: Isang button na text na nagpapakita ng pagtalsik ng tinta kapag pinindot pero hindi umaangat. Gamitin ang mga button na text sa mga toolbar, sa mga dialog, at inline nang may padding
fr_ca: Un bouton plat affiche une éclaboussure d'encre lors de la pression, mais ne se soulève pas. Utilisez les boutons plats dans les barres d'outils, les boîtes de dialogue et sous forme de bouton aligné avec du remplissage
gl: Os botóns de texto mostran unha salpicadura de tinta ao premelos, pero non sobresaen. Úsaos nas barras de ferramentas, nos cadros de diálogo e inseridos con recheo
gu: ટેક્સ્ટ બટન દબાવવા પર ઇંક સ્પ્લૅશ બતાવે છે પરંતુ તે ઉપસી આવતું નથી. ટૂલબાર પર, સંવાદમાં અને પૅડિંગની સાથે ઇનલાઇનમાં ટેક્સ્ટ બટનનો ઉપયોગ કરો
he: לחצן טקסט מציג התזת דיו כשלוחצים עליו, אבל הוא לא מובלט. יש להשתמש בלחצני טקסט בסרגלי כלים, בתיבות דו-שיח ובתוך שורות עם מרווח פנימי.
hi: टेक्स्ट बटन को दबाने पर वह फैली हुई स्याही जैसा दिखता है, लेकिन वह ऊपर की ओर उठा हुआ नहीं दिखता. टूलबार, डायलॉग, और पैडिंग वाले इनलाइन के साथ टेक्स्ट बटन का इस्तेमाल करें
hu: Valamelyik szöveg gomb megnyomásakor tintafolt jelenik meg rajta, de nem emelkedik fel. Szöveg gombokat használhat eszköztárakban, párbeszédpaneleken és kitöltéssel szövegen belül is
hy: Սեղմելու դեպքում տեքստային կոճակը չի բարձրանում։ Դրա փոխարեն էկրանին հայտնվում է թանաքի հետք։ Այսպիսի կոճակներն օգտագործեք գործիքագոտիներում, երկխոսության պատուհաններում և տեղադրեք դրանք դաշտերում։
id: Tombol teks menampilkan percikan tinta saat ditekan, tetapi tidak terangkat. Gunakan tombol teks pada toolbar, dalam dialog, dan bagian dari padding
it: Un pulsante di testo mostra una macchia di inchiostro quando viene premuto, ma non si solleva. Usa pulsanti di testo nelle barre degli strumenti, nelle finestre di dialogo e in linea con la spaziatura interna.
ja: テキストボタンを押すと、インク スプラッシュが表示されますが、このボタンは浮き上がりません。ツールバー、ダイアログのほか、パディング入りインラインで使用されます
ka: დაჭერისას ტექსტის ღილაკი აჩვენებს მელნის შხეფებს, მაგრამ არ ამოიწევა. გამოიყენეთ ტექსტის ღილაკები ხელსაწყოთა ზოლებში, დიალოგებში და ჩართულ ელემენტებში შევსებით
km: ប៊ូតុង​អត្ថបទ​បង្ហាញការសាចពណ៌​នៅពេលចុច ប៉ុន្តែ​មិនផុសឡើង​ទេ។ ប្រើប៊ូតុង​អត្ថបទនៅលើ​របារឧបករណ៍ នៅក្នុង​ប្រអប់ និង​ក្នុងជួរជាមួយចន្លោះ
kn: ಪಠ್ಯ ಬಟನ್ ಒತ್ತಿದಾಗ ಇಂಕ್ ಸ್ಪ್ಲಾಷ್ ಅನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡುತ್ತದೆ ಆದರೆ ಲಿಫ್ಟ್ ಮಾಡುವುದಿಲ್ಲ. ಪರಿಕರ ಪಟ್ಟಿಗಳಲ್ಲಿ, ಡೈಲಾಗ್‌ಗಳಲ್ಲಿ ಮತ್ತು ಪ್ಯಾಡಿಂಗ್‌ ಇನ್‌ಲೈನ್‌ನಲ್ಲಿ ಪಠ್ಯ ಬಟನ್‌ಗಳನ್ನು ಬಳಸಿ
ko: 텍스트 버튼은 누르면 잉크가 퍼지는 모양이 나타나지만 버튼이 올라오지는 않습니다. 툴바, 대화상자, 인라인에서 텍스트 버튼을 패딩과 함께 사용합니다.
ky: Текст баскычын басканда сыя чыгат, бирок баскыч көтөрүлбөйт. Текст баскычтарын куралдар тилкелеринде, диалогдордо жана кемтик менен бирге колдонуңуз
lo: ປຸ່ມຂໍ້ຄວາມຈະສະແດງຮອຍແຕ້ມໝຶກເມື່ອກົດແຕ່ຈະບໍ່ຍົກຂຶ້ນ. ໃຊ້ປຸ່ມຂໍ້ຄວາມຢູ່ແຖບເຄື່ອງມື, ໃນກ່ອງໂຕ້ຕອບ ແລະ ໃນແຖວທີ່ມີໄລຍະຫ່າງຈາກຂອບ.
lt: Paspaudus tekstinį mygtuką pateikiama rašalo dėmė, bet ji neišnyksta. Naudokite tekstinius mygtukus įrankių juostose, dialogų languose ir įterptus su užpildymu
lv: Teksta poga piespiežot attēlo tintes traipu, taču nepaceļas. Teksta pogas izmantojamas rīkjoslās, dialoglodziņos un iekļautas ar iekšējo atkāpi.
mk: Копчето за текст прикажува дамка од мастило при притискање, но не се подига. Користете копчиња за текст во алатници, во дијалози и во линија со дополнување
ml: ടെക്‌സ്‌റ്റ് ബട്ടൺ അമർത്തുമ്പോൾ ഒരു ഇങ്ക് സ്പ്ലാഷ് പോലെ പ്രദർശിപ്പിക്കുമെങ്കിലും ബട്ടൺ ഉയർത്തുന്നില്ല. ടൂൾബാറുകളിലും ഡയലോഗുകളിലും പാഡിംഗുമായി ചേരുന്ന തരത്തിലും ടെക്‌സ്‌റ്റ് ബട്ടണുകൾ ഉപയോഗിക്കുക
mn: Текстийн товчлуур дээр дарахад бэх цацарч харагдах боловч өргөгдөхгүй. Текстийн товчлуурыг самбар дээр, харилцах цонхонд болон мөрөнд доторх зайтайгаар ашиглана уу
mr: मजकुराचे बटण प्रेस केल्यावर ते शाई उडवताना दाखवते पण, ते वर उचलत नाही. टूलबार, डायलॉगमध्ये आणि पॅडिंगसह इनलाइनमध्ये मजकुराची बटणे वापरा
ms: Butang teks memaparkan percikan dakwat apabila ditekan namun tidak timbul. Gunakan butang teks pada bar alat, dalam dialog dan sebaris dengan pelapik
my: စာသားခလုတ်က နှိပ်လိုက်သည့်အခါ မင်ပက်ဖြန်းမှုကို ပြသသော်လည်း မ တင်ခြင်းမရှိပါ။ ကိရိယာဘား၊ ဒိုင်ယာလော့ခ်များနှင့် စာကြောင်းအတွင်းတို့တွင် စာသားခလုတ်များကို အသုံးပြုပါ
nb: En tekstknapp viser en blekkflekk når den trykkes, men løftes ikke. Bruk tekstknapper i verktøyrader, dialogbokser og innebygd i utfylling
ne: कुनै टेक्स्ट बटनमा थिच्दा मसी फैलिएको जस्तो देखिन्छ तर माथि उठ्दैन। टुलबार र डायलगहरूमा र प्याडिङसहितको इनलाइनका लागि टेक्स्ट बटन प्रयोग गर्नुहोस्
pa: ਲਿਖਤ ਵਾਲਾ ਬਟਨ ਦਬਾਏ ਜਾਣ 'ਤੇ ਸਿਆਹੀ ਦੇ ਛਿੱਟੇ ਦਿਖਾਉਂਦਾ ਹੈ ਪਰ ਉੱਪਰ ਨਹੀਂ ਉੱਠਦਾ ਹੈ। ਟੂਲਬਾਰਾਂ ਉੱਤੇ, ਵਿੰਡੋਆਂ ਵਿੱਚ ਅਤੇ ਪੈਡਿੰਗ ਦੇ ਨਾਲ ਇਨਲਾਈਨ ਲਿਖਤ ਵਾਲੇ ਬਟਨਾਂ ਦੀ ਵਰਤੋਂ ਕਰੋ
pl: Przycisk tekstowy wyświetla plamę po naciśnięciu, ale nie podnosi się. Takich przycisków należy używać na paskach narzędzi, w oknach dialogowych oraz w tekście z dopełnieniem.
pt: Um botão de texto exibe um borrão de tinta ao ser pressionado, mas sem elevação. Use botões de texto em barras de ferramentas, caixas de diálogo e in-line com padding
pt_pt: Um botão de texto apresenta um salpico de tinta ao premir, mas não levanta. Utilize botões de texto em barras de ferramentas, caixas de diálogo e inline com preenchimento.
ro: Butonul text reacționează vizibil la apăsare, dar nu se ridică. Folosiți butoanele text în bare de instrumente, casete de dialog și în linie cu chenarul interior.
ru: При нажатии текстовой кнопки отображается цветовой эффект, но кнопка не поднимается. Используйте такие кнопки на панелях инструментов, в диалоговых окнах или как встроенные элементы с полями.
si: පෙළ බොත්තමක් එබීමේදී තීන්ත ඉසිරිමක් සංදර්ශනය කරන නමුත් නොඔසවයි. මෙවලම් තීරුවල, සංවාදවල සහ පිරවීම සමග පේළිගතව පෙළ බොත්තම් භාවිත කරන්න
sk: Textové tlačidlo po stlačení zobrazí atramentovú škvrnu, ale nezvýši sa. Textové tlačidlá používajte v paneloch s nástrojmi, dialógových oknách a texte s odsadením
sq: Një buton teksti shfaq një spërkatje me bojë pas shtypjes, por nuk ngrihet. Përdor butonat e tekstit në shiritat e veglave, dialogët dhe brenda faqes me skemë padding
sr: Када се притисне, дугме за текст приказује мрљу боје, али се не подиже. Дугмад за текст користите на тракама с алаткама, у дијалозима и у тексту са размаком
sr_latn: Kada se pritisne, dugme za tekst prikazuje mrlju boje, ali se ne podiže. Dugmad za tekst koristite na trakama s alatkama, u dijalozima i u tekstu sa razmakom
sv: Med en textknapp visas en bläckplump vid tryck men den höjs inte. Använd textknappar i verktygsfält, dialogrutor och infogade med utfyllnad
te: టెక్స్ట్ బటన్‌ను నొక్కితే, అది ఇంక్ చల్లినట్టుగా ప్రదర్శిస్తుంది, కానీ ఎత్తదు. టూల్‌బార్‌లలో, డైలాగ్‌లలో, 'ప్యాడింగ్‌తో ఇన్‌లైన్‌లో' టెక్స్ట్ బటన్‌లను ఉపయోగించండి
th: ปุ่มข้อความจะแสดงการไฮไลต์เมื่อกดแต่จะไม่ยกขึ้น ใช้ปุ่มข้อความกับแถบเครื่องมือ ในกล่องโต้ตอบ และแทรกในบรรทัดแบบมีระยะห่างจากขอบ
tr: Basıldığında mürekkep sıçraması görüntüleyen ancak basıldıktan sonra yukarı kalkmayan metin düğmesi. Metin düğmelerini araç çubuklarında, iletişim kutularında ve dolgulu satır içinde kullanın
uk: За натискання текстової кнопки по ній проходить кольоровий спалах, і кнопка не піднімається. Використовуйте текстові кнопки на панелях інструментів, у діалогових вікнах і вбудованих елементах із відступами.
ur: ٹیکسٹ بٹن، جب دبایا جاتا ہے تو سیاہی کی چھلکیاں دکھاتا ہے، لیکن اوپر نہیں جاتا ہے۔ پیڈنگ کے ساتھ ان لائن اور ڈائیلاگز میں ٹیکسٹ بٹنز، ٹول بارز پر استعمال کریں
uz: Matnli tugmalarni bossangiz, ular koʻtarilmaydi. Uning oʻrniga siyohli dogʻ paydo boʻladi. Bu tugmalardan asboblar panelida va muloqot oynalarida foydalaning yoki ularni maydonga kiriting
vi: Nút văn bản hiển thị hình ảnh giọt mực bắn tung tóe khi nhấn giữ. Dùng nút văn bản trên thanh công cụ, hộp thoại và cùng dòng với khoảng đệm
zh_hk: 按下文字按鈕後會出現墨水擴散特效，但不會有升起效果。這類按鈕用於工具列、對話框和設有邊框間距的內嵌元素
zu: Inkinobho yombhalo ibonisa ukusaphazeka kweyinki ekucindezelweni kodwa ayiphakami. Sebenzisa izinkinobho zombhalo kubha yamathuluzi, kumabhokisi nangaphakathi kolayini ngokokugxusha

# demoElevatedButtonTitle
source: Elevated Button
af: Verhewe knoppie
am: ከፍ ያለ አዝራር
ar_eg: زر بارز
as: উঠঙা বুটাম
az: Qabarıq Düymə
be: Прыпаднятая кнопка
bn: উন্নত বোতাম
bs: Izdignuto dugme
ca: Botó amb relleu
da: Hævet knap
es_ar: Botón con relieve
et: Tõstetud nupud
eu: Botoi goratuak
fa: دکمه برجسته
fil: Nakaangat na Button
fr_ca: Bouton surélevé
gl: Botón elevado
gu: ઉપર ચડાવેલું બટન
he: לחצן בולט
hi: उभरे हुए बटन
hu: Kiemelkedő gomb
hy: Բարձրացված կոճակ
id: Tombol Timbul
it: Pulsante sollevato
ja: 浮き上がりボタン
ka: ამოწეული ღილაკი
km: ប៊ូតុងផុសឡើង
kn: ಎತ್ತರಿಸಿದ ಬಟನ್
ko: 돌출 버튼
ky: Көтөрүлгөн баскыч
lo: ປຸ່ມຍົກຂຶ້ນ
lt: Iškilusis mygtukas
lv: Paaugstināta poga
mk: Подигнато копче
ml: എലവേറ്റഡ് ബട്ടൺ
mn: Товгор товчлуур
mr: एलेव्हेटेड बटण
ms: Butang Terangkat
my: စာလုံးဆင့်ခြင်း ခလုတ်
nb: Fremhevet knapp
ne: माथि उठेको बटन
pa: ਉੱਭਰਿਆ ਹੋਇਆ ਬਟਨ
pl: Przycisk podniesiony
pt: Botão elevado
pt_pt: Botão elevado
ro: Butonul în relief
ru: Приподнятая кнопка
si: එසවූ බොත්තම
sk: Zvýšené tlačidlo
sq: Buton i ngritur
sr: Издигнуто дугме
sr_latn: Izdignuto dugme
sv: Upphöjd knapp
te: ముందుకు ఉన్న బటన్
th: ปุ่มแบบยกขึ้น
tr: Yükseltilmiş Düğme
uk: Опукла кнопка
ur: ابھرا ہوا بٹن
uz: Koʻtarilgan tugma
vi: Nút lồi
zh_hk: 凸起的按鈕
zu: Inkinobho Ephakanyisiwe

# demoElevatedButtonDescription
source: Elevated buttons add dimension to mostly flat layouts. They emphasize functions on busy or wide spaces.
af: Verhewe knoppies voeg dimensie by vir uitlegte wat meestal plat is. Hulle beklemtoon funksies in besige of wye ruimtes.
am: ከፍ ያሉ አዝራሮች በአብዛኛው ዝርግ ለሆኑ አቀማመጦች ልኬት ያክላሉ። በባተሌ ወይም ሰፊ ቦታዎች ላይ ተግባራት ላይ አጽዕኖት ይሰጣሉ።
ar_eg: تضفي الأزرار البارزة مزيدًا من الحركة إلى التصميمات الأحادية البعد. فهي تبرِز الوظائف المعروضة في المساحات العريضة أو المكدَّسة.
as: উঠঙা বুটামে সাধাৰণতে সমতল লে’আউটত মাত্ৰা যোগ দিয়ে। সেইবোৰে ব্যস্ত অথবা বহল ঠাইত কৰা কাৰ্যক অধিক প্ৰধান্য দিয়ে।
az: Qabarıq düymələr əsasən yastı düzənlərin üzərində ölçücə böyük olur. Onlar dolu və ya geniş səthlərdə funksiyaları vurğulayır.
be: Прыпаднятыя кнопкі надаюць аб'ёмнасць пераважна плоскім макетам. Яны паказваюць функцыі ў занятых або шырокіх абласцях.
bn: উন্নত বোতাম প্রায়ই ফ্ল্যাট লেআউটে আকার দিতে সাহায্য করে। ব্যস্ত বা চওড়া জায়গাতে তারা আরও গুরুত্ব দেয়।
bs: Izdignuta dugmad daju trodimenzionalni izgled uglavnom ravnim prikazima. Ona naglašavaju funkcije u prostorima s puno elemenata ili širokim prostorima.
ca: Els botons amb relleu aporten dimensió als dissenys plans. Destaquen les funcions en espais amplis o amb molts elements.
da: Hævede knapper giver layouts, der primært er flade, en 3D-effekt. De fremhæver funktioner i tætpakkede eller åbne områder.
es_ar: Los botones con relieve agregan profundidad a los diseños que son principalmente planos. Destacan las funciones en espacios amplios o con muchos elementos.
et: Tõstetud nupud pakuvad peamiselt ühetasandiliste nuppude kõrval lisamõõdet. Need tõstavad tihedalt täidetud või suurtel aladel esile funktsioone.
eu: Botoi goratuek dimentsioa ematen diete nagusiki lauak diren diseinuei. Funtzioak nabarmentzen dituzte espazio bete edo zabaletan.
fa: دکمه‌های برجسته به طرح‌بندی‌هایی که تا حد زیادی مسطح هستند بُعد می‌دهد. این دکمه‌ها در فضاهای پهن یا شلوغ، عملکردها را برجسته می‌کنند.
fil: Nagdaragdag ng dimensyon ang mga nakaangat na button sa mga layout na puro flat. Binibigyang-diin ng mga ito ang mga function sa mga lugar na maraming nakalagay o malawak.
fr_ca: Les boutons surélevés ajoutent une dimension aux mises en page plates. Ils font ressortir les fonctions dans les espaces occupés ou vastes.
gl: Os botóns elevados engaden dimensión a deseños principalmente planos. Destacan funcións en espazos reducidos ou amplos.
gu: ઉપર ચડાવેલા બટન મોટાભાગના સમતલ લેઆઉટ પર પરિમાણ ઉમેરે છે. તે વ્યસ્ત અથવા વ્યાપક સ્થાનો પર ફંક્શન પર ભાર આપે છે.
he: לחצנים בולטים מוסיפים ממד לפריסות ששטוחות ברובן. הם מדגישים פונקציות בסביבות תצוגה עמוסות או רחבות.
hi: उभरे हुए बटन, फ़्लैट लेआउट को डाइमेंशन देकर, उन्हें बेहतर बनाने में मदद करते हैं. ये भरी हुई या चौड़ी जगहों पर किए जाने वाले कामों को बेहतर तरीके से दिखाते हैं.
hu: A kiemelkedő gombok térbeli kiterjedést adnak az általában lapos külsejű gomboknak. Alkalmasak a funkciók kiemelésére zsúfolt vagy nagy területeken.
hy: Բարձրացված կոճակները թույլ են տալիս հարթ մակերեսները դարձնել ավելի ծավալային, իսկ հագեցած և լայն էջերի գործառույթները՝ ավելի տեսանելի։
id: Tombol timbul menambahkan dimensi ke sebagian besar tata letak datar. Tombol tersebut mempertegas fungsi pada ruang yang penuh atau lapang.
it: I pulsanti sollevati aggiungono dimensione a layout prevalentemente piatti. Mettono in risalto le funzioni in spazi ampi o densi di contenuti.
ja: 浮き上がりボタンを使うと、ほぼ平面のレイアウトに立体感が出ます。スペースに余裕がある場所でもない場所でも、機能が強調されます。
ka: ამოწეული ღილაკები ბრტყელ განლაგებებს უფრო მოცულობითს ხდის. ისინი ფუნქციებს უფრო შესამჩნევს ხდიან გადატვირთულ ან ფართო სივრცეებზე.
km: ប៊ូតុង​ផុសឡើង​បន្ថែមវិមាត្រ​ទៅប្លង់​រាបស្មើភាគច្រើន។ ប៊ូតុង​ទាំងនេះ​រំលេចមុខងារ​នៅកន្លែង​ដែលមមាញឹក ឬទូលាយ។
kn: ಎತ್ತರಿಸಿದ ಬಟನ್‌ಗಳು ಸಾಮಾನ್ಯವಾಗಿ ಫ್ಲಾಟ್ ವಿನ್ಯಾಸಗಳಿಗೆ ಆಯಾಮವನ್ನು ಸೇರಿಸುತ್ತವೆ. ಅವರು ಬ್ಯುಸಿ ಅಥವಾ ವಿಶಾಲ ಸ್ಥಳಗಳಲ್ಲಿ ಫಂಕ್ಷನ್‌ಗಳಿಗೆ ಪ್ರಾಮುಖ್ಯತೆ ನೀಡುತ್ತಾರೆ.
ko: 돌출 버튼은 대부분 평면인 레이아웃에 공간감을 주는 데 사용합니다. 꽉 차 있거나 넓은 공간에서 해당 버튼에 표시된 기능을 강조합니다.
ky: Көтөрүлгөн баскычтар көбүнчө түз калыптарга чен-өлчөм кошот. Алар бош эмес же кең мейкиндиктердеги функциялар болуп эсептелет.
lo: ປຸ່ມຍົກຂຶ້ນຈະເພີ່ມມິຕິໃຫ້ກັບໂຄງຮ່າງທີ່ສ່ວນໃຫຍ່ຮາບພຽງ. ພວກມັນຈະເນັ້ນຟັງຊັນຕ່າງໆທີ່ສຳຄັນໃນພື້ນທີ່ກວ້າງ ຫຼື ມີການໃຊ້ວຽກຫຼາຍ.
lt: Iškilieji mygtukai padidina daugumą plokščiųjų išdėstymų. Jie paryškina funkcijas užimtose ar plačiose erdvėse.
lv: Paaugstinātas pogas piešķir plakaniem izkārtojumiem apjomu. Tās uzsver funkcijas pieblīvētās vai platās vietās.
mk: Подигнатите копчиња додаваат димензионалност во распоредите што се претежно рамни. Ги нагласуваат функциите во збиените или широките простори.
ml: എലവേറ്റഡ് ബട്ടണുകൾ മിക്കവാറും ഫ്ലാറ്റായ ലേഔട്ടുകൾക്ക് ഉയർച്ച നൽകുന്നു. തീരെ ഇടമില്ലാത്തതോ പരന്നതോ ആയ ഇടങ്ങളിൽ ഫംഗ്ഷനുകൾക്ക് ഇവ പ്രാധാന്യം നൽകുന്നു.
mn: Товгор товчлуур нь ихэвчлэн хавтгай бүдүүвчид хэмжээс нэмдэг. Тэдгээр нь шигүү эсвэл өргөн зайтай функцийг онцолдог.
mr: एलेव्हेटेड बटणे सहसा फ्लॅट लेआउटना डायमेंशन देऊन उत्तम बनवण्यात मदत करतात. ती भरीव किंवा रूंद जागांवर केली जाणारी कार्य उत्तमप्रकारे दाखवतात.
ms: Butang terangkat menambahkan dimensi pada reka letak yang kebanyakannya rata. Butang ini menekankan fungsi pada ruang sibuk atau luas.
my: စာလုံးဆင့်ခြင်း ခလုတ်များသည် အများအားဖြင့် အပြားလိုက် အပြင်အဆင်များတွင် ထုထည်အားဖြင့်ဖြည့်ပေးသည်။ ၎င်းတို့သည် ကျယ်ပြန့်သော သို့မဟုတ် ခလုတ်များပြားသော နေရာများတွင် လုပ်ဆောင်ချက်များကို အထူးပြုသည်။
nb: Fremhevede knapper gir dimensjon til oppsett som hovedsakelig er flate. De fremhever funksjoner på tettpakkede eller store områder.
ne: माथि उठेका बटनहरूले धेरैजसो समतल लेआउटहरूमा आयाम थप्छन्। यी बटनहरूले व्यस्त र फराकिला खाली ठाउँहरूमा हुने कार्यमा जोड दिन्छन्।
pa: ਉੱਭਰੇ ਹੋਏ ਬਟਨ ਜ਼ਿਆਦਾਤਰ ਸਮਤਲ ਖਾਕਿਆਂ 'ਤੇ ਆਯਾਮ ਸ਼ਾਮਲ ਕਰਦੇ ਹਨ। ਉਹ ਰੁੱਝੀਆਂ ਜਾਂ ਚੌੜੀਆਂ ਸਪੇਸਾਂ 'ਤੇ ਫੰਕਸ਼ਨਾਂ 'ਤੇ ਜ਼ੋਰ ਦਿੰਦੇ ਹਨ।
pl: Przyciski podniesione dodają głębi układom, które są w znacznej mierze płaskie. Zwracają uwagę na funkcje w mocno wypełnionych lub dużych obszarach.
pt: Botões elevados adicionam dimensão a layouts praticamente planos. Eles enfatizam funções em espaços cheios ou amplos.
pt_pt: Os botões elevados adicionam dimensão a esquemas maioritariamente planos. Estes botões realçam funções em espaços ocupados ou amplos.
ro: Butoanele în relief conferă dimensiune aspectelor în mare parte plate. Acestea evidențiază funcții în spații pline sau ample.
ru: Приподнятые кнопки позволяют сделать плоские макеты более объемными, а функции на насыщенных или широких страницах – более заметными.
si: එසවූ බොත්තම් බොහෝ විට පැතලි පිරිසැලසුම්වලට මානය එක් කරයි. ඒවා කාර්ය බහුල හෝ පුළුල් ඉඩවල ශ්‍රිත අවධාරණය කරයි.
sk: Zvýšené tlačidlá pridávajú rozmery do prevažne plochých rozložení. Zvýrazňujú funkcie v neprehľadných alebo širokých priestoroch.
sq: Butonat e ngritur u shtojnë dimension strukturave kryesisht të rrafshëta. Ata theksojnë funksionet në hapësirat e gjera ose me trafik.
sr: Издигнута дугмад пружа тродимензионални изглед равном приказу. Она наглашава функције у широким просторима или онима са пуно елемената.
sr_latn: Izdignuta dugmad pruža trodimenzionalni izgled ravnom prikazu. Ona naglašava funkcije u širokim prostorima ili onima sa puno elemenata.
sv: Med upphöjda knappar får mestadels platta layouter definition. De kan användas för att lyfta fram funktioner i plottriga eller breda utrymmen.
te: ముందుకు ఉన్న బటన్‌లు ఎక్కువగా ఫ్లాట్ లేఅవుట్‌లకు భుజాన్ని జోడిస్తాయి. అవి బిజీగా లేదా విస్తృతంగా ఉన్న ప్రదేశాలలో విధులను నొక్కి చెబుతాయి.
th: ปุ่มแบบยกขึ้นช่วยเพิ่มมิติให้แก่เลย์เอาต์แบบแบนราบเป็นส่วนใหญ่ โดยจะช่วยเน้นฟังก์ชันในพื้นที่ที่มีการใช้งานมากหรือกว้างขวาง
tr: Yükseltilmiş düğmeler çoğunlukla düz düzenlere boyut ekler. Yoğun veya geniş alanlarda işlevleri vurgular.
uk: Опуклі кнопки роблять пласкі макети помітнішими. Вони привертають увагу до функцій на заповнених або пустих місцях.
ur: ابھرے ہوئے بٹنز زیادہ تر ہموار لے آؤٹس میں ڈائمینشن شامل کرتے ہیں۔ یہ مصروف یا وسیع جگہوں والے فنکشنز پر زور دیتے ہیں۔
uz: Koʻtarilgan tugmalar yassi maketni qavariqli qilish imkonini beradi. Katta va keng sahifalarda koʻzga tez tashlanadigan boʻladi
vi: Các nút lồi sẽ làm gia tăng kích thước đối với hầu hết các bố cục phẳng. Các nút này làm nổi bật những chức năng trên không gian rộng hoặc có mật độ dày đặc.
zh_hk: 凸起的按鈕可為主要為平面的版面配置增添層次。這類按鈕可在擁擠或寬闊的空間中突顯其功能。
zu: Izinkinobho eziphakanyisiwe zingeza ubukhulu kaningi kuzakhiwo eziphansi. Zigcizelela imisebenzi kuzikhala ezimatasa noma ezibanzi.

# demoOutlinedButtonTitle
source: Outlined Button
af: Buitelynknoppie
am: ባለቢጋር አዝራር
ar_eg: زر محدَّد الجوانب
as: বৰ্হিৰেখাযুক্ত বুটাম
az: Haşiyəli Düymə
be: Кнопка з контурам
bn: আউটলাইন করা বোতাম
bs: Ocrtano dugme
ca: Botó perfilat
da: Konturknap
es_ar: Botón con contorno
et: Mitmetasandiline nupp
eu: Botoi ingeradadunak
fa: دکمه برون‌نما
fil: Button na May Outline
fr_ca: Bouton avec contours
gl: Botón con contorno
gu: આઉટલાઇન બટન
he: לחצן מודגש
hi: आउटलाइन वाले बटन
hu: Körülrajzolt gomb
hy: Ուրվագծային կոճակ
id: Tombol Outline
it: Pulsante con contorni
ja: アウトライン ボタン
ka: კონტურიანი ღილაკი
km: ប៊ូតុងមានបន្ទាប់ជុំវិញ
kn: ವಿವರಿಸಿದ ಬಟನ್
ko: 윤곽 버튼
ky: Контурланган баскыч
lo: ປຸ່ມມີຂອບ
lt: Kontūriniai mygtukai
lv: Konturēta poga
mk: Копче со контура
ml: ഔട്ട്ലൈൻഡ് ബട്ടൺ
mn: Хүрээтэй товчлуур
mr: आउटलाइन्ड बटण
ms: Butang Garis Kasar
my: ဘောင်မျဉ်းခတ်ခြင်း ခလုတ်
nb: Knapp med omriss
ne: आउटलाइनयुक्त बटन
pa: ਖਾਕਾਬੱਧ ਬਟਨ
pl: Przycisk z konturem
pt: Botão circunscrito
pt_pt: Botão de contorno
ro: Butonul conturat
ru: Контурная кнопка
si: වැටිසන යෙදූ බොත්තම
sk: Tlačidlo s obrysom
sq: Buton me kontur
sr: Оивичено дугме
sr_latn: Oivičeno dugme
sv: Konturknapp
te: రూపకల్పన ఉన్న బటన్
th: ปุ่มแบบเติมขอบ
tr: Dış Çizgili Düğme
uk: Кнопка з контуром
ur: آؤٹ لائن والا بٹن
uz: Chegarali tugma
vi: Nút có đường viền
zh_hk: 外框按鈕
zu: Inkinobho Echaziwe
