Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoDataTableDescription
source: Data tables display information in a grid-like format of rows and columns. They organize information in a way that's easy to scan, so that users can look for patterns and insights.
af: Datatabelle wys inligting in ’n roosterformaat met rye en kolomme. Dit organiseer inligting op ’n manier wat maklik is om noukeurig te bestudeer sodat gebruikers patrone en insigte kan kry.
am: የውሂብ ሠንጠረዦች መረጃን የፍርግርግ ዓይነት በሆነ የረድፎች እና አምዶች ቅርጸት ያሳያሉ። ተጠቃሚዎች ስርዓተ ጥለቶችን እና ግንዛቤዎችን መፈለግ እንዲችሉ መረጃን ለመቃኘት ቀላል በሆነ መንገድ ያደራጁታል።
ar_eg: تعرض جداول البيانات معلومات على هيئة شبكة من الصفوف والأعمدة، حيث يتم تنظيم المعلومات بطريقة يَسهُل فحصها كي يتمكّن المستخدمون من البحث عن الأنماط والإحصاءات.
as: ডেটাৰ তালিকাসমূহে শাৰী আৰু স্তম্ভবোৰৰ গ্ৰিডৰ দৰে এটা ফৰ্মেটত তথ্য প্ৰদৰ্শন কৰে। সেইবোৰে সহজে স্কেন কৰিব পৰাকৈ তথ্য সংগঠিত কৰে, যাতে ব্যৱহাৰকাৰীসকলে আৰ্হি আৰু অন্তৰ্দৃষ্টিসমূহ চাব পাৰে।
az: Data cədvəlləri məlumatları sıra və sütunlardan ibarət tor şəklində göstərir. Onlar məlumatları skan etməyi asanlaşdıran qaydaya salır, beləcə istifadəçilər struktur və məlumatları axtara bilərlər.
be: Табліцы з данымі паказваюць інфармацыю ў выглядзе сеткі з радкамі і слупкамі. У іх інфармацыя ўпарадкавана так, каб яе было лёгка знайсці і параўнаць.
bn: সারি এবং কলামযুক্ত গ্রিডের মতো ফর্ম্যাটে ডেটা টেবিল তথ্য দেখায়। ডেটা টেবিল এমনভাবে তথ্য দেখায় যা সহজেই স্ক্যান করা যায়, যাতে ব্যবহারকারীরা প্যাটার্ন এবং ইনসাইট দেখতে পারেন।
bs: Informacije u tabelama s podacima su prikazane u formatu mreže redova i kolona. Informacije su organizirane na način koji olakšava pregled da korisnici mogu tražiti uzorke i uvide.
ca: Les taules de dades mostren informació en un format de quadrícula estructurat en files i columnes. Organitzen la informació de manera que sigui fàcil d'analitzar, perquè els usuaris puguin cercar patrons i estadístiques.
da: Datatabeller viser oplysninger i et gitterlignende format med rækker og kolonner. Oplysningerne organiseres på en måde, der gør dem nemme at gennemgå, så brugerne kan finde mønstre og få indsigt.
es_ar: Las tablas de datos muestran información en un formato similar a una grilla con filas y columnas. Se usan para organizar datos de modo que sean fáciles de analizar, y que los usuarios puedan buscar patrones y estadísticas en ellas.
et: Andmetabelites kuvatakse teave ridade ja veergudena ruudustiku vormingus. Need korrastavad teabe nii, et seda oleks lihtne otsida, et kasutajad saaksid otsida mustreid ja statistikat.
eu: Datu-taulek errenkada eta zutabetan bistaratzen dute informazioa, sareta gisa. Erraz bilatzeko moduan dago antolatuta informazioa, erabiltzaileek ereduak eta estatistikak bila ditzaten.
fa: جدول داده اطلاعات را در قالبی شبکه‌مانند نمایش می‌دهد و از ردیف و ستون تشکیل شده است. این جدول اطلاعات را به روشی آسان برای خواندن اجمالی سازمان‌دهی می‌کند تا کاربران بتوانند الگوها و اطلاعات آماری را پیدا کنند.
fil: Ang mga talahanyan ng data ay nagpapakita ng impormasyon sa format ng mga row at column na parang grid. Isinasaayos ng mga ito ang impormasyon sa paraang madaling suriin para makahanap ng mga pattern at insight ang mga user.
fr_ca: Les tableaux de données présentent des renseignements sous forme de grilles composées de lignes et de colonnes. Ils permettent d'organiser l'information d'une manière qui permet de la parcourir facilement, et de cerner des tendances et des statistiques.
gl: As táboas de datos mostran información en forma de grades distribuídas en filas e columnas, o que facilita a busca de datos e a visualización de padróns e tendencias.
gu: ડેટા ટેબલ પંક્તિઓ અને કૉલમના ગ્રિડ જેવા ફૉર્મેટમાં માહિતી બતાવે છે. તે માહિતીને એવી રીતે ગોઠવે છે કે જેનાથી સ્કૅન કરવાનું સરળ બની રહે છે, જેથી વપરાશકર્તાઓ પૅટર્ન અને જાણકારી શોધી શકે.
he: בטבלאות נתונים מוצג מידע בפורמט דמוי-רשת, הכולל שורות ועמודות. המידע מאורגן בהן כך שקל לסרוק אותו, ומשתמשים יכולים למצוא דפוסים ולקבל תובנות.
hi: डेटा टेबल, ग्रिड जैसे फ़ॉर्मैट में होती हैं. इनमें जानकारी को पंक्तियों और कॉलम में दिखाया जाता है. इनमें दी गई जानकारी को स्कैन करना आसान होता है. इससे उपयोगकर्ताओं को पैटर्न और अहम जानकारी खाेजने में मदद मिलती है.
hu: Az adattáblák oszlopok és sorok rácsszerű formájában jelenítik meg az információkat. Olyan módon rendszerezik őket, hogy könnyen áttekinthetők legyenek, így a felhasználók felfedezhetik a mintázatokat és az egyéb fontos adatokat.
hy: Տվյալների աղյուսակները ցուցադրում են տեղեկություններ տողերի և սյունակների ցանցի տեսքով։ Դրանք դասավորում են տեղեկություններն այնպես, որ հեշտ լինի որոնում կատարելը, ինչպես նաև նմուշներ և վիճակագրություն գտնելը։
id: Tabel data menampilkan informasi dalam baris dan kolom dengan format seperti petak. Tabel data menyusun informasi dengan format yang mudah dipindai, sehingga pengguna dapat dengan mudah mencari pola dan data.
it: Le tabelle di dati mostrano le informazioni in un formato a griglia di righe e colonne. Le informazioni sono organizzate in modo da facilitare l'analisi e consentire agli utenti di cercare sequenze dati.
ja: データテーブルには、行と列のグリッドのような形式で情報が表示されます。スキャンしやすいように情報が編成されているため、ユーザーはパターンやインサイトを探すことができます。
ka: მონაცემთა ცხრილები აჩვენებს ინფორმაციას ბადისებურ ფორმატში, მწკრივებით და სვეტებით. მათში ინფორმაცია ისეა ორგანიზებული, რომ მარტივია სკანირებისთვის და მომხმარებლებს შეუძლიათ ნიმუშებისა და ანალიზების ნახვა.
km: តារាងទិន្នន័យ​បង្ហាញអំពី​ព័ត៌មានជា​ទម្រង់ដូចក្រឡា​នៃជួរដេក និងជួរឈរ។ តារាង​ទាំងនេះ​រៀបចំព័ត៌មាន​តាមរបៀប​ដែលងាយស្រួល​ស្កេន ដើម្បីឱ្យ​អ្នកប្រើប្រាស់​អាច​រកមើល​លំនាំ និងស្ថិតិបាន។
kn: ಡೇಟಾ ಟೇಬಲ್‌ಗಳು, ಸಾಲುಗಳು ಮತ್ತು ಕಾಲಮ್‌ಗಳ ಗ್ರಿಡ್-ರೀತಿಯ ಫಾರ್ಮ್ಯಾಟ್‌ನಲ್ಲಿ ಡೇಟಾವನ್ನು ತೋರಿಸುತ್ತವೆ. ಅವರು ಮಾಹಿತಿಯನ್ನು ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ಸುಲಭವಾದ ರೀತಿಯಲ್ಲಿ ಆಯೋಜಿಸುತ್ತಾರೆ, ಇದರಿಂದ ಬಳಕೆದಾರರು ಪ್ಯಾಟರ್ನ್‌ಗಳು ಮತ್ತು ಒಳನೋಟಗಳನ್ನು ನೋಡಬಹುದು.
ko: 데이터 표는 행과 열로 구성된 그리드 형식으로 정보를 표시합니다. 사용자가 패턴이나 통계를 파악할 수 있도록 훑어보기 쉬운 방식으로 데이터가 정리됩니다.
ky: Маалымат жадыбалдарында маалымат саптар менен тилкелерден турган торчонун форматында берилет. Аларда маалымат текшерүүгө оңой жолдо иреттелип, колдонуучулар үлгүлөрдү жана статистиканы оңой таба алышат.
lo: ຕາຕະລາງຂໍ້ມູນຈະສະແດງຂໍ້ມູນໃນຮູບແບບຊ່ອງທີ່ປະກອບດ້ວຍແຖວ ແລະ ຖັນ. ພວກມັນຈະຈັດລະບຽບຂໍ້ມູນໃນແບບທີ່ສາມາດສະແກນໄດ້ງ່າຍ, ເພື່ອໃຫ້ຜູ້ໃຊ້ສາມາດຊອກຫາຮູບແບບ ແລະ ຂໍ້ມູນເຈາະເລິກໄດ້.
lt: Duomenų lentelėse informacija pateikiama į tinklelį panašiu eilučių ir stulpelių formatu. Jose informacija sisteminama, kad būtų paprasta nuskaityti ir naudotojai galėtų ieškoti šablonų bei įžvalgų.
lv: Datu tabulās režģa formātā ir attēlota rindu un kolonnu informācija. Informācija šajās tabulās ir attēlota ērti pārmeklējamā veidā, lai lietotāji varētu meklēt tendences un gūt ieskatus.
mk: Табелите со податоци прикажуваат податоци во формат во вид на мрежа од редови и колони. Тие ги организираат податоците да бидат лесни за скенирање, така што корисниците може да бараат шеми и увид.
ml: ഡാറ്റാ പട്ടികകൾ, വരികളും കോളങ്ങളും അടങ്ങിയ ഗ്രിഡ് ഫോർമാറ്റിൽ വിവരങ്ങൾ കാണിക്കുന്നു. അവ എളുപ്പം സ്‌കാൻ ചെയ്യാനാകുന്ന വിധം വിവരങ്ങൾ ക്രമീകരിക്കുന്നതിനാൽ ഉപയോക്താക്കൾക്ക് അതിലെ ക്രമങ്ങളും ഉൾക്കാഴ്‌ചകളും തിരയാനാകും.
mn: Өгөгдлийн хүснэгт нь мэдээллийг мөр, баганууд бүхий сүлжээсэн форматаар үзүүлдэг. Тэдгээр нь мэдээллийг хайхад хялбар байдлаар цэгцэлснээр хэрэглэгч загвар, статистикийг харах боломжтой.
mr: डेटा सारण्या पंक्ती आणि स्तंभांच्या ग्रिड सारख्या फॉरमॅटमध्ये माहिती प्रदर्शित करतात. स्कॅन करणे सोपे असेल अशाप्रकारे ते माहिती व्यवस्थापित करतात, जेणेकरून वापरकर्ते नमुने आणि इनसाइट शोधू शकतील.
ms: Jadual data memaparkan maklumat dalam format seperti grid yang mengandungi baris dan lajur. Jadual ini menyusun maklumat dengan cara yang mudah untuk diimbas, supaya pengguna dapat mencari corak dan cerapan.
my: ဒေတာဇယားများတွင် အချက်အလက်များကို အတန်းနှင့် ကော်လံများပါသော ဇယားကွက်ကဲ့သို့ ပုံစံဖြင့် ဖော်ပြသည်။ အလွယ်တကူကြည့်နိုင်သော နည်းလမ်းဖြင့် အချက်အလက်များကို စီစဉ်ထားသည့်အတွက် အသုံးပြုသူများက ပုံစံနှင့် သိကောင်းစရာများကို ရှာဖွေနိုင်သည်။
nb: Datatabeller viser informasjon i et rutenettlignende format med rader og kolonner. Der organiseres informasjonen på en måte som er enkel å skanne, slik at brukerne kan se etter mønstre og statistikk.
ne: डेटाका तालिकाहरूले पङ्क्ति तथा स्तम्भको ग्रिड जस्तै देखिने फर्म्याटमा जानकारी देखाउँछन्। तालिकाहरूले प्रयोगकर्ताहरूले प्याटर्न तथा अन्तर्दृष्टि खोज्न सकून् भन्नाका लागि स्क्यान गर्न सजिलो हुने गरी जानकारी व्यवस्थापन गर्छन्।
pa: ਡਾਟਾ ਸਾਰਨੀਆਂ ਕਤਾਰਾਂ ਅਤੇ ਕਾਲਮਾਂ ਦੇ ਗ੍ਰਿਡ-ਵਰਗੇ ਫਾਰਮੈਟ ਵਿੱਚ ਜਾਣਕਾਰੀ ਦਿਖਾਉਂਦੀਆਂ ਹਨ। ਇਹ, ਜਾਣਕਾਰੀ ਨੂੰ ਇਸ ਤਰੀਕੇ ਨਾਲ ਵਿਵਸਥਿਤ ਕਰਦੀਆਂ ਹਨ ਤਾਂ ਜੋ ਇਸਨੂੰ ਆਸਾਨੀ ਨਾਲ ਸਕੈਨ ਕੀਤਾ ਜਾ ਸਕੇ, ਜਿਸ ਨਾਲ ਵਰਤੋਂਕਾਰ ਪੈਟਰਨ ਲੱਭ ਸਕਣ ਅਤੇ ਅੰਦਰੂਨੀ-ਝਾਤਾਂ ਲੈ ਸਕਣ।
pl: Tabele danych wyświetlają informacje w formacie siatki podzielonej na wiersze i kolumny. Organizują one dane w formie sprzyjającej szybkiemu przeglądaniu, dzięki czemu łatwiej można zauważyć wzorce i trendy.
pt: As tabelas de dados apresentam informações em grades com linhas e colunas. As informações são organizadas para facilitar a leitura, permitindo que os usuários procurem por padrões e insights.
pt_pt: As tabelas de dados apresentam informações num formato de grelha de linhas e colunas. Organizam as informações de uma forma fácil de analisar para que os utilizadores possam procurar padrões e estatísticas.
ro: Tabelele de date afișează informații sub formă de grilă, cu rânduri și coloane. Acestea organizează informațiile astfel încât să fie ușor de consultat, pentru ca utilizatorii să poată căuta modele și statistici.
ru: В таблицах данные распределены по строкам и столбцам, чтобы пользователь мог легко находить нужную информацию и быстро сравнивать представленные варианты.
si: දත්ත වගු පේළි සහ තීරුවල ජාලක වැනි ආකෘතියකින් තොරතුරු පෙන්වයි. ඒවා තොරතුරු ස්කෑන් කිරීමට පහසු වන පරිදි සංවිධානය කරයි. ඒ නිසා පරිශීලකයන්ට රටා සහ ඇතුළාන්ත සඳහා බැලිය හැකි වේ.
sk: Tabuľky údajov zobrazujú informácie vo formáte pripomínajúcom mriežku riadkov a stĺpcov. Usporiadavajú informácie tak, že sa dajú ľahko vyhľadať, takže používatelia môžu hľadať vzory a štatistiky.
sq: Tabelat e të dhënave shfaqin informacione në një format me rreshta dhe kolona si në rrjetë. Ato i organizojnë informacionet në një mënyrë që është e lehtë për t'i skanuar, në mënyrë që përdoruesit të mund të shikojnë për motive dhe statistika.
sr: Табеле са подацима приказују информације у облику мреже са редовима и колонама. У њима су информације организоване тако да могу лако да се прегледају и да би корисници могли да траже шаблоне и увиде.
sr_latn: Tabele sa podacima prikazuju informacije u obliku mreže sa redovima i kolonama. U njima su informacije organizovane tako da mogu lako da se pregledaju i da bi korisnici mogli da traže šablone i uvide.
sv: Datatabeller visar information i ett rutnätsformat med rader och kolumner. De gör information lätt att söka igenom, så att användare kan leta efter mönster och insikter.
te: డేటా పట్టికలు సమాచారాన్ని అడ్డు వరుసలు మరియు నిలువు వరుసలు కలిగి ఉండే గ్రిడ్ లాంటి ఫార్మాట్‌లో ప్రదర్శిస్తాయి. ఇవి సమాచారాన్ని సులభంగా స్కాన్ చేయగలిగేలా నిర్వహిస్తాయి, కనుక యూజర్‌లు ఆకృతులు, గణాంకాలను చూడగలరు.
th: ตารางข้อมูลแสดงข้อมูลในรูปแบบตารางกริดที่ประกอบด้วยแถวและคอลัมน์ ใช้ในการจัดระเบียบข้อมูลให้ค้นหาได้ง่ายเพื่อให้ผู้ใช้มองหารูปแบบและข้อมูลเชิงลึกได้
tr: Veri tabloları bilgileri ızgara biçimindeki satırlar ve sütunlarda görüntüler. Kullanıcıların model ve sonuç arayabilmesi için bilgiyi kolayca taranabilecek şekilde düzenler.
uk: У таблицях даних інформацію представлено у форматі сітки з рядками та стовпцями. Інформація в них упорядковується так, щоб її було легко переглядати, а користувачі могли шукати шаблони та статистику.
ur: ڈیٹا ٹیبلز قطاروں اور کالمز کے گرڈ جیسے فارمیٹ میں معلومات دکھاتے ہیں۔ وہ معلومات کو اس طرح منظم کرتے ہیں کہ جس سے اسکین کرنا آسان ہو، تاکہ صارفین پیٹرنز اور بصیرتوں کو تلاش کر سکیں۔
uz: Jadvaldagi maʼlumotlar ustun va qatorlar boʻyicha ajratilgan. Bu foydalanuvchiga kerakli axborotni tezroq topish va taqdim etilgan variantlarni taqqoslash imkonini beradi.
vi: Bảng dữ liệu trình bày thông tin ở định dạng lưới gồm hàng và cột. Những bảng này sắp xếp thông tin theo cách rõ ràng, dễ tra cứu để người dùng có thể tìm mẫu và thông tin chi tiết.
zh_hk: 資料表以列和欄的格狀形式展示資訊，用以整理資訊，方便查閱，讓使用者找出模式和分析資料。
zu: Amathebula edatha abonisa imininingwane ngefomethi eyigridi yemigqa namakholomu. Ihlela imininingwane ngendlela yokuthi kube lula ukuskena, ukuze abasebenzisi babheke amaphethini nemininingwane.
