Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# cupertinoAlertAllow
source: Allow
af: Laat toe
am: ፍቀድ
ar_eg: السماح
as: অনুমতি দিয়ক
az: İcazə verin
be: Дазволіць
bn: অনুমতি দিন
bs: Dozvoli
ca: Permet
da: Tillad
es_ar: Permitir
et: Luba
eu: Baimendu
fa: اجازه دادن
fil: Payagan
fr_ca: Autoriser
gl: Permitir
gu: મંજૂરી આપો
he: אישור
hi: अनुमति दें
hu: Engedélyezés
hy: Թույլատրել
id: Izinkan
it: Consenti
ja: 許可
ka: დაშვება
km: អនុញ្ញាត
kn: ಅನುಮತಿಸಿ
ko: 허용
ky: Уруксат берүү
lo: ອະນຸຍາດ
lt: Leisti
lv: Atļaut
mk: Дозволи
ml: അനുവദിക്കുക
mn: Зөвшөөрөх
mr: अनुमती द्या
ms: Benarkan
my: ခွင့်ပြုရန်
nb: Tillat
ne: अनुमति दिनुहोस्
pa: ਆਗਿਆ ਦਿਓ
pl: Zezwól
pt: Permitir
pt_pt: Permitir
ro: Permiteți
ru: Разрешить
si: ඉඩ දෙන්න
sk: Povoliť
sq: Lejo
sr: Дозволи
sr_latn: Dozvoli
sv: Tillåt
te: అనుమతించండి
th: อนุญาต
tr: İzin ver
uk: Дозволити
ur: اجازت دیں
uz: Ruxsat berish
vi: Cho phép
zh_hk: 允許
zu: Vumela

# cupertinoAlertDontAllow
source: Don't Allow
af: Moenie toelaat nie
am: አትፍቀድ
ar_eg: عدم السماح
as: অনুমতি নিদিব
az: İcazə verməyin
be: Не дазваляць
bn: অনুমতি দেবেন না
bs: Nemoj dozvoliti
ca: No permetis
da: Tillad ikke
es_ar: No permitir
et: Ära luba
eu: Ez baimendu
fa: مجاز نیست
fil: Huwag Payagan
fr_ca: Ne pas autoriser
gl: Non permitir
gu: મંજૂરી આપશો નહીં
he: אין לאפשר
hi: अनुमति न दें
hu: Tiltás
hy: Չթույլատրել
id: Jangan Izinkan
it: Non consentire
ja: 許可しない
ka: აკრძალვა
km: មិនអនុញ្ញាត
kn: ಅನುಮತಿಸಬೇಡಿ
ko: 허용 안함
ky: Уруксат берилбесин
lo: ບໍ່ອະນຸຍາດ
lt: Neleisti
lv: Neatļaut
mk: Не дозволувај
ml: അനുവദിക്കരുത്
mn: Зөвшөөрөхгүй
mr: अनुमती देऊ नका
ms: Jangan Benarkan
my: ခွင့်မပြုပါ
nb: Ikke tillat
ne: अनुमति नदिनुहोस्
pa: ਆਗਿਆ ਨਾ ਦਿਓ
pl: Nie zezwalaj
pt: Não permitir
pt_pt: Não permitir
ro: Nu permiteți
ru: Запретить
si: අවසර නොදෙන්න
sk: Nepovoliť
sq: Mos lejo
sr: Не дозволи
sr_latn: Ne dozvoli
sv: Tillåt inte
te: అనుమతించవద్దు
th: ไม่อนุญาต
tr: İzin Verme
uk: Заборонити
ur: اجازت نہ دیں
uz: Ruxsat berilmasin
vi: Không cho phép
zh_hk: 不允許
zu: Ungavumeli

# cupertinoAlertFavoriteDessert
source: Select Favorite Dessert
af: Kies gunstelingnagereg
am: ተወዳጅ ጣፋጭ ምግብን ይምረጡ
as: প্ৰিয় ডিজার্ট বাছনি কৰক
az: Sevimli Desertinizi Seçin
be: Выберыце ўлюбёны дэсерт
bn: পছন্দের মিষ্টি বেছে নিন
bs: Odaberite omiljeni desert
ca: Selecciona les teves postres preferides
da: Vælg en favoritdessert
es_ar: Selecciona tu postre favorito
et: Valige lemmikmagustoit
eu: Aukeratu gogoko postrea
fa: انتخاب دسر موردعلاقه
fil: Piliin ang Paboritong Panghimagas
fr_ca: Sélectionnez votre dessert favori
gl: Seleccionar sobremesa favorita
gu: મનપસંદ મીઠાઈ પસંદ કરો
he: בחירת הקינוח המועדף
hi: पसंदीदा मिठाई चुनें
hu: Kedvenc desszert kiválasztása
hy: Ընտրեք սիրած աղանդերը
id: Pilih Makanan Penutup Favorit
it: Seleziona il dolce che preferisci
ja: お気に入りのデザートの選択
ka: აირჩიეთ საყვარელი დესერტი
km: ជ្រើសរើស​បង្អែមដែល​ចូលចិត្ត
kn: ನೆಚ್ಚಿನ ಡೆಸರ್ಟ್ ಆಯ್ಕೆಮಾಡಿ
ko: 가장 좋아하는 디저트 선택
ky: Жакшы көргөн десертти тандоо
lo: ເລືອກຂອງຫວານທີ່ມັກ
lt: Mėgstamiausio deserto pasirinkimas
lv: Atlasiet iecienītāko desertu
mk: Изберете го омилениот десерт
ml: പ്രിയപ്പെട്ട ഡെസേർട്ട് തിരഞ്ഞെടുക്കുക
mn: Дуртай амттанаа сонгоно уу
mr: आवडते डेझर्ट निवडा
ms: Pilih Pencuci Mulut Kegemaran
my: အနှစ်သက်ဆုံး အချိုပွဲကို ရွေးပါ
nb: Velg favorittdessert
ne: मन पर्ने डेजर्ट चयन गर्नुहोस्
pa: ਮਨਪਸੰਦ ਮਿੱਠੀ ਚੀਜ਼ ਚੁਣੋ
pl: Wybierz ulubiony deser
pt: Selecionar sobremesa favorita
pt_pt: Selecione a sobremesa favorita
ro: Alegeți desertul preferat
ru: Выберите любимый десерт
si: ප්‍රියතම අතුරුපස තෝරන්න
sk: Výber obľúbeného dezertu
sq: Zgjidh ëmbëlsirën e preferuar
sr: Изаберите омиљену посластицу
sr_latn: Izaberite omiljenu poslasticu
sv: Välj favoritefterrätt
te: ఇష్టమైన డెజర్ట్‌ని ఎంపిక చేయండి
th: เลือกของหวานที่คุณชอบ
uk: Виберіть улюблений десерт
ur: پسندیدہ میٹھی ڈش منتخب کریں
uz: Sevimli desertingizni tanlang
vi: Chọn món tráng miệng yêu thích
zh_hk: 選取喜愛的甜品
zu: Khetha isidlo sokwehlisa esiyintandokazi

# cupertinoAlertDessertDescription
source: Please select your favorite type of dessert from the list below. Your selection will be used to customize the suggested list of eateries in your area.
af: Kies asseblief jou gunstelingsoort nagereg op die lys hieronder. Jou keuse sal gebruik word om die voorgestelde lys eetplekke in jou omgewing te pasmaak.
am: ከዚህ በታች ካለው ዝርዝር እባክዎ የእርስዎን ተወዳጅ ጣፋጭ ምግብ ዓይነት ይምረጡ። የእርስዎ ምርጫ በእርስዎ አካባቢ ያሉትን የሚጠቆሙ መመገቢያ ቦታዎችን ዝርዝር ብጁ ለማድረግ ጥቅም ላይ ሊውል ይችላል።
ar_eg: يُرجى اختيار نوع الحلوى المفضّل لك من القائمة أدناه. وسيتم استخدام اختيارك في تخصيص القائمة المقترَحة للمطاعم في منطقتك.
as: অনুগ্ৰহ কৰি, তলৰ সূচীখনৰ পৰা আপোনাৰ প্ৰিয় ডিজার্টৰ প্ৰকাৰ বাছনি কৰক। আপুনি কৰা বাছনি পৰামর্শ হিচাপে আগবঢ়োৱা আপোনাৰ এলেকাত থকা খাদ্যৰ দোকানসমূহৰ সূচীখন কাষ্টমাইজ কৰিবলৈ ব্যৱহাৰ কৰা হয়।
az: Aşağıdakı siyahıdan sevimli desert növünüzü seçin. Seçiminiz ərazinizdə təklif edilən restoranlardan ibarət siyahını fərdiləşdirmək üçün istifadə ediləcək.
be: Выберыце ўлюбёны тып дэсерту са спіса ўнізе. З улікам выбранага вамі варыянта будзе складацца спіс месцаў паблізу, дзе гатуюць падобныя ласункі.
bn: নিচে উল্লেখ করা তালিকা থেকে পছন্দের মিষ্টি বেছে নিন। আপনার পছন্দের হিসেবে এলাকার খাবারের দোকানের সাজেস্ট করা একটি তালিকা কাস্টমাইজ করা হবে।
bs: Odaberite omiljenu vrstu deserta s liste u nastavku. Vaš odabir koristit će se za prilagođavanje liste prijedloga restorana u vašem području.
ca: Selecciona el teu tipus de postres preferides de la llista que hi ha més avall. La teva selecció s'utilitzarà per personalitzar la llista de suggeriments de restaurants de la teva zona.
da: Vælg din yndlingsdessert på listen nedenfor. Dit valg bruges til at tilpasse den foreslåede liste over spisesteder i dit område.
es_ar: Selecciona tu postre favorito de la siguiente lista. Se usará tu elección para personalizar la lista de restaurantes sugeridos en tu área.
et: Valige allolevast loendist oma lemmikmagustoit. Teie valikut kasutatakse teie piirkonnas soovitatud toidukohtade loendi kohandamiseks.
eu: Beheko zerrendan, aukeratu gehien gustatzen zaizun postrea. Inguruko jatetxeen iradokizunak pertsonalizatzeko erabiliko da hautapen hori.
fa: لطفاً نوع دسر موردعلاقه‌تان را از فهرست زیر انتخاب کنید. از انتخاب شما برای سفارشی کردن فهرست پیشنهادی رستوران‌های منطقه‌تان استفاده می‌شود.
fil: Pakipili ang paborito mong uri ng panghimagas sa listahan sa ibaba. Gagamitin ang pipiliin mo para i-customize ang iminumungkahing listahan ng mga kainan sa iyong lugar.
fr_ca: Veuillez sélectionner votre type de dessert favori dans la liste ci-dessous. Votre sélection servira à personnaliser la liste de suggestions de restaurants dans votre région.
gl: Selecciona o teu tipo de sobremesa preferido na lista que aparece a continuación. A escolla utilizarase para personalizar a lista de restaurantes recomendados da túa zona.
gu: નીચેની સૂચિમાંથી કૃપા કરીને તમારા મનપસંદ પ્રકારની મીઠાઈને પસંદ કરો. તમારા ક્ષેત્રમાં રહેલી ખાવા-પીવાની દુકાનોની સૂચવેલી સૂચિને કસ્ટમાઇઝ કરવા માટે તમારી પસંદગીનો ઉપયોગ કરવામાં આવશે.
he: יש לבחור את סוג הקינוח המועדף עליך מהרשימה שלמטה. בחירתך תשמש להתאמה אישית של רשימת המסעדות המוצעת באזור שלך.
hi: कृपया नीचे दी गई सूची से अपनी पसंदीदा मिठाई चुनें. आपके चुने गए विकल्प का इस्तेमाल, आपके इलाके में मौजूद खाने की जगहों के सुझावों को पसंद के मुताबिक बनाने के लिए किया जाएगा.
hu: Válaszd ki kedvenc desszertfajtádat az alábbi listából. A kiválasztott ételek alapján a rendszer személyre szabja a közeli étkezési lehetőségek javasolt listáját.
hy: Ընտրեք ձեր սիրած աղանդերը ստորև ցանկից։ Ձեր ընտրությունը կօգտագործվի մոտակայքում գտնվող օբյետկտները կարգավորելու համար։
id: Silakan pilih jenis makanan penutup favorit Anda dari daftar di bawah ini. Pilihan Anda akan digunakan untuk menyesuaikan daftar saran tempat makan di area Anda.
it: Seleziona il tuo dolce preferito nell'elenco indicato di seguito. La tua selezione verrà usata per personalizzare l'elenco di locali gastronomici suggeriti nella tua zona.
ja: 以下のリストからお気に入りのデザートの種類を選択してください。選択項目に基づいて、地域にあるおすすめのフードショップのリストがカスタマイズされます。
ka: ქვემოთ მოცემული სიიდან აირჩიეთ თქვენი საყვარელი დესერტი. თქვენი არჩევანის მეშვეობით მოხდება თქვენს ტერიტორიაზე შემოთავაზებული სიის მორგება.
km: សូមជ្រើសរើស​ប្រភេទបង្អែម​ដែលអ្នក​ចូលចិត្តពី​បញ្ជីខាងក្រោម។ ការជ្រើសរើស​របស់អ្នក​នឹងត្រូវបាន​ប្រើ ដើម្បីប្ដូរ​បញ្ជីអាហារដ្ឋាន​ដែលបានណែនាំ​តាមបំណង នៅក្នុង​តំបន់​របស់អ្នក។
kn: ಕೆಳಗಿನ ಪಟ್ಟಿಯಿಂದ ನಿಮ್ಮ ನೆಚ್ಚಿನ ಪ್ರಕಾರದ ಡೆಸರ್ಟ್ ಅನ್ನು ಆಯ್ಕೆಮಾಡಿ. ನಿಮ್ಮ ಪ್ರದೇಶದಲ್ಲಿನ ಸೂಚಿಸಲಾದ ಆಹಾರ ಮಳಿಗೆಗಳ ಪಟ್ಟಿಯನ್ನು ಕಸ್ಟಮೈಸ್ ಮಾಡಲು ನಿಮ್ಮ ಆಯ್ಕೆಯನ್ನು ಬಳಸಲಾಗುತ್ತದೆ.
ko: 아래 목록에서 가장 좋아하는 디저트를 선택하세요. 선택한 옵션은 지역 내 식당 추천 목록을 맞춤설정하는 데 사용됩니다.
ky: Төмөнкү тизмеден жакшы көргөн десертиңизди тандаңыз. Тандооңуз сиздин аймагыңыздагы тамак-аш жайларынын сунушталган тизмесин ыңгайлаштыруу үчүн колдонулат.
lo: ກະລຸນາເລືອກປະເພດຂອງຫວານທີ່ທ່ານມັກຈາກລາຍຊື່ທາງລຸ່ມ. ການເລືອກຂອງທ່ານຈະຖືກໃຊ້ເພື່ອປັບແຕ່ງລາຍຊື່ຮ້ານອາຫານທີ່ແນະນຳໃນພື້ນທີ່ຂອງທ່ານ.
lt: Pasirinkite savo mėgstamiausią desertą iš toliau pateikto sąrašo. Pagal pasirinkimą bus tinkinamas siūlomas valgyklų jūsų regione sąrašas.
lv: Lūdzu, tālāk redzamajā sarakstā atlasiet savu iecienītāko desertu. Jūsu atlase tiks izmantota, lai pielāgotu jūsu apgabalā ieteikto restorānu sarakstu.
mk: Изберете го омилениот тип десерт од списокот подолу. Вашиот избор ќе се искористи за да се приспособи предложениот список со места за јадење во вашата област.
ml: താഴെ കൊടുത്ത പട്ടികയിൽ നിന്ന് നിങ്ങളുടെ പ്രിയപ്പെട്ട ഡെസേർട്ട് തരം തിരഞ്ഞെടുക്കുക. നിങ്ങളുടെ പ്രദേശത്തെ നിർദ്ദേശിച്ച ഭക്ഷണശാലകളുടെ പട്ടിക ഇഷ്ടാനുസൃതമാക്കാൻ നിങ്ങളുടെ തിരഞ്ഞെടുപ്പ് ഉപയോഗിക്കും.
mn: Доорх жагсаалтаас дуртай амттаныхаа төрлийг сонгоно уу. Таны сонголтыг танай бүсэд байгаа санал болгож буй хоолны газруудын жагсаалтыг өөрчлөхөд ашиглах болно.
mr: कृपया खालील सूचीमधून तुमच्या आवडत्या डेझर्टचा प्रकार निवडा. तुमच्या परिसरातील सुचवलेल्या उपहारगृहांची सूची कस्टमाइझ करण्यासाठी तुमच्या निवडीचा उपयोग केला जाईल.
ms: Sila pilih jenis pencuci mulut kegemaran anda daripada senarai di bawah. Pemilihan anda akan digunakan untuk menyesuaikan senarai kedai makan yang dicadangkan di kawasan anda.
my: အောက်ပါစာရင်းမှနေ၍ သင့်အကြိုက်ဆုံး အချိုပွဲအမျိုးအစားကို ရွေးပါ။ သင့်ရွေးချယ်မှုကို သင့်ဒေသရှိ အကြံပြုထားသည့် စားသောက်စရာစာရင်းကို စိတ်ကြိုက်ပြင်ဆင်ရန် အသုံးပြုသွားပါမည်။
nb: Velg favorittdesserten din fra listen nedenfor. Valget ditt brukes til å tilpasse listen over foreslåtte spisesteder i området ditt.
ne: कृपया निम्न सूचीबाट आफूलाई मन पर्ने प्रकारको डेजर्ट चयन गर्नुहोस्। तपाईंले गरेको चयन तपाईंको क्षेत्रमा रहेका खाने ठाउँहरूको सिफारिस गरिएको सूचीलाई आफू अनुकूल पार्न प्रयोग गरिने छ।
pa: ਕਿਰਪਾ ਕਰਕੇ ਹੇਠਾਂ ਦਿੱਤੀ ਸੂਚੀ ਵਿੱਚੋਂ ਆਪਣੀ ਮਨਪਸੰਦ ਮਿੱਠੀ ਚੀਜ਼ ਚੁਣੋ। ਤੁਹਾਡੀ ਚੋਣ ਨੂੰ ਤੁਹਾਡੇ ਖੇਤਰ ਵਿੱਚ ਖਾਣ-ਪੀਣ ਦੇ ਸਥਾਨਾਂ ਦੀ ਸੁਝਾਈ ਗਈ ਸੂਚੀ ਨੂੰ ਵਿਉਂਤਬੱਧ ਕਰਨ ਲਈ ਵਰਤਿਆ ਜਾਵੇਗਾ।
pl: Wybierz z poniższej listy swój ulubiony rodzaj deseru. Na tej podstawie dostosujemy listę sugerowanych punktów gastronomicznych w Twojej okolicy.
pt: Selecione seu tipo favorito de sobremesa na lista abaixo. Sua seleção será usada para personalizar a lista sugerida de restaurantes na sua área.
pt_pt: Selecione o seu tipo de sobremesa favorito na lista abaixo. A sua seleção será utilizada para personalizar a lista sugerida de restaurantes na sua área.
ro: Alegeți desertul preferat din lista de mai jos. Opțiunea va fi folosită pentru a personaliza lista de restaurante sugerate din zona dvs.
ru: Выберите свой любимый десерт из списка ниже. На основе выбранного варианта мы настроим список рекомендуемых заведений поблизости.
si: කරුණාකර පහත ලැයිස්තුවෙන් ඔබේ ප්‍රියතම අතුරුපස වර්ගය තෝරන්න. ඔබේ තේරීම ඔබේ ප්‍රදේශයෙහි යෝජිත අවන්හල් ලැයිස්තුව අභිරුචිකරණය කිරීමට භාවිත කරනු ඇත.
sk: Vyberte si v zozname nižšie svoj obľúbený typ dezertu. Na základe vášho výberu sa prispôsobí zoznam navrhovaných reštaurácií vo vašom okolí.
sq: Zgjidh llojin tënd të preferuar të ëmbëlsirës nga lista më poshtë. Zgjedhja jote do të përdoret për të personalizuar listën e sugjeruar të restoranteve në zonën tënde.
sr: На листи у наставку изаберите омиљени тип посластице. Ваш избор ће се користити за прилагођавање листе предлога за ресторане у вашој области.
sr_latn: Na listi u nastavku izaberite omiljeni tip poslastice. Vaš izbor će se koristiti za prilagođavanje liste predloga za restorane u vašoj oblasti.
sv: Välj din favoritefterrätt i listan nedan. Valet används för att anpassa listan över förslag på matställen i ditt område.
te: ఈ కింది లిస్ట్‌లో మీకు ఇష్టమైన డెజర్ట్ రకాన్ని దయచేసి ఎంపిక చేసుకోండి. మీ ప్రాంతంలోని సూచించిన తినుబండారాల లిస్ట్‌ను అనుకూలంగా మార్చడానికి మీ ఎంపిక ఉపయోగించబడుతుంది.
th: โปรดเลือกชนิดของหวานที่คุณชอบจากรายการด้านล่าง ตัวเลือกของคุณจะใช้เพื่อปรับแต่งรายการร้านอาหารแนะนำในพื้นที่ของคุณ
tr: Lütfen aşağıdaki listeden en sevdiğiniz tatlı türünü seçin. Seçiminiz, bölgenizdeki önerilen restoranlar listesini özelleştirmek için kullanılacak.
uk: Виберіть свій улюблений десерт зі списку нижче. Ваш вибір буде використано для створення списку рекомендованих кафе у вашому районі.
ur: براہ کرم ذیل کی فہرست میں سے اپنی پسندیدہ میٹھی ڈش منتخب کریں۔ آپ کے انتخاب کا استعمال آپ کے علاقے میں آپ کی تجویز کردہ طعام خانوں کی فہرست کو حسب ضرورت بنانے کے لئے کیا جائے گا۔
uz: Quyidagi roʻyxatdan sevimli desertingizni tanlang. Tanlovingiz asosida biz yaqin-atrofdagi tavsiya etiladigan yemakxonalar roʻyxatini tuzamiz.
vi: Vui lòng chọn món tráng miệng yêu thích từ danh sách bên dưới. Món tráng miệng bạn chọn sẽ dùng để tùy chỉnh danh sách các quán ăn đề xuất trong khu vực của bạn.
zh_hk: 請從下方清單中選取您喜愛的甜點類型。系統會根據您的選擇和所在地區，提供個人化的餐廳建議清單。
zu: Sicela ukhethe uhlobo lwakho oluyintandokazi lwesidlo sokwehlisa kusukela kuhlu olungezansi. Ukukhethwa kwakho kuzosetshenziselwa ukwenza kube ngokwakho uhlu oluphakanyisiwe lwezindawo zokudlela endaweni yangakini.

# cupertinoAlertCheesecake
source: Cheesecake
af: Kaaskoek
am: ቺዝ ኬክ
ar_eg: كعكة بالجبن
as: চীজেৰে প্ৰস্তুত কৰা কেক
az: Çizkeyk
be: Чызкейк
bn: চিজকেক
bs: Torta sa sirom
ca: Pastís de formatge
et: Juustukook
eu: Gazta-tarta
fa: کیک پنیر
fr_ca: Gâteau au fromage
gl: Torta de queixo
gu: ચીઝકેક
he: עוגת גבינה
hi: चीज़केक
hu: Sajttorta
hy: Չիզքեյք
id: Kue Keju
ja: チーズケーキ
ka: ჩიზქეიქი
km: នំខេកឈីស
kn: ಚೀಸ್‌ಕೇಕ್
ko: 치즈 케이크
ky: Чизкейк
lo: ຊີສເຄັກ
lt: Sūrio pyragas
lv: Siera kūka
mk: Торта со сирење
ml: ചീസ്‌കേക്ക്
mn: Бяслагтай бялуу
mr: चीझकेक
ms: Kek keju
my: ချိစ်ကိတ်
nb: Ostekake
ne: चिजको केक
pa: ਪਨੀਰੀ ਕੇਕ
pl: Sernik
ru: Чизкейк
si: චීස් කේක්
sk: Tvarohový koláč
sq: Kek bulmeti
sr: Чизкејк
sr_latn: Čizkejk
te: చీస్ కేక్
th: ชีสเค้ก
uk: Чізкейк
ur: چیز کیک
uz: Chizkeyk
vi: Bánh phô mai
zh_hk: 芝士蛋糕
zu: I-Cheesecake

# cupertinoAlertTiramisu
source: Tiramisu
am: ቴራሚሶ
ar_eg: تيراميسو
as: টিৰামিছু
be: Тырамісу
bn: তিরামিসু
ca: Tiramisú
es_ar: Tiramisú
eu: Tiramisua
fa: تیرامیسو
gl: Tiramisú
gu: ટિરામિસુ
he: טירמיסו
hi: तीरामीसु
hy: Տիրամիսու
it: Tiramisù
ja: ティラミス
ka: ტირამისუ
km: បង្អែម​អ៊ីតាលី
kn: ತಿರಾಮಿಸು
ko: 티라미수
ky: Тирамису
lo: ທີຣາມິສຸ
mk: Тирамису
ml: തിറാമിസു
mn: Тирамисү
mr: तिरामिसू
my: တီရာမီစု
ne: तिरामिसु
pa: ਤਿਰਾਮਿਸੁ
ru: Тирамису
si: ටිරාමිසු
sr: Тирамису
te: తిరమిసు
th: ทิรามิสุ
uk: Тірамісу
ur: تیرامیسو
zh_hk: 提拉米蘇
zu: I-Tiramisu

# cupertinoAlertApplePie
source: Apple Pie
af: Appeltert
am: የፖም ፓይ
ar_eg: فطيرة التفاح
az: Alma Piroqu
bn: আপেল পাই
bs: Pita od jabuka
ca: Pastís de poma
da: Æbletærte
es_ar: Pastel de manzana
et: Õunakook
eu: Sagar-tarta
fr_ca: Tarte aux pommes
gl: Gráfico circular
gu: એપલ પાઇ
hi: एपल पाई
hu: Almás pite
hy: Խնձորի կարկանդակ
id: Pai Apel
it: Torta di mele
ja: アップルパイ
ka: ვაშლის ღვეზელი
km: នំ​ប៉ោម
ko: 애플 파이
ky: Алма пирогу
lt: Obuolių pyragas
lv: Ābolkūka
mk: Пита со јаболка
ml: ആപ്പിൾ പൈ
mn: Алимны бялуу
mr: ॲपल पाय
ms: Pai Epal
my: ပန်းသီးပိုင်မုန့်
nb: Eplekake
ne: एप्पल पाई
pl: Szarlotka
pt: Torta de maçã
pt_pt: Tarte de maçã
ro: Plăcintă cu mere
ru: Яблочный пирог
si: ඇපල් පයි
sk: Jablkový koláč
sq: Ëmbëlsirë me mollë
sr: Пита од јабука
sr_latn: Pita od jabuka
sv: Äppelpaj
te: యాపిల్ పై
th: พายแอปเปิล
tr: Elmalı Turta
uk: Яблучний пиріг
ur: ایپل پائی
uz: Olmali pirog
vi: Bánh táo
zh_hk: 蘋果批
zu: Uphaya we-apula

# cupertinoAlertChocolateBrownie
source: Chocolate Brownie
af: Sjokoladebruintjie
am: ቸኮሌት ብራውኒ
ar_eg: كعكة بالشوكولاتة والبندق
as: চকলেট ব্ৰাউনি
az: Şokoladlı Brauni
be: Шакаладны браўні
bn: চকলেট ব্রাউনি
bs: Čokoladni kolač
ca: Brownie de xocolata
da: Chokoladebrownie
es_ar: Brownie de chocolate
et: Šokolaadikook
eu: Txokolatezko brownie-a
fa: براونی شکلاتی
fr_ca: Brownie au chocolat
gl: Biscoito de chocolate
gu: ચોકલેટ બ્રાઉની
he: בראוניס שוקולד
hi: चॉकलेट ब्राउनी
hu: Csokoládés brownie
hy: Շոկոլադե բրաունի
id: Brownies Cokelat
it: Brownie al cioccolato
ja: チョコレート ブラウニー
ka: შოკოლადის ბრაუნი
km: នំសូកូឡា
kn: ಚಾಕೋಲೇಟ್ ಬ್ರೌನಿ
ko: 초콜릿 브라우니
ky: Брауни шоколады
lo: ຊັອກໂກແລັດບຣາວນີ
lt: Šokoladinis pyragas
lv: Šokolādes braunijs
mk: Чоколадно колаче
ml: ചോക്ലേറ്റ് ബ്രൗണി
mn: Шоколадтай брауни
mr: चॉकलेट ब्राउनी
ms: Brownie Coklat
my: ချောကလက် ကိတ်မုန့်ညို
nb: Sjokolade-brownie
ne: चकलेट ब्राउनी
pa: ਚਾਕਲੇਟ ਬ੍ਰਾਉਨੀ
pl: Brownie czekoladowe
pt: Brownie de chocolate
pt_pt: Brownie de chocolate
ro: Negresă cu ciocolată
ru: Брауни с шоколадом
si: චොකොලට් බ්‍රව්නි
sk: Čokoládový koláč
sq: Ëmbëlsirë me çokollatë
sr: Чоколадни брауни
sr_latn: Čokoladni brauni
sv: Chokladbrownie
te: చాక్లెట్ బ్రౌనీ
th: บราวนี่ช็อกโกแลต
tr: Çikolatalı Browni
uk: Брауні
ur: چاکلیٹ براؤنی
uz: Shokoladli brauni
vi: Bánh brownie sô-cô-la
zh_hk: 朱古力布朗尼
zu: I-Chocolate brownie

# cupertinoShowAlert
source: Show Alert
af: Wys opletberig
am: ማንቂያን አሳይ
ar_eg: عرض التنبيه
as: সতর্কবার্তা দেখুৱাওক
az: Xəbərdarlığı Göstərin
be: Паказаць абвестку
bn: সতর্কতা দেখান
bs: Prikaži obavještenje
ca: Mostra l'alerta
da: Vis underretning
es_ar: Mostrar alerta
et: Kuva hoiatus
eu: Erakutsi alerta
fa: نمایش هشدار
fil: Ipakita ang Alerto
fr_ca: Afficher l'alerte
gl: Mostrar alerta
gu: અલર્ટ બતાવો
he: הצגת התראה
hi: सूचना दिखाएं
hu: Értesítés megjelenítése
hy: Ցուցադրել ծանուցումը
id: Tampilkan Notifikasi
it: Mostra avviso
ja: アラートを表示
ka: გაფრთხილების ჩვენება
km: បង្ហាញ​ការជូនដំណឹង
kn: ಶೋ ಅಲರ್ಟ್
ko: 알림 표시
ky: Билдирмени көрсөтүү
lo: ສະແດງການແຈ້ງເຕືອນ
lt: Rodyti įspėjimą
lv: Parādīt brīdinājumu
mk: Прикажи предупреување
ml: മുന്നറിയിപ്പ് കാണിക്കുക
mn: Сэрэмжлүүлэг харуулах
mr: सूचना दाखवा
ms: Tunjukkan Makluman
my: သတိပေးချက် ပြရန်
nb: Vis varsel
ne: सतर्कता देखाउनुहोस्
pa: ਸੁਚੇਤਨਾ ਦਿਖਾਓ
pl: Pokaż alert
pt: Mostrar alerta
pt_pt: Mostrar alerta
ro: Afișează alerta
ru: Показать оповещение
si: ඇඟවීම පෙන්වන්න
sk: Zobraziť upozornenie
sq: Shfaq sinjalizimin
sr: Прикажи обавештење
sr_latn: Prikaži obaveštenje
sv: Visa avisering
te: అలర్ట్‌ని చూపించు
th: แสดงการแจ้งเตือน
tr: Uyarıyı Göster
uk: Показати сповіщення
ur: الرٹ دکھائیں
uz: Bildirishnomani koʻrsatish
vi: Hiển thị cảnh báo
zh_hk: 顯示通知
zu: Bonisa isexwayiso

# colorsRed
source: RED
af: ROOI
am: ቀይ
ar_eg: أحمر
as: ৰঙা
az: QIRMIZI
be: ЧЫРВОНЫ
bn: লাল
bs: CRVENA
ca: VERMELL
da: RØD
es_ar: ROJO
et: PUNANE
eu: GORRIA
fa: قرمز
fil: PULA
fr_ca: ROUGE
gl: VERMELLO
gu: લાલ
he: אדום
hi: लाल
hu: PIROS
hy: ԿԱՐՄԻՐ
id: MERAH
it: ROSSO
ja: レッド
ka: წითელი
km: ក្រហម
kn: ಕೆಂಪು ಬಣ್ಣ
ko: 빨간색
ky: КЫЗЫЛ
lo: ສີແດງ
lt: RAUDONA
lv: SARKANA
mk: ЦРВЕНА
ml: ചുവപ്പ്
mn: УЛААН
mr: लाल
ms: MERAH
my: အနီ
nb: RØD
ne: रातो
pa: ਲਾਲ
pl: CZERWONY
pt: VERMELHO
pt_pt: VERMELHO
ro: ROȘU
ru: КРАСНЫЙ
si: රතු
sk: ČERVENÁ
sq: I KUQ
sr: ЦРВЕНА
sr_latn: CRVENA
sv: RÖD
te: ఎరుపు
th: แดง
tr: KIRMIZI
uk: ЧЕРВОНИЙ
ur: سرخ
uz: QIZIL
vi: MÀU ĐỎ
zh_hk: 紅色
zu: OKUBOMVU

# colorsPink
source: PINK
af: PIENK
am: ሮዝ
ar_eg: وردي
as: গুলপীয়া
az: ÇƏHRAYI
be: РУЖОВЫ
bn: গোলাপী
bs: RUŽIČASTA
ca: ROSA
es_ar: ROSADO
et: ROOSA
eu: ARROSA
fa: صورتی
fr_ca: ROSE
gl: ROSA
gu: ગુલાબી
he: ורוד
hi: गुलाबी
hu: RÓZSASZÍN
hy: ՎԱՐԴԱԳՈՒՅՆ
id: MERAH MUDA
it: ROSA
ja: ピンク
ka: ვარდისფერი
km: ផ្កាឈូក
kn: ಗುಲಾಬಿ ಬಣ್ಣ
ko: 분홍색
ky: КЫЗГЫЛТЫМ
lo: ສີບົວ
lt: ROŽINĖ
lv: ROZĀ
mk: РОЗОВА
ml: പിങ്ക്
mn: ЯГААН
mr: गुलाबी
ms: MERAH JAMBU
my: ပန်းရောင်
nb: ROSA
ne: गुलाबी
pa: ਗੁਲਾਬੀ
pl: RÓŻOWY
pt: ROSA
pt_pt: COR-DE-ROSA
ro: ROZ
ru: РОЗОВЫЙ
si: රෝස
sk: RUŽOVÁ
sq: ROZË
sr: РОЗЕ
sr_latn: ROZE
sv: ROSA
te: గులాబీ రంగు
th: ชมพู
tr: PEMBE
uk: РОЖЕВИЙ
ur: گلابی
uz: PUSHTI
vi: MÀU HỒNG
zh_hk: 粉紅色
zu: OKUPHINKI

# colorsPurple
source: PURPLE
af: PERS
am: ሐምራዊ
ar_eg: أرجواني
as: বেঙুনীয়া
az: BƏNÖVŞƏYİ
be: ФІЯЛЕТАВЫ
bn: বেগুনি
bs: LJUBIČASTA
ca: PORPRA
da: LILLA
es_ar: PÚRPURA
et: LILLA
eu: MOREA
fa: بنفش
fr_ca: MAUVE
gl: VIOLETA
gu: જાંબલી
he: סגול
hi: बैंगनी
hu: LILA
hy: ՄԱՆՈՒՇԱԿԱԳՈՒՅՆ
id: UNGU
it: VIOLA
ja: パープル
ka: მეწამული
km: ស្វាយ
kn: ನೇರಳೆ ಬಣ್ಣ
ko: 보라색
ky: КЫЗГЫЛТЫМ КӨГҮШ
lo: ສີມ່ວງ
lt: PURPURINĖ
lv: VIOLETA
mk: ВИОЛЕТОВА
ml: പർപ്പിൾ
mn: НИЛ ЯГААН
mr: जांभळा
ms: UNGU
my: ခရမ်း
nb: LILLA
ne: बैजनी
pa: ਜਾਮਨੀ
pl: FIOLETOWY
pt: ROXO
pt_pt: ROXO
ro: MOV
ru: ФИОЛЕТОВЫЙ
si: දම්
sk: FIALOVÁ
sq: VJOLLCË
sr: ЉУБИЧАСТА
sr_latn: LJUBIČASTA
sv: LILA
te: వంగ రంగు
th: ม่วง
tr: MOR
uk: ПУРПУРОВИЙ
ur: جامنی
uz: SIYOHRANG
vi: MÀU TÍM
zh_hk: 紫色
zu: OKUPHEPHULI

# colorsDeepPurple
source: DEEP PURPLE
af: DIEPPERS
am: ደማቅ ሐምራዊ
ar_eg: أرجواني داكن
as: ডাঠ বেঙুনীয়া
az: TÜND BƏNÖVŞƏYİ
be: ЦЁМНА-ФІЯЛЕТАВЫ
bn: গাঢ় লাল-বেগুনি
bs: TAMNOLJUBIČASTA
ca: PORPRA INTENS
da: DYB LILLA
es_ar: PÚRPURA OSCURO
et: SÜGAVLILLA
eu: MORE BIZIA
fa: بنفش پررنگ
fr_ca: MAUVE FONCÉ
gl: VIOLETA INTENSO
gu: ઘાટો જાંબલી
he: סגול כהה
hi: गहरा बैंगनी
hu: MÉLYLILA
hy: ՄՈՒԳ ՄԱՆՈՒՇԱԿԱԳՈՒՅՆ
id: UNGU TUA
it: VIOLA SCURO
ja: ディープ パープル
ka: მუქი მეწამული
km: ស្វាយចាស់
kn: ಗಾಢ ನೇರಳೆ ಬಣ್ಣ
ko: 짙은 자주색
ky: КОЧКУЛ КЫЗГЫЛТ КӨГҮШ
lo: ສີມ່ວງເຂັ້ມ
lt: SODRI PURPURINĖ
lv: TUMŠI VIOLETA
mk: ТЕМНОПУРПУРНА
ml: ഇരുണ്ട പർപ്പിൾ നിറം
mn: ГҮН НИЛ ЯГААН
mr: गडद जांभळा
ms: UNGU TUA
my: ခရမ်းရင့်
nb: MØRK LILLA
ne: गाढा बैजनी
pa: ਗੂੜ੍ਹਾ ਜਾਮਨੀ
pl: GŁĘBOKI FIOLETOWY
pt: ROXO INTENSO
pt_pt: ROXO ESCURO
ro: MOV INTENS
ru: ТЕМНО-ФИОЛЕТОВЫЙ
si: තද දම්
sk: TMAVOFIALOVÁ
sq: E PURPURT E THELLË
sr: ТАМНОЉУБИЧАСТА
sr_latn: TAMNOLJUBIČASTA
sv: MÖRKLILA
te: ముదురు ఊదా రంగు
th: ม่วงเข้ม
tr: KOYU MOR
uk: НАСИЧЕНИЙ ПУРПУРОВИЙ
ur: گہرا جامنی
uz: TOʻQ SIYOHRANG
vi: MÀU TÍM ĐẬM
zh_hk: 深紫色
zu: OKUPHEPHULI OKUJULILE

# colorsIndigo
source: INDIGO
am: ወይን ጠጅ
ar_eg: نيليّ
as: ইণ্ডিগ'
az: GÖY RƏNG
be: ІНДЫГА
bn: নীলচে বেগুনি
ca: ANYIL
es_ar: ÍNDIGO
eu: ANILA
fa: نیلی
gl: ÍNDIGO
gu: ઘેરો વાદળી રંગ
he: אינדיגו
hi: गहरा नीला
hu: INDIGÓKÉK
hy: ԻՆԴԻԳՈ
id: NILA
it: INDACO
ja: インディゴ
ka: მუქი ლურჯი
km: ទឹកប៊ិក
kn: ಇಂಡಿಗೊ ಬಣ್ಣ
ko: 남색
ky: ИНДИГО
lo: ສີຄາມ
mk: ИНДИГО
ml: ഇൻഡിഗോ
mn: ХӨХӨВТӨР НИЛ ЯГААН
mr: आकाशी निळा
ms: BIRU NILA
my: မဲနယ်
ne: इन्डिगो
pa: ਲਾਜਵਰ
pl: INDYGO
pt: ÍNDIGO
pt_pt: ÍNDIGO
ru: ИНДИГО
si: ඉන්ඩිගෝ
sk: INDIGOVÁ
sr: ТАМНОПЛАВА
sr_latn: TAMNOPLAVA
sv: INDIGOBLÅ
te: నీలిరంగు
th: น้ำเงินอมม่วง
tr: ÇİVİT MAVİSİ
uk: ІНДИГО
ur: گہرا نیلا
vi: MÀU CHÀM
zh_hk: 靛藍色
zu: I-INDIGO

# colorsBlue
source: BLUE
af: BLOU
am: ሰማያዊ
ar_eg: أزرق
as: নীলা
az: MAVİ
be: СІНІ
bn: নীল
bs: PLAVA
ca: BLAU
da: BLÅ
es_ar: AZUL
et: SININE
eu: URDINA
fa: آبی
fil: ASUL
fr_ca: BLEU
gl: AZUL
gu: વાદળી
he: כחול
hi: नीला
hu: KÉK
hy: ԿԱՊՈՒՅՏ
id: BIRU
it: BLU
ja: ブルー
ka: ლურჯი
km: ខៀវ
kn: ನೀಲಿ ಬಣ್ಣ
ko: 파란색
ky: КӨК
lo: ສີຟ້າ
lt: MĖLYNA
lv: ZILA
mk: СИНА
ml: നീല
mn: ЦЭНХЭР
mr: निळा
ms: BIRU
my: အပြာ
nb: BLÅ
ne: निलो
pa: ਨੀਲਾ
pl: NIEBIESKI
pt: AZUL
pt_pt: AZUL
ro: ALBASTRU
ru: СИНИЙ
si: නිල්
sk: MODRÁ
sq: BLU
sr: ПЛАВА
sr_latn: PLAVA
sv: BLÅ
te: నీలం
th: น้ำเงิน
tr: MAVİ
uk: СИНІЙ
ur: نیلا
uz: KOʻK
vi: MÀU XANH LAM
zh_hk: 藍色
zu: OKULUHLAZA OKWESIBHAKABHAKA
