Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# dataTableRowHoneycomb
source: Honeycomb
af: Heuningkoek
am: የማር እሸት
as: মৌচাক
az: Arı şanı konfeti
be: Мядовыя соты
bs: Saće
ca: Bresca
da: Honningkaramel
es_ar: Caramelo de miel
et: Kärjekomm
eu: Abaraska
fa: کندو
fr_ca: Rayon de miel
gl: Panal
gu: હનીકોમ્બ
he: חלת דבש
hy: Մեղրաբջիջ
id: Sarang lebah
it: Croccante a nido d'ape
ja: ハニカム
ka: ფიჭა
km: សំបុកឃ្មុំ
kn: ಜೇನುಗೂಡು
ko: 벌집꿀
ky: Аары уюгу
lo: ຮັງເຜິ້ງ
lv: Medus kāre
mk: Саќе
mn: Зөгийн балны сархинаг
mr: हनीकोंब
my: ပျားသလက်
nb: Bikake
ne: माहुरीको चाका
pa: ਹਨੀਕਾਂਬ
pl: Plaster miodu
pt: Favo de mel
pt_pt: Favo de mel
ro: Fagure de miere
ru: Мед в сотах
si: පැණි වද
sq: Hoje blete
sr: Саће
sr_latn: Saće
te: హనీకూంబ్
th: รังผึ้ง
tr: Bal peteği
uk: Стільники
uz: Asalari uyasi
zh_hk: 蜂窩糖
zu: Ikhekheba lezinyosi

# dataTableRowLollipop
source: Lollipop
af: Stokkielekker
am: ሊሎፖፕ
as: ল'লিপ'প
az: Nabat
be: Ледзянец
bs: Lizalo
ca: Piruleta
da: Slikkepind
es_ar: Paleta de caramelo
et: Pulgakomm
eu: Txupatxusa
fa: آب‌نبات چوبی
gl: Piruleta
gu: લૉલીપૉપ
he: סוכרייה על מקל
hy: Սառնաշաքար
it: Lecca lecca
ja: ロリポップ
ka: შაქარყინული
km: ស្ករគ្រាប់​ដោតឈើ
kn: ಲಾಲಿಪಾಪ್
ko: 롤리팝
ky: Чупачупс
lo: ໂລລິປັອບ
lv: Konfekte uz kociņa
mk: Лижавче
mn: Иштэй чихэр
mr: लॉलिपॉप
my: ချိုချဉ်ချောင်း
nb: Kjærlighet på pinne
ne: ललिपप
pa: ਲੋਲੀਪੋਪ
pl: Lizak
pt: Pirulito
pt_pt: Chupa-chupa
ro: Acadea
ru: Леденец
si: ලොලිපොප්
sq: Lëpirëse
sr: Лизалица
sr_latn: Lizalica
sv: Klubba
te: లాలిపాప్
th: อมยิ้ม
tr: Lolipop
uk: Льодяник
uz: Obakidandon
zh_hk: 波板糖
zu: I-Lollipop

# dataTableRowJellyBean
source: Jelly bean
af: Jellieboontjie
am: ጀሊ ቢን
as: জেলী বিন
az: Marmeladlı konfet
be: Мармеладнае дражэ
bn: 4.3 Jelly Bean
bs: Bombon
ca: Mongetes de gelea
es_ar: Gragea
et: Suhkrukomm
eu: Gominola
fa: آب‌نبات ژله‌ای
gl: Gominola
gu: જેલીબિન
he: סוכריות ג'לי
hy: Ժելե-կոնֆետներ
ja: ジェリービーン
ka: ჟელიბონი
km: ស្ករគ្រាប់រាងគ្រាប់សណ្ដែក
kn: ಜೆಲ್ಲಿ ಬೀನ್
ko: 젤리빈
ky: Килкилдек момпосуй
lo: ເຈລີບີນ
lv: Želejas pupiņa
mk: Желе-бонбонче
mn: Шош хэлбэртэй царцмаг
mr: जेली बीन
my: ဂျယ်လီစေ့
nb: Gelebønner
ne: जेली बिन
pa: ਜੈੱਲੀ ਬੀਨ
pl: Żelka
pt: Jujuba
ro: Jeleu
ru: Мармеладное драже
si: ජෙලි බීන්
sq: Karamele me xhelatinë
sr: Желе бомбона
sr_latn: Žele bombona
sv: Geléböna
te: జెల్లీ బీన్
th: เจลลี่บีน
tr: Jelibon
uk: Мармеладне драже
uz: Marmeladli draje
zh_hk: 啫喱豆
zu: I-Jelly bean

# dataTableRowGingerbread
source: Gingerbread
af: Gemmerbrood
am: ጂንጀርብሬድ
as: জিঞ্জাৰব্ৰেড
az: Zəncəfilli kökə
be: Імбірны пернік
bs: Medenjak
ca: Pa de gingebre
da: Ingefærssmåkager
es_ar: Bizcocho de jengibre
et: Piparkook
eu: Jengibre-gaileta
fa: نان زنجبیل
gl: Galleta de xenxibre
gu: જિંજરબ્રેડ
he: עוגיות ג'ינג'ר
hy: Կոճապղպեղի անուշահաց
id: Kue jahe
it: Pan di zenzero
ja: ジンジャーブレッド
ka: ჯანჯაფილის თაფლაკვერი
km: នំរសជាតិខ្ញី
kn: ಜಿಂಜರ್‌ಬ್ರೆಡ್
ko: 진저브레드
ky: Имбир
lo: ເຂົ້າຈີ່ຂິງ
lv: Piparkūka
mk: Колачиња со ѓумбир
mn: Цагаан гаа, бурамтай талх
mr: जिंजरब्रेड
my: ချင်းနံ့သင်းသော ဘီစကွတ်
nb: Pepperkake
ne: जिन्जरब्रेड
pa: ਜਿੰਜਰਬ੍ਰੈੱਡ
pl: Piernik
pt: Biscoito de gengibre
pt_pt: Pão de mel
ro: Turtă dulce
ru: Имбирный пряник
si: ඉඟුරු පාන්
sq: Biskota me xhenxhefil
sr: Медењак
sr_latn: Medenjak
sv: Pepparkaka
te: జింజర్ బ్రెడ్
th: ขนมปังขิง
tr: Kurabiye
uk: Імбирний пряник
uz: Shirin kulchalar
zh_hk: 薑餅
zu: I-Gingerbread

# dataTableRowCupcake
source: Cupcake
af: Kolwyntjie
am: ዘቢብ ኬክ
as: কাপকে’ক
az: Keks
be: Кекс
bs: Kolač
et: Tassikook
eu: Cupcake-a
fa: کیک فنجانی
gl: Madalena
gu: કપકેક
he: קאפקייק (עוגונית)
hy: Կեքս
ja: カップケーキ
ka: ქაფქეიქი
km: នំខាប់ខេក
kn: ಕಪ್‌ಕೇಕ್
ko: 컵케이크
ky: Кекс
lo: ຄັບເຄັກ
lv: Kēksiņš
mk: Тортичка
mn: Аяган бялуу
mr: कपकेक
my: ကိတ်မုန့်
nb: Muffins
ne: कपकेक
pa: ਕੱਪਕੇਕ
pl: Babeczka
ro: Brioșă
ru: Кекс
si: කප්කේක්
sq: Kek
sr: Мафин
sr_latn: Mafin
te: కప్‌కేక్
th: คัพเค้ก
tr: Küçük kek
uk: Кекс
uz: Keks
zh_hk: 杯子蛋糕
zu: I-Cupcake

# dataTableRowEclair
source: Eclair
am: ኢክሌር
as: ইক্লেয়াৰ
az: Ekler
be: Эклер
bs: Ekler
ca: Éclair
es_ar: Profiterol
et: Ekleer
eu: Éclair-a
fa: اِکلِر
gu: ઇક્લેર
he: אקלר (פחזנית)
hy: Էկլեր
ja: エクレア
ka: ეკლერი
km: នំអ៊ីក្លែ
kn: ಎಕ್ಲೇರ್
ko: 에클레르
ky: Эклер
lo: ເອແຄ
lv: Eklērs
mk: Еклер
mn: Эклер
mr: इक्लेअर
my: အီကလဲ
ne: एक्लेर
pa: ਐਕਲੇਅਰ
pl: Ekler
pt: Bomba
pt_pt: Éclair
ro: Ecler
ru: Эклер
si: ඉක්ලෙයාර්
sq: Pastashutë
sr: Еклер
sr_latn: Ekler
sv: Éclair
te: ఎక్లెయిర్
th: เอแคลร์
tr: Ekler
uk: Еклер
uz: Ekler
zh_hk: 法式泡芙
zu: I-Eclair

# dataTableRowIceCreamSandwich
source: Ice cream sandwich
af: Roomystoebroodjie
am: አይስ ክሬም ሳንድዊች
as: আইচক্ৰীম ছেণ্ডৱিচ্‌
az: Dondurmalı sendviç
be: Марожанае ў брыкеце
bs: Sendvič od sladoleda
ca: Sandvitx de gelat
da: Issandwich
es_ar: Sándwich de helado
et: Jäätisemaius
eu: Izozki-sandwicha
fa: ساندویچ بستنی
gl: Xeado
gu: આઇસક્રીમ સેન્ડવિચ
he: קסאטה (גלידה)
hy: Պաղպաղակի սենդվիչ
id: Sandwich es krim
it: Gelato biscotto
ja: アイスクリーム サンドイッチ
ka: ნაყინის სენდვიჩი
km: នំប៊ីស្គីត​មានការ៉េម​នៅកណ្ដាល
kn: ಐಸ್ ಕ್ರೀಂ ಸ್ಯಾಂಡ್‌ವಿಚ್
ko: 아이스크림 샌드위치
ky: Балмуздак сендвичи
lo: ໄອສະຄຣີມແຊນວິດ
lv: Saldējuma sendvičs
mk: Сендвич-сладолед
mn: Жигнэмэгтэй зайрмаг
mr: आइस्क्रीम सँडविच
my: ရေခဲညှပ် ပေါင်မုန့်
nb: Iskremsandwich
ne: आइस क्रिम स्यान्डविच
pa: ਆਈਸ ਕ੍ਰੀਮ ਸੈਂਡਵਿਚ
pl: Kanapka lodowa
pt: Sanduíche de sorvete
pt_pt: Sanduíche de gelado
ro: Sandviș cu înghețată
ru: Брикет мороженого
si: අයිස් ක්‍රීම් සැන්ඩ්විච්
sq: Sanduiç me akullore
sr: Сладолед сендвич
sr_latn: Sladoled sendvič
sv: Glassandwich
te: ఐస్ క్రీమ్ శాండ్విచ్
th: แซนด์วิชไอศกรีม
tr: Dondurmalı sandviç
uk: Морозиво в брикеті
ur: آئس کریم سینڈویچ
uz: Muzqaymoqli sendvich
zh_hk: 雪糕三文治
zu: Isemeshi ka-ayisikhilimu

# dataTableRowFrozenYogurt
source: Frozen yogurt
af: Bevrore jogurt
am: ቀዝቃዛ እርጎ
ar_eg: زبادي مجمّد
as: ফ্র’জেন য়'গাৰ্ট
az: Dondurulmuş yoqurt
be: Замарожаны ёгурт
bn: জমাট ইয়োগার্ট
bs: Zamrznuti jogurt
ca: Iogurt gelat
da: Yoghurtis
es_ar: Yogur helado
et: Külmutatud jogurt
eu: Jogurt izoztua
fa: ماست یخ‌زده
fr_ca: Froyo
gl: Iogur conxelado
gu: ફ્રોઝન યોગર્ટ
he: פרוזן יוגורט
hy: Սառեցված յոգուրտ
id: Yoghurt beku
ja: フローズン ヨーグルト
ka: გაყინული იოგურტი
km: យ៉ាអួកក
kn: ಫ್ರೋಜನ್ ಯೋಗರ್ಟ್
ko: 프로즌 요거트
ky: Тоңдурулган йогурт
lo: ນົມສົ້ມແຊ່ແຂັງ
lv: Saldēts jogurts
mk: Замрзнат јогурт
mn: Хөлдөөсөн тараг
mr: फ्रोझन योगर्ट
ms: Yogurt beku
my: ရေခဲထားသော ဒိန်ချဉ်
nb: Yoghurtis
ne: जमेको दही
pa: ਫਰੋਜ਼ਨ ਯੋਗਰਟ
pl: Jogurt mrożony
pt_pt: Iogurte gelado
ro: Iaurt înghețat
ru: Замороженный йогурт
si: මුදවන ලද යෝගට්
sq: Kos i ngrirë
sr: Замрзнут јогурт
sr_latn: Zamrznut jogurt
sv: Yoghurtglass
te: మీగడ పెరుగు
th: โฟรเซนโยเกิร์ต
tr: Dondurulmuş yoğurt
uk: Заморожений йогурт
ur: منجمد دہی
uz: Muzlatilgan yogurt
vi: Sữa chua đông lạnh
zh_hk: 乳酪雪糕
zu: Iyogathi eqinile

# dataTableColumnIron
source: Iron (%)
af: Yster (%)
am: ብረት (%)
ar_eg: الحديد (النسبة المئوية)
as: আইৰন (%)
az: Dəmir (%)
be: Жалеза (%)
bn: আয়রন (%)
bs: Željezo (%)
ca: Ferro (%)
da: Jern (%)
es_ar: Hierro (%)
et: Raud (%)
eu: Burdina (%)
fa: آهن (٪)
fr_ca: Fer (%)
gl: Ferro (%)
gu: આયર્ન (%)
he: ברזל (%)
hi: आयरन (%)
hu: Vas (%)
hy: Երկաթ (%)
id: Zat Besi (%)
it: Ferro (%)
ja: 鉄（%）
ka: რკინა (%)
km: ដែក (%)
kn: ಐರನ್ (%)
ko: 철분(%)
ky: Темир (%)
lo: ເຫຼັກ (%)
lt: Geležis (%)
lv: Dzelzs (%)
mk: Железо (%)
ml: അയേൺ (%)
mn: Төмөр (%)
mr: आयरन (%)
ms: Besi (%)
my: သံဓာတ် (%)
nb: Jern (%)
ne: फलाम (%)
pa: ਆਇਰਨ (%)
pl: Żelazo (%)
pt: Ferro (%)
pt_pt: Ferro (%)
ro: Fier (%)
ru: Железо (%)
si: යකඩ (%)
sk: Železo (%)
sq: Hekur (%)
sr: Гвожђе (%)
sr_latn: Gvožđe (%)
sv: Järn (%)
te: ఐరన్ (%)
th: เหล็ก (%)
tr: Demir (%)
uk: Залізо (%)
ur: آئرن (%)
uz: Temir (%)
vi: Sắt (%)
zh_hk: 鐵 (%)
zu: I-ayoni (%)

# dataTableColumnCalcium
source: Calcium (%)
af: Kalsium (%)
am: ካልሲየም (%)
ar_eg: الكالسيوم (النسبة المئوية)
as: কেলচিয়াম (%)
az: Kalsium (%)
be: Кальцый (%)
bn: ক্যালসিয়াম (%)
bs: Kalcij (%)
ca: Calci (%)
es_ar: Calcio (%)
et: Kaltsium (%)
eu: Kaltzioa (%)
fa: کلسیم (٪)
gl: Calcio (%)
gu: કૅલ્શિયમ (%)
he: סידן (%)
hi: कैल्शियम (%)
hu: Kalcium (%)
hy: Կալցիում (%)
id: Kalsium (%)
it: Calcio (%)
ja: カルシウム（%）
ka: კალციუმი (%)
km: កាល់ស្យូម (%)
kn: ಕ್ಯಾಲ್ಸಿಯಂ (%)
ko: 칼슘(%)
ky: Кальций (%)
lo: ແຄຊຽມ (%)
lt: Kalcis (%)
lv: Kalcijs (%)
mk: Калциум (%)
ml: കാൽസ്യം (%)
mn: Кальци (%)
mr: कॅल्शिअम (%)
ms: Kalsium (%)
my: ထုံးဓာတ် (%)
nb: Kalsium (%)
ne: क्याल्सियम (%)
pa: ਕੈਲਸ਼ੀਅਮ (%)
pl: Wapń (%)
pt: Cálcio (%)
pt_pt: Cálcio (%)
ro: Calciu (%)
ru: Кальций (%)
si: කැල්සියම් (%)
sk: Vápnik
sq: Kalcium (%)
sr: Калцијум (%)
sr_latn: Kalcijum (%)
sv: Kalcium (%)
te: కాల్షియం (%)
th: แคลเซียม (%)
tr: Kalsiyum (%)
uk: Кальцій (%)
ur: کیلشیم (%)
uz: Kalsiy (%)
vi: Canxi (%)
zh_hk: 鈣 (%)
zu: Ikhalisiyamu (%)

# dataTableColumnSodium
source: Sodium (mg)
am: ሶዲየም (ሚግ)
ar_eg: الصوديوم (بالغرام)
as: ছ'ডিয়াম (মিলিগ্ৰাম)
az: Natrium (mq)
be: Натрый (мг)
bn: সোডিয়াম (mg)
bs: Natrij (mg)
ca: Sodi (mg)
da: Salt (mg)
es_ar: Sodio (mg)
et: Naatrium (mg)
eu: Sodioa (mg)
fa: سدیم (میلی‌گرم)
gl: Sodio (mg)
gu: સોડિયમ (મિલિગ્રા)
he: נתרן (מ"ג)
hi: सोडियम (मि.ग्रा.)
hu: Nátrium (mg)
hy: Նատրիում (մգ)
it: Sodio (mg)
ja: ナトリウム（mg）
ka: ნატრუიმი (მგ)
km: សូដ្យូម (mg)
kn: ಸೋಡಿಯಂ (ಮಿಗ್ರಾಂ)
ko: 나트륨(mg)
ky: Натрий (мг.)
lo: ໂຊດຽມ (mg)
lt: Natris (mg)
lv: Nātrijs (mg)
mk: Натриум (мг)
ml: സോഡിയം (മില്ലിഗ്രാം)
mn: Натри (мг)
mr: सोडियम (मिग्रॅ)
my: ဆိုဒီယမ် (mg)
nb: Natrium (mg)
ne: सोडिएम (मिलिग्राम)
pa: ਸੋਡੀਅਮ (ਮਿ.ਗ੍ਰਾ.)
pl: Sód (mg)
pt: Sódio (mg)
pt_pt: Sódio (mg)
ro: Sodiu (mg)
ru: Натрий (мг)
si: සෝඩියම් (මිලි ග්‍රෑම්)
sk: Sodík (mg)
sq: Natrium (mg)
sr: Натријум (mg)
sr_latn: Natrijum (mg)
sv: Natrium (mg)
te: సోడియం (మి.గ్రా)
th: โซเดียม (มก.)
tr: Sodyum (mg)
uk: Натрій (мг)
ur: سوڈیم (ملی گرام)
uz: Natriy (mg)
vi: Natri (mg)
zh_hk: 鈉 (毫克)
zu: Isodiyamu (mg)

# demoTimePickerTitle
source: Time Picker
af: Tydkieser
am: የሰዓት መራጭ
ar_eg: أداة اختيار الوقت
as: সময় বাছনি কৰোঁতা
az: Vaxt Seçicisi
be: Інструмент выбару часу
bn: সময় চয়নকারী
bs: Birač vremena
ca: Selector d'hora
da: Tidsvælger
es_ar: Selector de hora
et: Kellaajavalija
eu: Ordu-hautatzailea
fa: انتخابگر زمان
fil: Picker ng Oras
fr_ca: Sélecteur de l'heure
gl: Selector de hora
gu: સમય પિકર
he: בורר שעה
hi: समय चुनने वाला टूल
hu: Időpontválasztó
hy: Ժամի ընտրիչ
id: Alat Pilih Waktu
it: Selettore ora
ja: 時刻選択ツール
ka: დროის ამომრჩევი
km: ផ្ទាំងជ្រើសរើស​ម៉ោង
kn: ಸಮಯ ಪಿಕರ್‌
ko: 시간 선택도구
ky: Убакыт тандагыч
lo: ຕົວເລືອກເວລາ
lt: Laiko rinkiklis
lv: Laika atlasītājs
mk: Избирач на време
ml: സമയ പിക്കർ
mn: Цаг сонгогч
mr: वेळ पिकर
ms: Pemilih Masa
my: အချိန် ရွေးချယ်ရေးစနစ်
nb: Klokkeslettvelger
ne: समय चयनकर्ता
pa: ਸਮਾਂ ਚੋਣਕਾਰ
pl: Selektor godziny
pt: Seletor de horário
pt_pt: Selecionador de hora
ro: Selector de oră
ru: Окно выбора времени
si: වේලා තෝරකය
sk: Výber času
sq: Zgjedhësi i orës
sr: Бирач времена
sr_latn: Birač vremena
sv: Tidväljare
te: సమయం పికర్
th: เครื่องมือเลือกเวลา
tr: Saat Seçici
uk: Засіб вибору часу
ur: وقت منتخب کنندہ
uz: Vaqt tanlash oynasi
vi: Bộ chọn giờ
zh_hk: 時間點選器
zu: Isikhi sesikhathi

# demo2dTransformationsResetTooltip
source: Reset transformations
af: Stel transformasies terug
am: ቅየራዎችን ዳግም ያቀናብሩ
ar_eg: إعادة ضبط التحويلات
as: ৰূপান্তৰণসমূহ ৰিছেট কৰক
az: Transformasiyanı sıfırlayın
be: Скінуць пераўтварэнні
bn: ট্রান্সফর্মেশনের বিকল্পটি আবার সেট করুন
bs: Vratite transformacije na zadano
ca: Restableix les transformacions
da: Nulstil transformationer
es_ar: Restablecer transformaciones
et: Teisendamiste lähtestamine
eu: Berrezarri bihurketak
fa: بازنشانی تبدیل
fil: I-reset ang mga pagbabago
fr_ca: Réinitialiser les transformations
gl: Restablecer as transformacións
gu: રૂપાંતરણો રીસેટ કરો
he: איפוס הטרנספורמציות
hi: ट्रांसफ़र्मेशन को रीसेट करें
hu: Átalakítások visszaállítása
hy: Վերակայել փոխակերպումները
id: Reset transformasi
it: Reimposta trasformazioni
ja: 変換をリセット
ka: გარდაქმნების გადაყენება
km: កំណត់​ការបំប្លែង​ឡើងវិញ
kn: ಪರಿವರ್ತನೆಗಳನ್ನು ಮರುಹೊಂದಿಸಿ
ko: 변환 재설정
ky: Өзгөртүүлөрдү баштапкы абалга келтирүү
lo: ຣີເຊັດການປັບປ່ຽນ
lt: Nustatyti transformacijas iš naujo
lv: Atiestatīt pārveidošanu
mk: Ресетирајте ги трансформациите
ml: പരിവർത്തനങ്ങൾ റീസെറ്റ് ചെയ്യുക
mn: Хэлбэр өөрчлөлтийг шинэчлэх
mr: रुपांतरे रीसेट करा
ms: Tetapkan semula transformasi
my: အသွင်ပြောင်းခြင်းများကို ပြင်ဆင်သတ်မှတ်ရန်
nb: Tilbakestill transformasjoner
ne: रूपान्तरणहरू रिसेट गर्नुहोस्
pa: ਰੁਪਾਂਤਰਨ ਨੂੰ ਰੀਸੈੱਟ ਕਰੋ
pl: Resetuj przekształcenia
pt: Redefinir transformações
pt_pt: Repor transformações
ro: Resetați transformările
ru: Сбросить трансформации
si: පරිණාමනය කිරීම් යළි සකසන්න
sk: Resetovať transformácie
sq: Rivendos transformimet
sr: Ресетујте трансформације
sr_latn: Resetujte transformacije
sv: Återställ transformationerna
te: పరివర్తనాలను రీసెట్ చేయండి
th: รีเซ็ตการเปลี่ยนรูปแบบ
tr: Dönüşümleri sıfırla
uk: Скинути трансформації
ur: ٹرانسفارمیشنز ری سیٹ کریں
uz: Transformatsiyalarni tiklash
vi: Đặt lại phép biến đổi
zh_hk: 重設變形
zu: Setha kabusha ukuguqula

# dataTableColumnFat
source: Fat (g)
af: Vet (g)
am: ስብ (ግ)
ar_eg: الدهون (بالغرام)
as: চর্বী (গ্ৰাম)
az: Yağ (q)
be: Тлушчы (г)
bn: ফ্যাট (g)
bs: Masnoća (g)
ca: Matèria grassa (g)
da: Fedt (g)
es_ar: Grasas (g)
et: Rasv (g)
eu: Koipea (g)
fa: چربی ( گرم)
fr_ca: Gras (g)
gl: Graxas (g)
gu: ચરબી (ગ્રા)
he: שומנים (ג')
hi: फ़ैट (ग्रा.)
hu: Zsír (g)
hy: Ճարպեր (գ)
id: Lemak (g)
it: Grassi (g)
ja: 脂肪（g）
ka: ცხიმი (გ)
km: ខ្លាញ់ (g)
kn: ಕೊಬ್ಬು (ಗ್ರಾಂ)
ko: 지방(g)
ky: Май (г.)
lo: ໄຂມັນ (g)
lt: Riebalai (g)
lv: Tauki (g)
mk: Масти (гр.)
ml: കൊഴുപ്പ് (ഗ്രാം)
mn: Өөх тос (гр)
mr: चरबी (ग्रॅ)
ms: Lemak (g)
my: အဆီ (g)
nb: Fett (g)
ne: बोसो (ग्राम)
pa: ਚਰਬੀ (ਗ੍ਰਾ.)
pl: Tłuszcze (g)
pt: Gordura (g)
pt_pt: Gordura (g)
ro: Grăsimi (g)
ru: Жиры (г)
si: මේදය (ග්‍රෑම්)
sk: Tuky (g)
sq: Yndyrnat (g)
sr: Масти (g)
sr_latn: Masti (g)
sv: Fett (g)
te: ఫ్యాట్ (గ్రా)
th: ไขมัน (ก.)
tr: Yağ ( g)
uk: Жири (г)
ur: چربی ( گرام)
uz: Yogʻlar ( g)
vi: Chất béo (g)
zh_hk: 脂肪 (克)
zu: Amafutha (g)

# dataTableColumnCalories
source: Calories
af: Kalorieë
am: ካሎሪ
ar_eg: السُعرات الحرارية
as: কেল'ৰি
az: Kalori
be: Калорыі
bn: ক্যালোরি
bs: Kalorije
da: Kalorier
es_ar: Calorías
et: Kalorid
eu: Kaloriak
fa: کالری
fil: Mga Calorie
gl: Calorías
gu: કૅલરી
he: קלוריות
hi: कैलोरी
hu: Kalória
hy: Կալորիաներ
id: Kalori
it: Calorie
ja: カロリー
ka: კალორიები
km: កាឡូរី
kn: ಕ್ಯಾಲೊರಿಗಳು
ko: 칼로리
ky: Калориялар
lo: ແຄລໍຣີ
lt: Kalorijos
lv: Kalorijas
mk: Калории
ml: കലോറികൾ
mn: Илчлэг
mr: कॅलरी
ms: Kalori
my: ကယ်လိုရီ
nb: Kalorier
ne: क्यालोरी
pa: ਕੈਲੋਰੀਆਂ
pl: Kalorie
pt: Calorias
pt_pt: Calorias
ro: Calorii
ru: Калории
si: කැලරි
sk: Kalórie
sq: Kaloritë
sr: Калорије
sr_latn: Kalorije
sv: Kalorier
te: కేలరీలు
th: แคลอรี
tr: Kalori
uk: Калорії
ur: کیلوریز
uz: Kaloriya
vi: Calo
zh_hk: 卡路里
zu: Amakhalori

# dataTableColumnDessert
source: Dessert (1 serving)
af: Nagereg (1 porsie)
am: መክሰስ (1 ሳህን)
ar_eg: الحلوى (تقدّم مرة واحدة)
as: ডিজার্ট (১ টা পৰিবেশন)
az: Desert (1 porsiya)
be: Дэсерт (1 порцыя)
bn: ডেসার্ট (১জনকে দেওয়া যাবে)
bs: Desert (1 porcija)
ca: Postres (1 ració)
da: Dessert (1 portion)
es_ar: Postre (1 porción)
et: Magustoit (1 portsjon)
eu: Postrea (errazio bat)
fa: دسر (برای ۱ نفر)
fil: Panghimagas (1 serving)
fr_ca: Dessert (une portion)
gl: Sobremesa (1 ración)
gu: ડેઝર્ટ (નંગ 1)
he: קינוח (מנה אחת)
hi: मीठा पकवान (1 प्लेट)
hu: Desszert (1 adag)
hy: Աղանդեր (1 բաժին)
id: Makanan penutup (1 porsi)
it: Dessert (1 porzione)
ja: デザート（1 人分）
ka: დესერტი (1 პორცია)
km: បង្អែម (1 ចាន)
kn: ಡೆಸರ್ಟ್(1 ಸರ್ವಿಂಗ್)
ko: 디저트(1인분)
ky: Десерт (1 порция)
lo: ຂອງຫວານ (ສຳລັບ 1 ຄົນ)
lt: Desertas (1 porcija)
lv: Deserts (1 porcija)
mk: Десерт (1 порција)
ml: ഡിസേർട്ട് (ഒരെണ്ണം നൽകുന്നു)
mn: Амттан (1 удаагийн)
mr: डिझर्ट (१)
ms: Pencuci mulut (1 sajian)
my: အချိုပွဲ (၁ ပွဲ)
nb: Dessert (en porsjon)
ne: भोजनको अन्तमा खाइने मिठाई (१ प्लेट)
pa: ਮਿਠਿਆਈ (1 ਵਿਅਕਤੀ ਲਈ)
pl: Deser (1 porcja)
pt: Sobremesa (1 porção)
pt_pt: Sobremesa (1 porção)
ro: Desert (o porție)
ru: Десерт (одна порция)
si: අතුරුපස (බෙදීම් 1)
sk: Dezert (1 porcia)
sq: Ëmbëlsirë (1 racion)
sr: Дезерт (1 порција)
sr_latn: Dezert (1 porcija)
sv: Efterrätt (1 portion)
te: డెజర్ట్ (1 సారి)
th: ของหวาน (สำหรับ 1 ที่)
tr: Tatlı (1 porsiyon)
uk: Десерт (1 порція)
ur: میوہ شیرینی بعد طعام (1 شخص کے لیے)
uz: Desert (1 porsiya)
vi: Đồ tráng miệng (1 suất)
zh_hk: 甜品 (1 人份量)
zu: Ukudla okumnandi kokugcina (1 ukuphakelwa)

# cardsDemoTravelDestinationLocation1
source: Thanjavur, Tamil Nadu
am: ታንጃቩር፣ ታሚል ናዱ
ar_eg: ثنجفور، تاميل نادو
as: তাঞ্জাভুৰ, তামিলনাডু
az: Tancavur, Tamil Nadu
be: Танджавур (Тамілнад)
bn: তাঞ্জাভুর, তামিলনাড়ু
fa: تانجاوور، تامیل نادو
gu: તંજાવુર, તમિળનાડુ
he: טאנג'וור, טמיל נאדו
hi: तंजावुर, तमिलनाडु
hu: Tandzsávúr, Tamilnádu
hy: Թանջավուր, Թամիլ Նադու
ja: タンジャーヴール、タミルナードゥ州
ka: ტანჯავური, ტამილნადუ
km: ថាន់ចាវួរ​នៅរដ្ឋតាមីល​ណាឌូ
kn: ತಂಜಾವೂರು, ತಮಿಳುನಾಡು
ko: 타밀 나두 탄자부르
ky: Танжавур, Тамилнад
lo: ທານຈາວູ, ທະມິນນາດູ
lt: Tandžavūras, Tamilnadas
lv: Thandžāvūra, Tamilnāda
mk: Танџавур, Тамил Наду
ml: തഞ്ചാവൂർ, തമിഴ്‌നാട്
mn: Тамилнаду муж, Танжавур хот
mr: तंजावर, तामिळनाडू
my: သန်ဂျီဗာ၊ တမီးလ်နာဒူ
ne: तन्जावुर, तामिल नाडु
pa: ਤੰਜਾਵਰ, ਤਮਿਲ ਨਾਡੂ
pl: Tańdźawur, Tamilnadu
pt_pt: Thanjavur, Tâmil Nadu
ru: Танджавур, штат Тамилнад
si: තන්ජාවූර්, තමිල්නාඩු
sr: Танџавур, Тамил Наду
sr_latn: Tandžavur, Tamil Nadu
sv: Thanjavur i Tamil Nadu
te: తంజావూర్, తమిళనాడు
th: เมืองตัญชาวร์ รัฐทมิฬนาฑู
uk: Тханджавур (Тамілнад)
ur: تھنجاور، تمل ناڈو
zh_hk: 泰米爾納德邦坦賈武爾
zu: E-Thanjavur, e-Tamil Nadu

# demoTimePickerDescription
source: Shows a dialog containing a Material Design time picker.
af: Wys 'n dialoog met 'n materiaalontwerp-tydkieser.
am: የቁሳዊ ንድፍ ሰዓት መራጭ የያዘ ማሳያን ያሳያል።
ar_eg: تعرض مربّع حوار يحتوي على أداة اختيار وقت ذات تصميم متعدد الأبعاد.
as: এটা বস্তুৰ ডিজাইনৰ সময় বাছনি কৰোঁতা থকা কোনো ডায়ল'গ প্ৰদৰ্শন কৰে।
az: Material Design vaxt seçicisini ehtiva edən dialoq pəncərəsini göstərir.
be: Дыялогавае акно ў Material Design, у якім можна выбраць час.
bn: মেটেরিয়াল ডিজাইনের সময় চয়নকারী রয়েছে এমন ডায়ালগ দেখায়।
bs: Prikazuje dijaloški okvir koji sadrži birač vremena u materijalnom dizajnu.
ca: Mostra un quadre de diàleg que conté un selector d'hora de Material Design.
da: Viser en dialogboks med en Material Design-tidsvælger.
es_ar: Muestra un diálogo que contiene un selector de hora de material design.
et: Kuvatakse dialoog, mis sisaldab materiaalse disaini kellaajavalijat.
eu: Material diseinuko ordu-hautatzailea duen leiho bat dago ikusgai.
fa: کادر گفتگویی حاوی انتخابگر زمان «طراحی مواد» را نمایش می‌دهد.
fil: Nagpapakita ng dialog na naglalaman ng picker ng oras ng Material Design.
fr_ca: Affiche une boîte de dialogue comportant un outil Material Design de sélection de l'heure.
gl: Mostra un cadro de diálogo que inclúe un selector de data de Material Design.
gu: સામગ્રીની ડિઝાઇનવાળા સમય પિકરને સમાવતો સંવાદ બતાવે છે.
he: מציג דיאלוג שמכיל בורר שעה בעיצוב חדשני תלת-ממדי.
hi: यह ऐसा डायलॉग दिखाता है जिसमें Material Design वाला टूल मौजूद होता है, जिससे तारीख चुन सकते हैं.
hu: Anyagszerű megjelenéssel rendelkező időpontválasztót tartalmazó párbeszédpanelt jelenít meg.
hy: Ցուցադրում է երկխոսության պատուհան, որը պարունակում է Material Design-ի ոճով ժամի ընտրիչ։
id: Menampilkan dialog yang berisi pemilih waktu Desain Material.
it: Viene mostrata una finestra di dialogo contenente un selettore dell'ora di Material Design.
ja: マテリアル デザインの時刻選択ツールを含むダイアログが表示されます。
ka: აჩვენებს დიალოგს, რომელიც შეიცავს მასალების დიზაინის დროის ამომრჩევს.
km: បង្ហាញ​ប្រអប់ ដែលមាន​ផ្ទាំងជ្រើសរើសម៉ោង​ដែលមានការរចនាគ្រប់ជ្រុងជ្រោយ។
kn: ವಸ್ತು ವಿನ್ಯಾಸ ಸಮಯ ಪಿಕರ್ ಹೊಂದಿರುವ ಡೈಲಾಗ್ ಅನ್ನು ತೋರಿಸುತ್ತದೆ.
ko: 머티리얼 디자인의 시간 선택도구가 포함된 대화상자를 표시합니다.
ky: Material Design убакыт тандагычы камтылган диалогду көрсөтөт.
lo: ສະແດງກ່ອງໂຕ້ຕອບທີ່ມີຕົວເລືອກເວລາແບບ Material Design.
lt: Rodomas dialogo langas, kuriame pateikiamas trimačių objektų dizaino laiko rinkiklis.
lv: Tiek rādīts dialoglodziņš, kurā ir materiāla dizaina laika atlasītājs.
mk: Прикажува дијалог што содржи избирач на време во Material Design.
ml: മെറ്റീരിയൽ രൂപകൽപ്പനാ സമയ പിക്കർ അടങ്ങിയ ഡയലോഗ് കാണിക്കുന്നു.
mn: Материалын загварын цаг сонгогчийг агуулсан харилцах цонхыг харуулдаг.
mr: मटेरियल डिझाइन ची वेळ पिकर असलेला डायलॉग दाखवतो.
ms: Menunjukkan dialog yang mengandungi pemilih masa Reka Bentuk Bahan.
my: Material Design အချိန်ရွေးချယ်ရေးစနစ် ပါဝင်သော ဒိုင်ယာလော့ခ်ကို ပြပေးသည်။
nb: Viser en dialogboks med en klokkeslettvelger for «material design».
ne: सामग्री डिजाइनको समय चयनकर्ता समावेश भएको संवाद देखाउँछ।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਦੇ ਸਮਾਂ ਚੋਣਕਾਰ ਵਾਲੀ ਵਿੰਡੋ ਦਿਖਾਉਂਦਾ ਹੈ।
pl: Wyświetla okno z selektorem godziny w stylu Material Design.
pt: Mostra uma caixa de diálogo com um seletor de horário do Material Design.
pt_pt: Apresenta uma caixa de diálogo que contém um selecionador de hora do material design.
ro: Afișează o casetă de dialog cu un selector de oră pentru design material.
ru: Диалоговое окно в стиле Material Design, в котором можно выбрать время.
si: ද්‍රව්‍ය සැලසුම් වේලා තෝරක අඩංගුවන සංවාදයක් පෙන්වයි.
sk: Zobrazuje dialógové okno s výberom času so vzhľadom Material Design.
sq: Shfaq një dialog që përfshin një zgjedhës ore me dizajnin e materialit.
sr: Приказује дијалог са бирачем времена материјалног дизајна.
sr_latn: Prikazuje dijalog sa biračem vremena materijalnog dizajna.
sv: Visar en dialog med en tidväljare i Material Design.
te: విశేష రూపకల్పన సమయం పికర్‌ను కలిగి ఉండే డైలాగ్‌ను చూపుతుంది.
th: แสดงกล่องโต้ตอบที่มีเครื่องมือเลือกเวลาแบบดีไซน์ Material
tr: Materyal Tasarıma sahip saat seçici içeren bir iletişim kutusu gösterir.
uk: Показує вікно з інструментом вибору часу з матеріальним дизайном.
ur: مٹیریل ڈیزائن کا وقت منتخب کنندہ پر مشتمل ڈائیلاگ دکھاتا ہے۔
uz: Material Design uslubidagi oyna orqali vaqtni tanlash mumkin.
vi: Hiển thị hộp thoại chứa bộ chọn giờ Material Design.
zh_hk: 顯示載有 Material Design 時間點選器的對話框。
zu: Ibonisa ibhokisi eliqukethe isikhi sesikhathi sedizayini ebalulekile.

# demoPickersShowPicker
source: SHOW PICKER
af: WYS KIESER
am: መራጭን አሳይ
ar_eg: إظهار أداة الاختيار
as: বাছনি কৰোঁতা প্ৰদৰ্শন কৰক
az: SEÇİCİNİ GÖSTƏRİN
be: ПАКАЗАЦЬ ІНСТРУМЕНТ ВЫБАРУ
bn: চয়নকারী দেখান
bs: PRIKAŽI BIRAČ
ca: MOSTRA EL SELECTOR
da: VIS VÆLGER
es_ar: MOSTRAR SELECTOR
et: KUVA VALIJA
eu: ERAKUTSI HAUTATZAILEA
fa: نمایش انتخابگر
fil: IPAKITA ANG PICKER
fr_ca: AFFICHER LE SÉLECTEUR
gl: MOSTRAR SELECTOR
gu: પિકર બતાવો
he: להצגת הבורר
hi: समय या तारीख चुनने वाला टूल दिखाएं
hu: VÁLASZTÓ MEGJELENÍTÉSE
hy: ՑՈՒՑԱԴՐԵԼ ԸՆՏՐԻՉԸ
id: TAMPILKAN ALAT PILIH
it: MOSTRA SELETTORE
ja: 選択ツールを表示
ka: ამომრჩევის ჩვენება
km: បង្ហាញ​ផ្ទាំងជ្រើសរើស
kn: ಪಿಕರ್‌ ತೋರಿಸಿ
ko: 선택도구 표시
ky: ТАНДАГЫЧТЫ КӨРСӨТҮҮ
lo: ສະແດງຕົວເລືອກ
lt: RODYTI RINKIKLĮ
lv: RĀDĪT ATLASĪTĀJU
mk: ПРИКАЖИ ИЗБИРАЧ
ml: പിക്കർ കാണിക്കുക
mn: СОНГОГЧИЙГ ХАРУУЛАХ
mr: पिकर दाखवा
ms: TUNJUKKAN PEMILIH
my: ရွေးချယ်ရေးစနစ် ပြရန်
nb: VIS VELGEREN
ne: चयनकर्ता देखाउनुहोस्
pa: ਚੋਣਕਾਰ ਦਿਖਾਓ
pl: POKAŻ SELEKTOR
pt: MOSTRAR SELETOR
pt_pt: MOSTRAR SELECIONADOR
ro: AFIȘAȚI SELECTORUL
ru: ПОКАЗАТЬ ОКНО ВЫБОРА
si: තෝරකය පෙන්වන්න
sk: ZOBRAZIŤ VÝBER
sq: SHFAQ ZGJEDHËSIN
sr: ПРИКАЖИ БИРАЧ
sr_latn: PRIKAŽI BIRAČ
sv: VISA VÄLJAREN
te: పికర్‌ను చూపించు
th: แสดงเครื่องมือเลือก
tr: SEÇİCİYİ GÖSTER
uk: ПОКАЗАТИ ЗАСІБ ВИБОРУ
ur: منتخب کنندہ دکھائیں
uz: TANLASH OYNASINI CHIQARISH
vi: HIỂN THỊ BỘ CHỌN
zh_hk: 顯示點選器
zu: BONISA ISIKHI
