Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoRangeSlidersDescription
source: Sliders reflect a range of values along a bar. They can have icons on both ends of the bar that reflect a range of values. They are ideal for adjusting settings such as volume, brightness, or applying image filters.
af: Glyers weerspieël 'n reeks waardes langs 'n balk. Hulle kan ikone op albei punte van die balk hê wat 'n reeks waardes weerspieël. Hulle is ideaal daarvoor om instellings soos volume of helderheid te verstel, of om prentfilters toe te pas.
am: ተንሸራታቾች ከአሞሌ ጋር የእሴቶችን ክልል ያንጸባርቃሉ። የእሴቶችን ክልል በሚያንጸባርቀው አሞሌ ሁለቱም ማብቂያዎች ላይ አዶዎች ሊኖራቸው ይችላል። እንደ ድምፅ፣ ብሩህነት የመሳሰሉ ቅንብሮችን ለማስተካከል ወይም የምስል ማጣሪያዎችን ተፈጻሚ ለማድረግ ተመራጭ ናቸው።
ar_eg: تعكس شرائط التمرير نطاقًا من القيم بطول شريط. يمكن أن تحتوي على رموز في كلا طرفي الشريط بحيث تعكس نطاقًا من القيم. وهي مثالية لتعديل الإعدادات، مثلاً مستوى الصوت أو السطوع أو تطبيق فلاتر الصور.
as: শ্লাইডাৰসমূহে এডাল বাৰত মানৰ এক পৰিসৰ দেখুৱায়। সেইবিলাকত বাৰডালৰ দুয়োটা প্ৰান্তত আইকন থাকিব পাৰে যি মানৰ এক পৰিসৰ দেখুৱায়। সেইবিলাক ভলিউম, উজ্জ্বলতা আদিৰ দৰে ছেটিংসমূহ মিলোৱা অথবা প্ৰতিচ্ছবিৰ ফিল্টাৰ প্ৰয়োগ কৰাৰ বাবে উপযোগী।
az: Slayderlər panel boyunca dəyərlər silsiləsini göstərir. Zolağın hər iki ucunda dəyərlər silsiləsini göstərən ikonalar ola bilər. Onlar səs səviyyəsi, parlaqlıq kimi ayarları tənzimləməyə və ya şəkil filtrlərini tətbiq etməyə imkan verir.
be: Паўзункі адлюстроўваюць дыяпазон значэнняў на панэлі. У іх могуць быць значкі з абодвух краёў панэлі, якія паказваюць дыяпазон значэнняў. Паўзункі ідэальна падыходзяць для карэкцыі гучнасці, яркасці ці прымянення фільтраў для відарысаў.
bn: বারের সাথে সাথে স্লাইডার মানেরও ব্যাপ্তি দেখায়। এর মধ্যে বারের দুই পাশের শেষে মানের ব্যাপ্তি নির্দেশক আইকন থাকতে পারে। ভলিউম, উজ্জ্বলতা বা ছবিতে ফিল্টার প্রয়োগ করা এমন সেটিংস অ্যাডজাস্ট করার জন্য এটি একটি আদর্শ বিকল্প।
bs: Klizači prikazuju raspon vrijednosti duž trake. Na oba kraja se mogu nalaziti ikone koje prikazuju raspon vrijednosti. Idealni su za podešavanje postavki kao što su jačina zvuka, osvijetljenost ili primjena filtera za slike.
ca: Els controls lliscants mostren un interval de valors al llarg d'una barra, que pot tenir icones als dos extrems. Són ideals per ajustar opcions de configuració com el volum o la brillantor, o bé per aplicar filtres d'imatge.
da: Skydere viser en række værdier langs en bjælke. De kan have ikoner i begge ender af bjælken, som afspejler en række værdier. De er ideelle til justering af indstillinger som f.eks. lydstyrke eller lysstyrke samt til valg af billedfiltre.
es_ar: Los controles deslizantes reflejan un rango de valores en una barra. Es posible que tengan íconos en ambos extremos de la barra que suponen un rango de valores. Son ideales para ajustar opciones de configuración como el volumen y el brillo, o bien para aplicar filtros de imagen.
et: Liugurid kajastavad väärtuste vahemikku ribal. Nende mõlemas otsas võivad olla ikoonid, mis kajastavad väärtuste vahemikku. Need sobivad hästi selliste seadete kohandamiseks nagu helitugevus, heledus või pildifiltrite rakendamine.
eu: Graduatzaileek balio barruti bat islatzen dute, barra batean. Ikono bana izan dezakete bi muturretan, balioen barrutia zein den erakusteko. Oso erabilgarriak dira irudiei iragazkiak aplikatzeko edo, orokorrean, ezarpenak doitzeko; esaterako, distira edo bolumena.
fa: لغزنده‌ها گستره‌ای از مقادیر را در امتداد نواری نشان می‌دهند. آن‌ها ممکن است در هر دو سر نوار نمادی داشته باشند که گستره‌ای از مقادیر را نشان دهد. لغزنده‌ها برای تغییر تنظیماتی مثل صدا، روشنایی یا اعمال فیلتر روی تصاویر ایده‌آل هستند.
fil: Nagpapakita ang mga slider ng isang hanay ng mga value sa isang bar. Puwedeng may mga icon ang mga ito sa magkabilang dulo ng bar na nagpapakita ng isang hanay ng mga value. Mainam ang mga ito para sa pagsasaayos ng mga setting tulad ng volume, liwanag, o paglalapat ng mga filter ng larawan.
fr_ca: Les curseurs présentent une plage de valeurs le long d'une barre. Ils peuvent être accompagnés d'icônes aux deux extrémités, indiquant une plage de valeurs. Ils sont idéaux pour ajuster divers paramètres, comme le volume ou la luminosité, ou encore pour appliquer des filtres à des images.
gl: Os controis desprazables reflicten un intervalo de valores ao longo dunha barra. Poden ter iconas en ambos os extremos da barra para mostrar un intervalo de valores. Son ideais para axustar opcións de configuración (como o volume ou o brillo) ou para aplicar filtros de imaxe.
gu: સ્લાઇડર બારમાં મૂલ્યોની શ્રેણી બતાવે છે. તેઓ બારના બન્ને છેડા પર એવા આઇકન ધરાવી શકે છે, જે મૂલ્યોની શ્રેણી બતાવે છે. તેઓ વૉલ્યૂમ, બ્રાઇટનેસ, અથવા છબી ફિલ્ટર લાગુ કરવા જેવી સેટિંગની ગોઠવણ કરવા માટે આદર્શ છે.
he: מחוונים מייצגים טווח ערכים לאורך סרגל. אפשר להוסיף להם סמלים בשני צדי הסרגל שמייצגים טווח ערכים. הם אידיאליים להתאמת הגדרות כמו עוצמת קול, בהירות או להחלת מסנני תמונות.
hi: स्लाइडर किसी बार पर मौजूद मानों की सीमा दिखाते हैं. इनमें बार के दोनों तरफ़ आइकॉन मौजूद हो सकते हैं जिनमें मानों की सीमा दिखाई जाती है. ये सेटिंग में बदलाव करने के लिए बेहतर विकल्प हैं. इसमें आवाज़ कम या ज़्यादा करना, चमक घटाना-बढ़ाना या किसी इमेज में फ़िल्टर लगाने जैसे बदलाव शामिल हैं.
hu: A csúszkák értéktartományt jelenítenek meg egy sáv mentén. A csúszkáknál a sáv mindkét végén ikonok jelezhetik az értéktartományt. A csúszkák ideális összetevők olyan beállítások módosításához, mint például a hangerő és a fényerő, valamint képszűrők alkalmazásához.
hy: Սահիչները թույլ են տալիս ընտրել անհրաժեշտ արժեքը տրված միջակայքում։ Պարզության համար, միջակայքի եզրերով կարող եք տեղակայել պատկերակներ։ Սահիչների օգնությամբ հեշտությամբ կարող եք կարգավորել ձայնի մակարդակը, պայծառությունն ու պատկերների զտիչները։
id: Penggeser menunjukkan rentang nilai di sepanjang panel. Penggeser bisa memiliki ikon di kedua ujung panel yang menunjukkan rentang nilai. Penggeser cocok untuk menyesuaikan setelan seperti volume, kecerahan, atau menerapkan filter gambar.
it: I cursori rappresentano un intervallo di valori lungo una barra, che può avere icone su entrambe le estremità per indicare un intervallo di valori. Sono la soluzione ideale per regolare impostazioni quali volume e luminosità oppure per applicare filtri delle immagini.
ja: スライダーはバー上の値の範囲を表すものです。スライダーには、バーの両端に値の範囲を表すアイコンを付けることができます。音量、明るさなどの設定を調整したり、画像フィルタを適用したりするのに最適です。
ka: სლაიდერები ზოლის გასწვრივ ასახავს მნიშვნელობათა დიაპაზონს. სლაიდერებს ზოლის ორივე ბოლოში შეიძლება ჰქონდეს ხატულები, რომლებიც ასახავს მნიშვნელობათა დიაპაზონს. ისინი იდეალურია ისეთი პარამეტრების კორექტირებისთვის, როგორიც არის ხმის სიმძლავრე და სიკაშკაშე, ან სურათის ფილტრების მისადაგებისთვის.
km: របាររំកិល​បង្ហាញ​ចន្លោះតម្លៃ​នៅលើរបារ។ របាររំកិល​ទាំងនេះ​អាចមាន​រូបតំណាងនៅចុងទាំងពីរនៃរបារ ដែលបង្ហាញចន្លោះតម្លៃ។ របាររំកិលទាំងនេះស័ក្តិសមសម្រាប់​ការកែតម្រូវការកំណត់​ផ្សេងៗដូចជា កម្រិតសំឡេង ពន្លឺ ឬការអនុវត្តតម្រងរូបភាពជាដើម។
kn: ಸ್ಲೈಡರ್, ಬಾರ್‌ನಾದ್ಯಂತ ಮೌಲ್ಯಗಳ ಶ್ರೇಣಿಯನ್ನು ಪ್ರತಿಬಿಂಬಿಸುತ್ತದೆ. ಇವುಗಳು ಬಾರ್‌ನ ಎರಡೂ ತುದಿಗಳಲ್ಲಿ ಐಕಾನ್‌ಗಳನ್ನು ಹೊಂದಿರಬಹುದು, ಇವು ಮೌಲ್ಯಗಳ ಶ್ರೇಣಿಯನ್ನು ಪ್ರತಿಬಿಂಬಿಸುತ್ತವೆ. ವಾಲ್ಯೂಮ್, ಪ್ರಖರತೆ ಅಥವಾ ಚಿತ್ರದ ಫಿಲ್ಟರ್‌ಗಳನ್ನು ಅನ್ವಯಿಸುವಂತಹ ಸೆಟ್ಟಿಂಗ್‌ಗಳನ್ನು ಸರಿಹೊಂದಿಸುವುದಕ್ಕೆ ಅವುಗಳು ಸೂಕ್ತವಾಗಿದೆ.
ko: 슬라이더는 막대를 따라 분포된 값 범위를 나타냅니다. 막대 양쪽 끝에 값 범위를 나타내는 아이콘이 표시될 수 있습니다. 볼륨, 밝기 등의 설정을 조정하거나 이미지 필터를 적용하는 데 적합합니다.
ky: Сыдырмалар тилкедеги маанилердин диапазонун чагылдырып турат. Сыдырмалардын эки жагында маанилердин диапазонун чагылдырган сүрөтчөлөрдүн тилкеси бар. Алар үндүн көлөмүн, экрандын жарыктыгын же сүрөттүн чыпкаларын колдонууда абдан пайдалуу.
lo: ຕົວເລື່ອນຈະມີໄລຍະຂອງຄ່າໄປຕາມແຖບໃດໜຶ່ງ. ພວກມັນສາມາດມີໄອຄອນຢູ່ປາຍທັງສອງຂອງແຖບທີ່ມີໄລຍະຂອງຄ່າຕ່າງໆໄດ້. ພວກມັນເໝາະສຳລັບການປັບແຕ່ງການຕັ້ງຄ່າຕ່າງໆ ເຊັ່ນ: ລະດັບສຽງ, ຄວາມສະຫວ່າງ ຫຼື ການນຳໃຊ້ຟິວເຕີຮູບພາບ.
lt: Šliaužikliai atspindi juostos verčių diapazoną. Jie gali būti su piktogramomis abiejose verčių diapazoną atspindinčios juostos pusėse. Jais galima lengvai koreguoti nustatymus, pvz., garsumą, šviesumą, arba taikyti vaizdų filtrus.
lv: Slīdņi atspoguļo vērtību diapazonu joslā. Abos slīdņu joslas galos var būt ikonas, kas atspoguļo vērtību diapazonu. Slīdņi ir lieliski piemēroti dažādu iestatījumu, piemēram, skaļuma vai spilgtuma, pielāgošanai vai attēlu filtru lietošanai.
mk: Лизгачите прикажуваат голем број вредности на лента. Може да имаат икони на двата краја на лентата со опсег на вредности. Идеални се за приспособување на поставките, како што се јачината на звукот, осветленоста или примената на филтри за слики.
ml: സ്ലെെഡറുകൾ ഒരു ബാറിലുടനീളം മൂല്യങ്ങളുടെ ഒരു ശ്രേണിയെ പ്രതിഫലിപ്പിക്കുന്നു. അവയിൽ, മൂല്യങ്ങളുടെ ശ്രേണിയെ പ്രതിഫലിപ്പിക്കുന്ന ബാറിന്റെ രണ്ട് അറ്റങ്ങളിലും ഐക്കണുകൾ ഉണ്ടാകാം. ശബ്‌ദം, തെളിച്ചം അല്ലെങ്കിൽ ചിത്ര ഫിൽട്ടറുകൾ പ്രയോഗിക്കൽ പോലുള്ള ക്രമീകരണങ്ങൾ ക്രമീകരിക്കുന്നതിന് ഏറ്റവും അനുയോജ്യമാണവ.
mn: Слайдер нь самбар дагуух утгын мужийг илэрхийлдэг. Энэ нь самбарын төгсгөлийн аль алинд утгын мужийг илэрхийлдэг дүрс тэмдэгтэй байх боломжтой. Энэ нь дууны түвшин, гэрэлтүүлэг зэрэг тохиргоог тохируулах эсвэл зургийн шүүлтүүрийг хэрэгжүүлэхэд яг таг тохирдог.
mr: स्लाइडर एका बारसह मूल्यांच्या रेंज दाखवतात. त्यांच्याकडे बारच्या दोन्ही टोकांवर मूल्यांच्या रेंज दाखवणारी चिन्हे असू शकतात. व्हॉल्यूम, ब्राइटनेस किंवा इमेज फिल्टर लागू करणे यांसारख्या अ‍ॅडजस्ट करणाऱ्या सेटिंग्जसाठी ते उत्तम आहेत.
ms: Peluncur menggambarkan satu julat nilai di sepanjang bar. Peluncur boleh mempunyai ikon di kedua-dua hujung bar yang menggambarkan satu julat nilai. Peluncur ini sesuai untuk melaraskan tetapan seperti kelantangan, kecerahan atau penggunaan penapis imej.
my: ရွှေ့တုံးများသည် ဘားတန်းတစ်ခုပေါ်ရှိ တန်ဖိုးအပိုင်းအခြားတစ်ခုကို ကိုယ်စားပြုသည်။ ဘားတန်းတစ်ခု၏ အဆုံးတစ်ဖက်တစ်ချက်တွင် သင်္ကေတတစ်ခုစီ ရှိနိုင်ပြီး တန်ဖိုးအပိုင်းအခြားတစ်ခုကို ကိုယ်စားပြုနိုင်သည်။ ၎င်းတို့သည် အသံ၊ တောက်ပမှုတို့ကို ချိန်ညှိသည့်အခါ သို့မဟုတ် ဓာတ်ပုံအရောင်စစ်မှန်ပြားများ အသုံးပြုသည့်အခါ အသင့်လျော်ဆုံးဖြစ်သည်။
nb: Glidebrytere gjenspeiler en rekke verdier langs en rad. De kan ha ikoner på begge ender av raden som viser et verdiområde. De er perfekte for å justere innstillinger som volum, lysstyrke og bruk av bildefiltre.
ne: स्लाइडरहरूले बारमा रहेका मानको दायरा प्रतिबिम्बित गर्दछन्। यी स्लाइडरका बारका दुवै पुछारमा मानको दायरा प्रतिबिम्बित गर्ने आइकनहरू हुन सक्छन्। यी स्लाइडरहरू भोल्युम, चमक जस्ता सेटिङ समायोजन गर्ने वा छविका फिल्टरहरू लागू गर्ने कार्यका लागि उपयुक्त हुन्छन्।
pa: ਸਲਾਇਡਰ ਬਾਰ ਦੇ ਨਾਲ-ਨਾਲ ਮੁੱਲ ਰੇਂਜ ਨੂੰ ਵੀ ਦਰਸਾਉਂਦੇ ਹਨ। ਉਹਨਾਂ ਦੇ ਬਾਰ ਦੇ ਦੋਵਾਂ ਸਿਰਿਆਂ 'ਤੇ ਪ੍ਰਤੀਕ ਹੋ ਸਕਦੇ ਹਨ ਜੋ ਮੁੱਲ ਦੀ ਤੀਬਰਤਾ ਦਰਸਾਉਂਦੇ ਹਨ। ਉਹ ਸੈਟਿੰਗਾਂ ਵਿਵਸਥਿਤ ਕਰਨ ਲਈ ਆਦਰਸ਼ ਹਨ ਜਿਵੇਂ ਕਿ ਅਵਾਜ਼, ਚਮਕ ਜਾਂ ਚਿੱਤਰ ਫਿਲਟਰ ਲਾਗੂ ਕਰਨ ਲਈ।
pl: Suwaki prezentują zakres wartości na pasku. Na obu końcach paska mogą znajdować się ikony ilustrujące dany zakres. Ten element interfejsu idealnie nadaje się do regulacji ustawień takich jak głośność, jasność czy stopień zastosowania filtra graficznego.
pt: Os controles deslizantes refletem um intervalo de valores em uma barra. Eles podem ter ícones em ambas as extremidades da barra, refletindo um intervalo de valores. São ideais para ajustar configurações como volume e brilho ou aplicar filtros de imagem.
pt_pt: Os controlos de deslize refletem um intervalo de valores ao longo de uma barra. Podem ter ícones em ambas as extremidades da barra que refletem um intervalo de valores. São ideais para ajustar definições como o volume, o brilho ou aplicar filtros de imagem.
ro: Glisoarele reprezintă un interval de valori de-a lungul unei bare. Acestea pot avea pictograme la ambele capete ale barei, care reflectă un interval de valori. Sunt ideale pentru reglarea setărilor, precum volumul, luminozitatea sau aplicarea filtrelor de imagine.
ru: Ползунки позволяют выбрать нужное значение в заданном диапазоне. Для понятности по краям диапазона можно расположить значки. С помощью ползунков удобно регулировать уровень громкости, настраивать яркость и фильтры изображений.
si: ස්ලයිඩර් තීරුවක් ඔස්සේ අගයන් පරාසයක් පිළිබිඹු කරයි. ඔවුන්ට අගයන් පරාසයක් පිළිබිඹු කරන තීරුවේ දෙකෙළවරම අයිකන තබා ගත හැකිය. පරිමාව, දීප්තිය හෝ රූප පෙරහන් යෙදීම වැනි සැකසීම් සීරුමාරු කිරීම සඳහා ඒවා ඉතා සුදුසුය.
sk: Posúvače predstavujú rozsah hodnôt na pruhu. Môžu mať na oboch koncoch pruhu ikony označujúce rozsah hodnôt. Sú ideálne na úpravu nastavení, ako je napríklad hlasitosť, jas alebo použitie filtrov obrázkov.
sq: Rrëshqitësit pasqyrojnë një gamë vlerash përgjatë një shiriti. Ata mund të kenë ikona në të dyja skajet e shiritit, të cilat pasqyrojnë një gamë vlerash. Ata janë idealë për rregullimin e cilësimeve si p.sh. volumi, ndriçimi ose zbatimi i filtrave të imazheve.
sr: Клизачи одражавају опсег вредности на траци. Могу да имају иконе на оба краја траке који одражавају опсег вредности. Идеални су за прилагођавање подешавања као што су јачина звука, осветљеност или примена филтера за слике.
sr_latn: Klizači odražavaju opseg vrednosti na traci. Mogu da imaju ikone na oba kraja trake koji odražavaju opseg vrednosti. Idealni su za prilagođavanje podešavanja kao što su jačina zvuka, osvetljenost ili primena filtera za slike.
sv: Skjutreglage är fält med ett värdeintervall. De kan ha ikoner på båda sidorna av fältet som motsvarar värdeintervallet. De passar perfekt till justering av inställningar som volym, ljusstyrka och bildfilter.
te: బార్ అంతటా విలువల శ్రేణిని స్లయిడర్‌లు సూచిస్తాయి. స్లయిడర్‌లు, విలువల శ్రేణిని సూచించే చిహ్నాలను బార్‌కు ఇరువైపులా కలిగి ఉంటాయి. వాల్యూమ్, కాంతి లేదా చిత్రానికి ఫిల్టర్‌లను వర్తింపజేయడం వంటి సెట్టింగ్‌లను సర్దుబాటు చేయడానికి అవి సరైన సూచికలు.
th: แถบเลื่อนแสดงช่วงของค่าในแถบ และอาจมีไอคอนอยู่ที่ปลายทั้ง 2 ด้านเพื่อแสดงช่วงของค่า เหมาะสำหรับการปรับการตั้งค่า เช่น ระดับเสียง ความสว่าง หรือการใช้ฟิลเตอร์รูปภาพ
tr: Kaydırma çubukları, bir çubuk boyunca çeşitli değerler yansıtır. Kaydırma çubuklarının her iki ucunda değer aralığının alt ve üst değerlerini gösteren simgeler bulunabilir. Kaydırma çubukları, ses düzeyi ve parlaklık gibi ayarları düzenlemek veya görüntü filtreleri uygulamak için idealdir.
uk: Повзунки показують діапазон значень уздовж панелі та можуть мати на обох кінцях значки, які показують цей діапазон. Вони найкраще підходять для налаштування таких параметрів, як звук і яскравість, або застосування фільтрів зображень.
ur: سلائیڈرز بار کے ساتھ اقدار کے رینج کی عکاسی کرتے ہیں۔ ان میں بار کے دونوں کناروں پر آئیکنز ہو سکتے ہیں جو اقدار کے رینج کی عکاسی کرتے ہیں۔ یہ والیوم، چمک، یا تصویر کے فلٹرز کا اطلاق کرنے جیسی ترتیبات کو ایڈجسٹ کرنے کے لیے مثالی ہیں۔
uz: Slayderlar yordamida berilgan diapazondagi kerakli qiymatni tanlash mumkin. Slayderlarning ikkala uchida yaqqol qiymatlarni anglatuvchi belgilar bo‘lishi mumkin Ular bilan tovush balandligi, yorqinlik yoki tasvir filtrlarini ham sozlash mumkin.
vi: Thanh trượt biểu thị khoảng giá trị dọc theo một thanh. Thanh trượt có thể có các biểu tượng ở cả hai đầu thanh biểu thị khoảng giá trị. Thanh trượt là lựa chọn lý tưởng để điều chỉnh các tùy chọn cài đặt như âm lượng, độ sáng hoặc áp dụng bộ lọc hình ảnh.
zh_hk: 滑桿上列有特定範圍內的值，兩端可用圖示來代表不同的值。滑桿最適合用來調整設定，例如調校音量或光暗，以及套用圖片濾鏡。
zu: Izilayidi zibonisa ibanga lamavelu kwibha. Zingaba nezithonjana ngasekugcineni kwebha ezibonisa ibanga lamavelu. Abalulekele ukulungisa izilungiselelo ezifana nevolomu, ukukhanya, noma ukufaka izihlungi zesithombe.

# demoMenuAnItemWithAContextMenuButton
source: An item with a context menu
af: 'n Item met 'n kontekskieslys
am: ከዓውድ ምናሌ ጋር ያለ ንጥል
ar_eg: عنصر يفتح قائمة سياقات
as: এখন প্ৰসংগ মেনুৰ সৈতে এটা বস্তু
az: Kontekst menyusu ilə element
be: Элемент з кантэкстным меню
bn: সংশ্লিষ্ট মেনু সহ একটি আইটেম
bs: Stavka s kontekstnim menijem
ca: Un element amb un menú contextual
da: Et element med en genvejsmenu
es_ar: Un elemento con un menú contextual
et: Kontekstimenüüga üksus
eu: Laster-menu bat duen aukera bat
fa: مورد با منوی بافتی
fil: Isang item na may menu ng konteksto
fr_ca: Un élément avec un menu contextuel
gl: Un elemento cun menú contextual
gu: સંદર્ભ મેનૂવાળી આઇટમ
he: פריט עם תפריט הקשר
hi: संदर्भ मेन्यू वाला आइटम
hu: Elem helyi menüvel
hy: Տեղային ընտրացանկով տարր
id: Item dengan menu konteks
it: Un elemento con un menu contestuale
ja: コンテキスト メニュー付きの項目
ka: ერთეული კონტექსტური მენიუთი
km: ធាតុ​ដែលមាន​ម៉ឺនុយ​បរិបទ
kn: ಸಂದರ್ಭದ ಮೆನು ಹೊಂದಿರುವ ಐಟಂ
ko: 컨텍스트 메뉴가 포함된 항목
ky: Контексттик менюдагы элемент
lo: ລາຍການທີ່ມີເມນູບໍລິບົດ
lt: Kontekstinio meniu elementas
lv: Vienums ar kontekstizvēlni
mk: Ставка со контекстуално мени
ml: സന്ദർഭ മെനു ഉള്ള ഒരിനം
mn: Хам сэдэв цэстэй зүйл
mr: कॉंटेक्स्ट मेनू असलेला एक आयटम
ms: Item dengan menu konteks
my: အကြောင်းအရာမီနူးပါသည့် အရာ
nb: Et element med en kontekstuell meny
ne: सन्दर्भ मेनुमा भएको वस्तु
pa: ਸੰਦਰਭੀ ਮੀਨੂ ਨਾਲ ਇੱਕ ਆਈਟਮ
pl: Element z menu kontekstowym
pt: Um item com um menu de contexto
pt_pt: Um item com um menu de contexto
ro: Element cu meniu contextual
ru: Объект, у которого есть контекстное меню
si: සන්දර්භය මෙනුවක් සහිත අයිතමයක්
sk: Položka s kontextovou ponukou
sq: Një artikulli me një meny kontekstuale
sr: Ставка са контекстуалним менијем
sr_latn: Stavka sa kontekstualnim menijem
sv: Ett alternativ med en snabbmeny
te: సందర్భోచిత మెనూ కలిగి ఉన్న అంశం
th: รายการพร้อมเมนูตามบริบท
tr: İçerik menüsü olan öğe
uk: Елемент із контекстним меню
ur: سیاق و سباق کے مینیو والا ایک آئٹم
uz: Kontekst menyuli obyekt
vi: Mục có trình đơn ngữ cảnh
zh_hk: 設有內容選單的項目
zu: Into enemenyu yokuqukethwe
