Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoButtonsDescription
source: An iOS-style button. It takes in text and/or an icon that fades out and in on touch. May optionally have a background.
af: 'n Knoppie in iOS-styl. Dit bring teks en/of 'n ikoon in wat verdof of duideliker word met aanraking. Het die opsie om 'n agtergrond te hê.
am: የ iOS-ቅጥ አዝራር። ሲነካ የሚደበዝዝ እና የሚደምቅ የጽሑፍ ውስጥ እና/ወይም አዶ ይወስዳል። በአማራጭነት በስተጀርባ ሊኖረው ይችል ይሆናል።
ar_eg: زر مستوحى من نظام التشغيل iOS. يتم عرض هذا الزر على شكل نص و/أو رمز يتلاشى ويظهر بالتدريج عند اللمس. وقد يكون مزوّدًا بخلفية اختياريًا.
as: এটা iOS-শৈলীৰ বুটাম। এইটো পাঠত আৰু/অথবা এখন আইকন হিচাপে থাকে, যিটোৱে স্পর্শ কৰিলে পোহৰৰ পৰিমাণ সলনি কৰি তোলে। ঐচ্ছিকভাৱে কোনো নেপথ্য থাকিব পাৰে।
az: iOS üslublu düymə. O, toxunduqda solğunlaşan və tündləşən mətn və/və ya ikonanı əks etdirir. İstəyə uyğun arxa fon təyin edilə bilər.
be: Кнопка ў стылі iOS. Яна ўключае тэкст і (ці) значок, якія знікаюць і паяўляюцца пры дакрананні. Можа мець фон (неабавязкова).
bn: একটি iOS-স্টাইল বোতাম। এটির সাহায্যে আপনি টেক্সট এবং/বা কোনও একটি আইকন যা টাচ করলে ফেড-আউট বা ফেড-ইন হয়। বিকল্প হিসেবে একটি ব্যাকগ্রাউন্ড থাকতে পারে।
bs: Dugme u stilu iOS-a. Sadrži tekst i/ili ikonu koja nestaje ili se prikazuje kada se dugme dodirne. Opcionalno može imati pozadinu.
ca: Botó d'estil iOS. Té forma de text o d'icona que s'atenuen o apareixen en tocar-los. Opcionalment pot tenir fons.
da: En knap i samme stil som iOS. Tydeligheden af teksten og/eller ikonet skifter, når knappen berøres. Der kan tilvælges en baggrund til knappen.
es_ar: Un botón con el estilo de iOS. Contiene texto o un ícono que aparece o desaparece poco a poco cuando se lo toca. De manera opcional, puede tener un fondo.
et: iOS-i stiilis nupp. See tõmbab sisse teksti ja/või ikooni, mis liigub puudutamisel välja ja sisse. Võib hõlmata ka tausta.
eu: iOS estiloko botoia. Ukitzean lausotzen eta berriro agertzen den testua eta/edo ikono bat dauka barruan. Atzeko plano bat ere izan dezake.
fa: دکمه‌ای به سبک iOS. نوشتار و/یا نمادی را دربر می‌گیرد که با لمس کردن ظاهر یا محو می‌شود. ممکن است به‌صورت اختیاری پس‌زمینه داشته باشد.
fil: Button na may istilong pang-iOS. Kumukuha ito ng text at/o icon na nagfe-fade out at nagfe-fade in kapag pinindot. Puwede ring may background ito.
fr_ca: Un bouton de style iOS. Il accepte du texte et une icône qui disparaissent et apparaissent quand on touche au bouton. Peut avoir un arrière-plan (optionnel).
gl: Un botón de tipo iOS. Utilízase en texto ou nunha icona que se esvaece e volve aparecer cando se toca. Tamén pode dispor de fondo.
gu: iOS-શૈલીનું બટન. તે ટેક્સ્ટ અને/અથવા આઇકનનો ઉપયોગ કરે છે કે જે સ્પર્શ કરવા પર ઝાંખું થાય છે તથા ઝાંખું નથી થતું. તેમાં વૈકલ્પિક રૂપે બૅકગ્રાઉન્ડ હોઈ શકે છે.
he: לחצן בסגנון iOS. הוא מקבל טקסט ו/או סמל שמתעמעמים ומתחדדים בעת נגיעה בלחצן. יכול להיות לו גם רקע.
hi: iOS की शैली वाला बटन. इसमें टेक्स्ट और/या आइकॉन छूने पर फ़ेड होना शामिल है. इसमें विकल्प के तौर पर एक बैकग्राउंड की सुविधा हो सकती है.
hu: iOS-stílusú gomb. Érintésre megjelenő és eltűnő szöveget és/vagy ikont foglal magában. Tetszés szerint rendelkezhet háttérrel is.
hy: iOS-ի ոճով կոճակ։ Պարունակում է տեքստ և/կամ պատկերակ, որը հայտնվում և անհետանում է սեղմելու դեպքում։ Կարող է նաև ֆոն ունենալ։
id: Tombol gaya iOS. Tombol ini berisi teks dan/atau ikon yang akan memudar saat disentuh. Dapat memiliki latar belakang.
it: Un pulsante in stile iOS. È costituito da testo e/o da un'icona con effetto di dissolvenza quando viene mostrata e quando scompare se viene toccata. A discrezione, può avere uno sfondo.
ja: iOS スタイルのボタンです。テキスト / アイコン形式のボタンで、タップでフェードアウトとフェードインが切り替わります。必要に応じて、背景を設定することもできます。
ka: iOS-ის სტილის ღილაკი. შეიცავს ტექსტს და/ან ხატულას, რომელიც ქრება ან ჩნდება შეხებისას. სურვილისამებრ, შეიძლება ჰქონდეს ფონი.
km: ប៊ូតុង​ដែលមាន​រចនាប័ទ្ម iOS។ វាស្រូប​អក្សរ និង/ឬរូបតំណាង​ដែលរលាយបាត់ និង​លេចឡើងវិញ​បន្តិចម្ដងៗ នៅពេលចុច។ ប្រហែលជា​មានផ្ទៃខាងក្រោយ​តាមការ​ជ្រើសរើស។
kn: iOS-ಶೈಲಿ ಬಟನ್. ಸ್ಪರ್ಶಿಸಿದಾಗ ಪಠ್ಯದಲ್ಲಿರುವ ಮತ್ತು/ಅಥವಾ ಐಕಾನ್‌ಗಳನ್ನು ಹೊಂದಿದ್ದು, ಅದು ಕ್ರಮೇಣ ಗೋಚರಿಸುತ್ತದೆ ಅಥವಾ ಮಸುಕಾಗುತ್ತದೆ. ಐಚ್ಛಿಕವಾಗಿ ಹಿನ್ನೆಲೆಯನ್ನು ಹೊಂದಿರಬಹುದು.
ko: iOS 스타일 버튼입니다. 터치하면 페이드인 또는 페이드아웃되는 텍스트 및 아이콘을 담을 수 있습니다. 선택사항으로 배경을 넣을 수 있습니다.
ky: iOS стилиндеги баскыч. Ал текст же сүрөтчө формасында болуп, жана тийгенде көрүнбөй калышы мүмкүн. Фону бар болушу мүмкүн.
lo: ປຸ່ມແບບ iOS. ມັນຈະໃສ່ຂໍ້ຄວາມ ແລະ/ຫຼື ໄອຄອນທີ່ຄ່ອຍໆປາກົດຂຶ້ນ ແລະ ຄ່ອຍໆຈາງລົງເມື່ອແຕະໃສ່. ອາດມີ ຫຼື ບໍ່ມີພື້ນຫຼັງກໍໄດ້.
lt: „iOS“ stiliaus mygtukas. Jis rodomas tekste ir (arba) kaip piktograma, kuri išnyksta ir atsiranda palietus. Galima pasirinkti foną.
lv: iOS stila poga. Pogā var ievietot tekstu un/vai ikonu, kas pieskaroties pakāpeniski parādās un izzūd. Pogai pēc izvēles var būt fons.
mk: Копче во iOS-стил. Содржи текст и/или икона што бледее и се појавува при допир. По избор, може да има и заднина.
ml: iOS-സ്റ്റൈലിലുള്ള ബട്ടൺ. ടെക്‌സ്‌റ്റിന്റെയോ ഐക്കണിന്റെയോ തെളിച്ചം, സ്‌പർശനത്തിലൂടെ കുറയ്ക്കാനും കൂട്ടാനും ഈ ബട്ടണ് കഴിയും. ഓപ്ഷണലായി. ഒരു പശ്ചാത്തലം ഉണ്ടായേക്കാം.
mn: iOS загварын товчлуур. Үүнийг текстэд болон/эсвэл хүрэх үед гадагшаа болон дотогшоо уусдаг дүрс тэмдэгт ашиглана. Сонгох боломжтой арын дэвсгэртэй байж магадгүй.
mr: एक iOS शैलीतील बटण. स्पर्श केल्यावर फिका होणार्‍या आणि न होणार्‍या मजकूरचा आणि/किंवा आयकनचा यामध्ये समावेश आहे यामध्ये पर्यायी एक बॅकग्राउंड असू शकतो.
ms: Butang gaya iOS. Butang menggunakan teks dan/atau ikon yang melenyap keluar dan muncul apabila disentuh. Boleh mempunyai latar belakang secara pilihan.
my: iOS-ပုံစံ ခလုတ်။ ထိလိုက်သည်နှင့် အဝင်နှင့် အထွက် မှိန်သွားသည့် စာသားနှင့်/သို့မဟုတ် သင်္ကေတကို ၎င်းက လက်ခံသည်။ နောက်ခံလည်း ပါဝင်နိုင်သည်။
nb: En knapp i iOS-stil. Den bruker tekst og/eller et ikon som tones ut og inn ved berøring. Kan ha en bakgrunn.
ne: एक iOS शैलीको बटन। यो बटन पाठ प्रयोग गरेर र/वा छुँदा मधुरो वा चखिलो हुने आइकन प्रयोग गरेर चल्छ। यसमा पृष्ठभूमि विकल्पका रूपमा रहन सक्छ।
pa: iOS-ਸਟਾਈਲ ਬਟਨ। ਇਸ ਵਿੱਚ ਲਿਖਤ ਅਤੇ/ਜਾਂ ਪ੍ਰਤੀਕ ਸਵੀਕਾਰ ਕਰਦਾ ਹੈ ਜੋ ਸਪਰਸ਼ ਕਰਨ 'ਤੇ ਫਿੱਕਾ ਅਤੇ ਗੂੜ੍ਹਾ ਹੋ ਜਾਂਦਾ ਹੈ। ਵਿਕਲਪਿਕ ਰੂਪ ਵਿੱਚ ਇਸਦਾ ਬੈਕਗ੍ਰਾਊਂਡ ਹੋ ਸਕਦਾ ਹੈ।
pl: Przycisk w stylu iOS. Przyjmuje tekst lub ikonę, które zanikają i powracają po naciśnięciu. Opcjonalnie może mieć tło.
pt: Um botão no estilo iOS. Ele engloba um texto e/ou um ícone que desaparece e reaparece com o toque. Pode conter um plano de fundo.
pt_pt: Um botão ao estilo do iOS. Abrange texto e/ou um ícone que aumenta e diminui gradualmente com o toque. Opcionalmente, pode ter um fundo.
ro: Buton în stil iOS. Preia text și/sau o pictogramă care se estompează sau se accentuează la atingere. Poate să aibă un fundal opțional.
ru: Кнопка в стиле iOS. Содержит текст или значок, который исчезает и появляется при нажатии. Может иметь фон.
si: iOS-විලාසයේ බොත්තමකි. එළිය වන සහ ස්පර්ශයේදී පෙළ සහ/හෝ අයිකනයක් ගනී. විකල්පව පසුබිමක් තිබිය හැකිය.
sk: Tlačidlo v štýle systému iOS. Zahŕňa text a ikonu, ktorá sa po dotyku stmaví alebo vybledne. Voliteľne môže mať aj pozadie.
sq: Një buton në stilin e iOS. Përfshin tekstin dhe/ose një ikonë që zhduket dhe shfaqet gradualisht kur e prek. Si opsion mund të ketë sfond.
sr: Дугме у iOS стилу. Садржи текст и/или икону који постепено нестају или се приказују када се дугме додирне. Опционално може да има позадину.
sr_latn: Dugme u iOS stilu. Sadrži tekst i/ili ikonu koji postepeno nestaju ili se prikazuju kada se dugme dodirne. Opcionalno može da ima pozadinu.
sv: En knapp i iOS-stil. Den har en text och/eller ikon som tonas in och ut vid beröring. Den kan ha en bakgrund.
te: ఒక iOS-శైలి బటన్. తాకినప్పుడు మసకబారేలా ఉండే వచనం మరియు/లేదా చిహ్నం రూపంలో ఉంటుంది. ఐచ్ఛికంగా బ్యాక్‌గ్రౌండ్‌ ఉండవచ్చు.
th: ปุ่มแบบ iOS จะใส่ข้อความและ/หรือไอคอนที่ค่อยๆ ปรากฏขึ้นและค่อยๆ จางลงเมื่อแตะ อาจมีหรือไม่มีพื้นหลังก็ได้
tr: iOS tarzı düğme. Dokunulduğunda rengi açılan ve kararan metin ve/veya simge içerir. İsteğe bağlı olarak arka planı bulunabilir.
uk: Кнопка в стилі iOS. Якщо натиснути на неї, з'явиться текст та/або значок, який світлішає й темнішає. Може мати фон (необов'язково).
ur: ایک iOS طرز کا بٹن۔ یہ بٹن ٹچ کرنے پر فیڈ آؤٹ اور فیڈ ان کرنے والے متن اور/یا آئیکن میں شامل ہو جاتا ہے۔ اختیاری طور پر اس کا پس منظر ہو سکتا ہے
uz: iOS uslubidagi tugma. Unda bosganda chiqadigan va yoʻqoladigan matn yoki belgi boʻladi. Orqa fon boʻlishi ham mumkin.
vi: Đây là một nút theo kiểu iOS. Nút này có chứa văn bản và/hoặc một biểu tượng mờ đi rồi rõ dần lên khi chạm vào. Ngoài ra, nút cũng có thể có nền (không bắt buộc).
zh_hk: iOS 樣式的按鈕，當中的文字和/或圖示會在使用者輕觸按鈕時淡出及淡入。可按需要設定背景。
zu: Inkinobho yesitayela se-iOS. Ithatha ifake ngaphakathi umbhalo kanye/noma isithonjana esifiphalayo siphume siphinde sifiphale singene ekuthintweni. Kungenzeka ngokukhetheka ibe nengemuva.

# demoCupertinoAlertsTitle
source: Alerts
af: Opletberigte
am: ማንቂያዎች
ar_eg: التنبيهات
as: সতৰ্কবার্তাসমূহ
az: Xəbərdarlıqlar
be: Абвесткі
bn: সতর্কতা
bs: Obavještenja
ca: Alertes
da: Underretninger
es_ar: Alertas
et: Hoiatused
eu: Alertak
fa: هشدارها
fil: Mga Alerto
fr_ca: Alertes
gl: Alertas
gu: અલર્ટ
he: התראות
hi: चेतावनियां
hu: Értesítések
hy: Ծանուցումներ
id: Notifikasi
it: Avvisi
ja: アラート
ka: გაფრთხილებები
km: ការជូនដំណឹង
kn: ಅಲರ್ಟ್‌ಗಳು
ko: 알림
ky: Эскертүүлөр
lo: ການແຈ້ງເຕືອນ
lt: Įspėjimai
lv: Brīdinājumi
mk: Предупредувања
ml: മുന്നറിയിപ്പുകൾ
mn: Сэрэмжлүүлэг
mr: सूचना
ms: Makluman
my: သတိပေးချက်များ
nb: Varsler
ne: सतर्कताहरू
pa: ਸੁਚੇਤਨਾਵਾਂ
pl: Alerty
pt: Alertas
pt_pt: Alertas
ro: Alerte
ru: Оповещения
si: ඇඟවීම්
sk: Upozornenia
sq: Sinjalizime
sr: Обавештења
sr_latn: Obaveštenja
sv: Aviseringar
te: హెచ్చరికలు
th: การแจ้งเตือน
tr: Uyarılar
uk: Сповіщення
ur: الرٹس
uz: Bildirishnomalar
vi: Cảnh báo
zh_hk: 通知
zu: Izexwayiso

# demoCupertinoAlertsSubtitle
source: iOS-style alert dialogs
af: Opletberigdialoë in iOS-styl
am: iOS-ቅጥ ማንቂያ ንግግሮች
ar_eg: مربعات حوار التنبيهات المستوحاة من نظام التشغيل iOS
as: iOS-শৈলীৰ সতর্কবার্তাৰ ডায়ল’গসমূহ
az: iOS üslubunda xəbərdarlıq dialoqları
be: Дыялогавыя вокны абвестак у стылі iOS
bn: iOS-স্টাইলে সতর্কতা ডায়ালগ
bs: Dijaloški okvir za obavještenja u stilu iOS-a
ca: Quadres de diàleg d'alerta d'estil iOS
da: Dialogbokse til underretning i samme stil som iOS
es_ar: Diálogos de alerta con estilo de iOS
et: iOS-i stiilis teatisedialoogid
eu: iOS estiloko alerta-leihoak
fa: کادرهای گفتگوی هشدار سبک iOS
fil: Mga dialog ng alerto na may istilong pang-iOS
fr_ca: Dialogues d'alertes de style iOS
gl: Cadros de diálogo de alertas de tipo iOS
gu: iOS-શૈલીના અલર્ટ સંવાદ
he: תיבות דו-שיח של התראות בסגנון iOS
hi: iOS की शैली वाले सूचना डायलॉग
hu: iOS-stílusú értesítési párbeszédpanelek
hy: iOS-ի ոճով ծանուցումների երկխոսության պատուհաններ
id: Dialog notifikasi gaya iOS
it: Finestre di avviso in stile iOS
ja: iOS スタイルのアラート ダイアログ
ka: iOS-ის სტილის გამაფრთხილებელი დიალოგები
km: ប្រអប់​ជូនដំណឹង​ដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿ ಅಲರ್ಟ್ ಡೈಲಾಗ್‌ಗಳು
ko: iOS 스타일 알림 대화상자
ky: iOS стилиндеги билдирме диалогдору
lo: ກ່ອງໂຕ້ຕອບການເຕືອນແບບ iOS
lt: „iOS“ stiliaus įspėjimo dialogų langai
lv: iOS stila brīdinājuma dialoglodziņi
mk: Дијалози за предупредување во iOS-стил
ml: iOS-സ്റ്റൈലിലുള്ള മുന്നറിയിപ്പ് ഡയലോഗുകൾ
mn: iOS загварын сэрэмжлүүлгийн харилцах цонх
mr: iOS शैलीचे सूचना डायलॉग
ms: Dialog makluman gaya iOS
my: iOS-ပုံစံ သတိပေးချက် ဒိုင်ယာလော့ဂ်များ
nb: Dialogbokser for varsler i iOS-stil
ne: iOS शैलीका सतर्कतासम्बन्धी संवादहरू
pa: iOS-ਸਟਾਈਲ ਸੁਚੇਤਨਾ ਵਿੰਡੋ
pl: Okna alertów w stylu iOS
pt: Caixas de diálogos de alerta no estilo iOS
pt_pt: Caixas de diálogo de alertas ao estilo do iOS
ro: Casete de dialog pentru alerte în stil iOS
ru: Диалоговые окна с оповещениями в стиле iOS
si: iOS-විලාස ඇඟවීම් සංවාද
sk: Dialógové okná upozornení v štýle systému iOS
sq: Dialogë sinjalizimi në stilin e iOS
sr: Дијалози обавештења у iOS стилу
sr_latn: Dijalozi obaveštenja u iOS stilu
sv: Varningsrutor i iOS-stil
te: iOS-శైలి అలర్ట్ డైలాగ్‌లు
th: กล่องโต้ตอบการแจ้งเตือนแบบ iOS
tr: iOS tarzı uyarı iletişim kutuları
uk: Діалогове вікно зі сповіщенням у стилі iOS
ur: iOS طرز الرٹ ڈائیلاگز
uz: iOS uslubidagi bildirishnomali muloqot oynasi
vi: Hộp thoại cảnh báo theo kiểu iOS
zh_hk: iOS 樣式的通知對話框
zu: amabhokisi esexwayiso sesitayela se-iOS

# demoCupertinoAlertTitle
source: Alert
af: Opletberig
am: ማንቂያ
ar_eg: تنبيه
as: সতৰ্কবাৰ্তা
az: Xəbərdarlıq
be: Абвестка
bn: সতর্কতা
bs: Obavještenje
ca: Alerta
da: Underretning
es_ar: Alerta
et: Märguanne
eu: Alerta
fa: هشدار
fil: Alerto
fr_ca: Alerte
gl: Alerta
gu: અલર્ટ
he: התראה
hi: सूचना
hu: Figyelmeztetés
hy: Ծանուցում
id: Notifikasi
it: Avviso
ja: アラート
ka: გაფრთხილება
km: ការជូនដំណឹង
kn: ಎಚ್ಚರಿಕೆ
ko: 알림
ky: Эскертүү
lo: ການເຕືອນ
lt: Įspėjimas
lv: Brīdinājums
mk: Предупредување
ml: മുന്നറിയിപ്പ്
mn: Сэрэмжлүүлэг
mr: इशारा
ms: Makluman
my: သတိပေးချက်
nb: Varsel
ne: अलर्ट
pa: ਸੁਚੇਤਨਾ
pt: Alerta
pt_pt: Alerta
ro: Alertă
ru: Оповещение
si: ඇඟවීම
sk: Upozornenie
sq: Sinjalizim
sr: Обавештење
sr_latn: Obaveštenje
sv: Varning
te: అలర్ట్
th: การแจ้งเตือน
tr: Uyarı
uk: Сповіщення
ur: الرٹ
uz: Bildirishnoma
vi: Cảnh báo
zh_hk: 通知
zu: Isexwayiso
