Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# dialogShow
source: SHOW DIALOG
af: WYS DIALOOG
am: ንግግርን አሳይ
ar_eg: عرض مربع الحوار
as: ডায়ল'গ দেখুৱাওক
az: DİALOQU GÖSTƏRİN
be: ПАКАЗАЦЬ ДЫЯЛОГАВАЕ АКНО
bn: ডায়ালগ দেখান
bs: PRIKAŽI DIJALOŠKI OKVIR
ca: MOSTRA EL QUADRE DE DIÀLEG
da: VIS DIALOGBOKS
es_ar: MOSTRAR DIÁLOGO
et: KUVA DIALOOG
eu: ERAKUTSI LEIHOA
fa: نمایش کادر گفتگو
fil: IPAKITA ANG DIALOG
fr_ca: AFFICHER LE DIALOGUE
gl: MOSTRAR CADRO DE DIÁLOGO
gu: સંવાદ બતાવો
he: הצגה של תיבת דו-שיח
hi: डायलॉग दिखाएं
hu: PÁRBESZÉDPANEL MEGJELENÍTÉSE
hy: ՑՈՒՑԱԴՐԵԼ ԵՐԿԽՈՍՈՒԹՅԱՆ ՊԱՏՈՒՀԱՆԸ
id: TAMPILKAN DIALOG
it: MOSTRA FINESTRA DI DIALOGO
ja: ダイアログを表示
ka: დიალოგის ჩვენება
km: បង្ហាញ​ប្រអប់
kn: ಡೈಲಾಗ್ ತೋರಿಸಿ
ko: 대화상자 표시
ky: ДИАЛОГДУ КӨРСӨТҮҮ
lo: ສະແດງກ່ອງໂຕ້ຕອບ
lt: RODYTI DIALOGO LANGĄ
lv: PARĀDĪT DIALOGLODZIŅU
mk: ПРИКАЖИ ГО ДИЈАЛОГОТ
ml: ഡയലോഗ് കാണിക്കുക
mn: ХАРИЛЦАХ ЦОНХЫГ ХАРУУЛАХ
mr: डायलॉग दाखवा
ms: TUNJUKKAN DIALOG
my: ဒိုင်ယာလော့ဂ်ကို ပြရန်
nb: VIS DIALOGBOKS
ne: संवाद देखाउनुहोस्
pa: ਵਿੰਡੋ ਦਿਖਾਓ
pl: WYŚWIETL OKNO
pt: MOSTRAR CAIXA DE DIÁLOGO
pt_pt: MOSTRAR CAIXA DE DIÁLOGO
ro: AFIȘEAZĂ CASETA DE DIALOG
ru: ПОКАЗАТЬ ДИАЛОГОВОЕ ОКНО
si: සංවාදය පෙන්වන්න
sk: ZOBRAZIŤ DIALÓGOVÉ OKNO
sq: SHFAQ DIALOGUN
sr: ПРИКАЖИ ДИЈАЛОГ
sr_latn: PRIKAŽI DIJALOG
sv: VISA DIALOGRUTA
te: డైలాగ్ చూపించు
th: แสดงกล่องโต้ตอบ
tr: İLETİŞİM KUTUSUNU GÖSTER
uk: ПОКАЗАТИ ДІАЛОГОВЕ ВІКНО
ur: ڈائیلاگ باکس دکھائیں
uz: MULOQOT OYNASINI CHIQARISH
vi: HIỂN THỊ HỘP THOẠI
zh_hk: 顯示對話框
zu: BONISA IBHOKISI

# dialogFullscreenTitle
source: Full Screen Dialog
af: Volskermdialoog
am: የሙሉ ማያ ገፅ ንግግር
ar_eg: مربع حوار بملء الشاشة
as: সম্পূর্ণ স্ক্ৰীনৰ ডায়ল'গ
az: Tam Ekran Dialoqu
be: Поўнаэкраннае дыялогавае акно
bn: ফুল-স্ক্রিন ডায়ালগ
bs: DIjaloški okvir preko cijelog ekrana
ca: Quadre de diàleg de pantalla completa
da: Dialogboks i fuld skærm
es_ar: Diálogo de pantalla completa
et: Täisekraanil kuvatud dialoog
eu: Pantaila osoko leihoa
fa: کادر گفتگوی تمام‌صفحه
fil: Full Screen na Dialog
fr_ca: Boîte de dialogue plein écran
gl: Cadro de diálogo de pantalla completa
gu: પૂર્ણ-સ્ક્રીન સંવાદ
he: תיבת דו-שיח במסך מלא
hi: फ़ुल-स्क्रीन वाला डायलॉग
hu: Teljes képernyős párbeszédpanel
hy: Լիաէկրան երկխոսության պատուհան
id: Dialog Layar Penuh
it: Finestra di dialogo a schermo intero
ja: 全画面表示ダイアログ
ka: სრულეკრანიანი დიალოგი
km: ប្រអប់​ពេញអេក្រង់
kn: ಫುಲ್‌ಸ್ಕ್ರೀನ್ ಡೈಲಾಗ್
ko: 전체 화면 대화상자
ky: Толук экрандуу диалог
lo: ກ່ອງໂຕ້ຕອບແບບເຕັມຈໍ
lt: Viso ekrano dialogo langas
lv: Pilnekrāna režīma dialoglodziņš
mk: Дијалог на цел екран
ml: പൂർണ്ണസ്‌ക്രീൻ ഡയലോഗ്
mn: Бүтэн дэлгэцийн харилцах цонх
mr: फुल स्क्रीन डायलॉग
ms: Dialog Skrin Penuh
my: မျက်နှာပြင်အပြည့် ဒိုင်ယာလော့ဂ်
nb: Dialogboks i fullskjerm
ne: फुल स्क्रिन संवाद
pa: ਪੂਰੀ-ਸਕ੍ਰੀਨ ਵਿੰਡੋ
pl: Okno pełnoekranowe
pt: Caixa de diálogo de tela cheia
pt_pt: Caixa de diálogo em ecrã inteiro
ro: Casetă de dialog pe ecran complet
ru: Диалоговое окно в полноэкранном режиме
si: පූර්ණ තිර සංවාදය
sk: Dialógové okno na celú obrazovku
sq: Dialogu në ekran të plotë
sr: Дијалог преко целог екрана
sr_latn: Dijalog preko celog ekrana
sv: Dialogruta i helskärm
te: ఫుల్-స్క్రీన్‌ డైలాగ్
th: กล่องโต้ตอบแบบเต็มหน้าจอ
tr: Tam Ekran İletişim Kutusu
uk: Діалогове вікно на весь екран
ur: پوری اسکرین ڈائیلاگ
uz: Butun ekran rejimidagi muloqot oynasi
vi: Hộp thoại toàn màn hình
zh_hk: 全螢幕對話框
zu: Ibhokisi lesikrini esigcwele

# dialogFullscreenSave
source: SAVE
af: STOOR
am: አስቀምጥ
ar_eg: حفظ
as: ছেভ কৰক
az: YADDA SAXLAYIN
be: ЗАХАВАЦЬ
bn: সেভ করুন
bs: SAČUVAJ
ca: DESA
da: GEM
es_ar: GUARDAR
et: SALVESTA
eu: GORDE
fa: ذخیره
fil: I-SAVE
fr_ca: ENREGISTRER
gl: GARDAR
gu: સાચવો
he: שמירה
hi: सेव करें
hu: MENTÉS
hy: ՊԱՀԵԼ
id: SIMPAN
it: SALVA
ja: 保存
ka: შენახვა
km: រក្សាទុក
kn: ಉಳಿಸಿ
ko: 저장
ky: САКТОО
lo: ບັນທຶກ
lt: IŠSAUGOTI
lv: SAGLABĀT
mk: ЗАЧУВАЈ
ml: സംരക്ഷിക്കുക
mn: ХАДГАЛАХ
mr: सेव्ह करा
ms: SIMPAN
my: သိမ်းရန်
nb: LAGRE
ne: सेभ गर्नुहोस्
pa: ਰੱਖਿਅਤ ਕਰੋ
pl: ZAPISZ
pt: SALVAR
pt_pt: GUARDAR
ro: SALVAȚI
ru: СОХРАНИТЬ
si: සුරකින්න
sk: ULOŽIŤ
sq: RUAJ
sr: САЧУВАЈ
sr_latn: SAČUVAJ
sv: SPARA
te: సేవ్ చేయండి
th: บันทึก
tr: KAYDET
uk: ЗБЕРЕГТИ
ur: محفوظ کریں
uz: SAQLASH
vi: LƯU
zh_hk: 儲存
zu: LONDOLOZA

# dialogFullscreenDescription
source: A full screen dialog demo
af: 'n Volskermdialoogdemonstrasie
am: የሙሉ ማያ ገፅ ንግግር ተግባራዊ ማሳያ
ar_eg: عرض توضيحي لمربع حوار بملء الشاشة
as: এটা সম্পূর্ণ স্ক্ৰীনৰ ডায়ল'গ ডেম’
az: Tam ekran dialoq demosu
be: Дэманстрацыя поўнаэкраннага дыялогавага акна
bn: ফুল-স্ক্রিন ডায়ালগ ডেমো
bs: Demo prikaz dijaloškog okvira preko cijelog ekrana
ca: Demostració d'un quadre de diàleg de pantalla completa
da: Demonstration af en dialogboks i fuld skærm
es_ar: Una demostración de diálogo de pantalla completa
et: Täisekraanil kuvatud dialoogi demo
eu: Pantaila osoko leiho baten demoa
fa: پخش نمایشی کادر گفتگویی تمام‌صفحه
fil: Demo ng full screen na dialog
fr_ca: Une démonstration d'un dialogue en plein écran
gl: Unha demostración dun cadro de diálogo de pantalla completa
gu: પૂર્ણ-સ્ક્રીન સંવાદ ડેમો
he: הדגמה של תיבת דו-שיח במסך מלא
hi: फ़ुल-स्क्रीन वाला डायलॉग डेमो
hu: Teljes képernyős párbeszédpanel demója
hy: Երկխոսության լիաէկրան պատուհանի դեմո
id: Demo dialog layar penuh
it: Finestra di dialogo demo a schermo intero
ja: 全画面表示ダイアログのデモ
ka: სრულეკრანიან დიალოგის დემონსტრაცია
km: ការបង្ហាញអំពី​ប្រអប់​ពេញអេក្រង់
kn: ಫುಲ್‌ಸ್ಕ್ರೀನ್ ಡೈಲಾಗ್ ಡೆಮೋ
ko: 전체 화면 대화상자 데모
ky: Толук экрандуу диалогдун демо версиясы
lo: ເດໂມກ່ອງໂຕ້ຕອບແບບເຕັມຈໍ
lt: Viso ekrano dialogo lango demonstracinė versija
lv: Pilnekrāna režīma dialoglodziņa demonstrācija
mk: Демонстрација за дијалог на цел екран
ml: പൂർണ്ണ സ്‌ക്രീൻ ഡയലോഗ് ഡെമോ
mn: Бүтэн дэлгэцийн харилцах цонхны демо
mr: फुल स्क्रीन डायलॉग डेमो
ms: Demo dialog skrin penuh
my: မျက်နှာပြင်အပြည့် ဒိုင်ယာလော့ဂ်သရုပ်ပြ
nb: En demonstrasjon av dialogboks i fullskjerm
ne: संवादको फुल स्क्रिन डेमो
pa: ਪੂਰੀ-ਸਕ੍ਰੀਨ ਵਿੰਡੋ ਦਾ ਡੈਮੋ
pl: Prezentacja okna pełnoekranowego
pt: Uma demonstração de caixa de diálogo em tela cheia
pt_pt: Uma demonstração de uma caixa de diálogo em ecrã inteiro
ro: Exemplu de casetă de dialog pe ecran complet
ru: Демоверсия диалогового окна в полноэкранном режиме.
si: සම්පූර්ණ තිර සංවාද ආදර්ශනයකි
sk: Ukážka dialógového okna na celú obrazovku
sq: Një demonstrim dialogu me ekran të plotë
sr: Демонстрација дијалога на целом екрану
sr_latn: Demonstracija dijaloga na celom ekranu
sv: En dialogrutedemo i helskärm
te: ఫుల్-స్క్రీన్‌ డైలాగ్ డెమో
th: การสาธิตกล่องโต้ตอบแบบเต็มหน้าจอ
tr: Tam ekran iletişim kutusu demosu
uk: Демо-версія діалогового вікна на весь екран
ur: ایک پوری اسکرین ڈائیلاگ ڈیمو
uz: Butun ekran rejimidagi muloqot oynasining demo versiyasi
vi: Minh họa hộp thoại toàn màn hình
zh_hk: 全螢幕對話框示範
zu: Idemo yebhokisi lesikrini esigcwele

# cupertinoButtonWithBackground
source: With Background
af: Met agtergrond
am: ከበስተጀርባ ጋር
ar_eg: زر مزوّد بخلفية
as: নেপথ্যৰ সৈতে
az: Arxa fonlu
be: З фонам
bn: ব্যাকগ্রাউন্ড সহ
bs: S pozadinom
ca: Amb fons
da: Med baggrund
es_ar: Con fondo
et: Koos taustaga
eu: Atzeko planoarekin
fa: دارای پس‌زمینه
fil: May Background
fr_ca: Avec arrière-plan
gl: Con fondo
gu: બૅકગ્રાઉન્ડની સાથે
he: עם רקע
hi: बैकग्राउंड के साथ
hu: Háttérrel
hy: Ֆոնով
id: Dengan Latar Belakang
it: Con sfondo
ja: 背景付き
ka: თეთრი ფონი
km: មាន​ផ្ទៃខាងក្រោយ
kn: ಹಿನ್ನೆಲೆ ಒಳಗೊಂಡಂತೆ
ko: 배경 포함
ky: Фону менен
lo: ມີພື້ນຫຼັງ
lt: Su fonu
lv: Ar fonu
mk: Со заднина
ml: പശ്ചാത്തലവുമായി
mn: Арын дэвсгэртэй
mr: बॅकग्राउंडसह
ms: Dengan Latar Belakang
my: နောက်ခံနှင့်
nb: Med bakgrunn
ne: पृष्ठभूमिसहितको
pa: ਬੈਕਗ੍ਰਾਊਂਡ ਨਾਲ
pl: Z tłem
pt: Com plano de fundo
pt_pt: Com fundo
ro: Cu fundal
ru: С фоном
si: පසුබිම සමග
sk: S pozadím
sq: Me sfond
sr: Са позадином
sr_latn: Sa pozadinom
sv: Med bakgrund
te: బ్యాక్‌గ్రౌండ్‌తో
th: มีพื้นหลัง
tr: Arka Planı Olan
uk: З фоном
ur: پس منظر کے ساتھ
uz: Orqa fon bilan
vi: Có nền
zh_hk: 設有背景
zu: Nengemuva

# cupertinoAlertCancel
source: Cancel
af: Kanselleer
am: ተወው
ar_eg: إلغاء
as: বাতিল কৰক
az: Ləğv edin
be: Скасаваць
bn: বাতিল করুন
bs: Otkaži
ca: Cancel·la
da: Annuller
es_ar: Cancelar
et: Tühista
eu: Utzi
fa: لغو
fil: Kanselahin
fr_ca: Annuler
gl: Cancelar
gu: રદ કરો
he: ביטול
hi: रद्द करें
hu: Mégse
hy: Չեղարկել
id: Batal
it: Annulla
ja: キャンセル
ka: გაუქმება
km: បោះបង់
kn: ರದ್ದುಗೊಳಿಸಿ
ko: 취소
ky: Жокко чыгаруу
lo: ຍົກເລີກ
lt: Atšaukti
lv: Atcelt
mk: Откажи
ml: റദ്ദാക്കുക
mn: Цуцлах
mr: रद्द करा
ms: Batal
my: မလုပ်တော့
nb: Avbryt
ne: रद्द गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: Anuluj
pt: Cancelar
pt_pt: Cancelar
ro: Anulați
ru: Отмена
si: අවලංගු කරන්න
sk: Zrušiť
sq: Anulo
sr: Откажи
sr_latn: Otkaži
sv: Avbryt
te: రద్దు చేయండి
th: ยกเลิก
tr: İptal
uk: Скасувати
ur: منسوخ کریں
uz: Bekor qilish
vi: Hủy
zh_hk: 取消
zu: Khansela

# cupertinoAlertDiscard
source: Discard
af: Gooi weg
am: አስወግድ
ar_eg: تجاهل
as: প্ৰত্যাখ্যান কৰক
az: İmtina edin
be: Адхіліць
bn: বাতিল করুন
bs: Odbaci
ca: Descarta
da: Kassér
es_ar: Descartar
et: Loobu
eu: Baztertu
fa: صرف‌نظر کردن
fil: I-discard
fr_ca: Supprimer
gl: Descartar
gu: કાઢી નાખો
he: סגירה
hi: खारिज करें
hu: Elvetés
hy: Հեռացնել
id: Hapus
it: Annulla
ja: 破棄
ka: გაუქმება
km: លុបចោល
kn: ತ್ಯಜಿಸಿ
ko: 삭제
ky: Өчүрүү
lo: ຍົກເລີກ
lt: Atmesti
lv: Atmest
mk: Отфрли
ml: നിരസിക്കുക
mn: Болих
mr: काढून टाका
ms: Buang
my: ဖယ်ပစ်ရန်
nb: Forkast
ne: खारेज गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: Odrzuć
pt: Descartar
pt_pt: Rejeitar
ro: Renunțați
ru: Удалить
si: ඉවත ලන්න
sk: Zahodiť
sq: Hidh poshtë
sr: Одбаци
sr_latn: Odbaci
sv: Släng
te: విస్మరించు
th: ทิ้ง
tr: Sil
uk: Відхилити
ur: رد کریں
uz: Bekor qilish
vi: Hủy
zh_hk: 捨棄
zu: Lahla

# cupertinoAlertLocationTitle
source: Allow "Maps" to access your location while you are using the app?
af: Laat "Maps" toe om toegang tot jou ligging te kry terwyl jy die program gebruik?
am: የእርስዎ መገኛ አካባቢ እርስዎ መተግበሪያውን እየተጠቀሙ እንዳሉ እንዲደርስበት ለ "ካርታዎች" ይፈቀድ?
ar_eg: هل تريد السماح لخدمة "خرائط Google" بالدخول إلى موقعك الجغرافي أثناء استخدام التطبيق؟
as: আপুনি এপ্‌টো ব্যৱহাৰ কৰি থাকোঁতে "Maps"ক আপোনাৰ অৱস্থান এক্সেছ কৰিবলৈ অনুমতি দিবনে?
az: Tətbiqdən istifadə etdiyiniz zaman "Xəritə"yə məkanınıza giriş imkanı verilsin?
be: Дазволіць "Картам" мець доступ да звестак пра ваша месцазнаходжанне падчас выкарыстання праграмы?
bn: অ্যাপ ব্যবহার করার সময়ে "Maps"-কে আপনার লোকেশন অ্যাক্সেস করার অনুমতি দিতে চান?
bs: Dozvoliti "Mapama" pristup vašoj lokaciji dok koristite aplikaciju?
ca: Vols permetre que Maps accedeixi a la teva ubicació quan utilitzis l'aplicació?
da: Vil du give "Maps" adgang til din lokation, når du bruger appen?
es_ar: ¿Quieres permitir que "Maps" acceda a tu ubicación mientras usas la app?
et: Kas anda rakendusele „Maps" juurdepääs teie asukohale, kui rakendust kasutate?
eu: Aplikazioa erabili bitartean kokapena erabiltzeko baimena eman nahi diozu Maps-i?
fa: به «Maps» اجازه داده شود هنگامی که از برنامه موردنظر استفاده می‌کنید به مکان شما دسترسی پیدا کند؟
fil: Payagan ang "Maps" na i-access ang iyong lokasyon habang ginagamit mo ang app?
fr_ca: Permettre à « Maps » d'accéder à votre position lorsque vous utilisez l'application?
gl: Queres permitir que Maps acceda á túa localización mentres utilizas a aplicación?
gu: તમે ઍપનો ઉપયોગ કરી રહ્યાં હો તે વખતે "Maps"ને તમારા સ્થાનના ઍક્સેસની મંજૂરી આપીએ?
he: האם לתת למפות Google גישה למיקום שלך בעת שימוש באפליקציה?
hi: क्या आप ऐप्लिकेशन का इस्तेमाल करते समय "Maps" को अपनी जगह की जानकारी ऐक्सेस करने की अनुमति देना चाहते हैं?
hu: Engedélyezi a „Térkép” számára a hozzáférést tartózkodási helyéhez, amíg az alkalmazást használja?
hy: Քարտեզներին հասանելի դարձնե՞լ ձեր տեղադրությանը, երբ օգտագործում եք հավելվածը
id: Izinkan "Maps" mengakses lokasi Anda selagi Anda menggunakan aplikasi?
it: Consentire a "Maps" di accedere alla tua posizione mentre usi l'app?
ja: マップアプリの使用中に「マップ」に位置情報にアクセスすることを許可しますか？
ka: გსურთ, Maps-ს ჰქონდეს წვდომა თქვენს მდებარეობაზე ამ აპის გამოყენებისას?
km: អនុញ្ញាតឱ្យ "ផែនទី" ចូលប្រើ​ទីតាំង​របស់អ្នក នៅពេល​អ្នកកំពុង​ប្រើកម្មវិធីនេះ​ឬ?
kn: ನೀವು ಆ್ಯಪ್ ಬಳಸುತ್ತಿರುವಾಗ ನಿಮ್ಮ ಸ್ಥಳವನ್ನು ಪ್ರವೇಶಿಸಲು "Maps" ಗೆ ಅನುಮತಿಸುವುದೇ?
ko: '지도'를 사용하는 동안 앱에서 사용자의 위치에 액세스할 수 있도록 허용할까요?
ky: "Карталарга" сиз колдонмону пайдаланып жаткан учурда жайгашкан жериңизге кирүүгө уруксат берилсинби?
lo: ອະນຸຍາດໃຫ້ "ແຜນທີ່" ເຂົ້າເຖິງສະຖານທີ່ຂອງທ່ານໄດ້ໃນຂະນະທີ່ທ່ານກຳລັງໃຊ້ແອັບບໍ?
lt: Leisti Žemėlapiams pasiekti vietovę jums naudojant programą?
lv: Vai ļaut lietotnei “Maps” piekļūt jūsu atrašanās vietai, kad izmantojat šo lietotni?
mk: Да се дозволи „Карти“ да пристапува до вашата локација додека ја користите апликацијата?
ml: ആപ്പ് ഉപയോഗിക്കുമ്പോൾ നിങ്ങളുടെ ലൊക്കേഷൻ ആക്‌സസ് ചെയ്യാൻ "Maps"-നെ അനുവദിക്കണോ?
mn: Та "Газрын зураг" аппыг ашиглах явцад үүнд таны байршилд хандахыг зөвшөөрөх үү?
mr: तुम्ही अ‍ॅप वापरत असताना "Maps" ला तुमचे स्थान ॲक्सेस करण्याची अनुमती द्यायची का?
ms: Benarkan "Peta" mengakses lokasi anda semasa anda menggunakan apl?
my: အက်ပ်ကို အသုံးပြုနေစဉ် သင့်တည်နေရာကို "Maps" အားအသုံးပြုခွင့် ပေးလိုသလား။
nb: Vil du gi «Maps» tilgang til posisjonen din når du bruker appen?
ne: एपको प्रयोग गर्दा "नक्सा" लाई आफ्नो स्थानसम्बन्धी जानकारीमाथि पहुँच राख्न दिने हो?
pa: ਕੀ ਤੁਹਾਡੇ ਵੱਲੋਂ ਐਪ ਦੀ ਵਰਤੋਂ ਕਰਨ ਵੇਲੇ "Maps" ਨੂੰ ਤੁਹਾਡੇ ਟਿਕਾਣੇ ਤੱਕ ਪਹੁੰਚ ਦੇਣੀ ਹੈ?
pl: Zezwolić „Mapom” na dostęp do Twojej lokalizacji, gdy używasz aplikacji?
pt: Permitir que o "Maps" acesse seu local enquanto você estiver usando o app?
pt_pt: Permitir que o "Maps" aceda à sua localização enquanto estiver a utilizar a aplicação?
ro: Permiteți ca Maps să vă acceseze locația când folosiți aplicația?
ru: Разрешить Картам доступ к вашему местоположению при работе с приложением?
si: ඔබ යෙදුම භාවිත කරමින් සිටින අතරතුර "සිතියම්" හට ඔබේ ස්ථානයට ප්‍රවේශ වීමට ඉඩ දෙන්නද?
sk: Chcete povoliť Mapám prístup k vašej polohe, keď túto aplikáciu používate?
sq: Dëshiron të lejosh që "Maps" të ketë qasje te vendndodhja jote ndërkohë që je duke përdorur aplikacionin?
sr: Желите ли да дозволите да Мапе приступају вашој локацији док користите ту апликацију?
sr_latn: Želite li da dozvolite da Mape pristupaju vašoj lokaciji dok koristite tu aplikaciju?
sv: Vill du tillåta att Maps får åtkomst till din plats när du använder appen?
te: యాప్‌ని ఉపయోగిస్తున్నప్పుడు మీ లొకేషన్‌ని యాక్సెస్ చేసేందుకు "Maps"ని అనుమతించాలా?
th: อนุญาตให้ Maps เข้าถึงตำแหน่งของคุณขณะที่ใช้แอปหรือไม่
tr: Uygulamayı kullanırken "Haritalar"ın konumunuza erişmesine izin verilsin mi?
uk: Надавати Картам доступ до геоданих, коли ви використовуєте додаток?
ur: جب آپ ایپ استعمال کر رہے ہوں تو "Maps" کو اپنے مقام تک رسائی حاصل کرنے دیں؟
uz: Ilovalardan foydalanishdan oldin “Xaritalar” ilovasiga joylashuv axborotidan foydalanishga ruxsat berasizmi?
vi: Cho phép "Maps" sử dụng thông tin vị trí của bạn khi bạn đang dùng ứng dụng?
zh_hk: 要允許「Google 地圖」在您使用時存取位置資訊嗎？
zu: Vumela okuthi "Amamephu" ukuze ufinyelele kundawo yakho ngenkathi usebenzisa uhlelo lokusebenza?

# cupertinoAlertLocationDescription
source: Your current location will be displayed on the map and used for directions, nearby search results, and estimated travel times.
af: Jou huidige ligging sal op die kaart gewys word en gebruik word vir aanwysings, soekresultate in die omtrek, en geskatte reistye.
am: የእርስዎ አሁን ያሉበት መገኛ አካባቢ በካርታው ላይ ይታያል እንዲሁም ለአቅጣጫዎች፣ በአቅራቢያ ያሉ ፍለጋ ውጤቶች እና የሚገመቱ የጉዞ ጊዜያት ጥቅም ላይ ይውላል።
ar_eg: سيتم عرض الموقع الجغرافي الحالي على الخريطة واستخدامه لتوفير الاتجاهات ونتائج البحث عن الأماكن المجاورة وأوقات التنقّل المقدرة.
as: আপোনাৰ বর্তমানৰ অৱস্থানটো মেপত প্ৰদর্শন কৰা হ'ব আৰু দিক্-নিৰ্দেশনাসমূহ, নিকটৱৰ্তী সন্ধানৰ ফলাফলসমূহ আৰু আনুমানিক যাত্ৰাৰ সময়বোৰৰ বাবে এইটো ব্যৱহাৰ কৰা হ'ব।
az: Cari məkanınız xəritədə göstəriləcək və istiqamətlər, yaxınlıqdakı axtarış nəticələri və təqribi səyahət vaxtları üçün istifadə ediləcək.
be: Ваша месцазнаходжанне будзе паказвацца на карце і выкарыстоўвацца для пракладкі маршрутаў, пошуку месцаў паблізу і вызначэння прыкладнага часу паездак.
bn: আপনার বর্তমান লোকেশন ম্যাপে দেখানো হবে এবং সেই সাথে দিকনির্দেশের ও আশেপাশের সার্চের ফলাফলের জন্য ব্যবহার হবে এবং যাত্রাপথের আনুমানিক সময় জানতে ব্যবহার হবে।
bs: Vaša trenutna lokacija bit će prikazana na mapi i koristit će se za smjernice, rezultate pretraživanje stvari u blizini i procjenu trajanja putovanja.
ca: La teva ubicació actual es mostrarà al mapa i s'utilitzarà per donar indicacions, oferir resultats propers de cerca i indicar la durada estimada dels trajectes.
da: Din aktuelle lokation vises på kortet og bruges til rutevejledning, søgeresultater i nærheden og til at beregne rejsetider.
es_ar: Tu ubicación actual se mostrará en el mapa y se usará para obtener instrucciones sobre cómo llegar a lugares, resultados cercanos de la búsqueda y tiempos de viaje aproximados.
et: Teie praegune asukoht kuvatakse kaardil ja seda kasutatakse juhiste, läheduses leiduvate otsingutulemuste ning hinnanguliste reisiaegade pakkumiseks.
eu: Oraingo kokapena mapan bistaratuko da, eta jarraibideak, inguruko bilaketa-emaitzak eta bidaien estimatutako iraupena emango dira.
fa: مکان فعلی‌تان روی نقشه نشان داده می‌شود و از آن برای تعیین مسیرها، نتایج جستجوی اطراف، و زمان‌های سفر تخمینی استفاده می‌شود.
fil: Ipapakita sa mapa ang kasalukuyan mong lokasyon at gagamitin ito para sa mga direksyon, resulta ng paghahanap sa malapit, at tinatantyang tagal ng pagbiyahe.
fr_ca: Votre position actuelle sera affichée sur la carte et sera utilisée pour les itinéraires, les résultats de recherche à proximité et l'estimation des durées de déplacement.
gl: A túa localización actual mostrarase no mapa e utilizarase para obter indicacións, resultados de busca próximos e duracións estimadas de viaxes.
gu: નકશા પર તમારું વર્તમાન સ્થાન બતાવવામાં આવશે અને દિશા નિર્દેશો, નજીકના શોધ પરિણામ અને મુસાફરીના અંદાજિત સમયને બતાવવા માટે તેનો ઉપયોગ કરવામાં આવશે.
he: המיקום הנוכחי שלך יוצג במפה וישמש להצגת מסלול, תוצאות חיפוש למקומות בסביבה וזמני נסיעות משוערים.
hi: मैप पर आपकी मौजूदा जगह की जानकारी दिखाई जाएगी. इसका इस्तेमाल रास्ते दिखाने, आस-पास खोज के नतीजे दिखाने, और किसी जगह जाने में लगने वाले कुल समय के लिए किया जाएगा.
hu: Aktuális tartózkodási helye megjelenik a térképen, és a rendszer felhasználja az útvonaltervekhez, a közelben lévő keresési eredményekhez és a becsült utazási időkhöz.
hy: Ձեր ընթացիկ գտնվելու վայրը կցուցադրվի քարտեզի վրա և կօգտագործվի երթուղիների, ճշգրիտ որոնման արդյունքների և ճանապարհի տևողության համար։
id: Lokasi Anda saat ini akan ditampilkan di peta dan digunakan untuk rute, hasil penelusuran di sekitar, dan estimasi waktu tempuh.
it: La tua posizione corrente verrà mostrata sulla mappa e usata per le indicazioni stradali, i risultati di ricerca nelle vicinanze e i tempi di percorrenza stimati.
ja: 現在の位置情報が地図に表示され、経路、近くの検索結果、予想所要時間に使用されます。
ka: რუკაზე გამოჩნდება თქვენი ამჟამინდელი მდებარეობა, რომელიც გამოყენებული იქნება მითითებებისთვის, ახლომდებარე ტერიტორიაზე ძიების შედეგებისთვის და მგზავრობის სავარაუდო დროის გამოსათვლელად.
km: ទីតាំង​បច្ចុប្បន្ន​របស់អ្នកនឹង​បង្ហាញ​នៅលើផែនទី និង​ត្រូវបានប្រើសម្រាប់​ទិសដៅ លទ្ធផលស្វែងរក​ដែលនៅជិត និង​រយៈពេល​ធ្វើដំណើរដែល​បាន​ប៉ាន់ស្មាន។
kn: ನಿಮ್ಮ ಪ್ರಸ್ತುತ ಸ್ಥಳವನ್ನು Map ನಲ್ಲಿ ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಾಗುತ್ತದೆ ಮತ್ತು ನಿರ್ದೇಶನಗಳು, ಹತ್ತಿರದ ಹುಡುಕಾಟ ಫಲಿತಾಂಶಗಳು ಮತ್ತು ಅಂದಾಜಿಸಿದ ಪ್ರಯಾಣದ ಸಮಯಗಳಿಗಾಗಿ ಬಳಸಲಾಗುತ್ತದೆ.
ko: 현재 위치가 지도에 표시되며 길안내, 근처 검색결과, 예상 소요 시간 계산에 사용됩니다.
ky: Учурдагы жайгашкан жериңиз картада көрсөтүлүп, багыттарды, жакын жерлерди издөө жыйынтыктарын жана болжолдуу саякаттоо убакытын аныктоо үчүн колдонулат.
lo: ສະຖານທີ່ປັດຈຸບັນຂອງທ່ານຈະຖືກສະແດງຢູ່ແຜນທີ່ ແລະ ຖືກໃຊ້ເພື່ອເສັ້ນທາງ, ຜົນການຊອກຫາທີ່ຢູ່ໃກ້ຄຽງ ແລະ ເວລາເດີນທາງໂດຍປະມານ.
lt: Jūsų dabartinė vietovė bus pateikta žemėlapyje ir naudojama nuorodoms, paieškos rezultatams netoliese ir apskaičiuotam kelionės laikui rodyti.
lv: Kartē tiks attēlota jūsu pašreizējā atrašanās vieta, un tā tiks izmantota, lai sniegtu norādes, parādītu tuvumā esošus meklēšanas rezultātus un noteiktu aptuvenu ceļā pavadāmo laiku.
mk: Вашата моментална локација ќе се прикаже на картата и ќе се користи за насоки, резултати од пребрувањето во близина и проценети времиња за патување.
ml: നിങ്ങളുടെ നിലവിലെ ലൊക്കേഷൻ, മാപ്പിൽ പ്രദർശിപ്പിക്കുകയും ദിശകൾ, സമീപത്തുള്ള തിരയൽ ഫലങ്ങൾ, കണക്കാക്കിയ യാത്രാ സമയങ്ങൾ എന്നിവയ്ക്ക് ഉപയോഗിക്കുകയും ചെയ്യും.
mn: Таны одоогийн байршил газрын зураг дээр үзэгдэх бөгөөд үүнийг чиглэл, ойролцоох хайлтын илэрц болон очих хугацааг тооцоолоход ашиглана.
mr: तुमचे सध्याचे स्थान नकाशावर दाखवले जाईल आणि दिशानिर्देश, जवळपासचे शोध परिणाम व प्रवासाचा अंदाजे वेळ दाखवण्यासाठी वापरले जाईल.
ms: Lokasi semasa anda akan dipaparkan pada peta dan digunakan untuk menunjuk arah, hasil carian tempat berdekatan dan anggaran waktu perjalanan.
my: သင့်လက်ရှိ တည်နေရာကို မြေပုံပေါ်တွင် ဖော်ပြမည်ဖြစ်ပြီး လမ်းညွှန်ချက်များ၊ အနီးနားရှိ ရှာဖွေမှုရလဒ်များနှင့် ခန့်မှန်းခြေ ခရီးသွားချိန်များအတွက် အသုံးပြုသွားပါမည်။
nb: Den nåværende posisjonen din vises på kartet og brukes til veibeskrivelser, søkeresultater i nærheten og beregnede reisetider.
ne: तपाईंको वर्तमान स्थानसम्बन्धी जानकारी नक्सामा देखाइने छ र यसलाई दिशानिर्देशन, वरपरका खोज परिणाम र यात्राको अनुमानित समय देखाउनका लागि प्रयोग गरिने छ।
pa: ਤੁਹਾਡਾ ਮੌਜੂਦਾ ਟਿਕਾਣਾ ਨਕਸ਼ੇ 'ਤੇ ਦਿਸੇਗਾ ਅਤੇ ਇਸਦੀ ਵਰਤੋਂ ਦਿਸ਼ਾਵਾਂ, ਨਜ਼ਦੀਕੀ ਖੋਜ ਨਤੀਜਿਆਂ ਅਤੇ ਯਾਤਰਾ ਦੇ ਅੰਦਾਜ਼ਨ ਸਮਿਆਂ ਲਈ ਕੀਤੀ ਜਾਵੇਗੀ।
pl: Twoja bieżąca lokalizacja będzie wyświetlana na mapie i używana do pokazywania trasy, wyników wyszukiwania w pobliżu oraz szacunkowych czasów podróży.
pt: Seu local atual será exibido no mapa e usado para rotas, resultados da pesquisa por perto e tempo estimado de viagem.
pt_pt: A sua localização atual será apresentada no mapa e utilizada para direções, resultados da pesquisa nas proximidades e tempos de chegada estimados.
ro: Locația dvs. actuală va fi afișată pe hartă și folosită pentru indicații de orientare, rezultate ale căutării din apropiere și duratele de călătorie estimate.
ru: Ваше текущее местоположение будет показываться на карте и использоваться для составления маршрутов, выдачи актуальных результатов поиска и расчета времени в пути.
si: ඔබේ වත්මන් ස්ථානය සිතියමේ සංදර්ශනය වී දිශාවන්, අවට සෙවීම් ප්‍රතිඵල සහ ඇස්තමේන්තුගත සංචාර වේලාවන් සඳහා භාවිත කරනු ඇත.
sk: Vaša aktuálna poloha sa zobrazí na mape a budú sa pomocou nej vyhľadávať trasy, výsledky vyhľadávania v okolí a odhadované časy cesty.
sq: Vendndodhja jote aktuale do të shfaqet në hartë dhe do të përdoret për udhëzime, rezultate të kërkimeve në afërsi dhe kohën e përafërt të udhëtimit.
sr: Актуелна локација ће се приказивати на мапама и користи се за путање, резултате претраге за ствари у близини и процењено трајање путовања.
sr_latn: Aktuelna lokacija će se prikazivati na mapama i koristi se za putanje, rezultate pretrage za stvari u blizini i procenjeno trajanje putovanja.
sv: Din aktuella plats visas på kartan och används för vägbeskrivningar, sökresultat i närheten och beräknade resetider.
te: మీ ప్రస్తుత లొకేషన్ మ్యాప్‌లో ప్రదర్శించబడుతుంది, అలాగే దిశలు, సమీప శోధన ఫలితాలు మరియు అంచనా ప్రయాణ సమయాల కోసం ఉపయోగించబడుతుంది.
th: ตำแหน่งปัจจุบันของคุณจะแสดงในแผนที่และใช้เพื่อแสดงคำแนะนำ ผลการค้นหาใกล้เคียง และเวลาเดินทางโดยประมาณ
tr: Geçerli konumunuz haritada gösterilecek, yol tarifleri, yakındaki arama sonuçları ve tahmini seyahat süreleri için kullanılacak.
uk: Ваше поточне місцезнаходження відображатиметься на карті й використовуватиметься для прокладання маршрутів, пошуку закладів поблизу та прогнозування часу на дорогу.
ur: آپ کا موجودہ مقام نقشے پر دکھایا جائے گا اور اس کا استعمال ڈائریکشنز، تلاش کے قریبی نتائج، اور سفر کے تخمینی اوقات کے لیے کیا جائے گا۔
uz: Joriy joylashuvingiz xaritada chiqadi va yoʻnalishlarni aniqlash, yaqin-atrofdagi qidiruv natijalari, qolgan sayohat vaqtlarini chiqarish uchun kerak boʻladi.
vi: Vị trí hiện tại của bạn sẽ hiển thị trên bản đồ và dùng để xác định đường đi, kết quả tìm kiếm ở gần và thời gian đi lại ước đoán.
zh_hk: 您的目前位置會在地圖上顯示，並用於路線、附近搜尋結果和預計的行程時間。
zu: Indawo yakho yamanje izoboniswa kumephu iphinde isetshenziselwe izikhombisi-ndlela, imiphumela yosesho oluseduze, nezikhathi zokuvakasha ezilinganisiwe.
