Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSharedYAxisDemoInstructions
source: Sort by "Recently Played"
af: Rangskik volgens "Onlangs gespeel"
am: በ«ቅርብ በተጫወቱ» ደርድር
ar_eg: ترتيب حسب "الأغاني المشغّلة مؤخرًا"
as: "শেহতীয়াকৈ প্লে’ কৰা" অনুসৰি সজাওক
az: "Son Oxudulanlar" üzrə çeşidləyin
be: Парадак сартавання: "Нядаўна прайгравалася"
bn: "সম্প্রতি চালানো হয়েছে" হিসেবে সাজান
bs: Poredaj prema kriteriju "Nedavno slušano"
ca: Ordena per Reproduït recentment
da: Sortér efter "Hørt for nylig"
es_ar: Ordenado por "Reproducido recientemente"
et: Sortimisalus „Hiljuti esitatud”
eu: Ordenatu "Erreproduzitutako azkenak" irizpidearen arabera
fa: مرتب‌سازی براساس «پخش‌شده‌های اخیر»
fil: Pagbukud-bukurin ayon sa "Na-play Kamakailan"
fr_ca: Trier par « Écouté récemment »
gl: Ordenar por Reproducidas recentemente
gu: "તાજેતરમાં ચલાવેલા" અનુસાર સૉર્ટ કરો
he: מיון לפי "הושמעו לאחרונה"
hi: "हाल ही में चलाए गए" के क्रम में लगाएं
hu: Rendezés a „Nemrég lejátszott” lehetőség szerint
hy: Տեսակավորել ըստ «Վերջերս նվագարկված» պարամետրի
id: Urutkan menurut "Baru Diputar"
it: Ordina per "Riproduzioni recenti"
ja: [最近再生した曲] で並べ替え
ka: დალაგება პრინციპით „ცოტა ხნის წინ დაკრული“
km: តម្រៀបតាម "ទើបតែ​លេង​ហើយ"
kn: "ಇತ್ತೀಚೆಗೆ ಪ್ಲೇ ಮಾಡಿರುವುದು" ಮೂಲಕ ವಿಂಗಡಿಸಿ
ko: '최근 재생' 기준으로 정렬
ky: "Акыркы ойнолгондор" боюнча иреттөө
lo: ຈັດຮຽງຕາມ "ຫຼິ້ນຫຼ້າສຸດ"
lt: Rūšiuoti pagal „Neseniai leista“
lv: Kārtot pēc tā, cik nesen atskaņots
mk: Подреди според „Неодамна слушани“
ml: "അടുത്തിടെ പ്ലേ ചെയ്‌തത്" പ്രകാരം അടുക്കുക
mn: "Хамгийн сүүлд тоглуулснаар" эрэмбэлэх
mr: "अलीकडे प्ले केलेली" यानुसार क्रमाने लावा
ms: Isih mengikut "Dimainkan Baru-baru Ini"
my: "မကြာသေးမီက ဖွင့်ခဲ့သည်" အရ စီပါ
nb: Sorter etter «Spilt av nylig»
ne: "हालसालै प्ले गरिएका" अनुसार क्रमबद्ध गर्नुहोस्
pa: "ਹਾਲ ਹੀ ਵਿੱਚ ਚਲਾਏ ਗਏ" ਮੁਤਾਬਕ ਕ੍ਰਮ-ਬੱਧ ਕਰੋ
pl: Sortuj według opcji „Ostatnio odtwarzane”
pt: Ordenar por "Tocados recentemente"
pt_pt: Ordene por "Reproduzidas recentemente".
ro: Sortați după „Redate recent”
ru: Сортировать, используя фильтр "Слушали недавно"
si: "මෑතකදී වාදනය කළ" අනුව අනුපිළිවෙළට සකසන්න
sk: Zoradiť podľa nedávno počúvaných
sq: Rendit sipas "Të luajturave së fundi"
sr: Сортирај по критеријуму Недавно слушано
sr_latn: Sortiraj po kriterijumu Nedavno slušano
sv: Sortera efter Nyligen spelade
te: "ఇటీవల ప్లే చేసినవి" ఆధారంగా క్రమపద్ధతిలో అమర్చండి
th: เรียงตาม "ฟังล่าสุด"
tr: "Son Çalınanlar"a göre sıralama
uk: Параметр сортування "Нещодавно відтворене"
ur: "حال ہی میں چلائے گئے" کے لحاظ سے ترتیب دیں
uz: “Yaqinda tinglangan” filtri bilan saralash
vi: Lọc theo mục "Phát gần đây"
zh_hk: 按「最近播放」排序
zu: Hlunga ngokuthi "Okudlalwe Kamuva"

# demoTextButtonTitle
source: Text Button
af: Teksknoppie
am: የጽሑፍ አዝራር
ar_eg: زر نصي
as: পাঠ বুটাম
az: Mətn Düyməsi
be: Тэкставая кнопка
bn: টেক্সট বোতাম
bs: Dugme za tekst
ca: Botó de text
da: Tekstknap
es_ar: Botón plano
et: Tekstinupp
eu: Botoi lauak
fa: دکمه نوشتاری
fil: Button na Text
fr_ca: Bouton plat
gl: Botón de texto
gu: ટેક્સ્ટ બટન
he: לחצן הטקסט
hi: टेक्स्ट बटन
hu: Szöveg gomb
hy: Տեքստային կոճակ
id: Tombol Teks
it: Pulsante di testo
ja: テキストボタン
ka: ტექსტის ღილაკი
km: ប៊ូតុងអត្ថបទ
kn: ಪಠ್ಯದ ಬಟನ್
ko: 텍스트 버튼
ky: Текст баскычы
lo: ປຸ່ມຂໍ້ຄວາມ
lt: Tekstinis mygtukas
lv: Teksta poga
mk: Копче за текст
ml: ടെക്‌സ്‌റ്റ് ബട്ടൺ
mn: Текстийн товчлуур
mr: मजकूर बटण
ms: Butang Teks
my: စာသားခလုတ်
nb: Tekstknapp
ne: टेक्स्ट बटन
pa: ਲਿਖਤ ਵਾਲਾ ਬਟਨ
pl: Przycisk tekstowy
pt: Botão de texto
pt_pt: Botão de texto
ro: Butonul text
ru: Текстовая кнопка
si: පෙළ බොත්තම
sk: Textové tlačidlo
sq: Butoni i tekstit
sr: Дугме за текст
sr_latn: Dugme za tekst
sv: Textknapp
te: టెక్స్ట్ బటన్
th: ปุ่มข้อความ
tr: Metin Düğmesi
uk: Текстова кнопка
ur: ٹیکسٹ بٹن
uz: Matnli tugma
vi: Nút văn bản
zh_hk: 文字按鈕
zu: Inkinobho Yombhalo

# demoSharedZAxisBeefSandwichRecipeTitle
source: Beef Sandwich
af: Beesvleistoebroodjie
am: የበሬ ስጋ ሳንድዊች
ar_eg: شطيرة لحم بقري
as: গো -মাংসৰ ছেণ্ডৱিচ্চ
az: Mal əti sendviçi
be: Сандвіч з ялавічынай
bn: বিফ স্যান্ডউইচ
bs: Sendvič s govedinom
ca: Entrepà de vedella
da: Oksekødssandwich
es_ar: Sándwich de carne de res
et: Veiselihavõileib
eu: Behiki-ogitartekoa
fa: ساندویچ گوشت گاو
fr_ca: Sandwich au bœuf
gl: Sándwich de carne de vaca
gu: બીફ સૅન્ડવિચ
he: סנדוויץ' בקר
hi: बीफ़ सैंडविच
hu: Marhahúsos szendvics
hy: Տավարի մսով սենդվիչ
id: Sandwich daging sapi
it: Panino con la carne
ja: ビーフ サンドイッチ
ka: საქონლის ხორცის სენდვიჩი
km: សាំងវិច​សាច់គោ
kn: ಬೀಫ್ ಸ್ಯಾಂಡ್‌ವಿಚ್
ko: 비프 샌드위치
ky: Уй этинен жасалган сэндвич
lo: ແຊນວິດງົວ
lt: Sumuštinis su jautiena
lv: Sviestmaize ar liellopu gaļu
mk: Сендвич со телешко
ml: ബീഫ് സാൻഡ്‌വിച്ച്
mn: Үхрийн махтай хачиртай талх
mr: बीफ सँडविच
ms: Sandwic Daging
my: အမဲသား အသားညှပ်ပေါင်မုန့်
nb: Smørbrød med storfekjøtt
ne: बिफ स्यान्डविच
pa: ਬੀਫ਼ ਸੈਂਡਵਿਚ
pl: Kanapka z wołowiną
pt: Sanduíche de carne
pt_pt: Sanduíche de carne de vaca
ro: Sandviș cu vită
ru: Бутерброд с говядиной
si: බීෆ් සැන්ඩ්විච්
sk: Hovädzí sendvič
sq: Sandviç me mish viçi
sr: Сендвич са говедином
sr_latn: Sendvič sa govedinom
sv: Biffmacka
te: బీఫ్ శాండ్విచ్
th: แซนด์วิชเนื้อ
tr: Etli Sandviç
uk: Сендвіч із яловичиною
ur: بیف سینڈوچ
uz: Mol goʻshtli sendvich
vi: Bánh sandwich bò
zh_hk: 牛肉三文治
zu: Isemeshi yebhifu

# demoSharedZAxisDessertRecipeDescription
source: Dessert recipe
af: Nageregresep
am: የጣፋጭ ምግብ አሰራር
ar_eg: وصفة الحلويات
as: ডির্জাটৰ ৰন্ধনবিধি
az: Desert resepti
be: Рэцэпт дэсерта
bn: ডেজার্টের রেসিপি
bs: Recept za desert
ca: Recepta de postres
da: Opskrift på dessert
es_ar: Receta de postre
et: Magustoiduretsept
eu: Postre baten errezeta
fa: دستور تهیه دسر
fil: Recipe ng panghimagas
fr_ca: Recette de dessert
gl: Receita de sobremesa
gu: ડેઝર્ટની રૅસિપિ
he: מתכון לקינוח
hi: मिठाई बनाने की रेसिपी
hu: Desszertrecept
hy: Աղանդերի բաղադրատոմս
id: Resep hidangan penutup
it: Ricetta dessert
ja: デザートのレシピ
ka: დესერტის რეცეპტი
km: រូបមន្ត​ធ្វើបង្អែម
kn: ಡೆಸರ್ಟ್ ರೆಸಿಪಿ
ko: 디저트 레시피
ky: Десерттин рецепти
lo: ສູດຂອງຫວານ
lt: Deserto receptas
lv: Deserta recepte
mk: Рецепт за десерт
ml: ഡെസെർട്ട് റെസിപ്പി
mn: Амттаны жор
mr: डेझर्टची पाककृती
ms: Resipi pencuci mulut
my: အချိုပွဲလုပ်နည်း
nb: Dessertoppskrift
ne: डेजर्ट बनाउने तरिका
pa: ਮਿਠਿਆਈ ਦੀ ਪਕਵਾਨ-ਵਿਧੀ
pl: Przepis na deser
pt: Receita de sobremesa
pt_pt: Receita de sobremesa
ro: Rețetă de desert
ru: Рецепт десерта
si: අතුරුපස වට්ටෝරුව
sk: Recept na dezert
sq: Recetë për ëmbëlsirë
sr: Рецепт за дезерт
sr_latn: Recept za dezert
sv: Recept på efterrätt
te: డెజర్ట్ తయారీ విధానం
th: สูตรของหวาน
tr: Tatlı tarifi
uk: Рецепт десерту
ur: میٹھے کا نسخہ
uz: Desert retsepti
vi: Công thức làm món tráng miệng
zh_hk: 甜品食譜
zu: Iresiphu ye-dessert

# demoSharedYAxisAlbumTileSubtitle
source: Artist
af: Kunstenaar
am: አርቲስት
ar_eg: فنان
as: শিল্পী
az: İfaçı
be: Выканаўца
bn: শিল্পী
bs: Izvođač
ca: Artista
da: Kunstner
es_ar: Artista
et: Esitaja
eu: Artista
fa: هنرمند
fr_ca: Artiste
gl: Artista
gu: કલાકાર
he: אמן
hi: कलाकार
hu: Előadó
hy: Կատարող
id: Artis
it: Artista
ja: アーティスト
ka: მუსიკოსი
km: សិល្បករ
kn: ಕಲಾವಿದರು
ko: 아티스트
ky: Аткаруучу
lo: ສິນລະປິນ
lt: Atlikėjas
lv: Izpildītājs
mk: Изведувач
ml: ആർട്ടിസ്‌റ്റ്
mn: Уран бүтээлч
mr: कलाकार
ms: Artis
my: အနုပညာရှင်
ne: कलाकार
pa: ਕਲਾਕਾਰ
pl: Wykonawca
pt: Artista
pt_pt: Artista
ru: Исполнитель
si: කලාකරු
sk: Interpret
sq: Artisti
sr: Извођач
sr_latn: Izvođač
te: ఆర్టిస్ట్
th: ศิลปิน
tr: Sanatçı
uk: Виконавець
ur: فنکار
uz: Ijrochi
vi: Nghệ sĩ
zh_hk: 歌手
zu: Umculi

# demoSharedYAxisAlbumTileTitle
source: Album
am: አልበም
ar_eg: ألبوم
as: এলবাম
az: Albom
be: Альбом
bn: অ্যালবাম
ca: Àlbum
es_ar: Álbum
eu: Albuma
fa: آلبوم
gl: Álbum
gu: આલ્બમ
he: אלבום
hi: एल्बम
hy: Ալբոմ
ja: アルバム
ka: ალბომი
km: អាល់ប៊ុម
kn: ಆಲ್ಬಮ್‌
ko: 앨범
ky: Альбом
lo: ອະລະບໍ້າ
lt: Albumas
lv: Albums
mk: Албум
ml: ആൽബം
mn: Цомог
mr: अल्बम
my: အယ်လ်ဘမ်
ne: एल्बम
pa: ਐਲਬਮ
pt: Álbum
pt_pt: Álbum
ru: Альбом
si: ඇල්බමය
sq: Albumi
sr: Албум
te: ఆల్బమ్
th: อัลบั้ม
tr: Albüm
uk: Альбом
ur: البم
uz: Albom
zh_hk: 專輯
zu: I-albhamu

# demoSharedYAxisRecentSortTitle
source: Recently played
af: Onlangs gespeel
am: በቅርቡ የተጫወቱ
ar_eg: شغلت مؤخرًا
as: শেহতীয়াকৈ প্লে’ কৰা
az: Son oxudulan
be: Нядаўна прайгравалася
bn: সম্প্রতি চলানো হয়েছে
bs: Nedavno slušano
ca: Reproduït recentment
da: Hørt for nylig
es_ar: Reproducido recientemente
et: Hiljuti esitatud
eu: Erreproduzitutako azkenak
fa: پخش‌شده‌های اخیر
fil: Na-play kamakailan
fr_ca: Écouté récemment
gl: Reproducións recentes
gu: તાજેતરમાં ચલાવેલા
he: הושמעו לאחרונה
hi: हाल ही में सुने गए
hu: Nemrég lejátszott
hy: Վերջերս նվագարկվածները
id: Baru diputar
it: Ascoltati di recente
ja: 最近再生したもの
ka: ცოტა ხნის წინ დაკრული
km: ទើបតែ​លេង​ហើយ
kn: ಇತ್ತೀಚೆಗೆ ಪ್ಲೇ ಮಾಡಿರುವುದು
ko: 최근 재생한 항목
ky: Акыркы ойнотулгандар
lo: ຫຼິ້ນບໍ່ດົນມານີ້
lt: Neseniai leista
lv: Nesen atskaņots
mk: Неодамна пуштени
ml: അടുത്തിടെ പ്ലേ ചെയ്‌തത്
mn: Хамгийн сүүлд тоглуулсан
mr: अलीकडे प्‍ले केलेले
ms: Dimainkan baru-baru ini
my: မကြာသေးမီက ဖွင့်ခဲ့သည်
nb: Spilt av nylig
ne: हालसालै प्ले गरिएका
pa: ਹਾਲ ਹੀ ਵਿੱਚ ਚਲਾਏ ਗਏ
pl: Ostatnio odtwarzane
pt: Reproduzidas recentemente
pt_pt: Reproduzido recentemente
ro: Redate recent
ru: Прослушано недавно
si: මෑතක දී ධාවනය කළ
sk: Nedávno počúvané
sq: Të luajtura së fundi
sr: Недавно слушано
sr_latn: Nedavno slušano
sv: Nyligen spelade
te: ఇటీవల ప్లే చేసినవి
th: ฟังล่าสุด
tr: Son çalınanlar
uk: Нещодавно відтворене
ur: حال ہی میں چلائے گئے
uz: Yaqinda tinglangan
vi: Phát gần đây
zh_hk: 最近播放
zu: Okudlalwe kamuva

# demoSharedYAxisAlphabeticalSortTitle
source: A-Z
am: ሀ-ፐ
ar_eg: أ-ي
as: Aৰ পৰা Zলৈ
be: А-Я
bs: A–Ž
da: A-Å
fa: به‌ترتیب الفبا
fr_ca: A à Z
he: א'-ת'
ja: アルファベット順
ka: ა-ჰ
ko: 가나다순
ky: А-Я
lt: A–Ž
mk: A-Ш
mn: А-Я
nb: A–Å
ru: А–Я
sv: A–Ö
tr: A'dan Z'ye
uk: А–Я

# demoSharedYAxisAlbumCount
source: 268 albums
am: 268 አልበሞች
ar_eg: 268 ألبومًا
as: ২৬৮ টা এলবাম
az: 268 albom
be: 268 альбомаў
bn: ২৬৮টি অ্যালবাম
bs: 286 albuma
ca: 268 àlbums
da: 268 album
es_ar: 268 álbumes
et: 268 albumit
eu: 268 album
fa: ۲۶۸ آلبوم
fil: 268 album
gl: 268 álbums
gu: 268 આલ્બમ
he: 268 אלבומים
hi: 268 एल्बम
hu: 268 album
hy: 268 ալբոմ
id: 268 album
it: 268 album
ja: 268 冊のアルバム
ka: 268 ალბომი
km: 268 អាល់ប៊ុម
kn: 268 ಆಲ್ಬಮ್‌ಗಳು
ko: 앨범 268개
ky: 268 альбом
lo: 268 ອະລະບ້ຳ
lt: 268 albumai
lv: 268 albumi
mk: 268 албуми
ml: 268 ആൽബങ്ങൾ
mn: 268 цомог
mr: २६८ अल्बम
ms: 268 album
my: အယ်လ်ဘမ် ၂၆၈ ခု
nb: 268 album
ne: २६८ वटा एल्बम
pa: 268 ਐਲਬਮਾਂ
pl: 268 albumów
pt: 268 álbuns
pt_pt: 268 álbuns
ro: 268 de albume
ru: 268 альбомов
si: ඇල්බම 268
sk: 268 albumov
sq: 268 albume
sr: 268 албума
sr_latn: 268 albuma
sv: 268 album
te: 268 ఆల్బమ్‌లు
th: 268 อัลบั้ม
tr: 268 albüm
uk: 268 альбомів
ur: 268 البمز
uz: 268 ta albom
vi: 268 album
zh_hk: 268 張專輯
zu: ama-albhamu angama-268

# demoSharedYAxisTitle
source: Shared y-axis
af: Gedeelde y-as
am: የተጋራ y-ዘንግ
ar_eg: محور "ص" المشترك
as: শ্বেয়াৰ কৰা y অক্ষ
az: Paylaşılan y oxu
be: Абагуленая вось y
bn: শেয়ার করা y-অ্যাক্সিস
bs: Dijeljena y osa
ca: Eix Y compartit
da: Delt y-akse
es_ar: Eje Y compartido
et: Jagatud Y-telg
eu: Partekatutako Y ardatza
fa: محور y مشترک
fil: Nakabahaging y-axis
fr_ca: Axe y partagé
gl: Eixe y compartido
gu: શેર કરેલા y-અક્ષ
he: ציר y משותף
hi: शेयर्ड वाई-ऐक्सिस
hu: Megosztott y tengely
hy: Ընդհանուր Y առանցք
id: Sumbu y merata
it: Asse y condiviso
ja: y 軸共有
ka: საზიარო y-ღერძი
km: អ័ក្ស y រួម
kn: ಹಂಚಿದ y-ಅಕ್ಷ
ko: 공유된 y축
ky: Бөлүшүлгөн y-огу
lo: ແກນ y ທີ່ແບ່ງປັນ
lt: Bendrinama y ašis
lv: Kopīga y ass
mk: Споделена y-оска
ml: y-അക്ഷം പങ്കിട്ടു
mn: Хуваалцсан y-тэнхлэг
mr: शेअर केलेला y अक्ष
ms: Paksi y dikongsi
my: မျှဝေထားသော y ဝင်ရိုး
nb: Delt Y-akse
ne: साझा वाइ-एक्सिस
pa: ਸਾਂਝਾ ਕੀਤਾ y-ਧੁਰਾ
pl: Wspólna oś y
pt: Eixo y compartilhado
pt_pt: Eixo y partilhado
ro: Axa y comună
ru: Общая ось Y
si: බෙදා ගත් y-අක්ෂය
sk: Zdieľaná os y
sq: Boshti y i ndarë
sr: Заједничка Y оса
sr_latn: Zajednička Y osa
sv: Delad y-axel
te: షేర్‌డ్ y-ఆక్సిస్
th: แกน Y ที่ใช้ร่วมกัน
tr: Paylaşılan y ekseni
uk: Спільна вісь Y
ur: مشترکہ y-axis
uz: Umumiy Y oʻqi
vi: Trục y chung
zh_hk: 共用 Y 軸
zu: I-y-axis eyabiwe

# demoSharedXAxisCreateAccountButtonText
source: CREATE ACCOUNT
af: SKEP REKENING
am: መለያ ፍጠር
ar_eg: إنشاء حساب
as: একাউণ্ট সৃষ্টি কৰক
az: HESAB YARADIN
be: СТВАРЫЦЬ УЛІКОВЫ ЗАПІС
bn: অ্যাকাউন্ট তৈরি করুন
bs: KREIRAJ RAČUN
ca: CREA UN COMPTE
da: OPRET KONTO
es_ar: CREAR CUENTA
et: LOO KONTO
eu: SORTU KONTU BAT
fa: ایجاد حساب
fil: GUMAWA NG ACCOUNT
fr_ca: CRÉER UN COMPTE
gl: CREAR CONTA
gu: એકાઉન્ટ બનાવો
he: צור חשבון
hi: खाता बनाएं
hu: FIÓK LÉTREHOZÁSA
hy: ՍՏԵՂԾԵԼ ՀԱՇԻՎ
id: BUAT AKUN
it: CREA ACCOUNT
ja: アカウントを作成
ka: ანგარიშის შექმნა
km: បង្កើតគណនី
kn: ಖಾತೆಯನ್ನು ರಚಿಸಿ
ko: 계정 만들기
ky: АККАУНТ ТҮЗҮҮ
lo: ສ້າງບັນຊີ
lt: SUKURTI PASKYRĄ
lv: IZVEIDOT KONTU
mk: СОЗДАЈ СМЕТКА
ml: അക്കൗണ്ട് സൃഷ്‌ടിക്കുക
mn: БҮРТГЭЛ ҮҮСГЭХ
mr: खाते तयार करा
ms: BUAT AKAUN
my: အကောင့် ပြုလုပ်ရန်
nb: OPPRETT KONTO
ne: खाता बनाउनुहोस्
pa: ਖਾਤਾ ਬਣਾਓ
pl: UTWÓRZ KONTO
pt: CRIAR CONTA
pt_pt: CRIAR CONTA
ro: CREAȚI UN CONT
ru: СОЗДАТЬ АККАУНТ
si: ගිණුමක් සාදන්න
sk: VYTVORIŤ ÚČET
sq: KRIJO LLOGARI
sr: ОТВОРИ НАЛОГ
sr_latn: OTVORI NALOG
sv: SKAPA KONTO
te: ఖాతాను క్రియేట్ చేయండి
th: สร้างบัญชี
tr: HESAP OLUŞTUR
uk: СТВОРИТИ ОБЛІКОВИЙ ЗАПИС
ur: اکاؤنٹ بنائیں
uz: HISOB YARATISH
vi: TẠO TÀI KHOẢN
zh_hk: 建立帳戶
zu: DALA I-AKHAWUNTI

# demoFadeScaleAlertDialogDiscardButton
source: DISCARD
af: GOOI WEG
am: ጣለው
ar_eg: تجاهل
as: বাতিল কৰক
az: KƏNARLAŞDIRIN
be: АДХІЛІЦЬ
bn: বাতিল করুন
bs: ODBACI
ca: DESCARTA
da: KASSÉR
es_ar: DESCARTAR
et: LOOBU
eu: BAZTERTU
fa: صرف‌نظر کردن
fil: I-DISCARD
fr_ca: SUPPRIMER
gl: DESCARTAR
gu: કાઢી નાખો
he: סגירה
hi: खारिज करें
hu: ELVETÉS
hy: ՉԵՂԱՐԿԵԼ
id: HAPUS
it: IGNORA
ja: 破棄
ka: გაუქმება
km: លុបចោល
kn: ತ್ಯಜಿಸಿ
ko: 삭제
ky: ӨЧҮРҮҮ
lo: ຍົກເລີກ
lt: ATMESTI
lv: ATMEST
mk: ОТФРЛИ
ml: ഉപേക്ഷിക്കുക
mn: БОЛИХ
mr: काढून टाका
ms: BUANG
my: ဖယ်ပစ်ရန်
nb: FORKAST
ne: खारेज गर्नुहोस्
pa: ਖਾਰਜ ਕਰੋ
pl: ODRZUĆ
pt: DESCARTAR
pt_pt: REJEITAR
ro: RENUNȚAȚI
ru: ОТМЕНИТЬ
si: ඉවත ලන්න
sk: ZAHODIŤ
sq: HIQ
sr: ОДБАЦИ
sr_latn: ODBACI
sv: IGNORERA
te: విస్మరించు
th: ทิ้ง
tr: SİL
uk: ВІДХИЛИТИ
ur: مسترد کریں
uz: RAD ETISH
vi: HỦY
zh_hk: 捨棄
zu: LAHLA

# demoSharedXAxisSignInTextFieldLabel
source: Email or phone number
af: E-posadres of foonnommer
am: ኢሜይል ወይም ስልክ ቁጥር
ar_eg: البريد الإلكتروني أو رقم الهاتف
as: ইমেইল অথবা ফ’ন নম্বৰ
az: E-poçt və ya telefon nömrəsi
be: Электронная пошта ці нумар тэлефона
bn: ইমেল বা ফোন নম্বর
bs: Adresa e-pošte ili broj telefona
ca: Adreça electrònica o número de telèfon
da: Mail eller telefonnummer
es_ar: Correo electrónico o número de teléfono
et: E-post või telefoninumber
eu: Helbide elektronikoa edo telefono-zenbakia
fa: ایمیل یا شماره تلفن
fil: Email o numero ng telepono
fr_ca: Adresse de courriel ou numéro de téléphone
gl: Correo electrónico ou número de teléfono
gu: ઇમેઇલ અથવા ફોન નંબર
he: אימייל או מספר טלפון
hi: ईमेल पता या फ़ोन नंबर
hu: E-mail-cím vagy telefonszám
hy: Էլ․ հասցե կամ հեռախոսահամար
id: Email atau nomor telepon
it: Indirizzo email o numero di telefono
ja: メールアドレスまたは電話番号
ka: ელფოსტა ან ტელეფონის ნომერი
km: អ៊ីមែល ឬ​លេខទូរសព្ទ
kn: ಇಮೇಲ್‌ ಅಥವಾ ಫೋನ್‌ ಸಂಖ್ಯೆ
ko: 이메일 주소 또는 전화번호
ky: Электрондук почта дареги же телефон номери
lo: ອີເມວ ຫຼື ເບີໂທລະສັບ
lt: El. pašto adresas arba telefono numeris
lv: E-pasta adrese vai tālruņa numurs
mk: Е-пошта или телефонски број
ml: ഇമെയിൽ അല്ലെങ്കിൽ ഫോൺ നമ്പർ
mn: Имэйл эсвэл утасны дугаар
mr: ईमेल किंवा फोन नंबर
ms: E-mel atau nombor telefon
my: အီးမေးလ် သို့မဟုတ် ဖုန်းနံပါတ်
nb: E-postadresse eller telefonnummer
ne: इमेल ठेगाना वा फोन नम्बर
pa: ਈਮੇਲ ਜਾਂ ਫ਼ੋਨ ਨੰਬਰ
pl: E-mail lub numer telefonu
pt: E-mail ou número de telefone
pt_pt: Email ou número de telefone
ro: Adresa de e-mail sau numărul de telefon
ru: Адрес электронной почты или номер телефона
si: ඉ-තැපෑල හෝ දුරකථන අංකය
sk: E‑mail alebo telefónne číslo
sq: Email-i ose numri i telefonit
sr: Имејл или број телефона
sr_latn: Imejl ili broj telefona
sv: E-postadress eller telefonnummer
te: ఈమెయిల్‌ లేదా ఫోన్ నంబర్
th: อีเมลหรือหมายเลขโทรศัพท์
tr: E-posta adresi veya telefon numarası
uk: Електронна адреса чи номер телефону
ur: ای میل یا فون نمبر
uz: Email manzili yoki telefon raqami
vi: Email hoặc số điện thoại
zh_hk: 電郵地址或電話號碼
zu: I-imeyili noma inombolo yefoni

# demoSharedXAxisSignInSubtitleText
source: Sign in with your account
af: Meld aan by jou rekening.
am: በመለያዎ ይግቡ
ar_eg: تسجيل الدخول باستخدام حسابك
as: আপোনাৰ একাউণ্টৰ জৰিয়তে ছাইন ইন কৰক
az: Hesabınızla daxil olun
be: Увайдзіце ў свой уліковы запіс
bn: আপনার অ্যাকাউন্টে সাইন-ইন করুন
bs: Prijavite se putem svog računa
ca: Inicia la sessió amb el teu compte
da: Log ind med din konto
es_ar: Accede con tu cuenta
et: Logige oma kontole sisse
eu: Hasi saioa kontuarekin
fa: با حساب خود وارد سیستم شوید
fil: Mag-sign in gamit ang iyong account
fr_ca: Connectez-vous avec votre compte
gl: Inicia sesión coa túa conta
gu: તમારા એકાઉન્ટથી સાઇન ઇન કરો
he: יש להיכנס באמצעות החשבון שלך
hi: अपने खाते से साइन इन करें
hu: Jelentkezzen be fiókjával
hy: Մտեք ձեր հաշիվ
id: Login dengan akun Anda
it: Accedi all'account
ja: アカウントにログイン
ka: შედით თქვენს ანგარიშში
km: សូមចូល​ដោយប្រើ​គណនី​របស់អ្នក
kn: ನಿಮ್ಮ ಖಾತೆಯ ಮೂಲಕ ಸೈನ್ ಇನ್ ಮಾಡಿ
ko: 내 계정으로 로그인
ky: Аккаунтуңуз менен кириңиз
lo: ເຂົ້າສູ່ລະບົບຫາບັນຊີຂອງທ່ານ
lt: Prisijunkite prie paskyros
lv: Pierakstīties kontā
mk: Најавете се со вашата сметка
ml: നിങ്ങളുടെ അക്കൗണ്ട് ഉപയോഗിച്ച് സൈൻ ഇൻ ചെയ്യുക
mn: Бүртгэлээрээ нэвтрэх
mr: तुमचे खाते वापरून साइन इन करा
ms: Log masuk dengan akaun anda
my: သင့်အကောင့်ဖြင့် လက်မှတ်ထိုးဝင်ပါ
nb: Logg på med kontoen din
ne: आफ्नो खातामार्फत साइन इन गर्नुहोस्
pa: ਆਪਣੇ ਖਾਤੇ ਨਾਲ ਸਾਈਨ-ਇਨ ਕਰੋ
pl: Zaloguj się na swoje konto
pt: Fazer login com sua conta
pt_pt: Inicie sessão com a sua conta.
ro: Conectați-vă cu contul dvs.
ru: Войдите со своим аккаунтом
si: ඔබේ ගිණුම සමගින් පුරන්න
sk: Prihláste sa svojím účtom
sq: Identifikohu me llogarinë tënde
sr: Пријавите се помоћу налога
sr_latn: Prijavite se pomoću naloga
sv: Logga in på ditt konto
te: మీ ఖాతాతో సైన్ ఇన్ చేయండి
th: ลงชื่อเข้าใช้บัญชีของคุณ
tr: Hesabınızla oturum açın
uk: Увійдіть, використовуючи дані облікового запису
ur: اپنے اکاؤنٹ کے ساتھ سائن ان کریں
uz: Hisobingiz bilan kiring
vi: Đăng nhập bằng tài khoản của bạn
zh_hk: 使用您的帳戶登入
zu: Ngena ngemvume nge-akhawunti yakho

# demoSharedXAxisSignInWelcomeText
source: Hi David Park
af: Hallo David Park
am: ሰላም David Park
ar_eg: مرحبًا David Park
as: নমস্কাৰ ডেভিড পাৰ্ক
az: Salam, David Park
be: Вітаем у David Park
bn: হাই অভিজিত ভঞ্জ
bs: Zdravo, David Park
ca: Hola, David Park
da: Hej David Park
es_ar: Hola, David Park
et: Tere, David Park!
eu: Kaixo, David Park
fa: سلام دیوید پارک
fil: Kumusta, David Park
fr_ca: Bonjour David Park
gl: Ola, David Park
gu: નમસ્તે David Park
he: שלום David Park
hi: नमस्ते, डेविड पार्क
hu: Üdv, David Park!
hy: Ողջույն, David Park
id: Halo David Park
it: Ciao, David Park
ja: David Park 様
ka: გამარჯობა, David Park
km: សួស្ដី David Park
kn: ನಮಸ್ಕಾರ, David Park
ko: David Park님, 안녕하세요.
ky: Салам, David Park
lo: ສະບາຍດີ David Park
lt: Sveiki, David Park
lv: Labdien, David Park!
mk: Здраво David Park
ml: ഹായ് David Park
mn: Сайн уу, Дэвид Парк
mr: हाय David Park
ms: Hai, David Park
my: မင်္ဂလာပါ David Park
nb: Hei, David Park
ne: नमस्ते David Park
pa: ਸਤਿ ਸ੍ਰੀ ਅਕਾਲ David Park
pl: Cześć,
pt: Olá, David Park
pt_pt: Olá, David Park
ro: Bună ziua, David Park!
ru: Здравствуйте, Дэвид Парк!
si: ආයුබෝවන් David Park
sk: Dobrý deň, David Park
sq: Përshëndetje, David Park
sr: Здраво, Дејвид Парк
sr_latn: Zdravo, Dejvid Park
sv: Hej, David Park!
te: హాయ్ David Park
th: สวัสดี David Park
tr: Merhaba David Park
uk: Вітаємо, David Park!
ur: آداب David Park
uz: Salom, David Park!
vi: Xin chào David Park
zh_hk: David Park，您好
zu: Sawubona David Park

# demoSharedXAxisIndividualCourseSubtitle
source: Shown Individually
af: Word individueel gewys
am: በተናጠል የሚታይ
ar_eg: تظهر بشكل فردي
as: ব্যক্তিগতভাৱে প্ৰদশৰ্ন কৰা হয়
az: Fərdi Göstərilir
be: Паказваецца асобна
bn: আলাদা করে দেখানো
bs: Prikazano pojedinačno
ca: Es mostra de manera individual
da: Vist enkeltvist
es_ar: Mostrados por separado
et: Kuvatakse üksikult
eu: Banaka erakutsiko dira
fa: نمایش به‌صورت جداگانه
fil: Magkakahiwalay na Ipinapakita
fr_ca: Affichées individuellement
gl: Mostrado individualmente
gu: વ્યક્તિગત રીતે બતાવેલ
he: מוצגות בנפרד
hi: अलग से दिखाया गया कोर्स
hu: Egyénileg megjelenítve
hy: Ցուցադրված է առանձին
id: Ditampilkan secara Individual
it: Mostrato singolarmente
ja: 単独で表示
ka: ინდივიდუალურად ნაჩვენები
km: បង្ហាញ​ដាច់ដោយ​ឡែកពីគ្នា
kn: ಪ್ರತ್ಯೇಕವಾಗಿ ತೋರಿಸಿ
ko: 개별적으로 표시됨
ky: Жалгыздан көрсөтүлүүдө
lo: ສະແດງແຍກກັນ
lt: Rodoma atskirai
lv: Tiek rādīts atsevišķi
mk: Прикажани засебно
ml: വ്യക്തിഗതമായി കാണിച്ചിരിക്കുന്നു
mn: Тусад нь харуулсан
mr: वैयक्तिकरित्या दाखवलेला
ms: Ditunjukkan Secara Berasingan
my: တစ်ခုချင်းစီပြသထားသည်
nb: Vises enkeltvis
ne: छुट्टा छुट्टै देखाइने
pa: ਵਿਅਕਤੀਗਤ ਤੌਰ 'ਤੇ ਦਿਖਾਇਆ ਗਿਆ
pl: Wyświetlane osobno
pt: Mostrado individualmente
pt_pt: Apresentado individualmente
ro: Afișate individual
ru: Показан отдельно
si: තනි තනිව පෙන්වන
sk: Zobrazené samostatne
sq: Shfaqet individualisht
sr: Приказује се појединачно
sr_latn: Prikazuje se pojedinačno
sv: Visas enskilt
te: విడివిడిగా చూపబడింది
th: แสดงแยกแต่ละรายการ
tr: Ayrı Olarak Gösterilir
uk: Окремо
ur: انفرادی طور پر دکھائے گئے
uz: Alohida koʻrsatilgan
vi: Hiển thị riêng lẻ
zh_hk: 分別顯示
zu: Kuboniswa Ngakunye

# demoSharedXAxisBundledCourseSubtitle
source: Bundled
af: Gebondel
am: የተጠቃለለ
ar_eg: مجمّع
as: বাণ্ডল হৈ থকা
az: Paketlənmiş
be: Звязаны
bn: বান্ডেল করা হয়েছে
bs: Upakovano
ca: Grup
da: Grupperet
es_ar: Adherido
et: Kogumis
eu: Multzokatuta
fa: دسته‌ای
fil: Naka-bundle
fr_ca: Groupées
gl: Agrupado
gu: બંડલ કરેલા
he: חלק מחבילה
hi: बंडल किया गया कोर्स
hu: Kategorizált
hy: Փաթեթով
id: Gabungan
it: Integrato
ja: 一括
ka: ნაკრების სახით
km: ជាកញ្ចប់
kn: ಬಂಡಲ್ ಮಾಡಿರುವುದು
ko: 번들
ky: Таңылган
lo: ເປັນຊຸດ
lt: Sugrupuota
lv: Iekļauts komplektā
mk: Во пакет
ml: ബണ്ടിൽ ചെയ്‌തു
mn: Багцалсан
mr: बंडल केलेले
ms: Dihimpunkan
my: ပေါင်းချုပ်ထားသည်
nb: Gruppert
ne: बन्डल बनाइएका
pa: ਬੰਡਲਬੱਧ
pl: W pakiecie
pt: Incluído
pt_pt: Agrupado
ro: În grup
ru: В наборе
si: පොදි කළ
sk: V balíku
sq: Pjesë e paketës
sr: У пакету
sr_latn: U paketu
sv: Grupperad
te: బండిల్ చేయబడిన
th: แพ็กเกจ
tr: Paket
uk: У наборі
ur: بنڈل کردہ
uz: Majmuada
vi: Theo gói
zh_hk: 組合
zu: Okuhlanganisiwe

# demoFadeThroughAlbumsDestination
source: Albums
am: አልበሞች
ar_eg: ألبومات
as: এলবাম
az: Albomlar
be: Альбомы
bn: অ্যালবাম
bs: Albumi
ca: Àlbums
da: Album
es_ar: Álbumes
et: Albumid
eu: Albumak
fa: آلبوم‌ها
fil: Mga Album
gl: Álbums
gu: આલ્બમ
he: אלבומים
hi: एल्बम
hu: Albumok
hy: Ալբոմներ
id: Album
it: Album
ja: アルバム
ka: ალბომები
km: អាល់ប៊ុម
kn: ಆಲ್ಬಮ್‌ಗಳು
ko: 앨범
ky: Альбомдор
lo: ອະລະບ້ຳ
lt: Albumai
lv: Albumi
mk: Албуми
ml: ആൽബങ്ങൾ
mn: Цомгууд
mr: अल्बम
ms: Album
my: အယ်လ်ဘမ်များ
nb: Album
ne: एल्बम
pa: ਐਲਬਮਾਂ
pl: Albumy
pt: Álbuns
pt_pt: Álbuns
ro: Albume
ru: Альбомы
si: ඇල්බම
sk: Albumy
sq: Albumet
sr: Албуми
sr_latn: Albumi
sv: Album
te: ఆల్బమ్‌లు
th: อัลบั้ม
tr: Albümler
uk: Альбоми
ur: البمز
uz: Albomlar
vi: Album
zh_hk: 專輯
zu: Ama-albhamu

# demoSharedXAxisDesignCourseTitle
source: Design
af: Ontwerp
am: ንድፍ
ar_eg: تصميمات
as: ডিজাইন
az: Dizayn
be: Дызайн
bn: ডিজাইন
bs: Dizajn
ca: Disseny
es_ar: Diseño
et: Disain
eu: Diseinua
fa: طراحی
fil: Disenyo
fr_ca: Conception
gl: Deseño
gu: ડિઝાઇન
he: עיצוב
hi: डिज़ाइन
hu: Dizájn
hy: Դիզայն
id: Desain
ja: デザイン
ka: დიზაინი
km: ការ​រចនា
kn: ವಿನ್ಯಾಸ
ko: 디자인
ky: Жасалгалоо
lo: ການອອກແບບ
lt: Dizainas
lv: Dizains
mk: Дизајн
ml: ഡിസൈൻ
mn: Дизайн
mr: डिझाइन
ms: Reka bentuk
my: ဒီဇိုင်း
ne: डिजाइन
pa: ਡਿਜ਼ਾਈਨ
pl: Projektowanie i design
ru: Дизайн
si: සැලසුම
sk: Dizajn
sq: Dizajnim
sr: Дизајн
sr_latn: Dizajn
te: డిజైన్
th: การออกแบบ
tr: Tasarım
uk: Дизайн
ur: ڈیزائن
uz: Dizayn
vi: Thiết kế
zh_hk: 設計
zu: Dizayina
