Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoContextMenuDescription
source: An iOS-style full screen contextual menu that appears when an element is long-pressed.
af: ’n Kontekstuele volskermkieslys in die iOS-styl wat verskyn wanneer ’n element gelangdruk word.
am: አባለ-ነገሩ በረጅሙ ሲጫን የሚታይ የiOS-ቅጥ ሙሉ ገፅ ዕይታ ተገቢ ሁኔታ ምናሌ።
ar_eg: قائمة سياقات بنمط iOS تظهر بوضع ملء الشاشة عند الضغط مع الاستمرار على أحد العناصر
as: এখন iOS-শৈলীৰ পূৰ্ণ স্ক্ৰীনৰ প্ৰাসংগিক মেনু যিখন কোনো উপাদানত দীঘলীয়াকৈ হেঁচি ধৰি থাকিলে ওলায়।
az: Element basılıb saxlandıqda görünən iOS üslublu tam ekran kontekst menyusu.
be: Поўнаэкраннае кантэкстнае меню ў стылі iOS, якое паказваецца пры доўгім націсканні на элемент.
bn: কোনও এলিমেন্টের উপর অনেকক্ষণ প্রেস করে ধরে থাকলে, iOS-স্টাইলের ফুল-স্ক্রিন কনটেক্সট মেনু দেখানো হয়।
bs: Kontekstni meni u iOS stilu prikazan na cijelom ekranu koji se pojavljuje kada pritisnete element i dugo zadržite.
ca: Un menú contextual d'estil iOS en pantalla completa que apareix quan un element es manté premut.
da: En genvejsmenu i fuld skærm til iOS, som vises, når et element holdes nede i nogle sekunder.
es_ar: Un menú contextual de pantalla completa con estilo de iOS que aparece cuando se mantiene presionado un elemento.
et: iOS-i stiilis täisekraan-kontekstimenüü, mis kuvatakse, kui elementi vajutatakse pikalt.
eu: Pantaila osoa hartzen duen iOS estiloko laster-menu bat, elementu bat luze sakatzean agertzen dena.
fa: منوی بافت تمام‌صفحه به‌سبک iOS که با فشار طولانی عناصر ظاهر می‌شود.
fil: Isang full screen na menu ng konteksto na may istilong pang-iOS na lumalabas kapag matagal na pinindot ang isang element.
fr_ca: Un menu contextuel plein écran de style iOS qui s'affiche lorsqu'un appui prolongé est fait sur un élément.
gl: Un menú contextual de tipo iOS a pantalla completa que aparece ao manter premido un elemento.
gu: જ્યારે કોઈ ઘટકને થોડીવાર દબાવી રાખવામાં આવે, ત્યારે iOS-શૈલીની પૂર્ણ સ્ક્રીનનું કોઈ સાંદર્ભિક મેનૂ દેખાય છે.
he: תפריט הקשר במסך מלא בסגנון iOS שמופיע כשלוחצים לחיצה ארוכה על אלמנט כלשהו.
hi: किसी एलिमेंट को दबाकर रखने पर, iOS-स्टाइल का फ़ुल स्क्रीन संदर्भ मेन्यू खुल जाता है.
hu: iOS-stílusú teljes képernyős helyi menü, amely megjelenik, ha az egyik elemet hosszan megnyomja.
hy: Լիաէկրան տեղային ընտրացանկ՝ iOS-ի ոճով, որը բացվում է՝ տարրը երկար սեղմելիս։
id: Menu kontekstual layar penuh bergaya iOS yang muncul saat elemen ditekan lama.
it: Un menu contestuale a schermo intero in stile iOS che viene visualizzato quando si esercita una pressione prolungata su un elemento.
ja: iOS スタイルの全画面表示のコンテキスト メニューで、要素を長押しすると表示されます
ka: iOS სტილის კონტექსტური მენიუ სრულ ეკრანზე გამოჩნდება მაშინ, როცა ელემენტს ხანგრძლივად დააჭერენ.
km: ម៉ឺនុយ​តាមបរិបទពេញអេក្រង់រចនាប័ទ្ម iOS ដែលបង្ហាញនៅពេលបានចុចធាតុមួយឱ្យយូរ។
kn: ಒಂದು ಅಂಶವನ್ನು ದೀರ್ಘಕಾಲ ಒತ್ತಿದಾಗ ಕಾಣಿಸಿಕೊಳ್ಳುವ iOS- ಶೈಲಿಯ ಫುಲ್ ಸ್ಕ್ರೀನ್ ಸಂದರ್ಭದ ಮೆನು.
ko: 요소를 길게 누르면 표시되는 iOS 스타일의 전체 화면 컨텍스트 메뉴입니다.
ky: iOS стилиндеги толук экрандагы контексттик меню элементти коё бербей басып турганда пайда болот.
lo: ເມນູບໍລິບົດແບບເຕັມຈໍຮູບແບບ iOS ທີ່ປາກົດເມື່ອກົດໃສ່ອົງປະກອບໃດໜຶ່ງຄ້າງໄວ້.
lt: „iOS“ stiliaus kontekstinis meniu per visą ekraną rodomas ilgai paspaudus elementą.
lv: iOS stila pilnekrāna kontekstizvēlne, kas tiek parādīta, nospiežot un turot kādu elementu.
mk: Контекстуално мени со iOS-стил на цел екран што се појавува кога ќе се притисне долго на некој елемент.
ml: എലമെന്റിൽ ദീർഘനേരം അമർത്തുമ്പോൾ ദൃശ്യമാകുന്ന iOS-സ്റ്റൈൽ പൂർണ്ണ സ്ക്രീൻ സന്ദർഭ മെനു.
mn: Элементийг удаан дарах үед харагддаг iOS загвартай бүтэн дэлгэцийн хам сэдэв цэс.
mr: iOS शैलीतील फुल स्क्रीन कॉंटेक्स्ट स्वरूपातील मेनू जो एखादा घटक जास्त वेळ प्रेस करून ठेवल्यावर दिसतो.
ms: Menu konteks skrin penuh bergaya iOS yang muncul apabila sesuatu elemen ditekan lama.
my: အစိတ်အပိုင်းတစ်ခုကို ကြာကြာနှိပ်ထားသောအခါ ပေါ်လာသည့် iOS-ပုံစံ ဖန်သားပြင်အပြည့် အကြောင်းအရာမီနူး။
nb: En kontekstuell meny i iOS-stil og fullskjermvisning som vises når det trykkes lenge på et element.
ne: कुनै एलिमेन्ट केही बेरसम्म थिच्दा देखिने iOS शैलीको फुल स्क्रिन सन्दार्भिक मेनु।
pa: iOS-ਸਟਾਈਲ ਵਾਲਾ ਪੂਰੀ ਸਕ੍ਰੀਨ ਦਾ ਸੰਦਰਭੀ ਮੀਨੂ ਜੋ ਉਦੋਂ ਦਿਸਦਾ ਹੈ ਜਦੋਂ ਕਿਸੇ ਤੱਤ ਨੂੰ ਦਬਾਈ ਰੱਖਿਆ ਜਾਂਦਾ ਹੈ।
pl: Menu kontekstowe znane z iOS i wyświetlane w widoku pełnego ekranu. Pojawia się, gdy użytkownik przytrzyma dany element.
pt: Um menu de contexto em tela cheia no estilo iOS que aparece ao tocar em um elemento pressionar.
pt_pt: Um menu de contexto de ecrã inteiro ao estilo do iOS que aparece quando se mantém premido um elemento.
ro: Un meniu contextual în stil iOS pe ecran complet care apare când se apasă lung pe un element.
ru: Полноэкранное контекстное меню в стиле iOS. Появляется после долгого нажатия на элемент интерфейса.
si: මූලාංගයක් දිගු වේලාවක් එබූ විට දිස්වන iOS-විලාසයේ පූර්ණ තිර ප්‍රකරණ මෙනුවකි.
sk: Kontextová ponuka typu iOS sa zobrazí na celej obrazovke, keď dlho stlačíte určitý prvok.
sq: Një meny kontekstuale në stilin për iOS në ekran të plotë që shfaqet kur një element mbahet shtypur gjatë.
sr: Контекстуални мени преко целог екрана у iOS стилу који се приказује по дугом притиску елемента.
sr_latn: Kontekstualni meni preko celog ekrana u iOS stilu koji se prikazuje po dugom pritisku elementa.
sv: En snabbmeny i helskärm i iOS-stil som visas när du trycker länge på ett element.
te: ఎలిమెంట్‌ను ఎక్కువ సేపు నొక్కి, ఉంచడం వలన iOS-స్టయిల్ ఫుల్ స్క్రీన్ సంబంధిత మెనూ కనిపిస్తుంది.
th: เมนูตามบริบทเต็มหน้าจอแบบ iOS ที่ปรากฏเมื่อมีการกดองค์ประกอบค้างไว้
tr: Bir öğeye uzun basıldığında görünen iOS stili tam ekran içerik menüsü.
uk: Повноекранне контекстне меню в стилі iOS, яке з’являється під час утримання елемента.
ur: ایک iOS طرز کا فُل اسکرین سیاق و سباق کا مینیو جو اس وقت ظاہر ہوتا ہے جب کسی عنصر کو لانگ پریس کیا جاتا ہے۔
uz: Element uzoq bosilganda chiqadigan iOS uslubidagi butun ekranli kontekst menyusi.
vi: Một trình đơn theo bối cảnh toàn màn hình mang phong cách iOS xuất hiện khi người dùng nhấn và giữ một thành phần.
zh_hk: 常按某個元素時，畫面上就會出現 iOS 樣式的全螢幕內容選單。
zu: Imenyu yokuqukethwe yesikrini esigcwele yesitayela se-iOS evela uma into icindezelwe isikhathi eside.

# demoAppBarTitle
source: App bar
af: Appbalk
am: የመተግበሪያ አሞሌ
ar_eg: شريط التطبيق
as: এপ্‌ বাৰ
az: Tətbiq paneli
be: Панэль праграм
bn: অ্যাপ বার
bs: Traka aplikacije
ca: Barra d'aplicacions
da: Appbjælke
es_ar: Barra de la aplicación
et: Rakenduseriba
eu: Aplikazioaren barra
fa: نوار برنامه
fil: Bar ng app
fr_ca: Barre d'applications
gl: Barra de aplicacións
gu: ઍપ બાર
he: סרגל האפליקציה
hi: ऐप्लिकेशन बार
hu: Alkalmazássáv
hy: Հավելվածի գոտի
id: Panel aplikasi
it: Barra dell'app
ja: アプリバー
ka: აპების ზოლი
km: របារកម្មវិធី
kn: ಆ್ಯಪ್ ಬಾರ್
ko: 앱 바
ky: Колдонмонун тилкеси
lo: ແອັບບາ
lt: Programos juosta
lv: Lietotņu josla
mk: Лента за апликацијата
ml: ആപ്പ് ബാർ
mn: Аппын талбар
mr: अ‍ॅप बार
ms: Bar apl
my: အက်ပ်ဘား
nb: Apprad
ne: एप बार
pa: ਐਪ ਪੱਟੀ
pl: Pasek aplikacji
pt: Barra de apps
pt_pt: Barra de apps
ro: Bara de aplicații
ru: Панель приложения
si: යෙදුම් තීරුව
sk: Panel aplikácie
sq: Shiriti i aplikacionit
sr: Трака апликације
sr_latn: Traka aplikacije
sv: Appfält
te: యాప్ బార్
th: แถบแอป
tr: Uygulama çubuğu
uk: Панель додатків
ur: ایپ بار
uz: Ilova paneli
vi: Thanh ứng dụng
zh_hk: 應用程式列
zu: Ibha ye-app

# demoAppBarDescription
source: The App bar provides content and actions related to the current screen. It's used for branding, screen titles, navigation, and actions
af: Die programbalk verskaf inhoud en handelinge wat met die huidige skerm verband hou. Dit word vir handelsmerke, skermtitels, navigasie en handelinge gebruik
am: የመተግበሪያ አሞሌው አሁን ካለው ማያ ገፅ ጋር ተዛማጅ የሆነ ይዘትን እና እርምጃዎችን ያቀርባል። ለምርት ስያሜ፣ ለማያ ገፅ አርዕስቶች፣ ለአሰሳ እና ለእርምጃዎች ስራ ላይ ይውላል
ar_eg: يعرض شريط التطبيق المحتوى والإجراءات المتعلّقة بالشاشة الحالية، ويُستخدَم لعرض العلامات التجارية وعناوين الشاشة والإجراءات والتنقّل بين الأقسام.
as: এপ্‌ বাৰডালে বৰ্তমানৰ স্ক্ৰীনখনৰ সৈতে জড়িত সমল আৰু কাৰ্য প্ৰদান কৰে। ইয়াক ব্ৰেণ্ডিং, স্ক্ৰীনৰ শিৰোনাম, নেভিগেশ্বন আৰু কাৰ্যৰ বাবে ব্যৱহাৰ কৰা হয়
az: Tətbiq paneli cari ekrana aid məzmun və əməliyyatları təmin edir. O, brendinq, ekran başlıqları, naviqasiya və əməliyyatlar üçün istifadə olunur
be: Панэль праграм прапануе змесціва і дзеянні, звязаныя з бягучым экранам. Яна выкарыстоўваецца для брэндынгу, назваў экранаў, навігацыі і дзеянняў
bn: অ্যাপ বারে বর্তমান স্ক্রিন সম্পর্কিত কন্টেন্ট ও অ্যাকশন দেখায়। এটি ব্র্যান্ডিং, স্ক্রিন টাইটেল, নেভিগেশন ও অ্যাকশনের জন্য ব্যবহৃত হয়
bs: Traka aplikacije pruža sadržaj i radnje povezane s trenutnim ekranom. Koristi se za brendiranje, naslove ekrana, navigaciju i radnje
ca: La barra d'aplicacions proporciona accions i contingut relacionats amb la pantalla actual. S'utilitza per al brànding, els títols de pantalles, la navegació i les accions.
da: Appbjælken viser indhold og handlinger, der er knyttet til den aktuelle skærm. Den bruges til branding, skærmtitler, navigation og handlinger.
es_ar: La barra de la app incluye contenido y acciones relacionadas a la pantalla actual. Se usa para desarrollo de la marca, títulos en pantalla, navegación y acciones.
et: Rakenduseriba hõlmab praeguse kuvaga seotud sisu ja toiminguid. Seda kasutatakse brändingu, kuvapealkirjade, navigeerimise ja toimingute jaoks.
eu: Une horretan ikusten den pantailarekin erlazionatutako edukia eta ekintzak bistaratzen dira aplikazioaren barran. Branding-erako, pantailen izenetarako, nabigatzeko eta ekintzetarako erabiltzen da.
fa: «نوار برنامه» محتوا و کنش‌های مربوط به صفحه فعلی را ارائه می‌دهد. از این نوار برای نمانام‌سازی، عنوان‌های صفحه، پیمایش، و کنش‌ها استفاده می‌شود
fil: Ang Bar ng app ay nagbibigay ng content at mga pagkilos kaugnay ng kasalukuyang screen. Ginagamit ito para sa pag-brand, mga pamagat ng screen, pag-navigate, at mga pagkilos
fr_ca: La barre d'applications vous présente des contenus et des actions relatifs au contenu de l'écran actuel. Elle est utilisée pour la stratégie de marque, les titres d'écran, la navigation et les actions
gl: Na barra de aplicacións podes atopar contidos e accións relacionados coa pantalla actual. Utilízase para a construción de marca, os títulos de pantallas, a navegación e as accións
gu: ઍપ બાર હાલની સ્ક્રીન સંબંધિત કન્ટેન્ટ અને ક્રિયાઓ પ્રદાન કરે છે. તેનો ઉપયોગ બ્રાંડિંગ, સ્ક્રીનના શીર્ષકો, નૅવિગેશન અને ક્રિયાઓ માટે થાય છે
he: בסרגל האפליקציה מופיעים תכנים ופעולות שקשורים למסך הנוכחי. הוא משמש למיתוג, לשמות של מסכים, לניווט ולפעולות.
hi: ऐप्लिकेशन बार, मौजूदा स्क्रीन से जुड़ी कार्रवाइयां और कॉन्टेंट उपलब्ध कराता है. इसका इस्तेमाल ब्रैंडिंग, स्क्रीन के शीर्षकों, नेविगेट करने, और कार्रवाइयों के लिए होता है
hu: Az alkalmazássáv az aktuális képernyőt érintő információkat és műveleteket biztosít. Márkaépítésre, képernyő-megnevezésre, navigálásra és műveletekre szolgál.
hy: Հավելվածի գոտում ցուցադրված են ընթացիկ էկրանին առնչվող բովանդակությունն ու գործողությունները։ Այն օգտագործվում է բրենդինգի, էկրանների վերնագրերի, նավիգացիայի և գործողությունների համար։
id: Panel aplikasi menyediakan konten dan tindakan yang terkait dengan layar saat ini. Panel aplikasi digunakan untuk branding, judul layar, navigasi, serta tindakan
it: La barra dell'app fornisce contenuti e azioni relativi alla schermata corrente. Viene utilizzata per branding, titoli delle schermate, navigazione e azioni
ja: アプリバーは、現在の画面に関連するコンテンツやアクションを表示するためのもので、ブランディングや、画面タイトル、ナビゲーション、アクションに使用されます
ka: აპების ზოლი უზრუნველყოფს მიმდინარე ეკრანთან დაკავშირებულ კონტენტსა და მოქმედებებს. ის გამოიყენება ბრენდირების, ეკრანის სათაურების, ნავიგაციისა და მოქმედებებისთვის
km: របារកម្មវិធីផ្តល់នូវខ្លឹមសារ និងសកម្មភាពដែលទាក់ទងនឹងអេក្រង់បច្ចុប្បន្ន។ របារនេះត្រូវបានប្រើសម្រាប់ការផ្សព្វផ្សាយម៉ាក ចំណងជើងអេក្រង់ ការរុករក និងសកម្មភាពផ្សេងៗ
kn: ಆ್ಯಪ್ ಬಾರ್ ಪ್ರಸ್ತುತ ಸ್ಕ್ರೀನ್‌ಗೆ ಸಂಬಂಧಿಸಿದ ವಿಷಯ ಮತ್ತು ಕ್ರಿಯೆಗಳನ್ನು ಒದಗಿಸುತ್ತದೆ. ಇದನ್ನು ಬ್ರ್ಯಾಂಡಿಂಗ್, ಸ್ಕ್ರೀನ್ ಶೀರ್ಷಿಕೆಗಳು, ನ್ಯಾವಿಗೇಷನ್ ಮತ್ತು ಕ್ರಿಯೆಗಳಿಗೆ ಬಳಸಲಾಗುತ್ತದೆ
ko: 앱 바는 현재 화면과 관련된 콘텐츠 및 작업을 제공합니다. 브랜딩, 화면 제목, 탐색, 작업에 사용됩니다.
ky: Колдонмонун тилкесинде учурдагы экранга байланыштуу контент жана аракеттер көрсөтүлөт. Ал брендди түзүү, экрандардын аталыштары, өтүү жана аракеттер үчүн колдонулат
lo: ແຖບແອັບຈະສະແດງເນື້ອຫາ ແລະ ຄຳສັ່ງຕ່າງໆທີ່ກ່ຽວຂ້ອງກັບໜ້າຈໍປັດຈຸບັນ. ມັນໃຊ້ສຳລັບການສ້າງແບຣນ, ຊື່ໜ້າຈໍ, ການນຳທາງ ແລະ ຄຳສັ່ງຕ່າງໆ
lt: Programos juostoje pateikiamas turinys ir veiksmai, susiję su esamu ekranu. Ji skirta prekės ženklui, ekrano pavadinimams, naršymo ir kitiems veiksmams
lv: Lietotņu joslā tiek rādīts saturs un darbības, kas saistītas ar pašreizējo ekrānu. Tā tiek izmantota zīmoliem, ekrānu virsrakstiem, navigācijai un darbībām.
mk: Лентата за апликацијата обезбедува содржини и дејства поврзани со тековниот екран. Се користи за брендирање, наслови на екранот, навигација и дејства.
ml: നിലവിലെ സ്ക്രീനുമായി ബന്ധപ്പെട്ട ഉള്ളടക്കവും പ്രവർത്തനങ്ങളും ആപ്പ് ബാർ നൽകുന്നു. ഇത് ബ്രാൻഡിംഗ്, സ്ക്രീൻ പേരുകൾ, നാവിഗേഷൻ, പ്രവർത്തനങ്ങൾ എന്നിവയ്ക്ക് ഉപയോഗിക്കുന്നു
mn: Аппын талбар нь одоогийн дэлгэцтэй холбоотой контент болон үйлдлүүдийг үзүүлнэ. Үүнийг брендинг, дэлгэцийн нэрс, навигац болон үйлдлүүдэд ашигладаг
mr: अ‍ॅप बार सध्याच्या स्क्रीनसंबंधित आशय आणि कृती दाखवतो. तो ब्रँडिंग, स्क्रीन शीर्षक, नेव्हिगेशन आणि कृतींसाठी वापरले जातो
ms: Bar Apl menyediakan kandungan dan tindakan yang berkaitan dengan skrin semasa. Bar Apl ini digunakan untuk penjenamaan, tajuk skrin, navigasi dan tindakan
my: ‘အက်ပ်ဘား’ က လက်ရှိစခရင်နှင့် ဆက်စပ်သော အကြောင်းအရာနှင့် လုပ်ဆောင်ချက်များ ပံ့ပိုးသည်။ အမှတ်တံဆိပ်တပ်ခြင်း၊ စခရင်ခေါင်းစဉ်များ၊ လမ်းညွှန်ခြင်းနှင့် လုပ်ဆောင်ချက်များအတွက် ၎င်းကိုသုံးသည်
nb: På appraden finner du innhold og handlinger som er tilknyttet den aktive skjermen. Den brukes til merkevarebygging, skjermtitler, navigasjon og handlinger.
ne: एपको बारले हालको स्क्रिनसँग सम्बन्धित सामग्री र कारबाहीहरू प्रदान गर्छ। ब्रान्डिङ, स्क्रिनका शीर्षक, नेभिगेसन र कारबाहीहरूका लागि यसको प्रयोग गरिन्छ
pa: ਐਪ ਪੱਟੀ ਮੌਜੂਦਾ ਸਕ੍ਰੀਨ ਨਾਲ ਸੰਬੰਧਿਤ ਸਮੱਗਰੀ ਅਤੇ ਕਾਰਵਾਈਆਂ ਮੁਹੱਈਆ ਕਰਵਾਉਂਦੀ ਹੈ। ਇਸਦੀ ਵਰਤੋਂ ਬ੍ਰਾਂਡਿੰਗ, ਸਕ੍ਰੀਨ ਸਿਰਲੇਖਾਂ, ਨੈਵੀਗੇਸ਼ਨ ਅਤੇ ਕਾਰਵਾਈਆਂ ਲਈ ਕੀਤੀ ਜਾਂਦੀ ਹੈ
pl: Pasek aplikacji zawiera treści i czynności dotyczące aktualnego ekranu. Można na nim umieścić oznaczenia marki, nazwę ekranu, elementy nawigacyjne i opcje czynności
pt: A barra de apps mostra ações e conteúdos relacionados à tela atual. Ela é usada para branding, títulos de telas, ações e navegação.
pt_pt: A barra de apps disponibiliza conteúdo e ações relacionados com o ecrã atual. É usada para branding, títulos de ecrãs, navegação e ações
ro: Bara de aplicații oferă conținut și acțiuni legate de ecranul actual. Se folosește pentru branding, titluri de ecran, navigare și acțiuni
ru: На панели приложения представлены сведения и действия, относящиеся к текущему экрану. Она может содержать название и логотип продукта, заголовок, а также кнопки для навигации и других действий.
si: යෙදුම් තීරුව වත්මන් තිරයට අදාළ අන්තර්ගතය සහ ක්‍රියා සපයයි. එය සන්නම්කරණය, තිර මාතෘකා, සංචාලනය සහ ක්‍රියා සඳහා භාවිත වේ
sk: Panel aplikácie zobrazuje kontext a akcie súvisiace s aktuálnou obrazovkou. Môžete ho využiť pri budovaní značky, pomenúvaní obrazoviek, navigácii a rôznych akciách.
sq: Shiriti i aplikacionit ofron përmbajtje dhe veprime që lidhen me ekranin aktual. Ai përdoret për markat, titujt e ekraneve, navigimin dhe veprimet
sr: Ова трака апликације пружа садржај и радње у вези са актуелним екраном. Користи се за брендирање, наслове екрана, навигацију и радње
sr_latn: Ova traka aplikacije pruža sadržaj i radnje u vezi sa aktuelnim ekranom. Koristi se za brendiranje, naslove ekrana, navigaciju i radnje
sv: I appfältet visas innehåll och åtgärder för den aktuella skärmen. Det kan vara varumärken, titlar på skärmen, navigering och åtgärder
te: యాప్ బార్, ప్రస్తుత స్క్రీన్‌కు సంబంధించిన కంటెంట్, చర్యలను అందిస్తుంది. ఇది బ్రాండింగ్, స్క్రీన్ టైటిల్స్, నావిగేషన్, చర్యల కోసం ఉపయోగించబడుతుంది
th: แถบแอปแสดงเนื้อหาและการทำงานที่เกี่ยวข้องกับหน้าจอปัจจุบัน ใช้สำหรับการสร้างแบรนด์ ชื่อหน้าจอ การนำทาง และการทำงาน
tr: Uygulama çubuğu, geçerli ekranla ilgili içerikleri ve işlemleri gösterir. Bu çubuk; marka bilinci oluşturma, ekran başlıkları, gezinme ve işlemler için kullanılır
uk: На панелі додатків показано контент і дії, пов’язані з поточним екраном. Вона використовується для фірмового оформлення, назв екранів, навігації та дій
ur: ایپ بار موجودہ اسکرین سے متعلق مواد اور کارروائیاں فراہم کرتا ہے۔ یہ برانڈنگ، اسکرین کے عنوانات، نیویگیشن اور کارروائیوں کے لیے استعمال ہوتا ہے
uz: Ilova paneli joriy ekranga tegishli kontent va amallarni taqdim etadi. U brending, ekran nomlari, navigatsiya va harakatlar uchun ishlatiladi
vi: Thanh ứng dụng cung cấp nội dung và thao tác liên quan đến màn hình hiện tại. Bạn có thể dùng thanh này cho hoạt động xây dựng thương hiệu, tiêu đề màn hình, thông tin điều hướng và thao tác
zh_hk: 應用程式列會提供與目前畫面相關的內容和動作，用於品牌經營、顯示畫面標題、提供導覽及動作
zu: Ibha ye-app inikeza okuqukethwe nezenzo ezihlobene nesikrini samanje. Isetshenziselwa ukufaka uphawu, izihloko zesikrini, ukufuna, nezenzo

# demoDividerTitle
source: Divider
af: Verdeler
am: አካፋይ
ar_eg: أداة تقسيم الشاشة
as: বিভাজক
az: Ayırıcı
be: Раздзяляльнік
bn: ডিভাইডার
bs: Graničnik
ca: Divisor
da: Skillelinje
es_ar: Divisor
et: Jaotur
eu: Bereizlea
fa: تقسیم‌کننده
fr_ca: Séparateur
gl: Separador
gu: વિભાજક
he: קו מפריד
hi: डिवाइडर
hu: Elválasztó
hy: Բաժանիչ
id: Pembagi
it: Divisore
ja: 分割線
ka: გამყოფი
km: បន្ទាត់ខណ្ឌចែក
kn: ವಿಭಾಜಕ
ko: 구분선
ky: Бөлгүч
lo: ຕົວຂັ້ນ
lt: Daliklis
lv: Atdalītājs
mk: Разделувач
ml: ഡിവൈഡർ
mn: Хуваагч
mr: विभाजक
ms: Pembahagi
my: ပိုင်းခြားမျဉ်း
nb: Skillelinje
ne: विभाजक
pa: ਵਿਭਾਜਕ
pl: Separator
pt: Divisor
pt_pt: Divisor
ro: Separator
ru: Разделитель
si: වෙන්කරණය
sk: Rozdeľovač
sq: Ndarësi
sr: Разделник
sr_latn: Razdelnik
sv: Avgränsare
te: డివైడర్
th: ตัวแบ่ง
tr: Ayırıcı
uk: Роздільник
ur: تقسیم کار
uz: Ajratkich
vi: Đường phân chia
zh_hk: 分隔線
zu: Isihlukanisi

# demoDividerSubtitle
source: A divider is a thin line that groups content in lists and layouts.
af: ’n Verdeler is ’n dun lyn wat inhoud op lyste en uitlegte groepeer.
am: አካፋይ ይዘትን በዝርዝሮች እና በአቀማመጦች የሚያከፋፍል ቀጭን መስመር ነው።
ar_eg: أداة تقسيم الشاشة هي خط رفيع يُجمِّع المحتوى في قوائم وتنسيقات.
as: বিভাজক হৈছে এডাল ক্ষীণ ৰেখা যিয়ে সূচী আৰু লে’আউটত সমল গোটবদ্ধ কৰে।
az: Ayırıcı məzmunu siyahılarda və tərtibatlarda qruplaşdıran nazik bir xəttdir.
be: Раздзяляльнік – гэта тонкая лінія, якая раздзяляе групы змесціва ў спісах і макетах.
bn: ডিভাইডার একটি সরু লাইন যেটি বিভিন্ন তালিকা ও লে-আউটে কন্টেন্ট আলাদা আলাদাভাবে দেখায়।
bs: Graničnik je tanka linija koja grupiše sadržaj u liste i rasporede
ca: Un divisor és una línia prima que agrupa contingut en llistes i dissenys.
da: En skillelinje er en tynd linje, der grupperer indhold i lister og inddeler opsætningen.
es_ar: Un divisor es una línea fina que agrupa contenido en listas y paneles.
et: Jaotur on peenike joon, mis rühmitab sisu loenditesse ja paigutustesse.
eu: Edukia zerrendetan eta diseinuetan taldekatzen duten lerro meheak dira bereizleak.
fa: تقسیم‌کننده خط باریکی است که محتوا را در فهرست‌ها و طرح‌بندی‌ها گروه‌بندی می‌کند.
fil: Ang divider ay manipis na linyang naggugrupo ng content sa mga listahan at layout.
fr_ca: Un séparateur est une fine ligne qui regroupe les contenus dans les listes et les mises en page.
gl: Un separador é unha liña fina que agrupa contido en listas e deseños.
gu: વિભાજક એ કોઈ પાતળી લાઇન છે કે જે સૂચિ અને લેઆઉટમાં કન્ટેન્ટનું ગ્રૂપ બનાવે છે.
he: קו מפריד הוא קו דק שמקבץ תכנים ברשימות ובפריסות.
hi: डिवाइडर उस बारीक लाइन को कहते हैं जो कॉन्टेंट को सूचियों और लेआउट में बांटता है.
hu: Az elválasztó egy vékony vonal, amely listákba és elrendezésekbe csoportosítja a tartalmakat.
hy: Բաժանիչը բարակ գիծ է, որը բովանդակությունը խմբավորում է ցանկերում և մակետներում։
id: Pembagi merupakan garis tipis yang mengelompokkan konten dalam daftar dan tata letak.
it: Un divisore è una linea sottile che raggruppa contenuti in elenchi e layout.
ja: 分割線は、リストやレイアウトを区切ることができる細い線で、コンテンツをグループ化して表示するのに使用します。
ka: გამყოფი თხელი ხაზია, რომელიც აჯგუფებს კონტენტს სიების და განლაგებების სახით.
km: បន្ទាត់ខណ្ឌចែក​គឺជាបន្ទាត់ស្តើងដែលដាក់ខ្លឹមសារជាក្រុមក្នុងបញ្ជី និងប្លង់។
kn: ವಿಭಾಜಕವು ಒಂದು ತೆಳುವಾದ ರೇಖೆಯಾಗಿದ್ದು ಅದು ಪಟ್ಟಿಗಳು ಮತ್ತು ಲೇಔಟ್‌ಗಳಲ್ಲಿ ವಿಷಯವನ್ನು ಗುಂಪುಗಳಾಗಿ ವಿಭಜಿಸುತ್ತದೆ.
ko: 목록 및 레이아웃에서 콘텐츠를 그룹으로 묶는 얇은 선
ky: Бөлгүч — тизмелердеги жана калыптардагы контентти топтоо үчүн колдонулган ичке сызык.
lo: ຕົວຂັ້ນແມ່ນເສັ້ນບາງໆທີ່ຈັດກຸ່ມເນື້ອຫາໄວ້ໃນລາຍຊື່ ແລະ ໂຄງຮ່າງຕ່າງໆ.
lt: Daliklis – tai plona linija, atskirianti turinio grupes sąrašuose ir išdėstymuose.
lv: Atdalītājs ir šaura līnija, ar kuru saturs tiek grupēts sarakstos un izkārtojumos.
mk: Разделувачот е тенка линија што групира содржини во списоци и распореди.
ml: ലിസ്റ്റുകളിലെയും ലേഔട്ടുകളിലെയും ഉള്ളടക്കം വേർതിരിക്കുന്ന നേരിയ വരയാണ് ഡിവൈഡർ.
mn: Хуваагч нь контентыг жагсаалт болон бүдүүвчид бүлэглэдэг нарийн шугам юм.
mr: विभाजक ही एक बारीक रेषा आहे जी सूची आणि लेआउट यांनुसार आशय गटबद्ध करते.
ms: Pembahagi ialah garisan nipis yang mengumpulkan kandungan dalam senarai dan reka letak.
my: ပိုင်းခြားမျဉ်းသည် စာရင်းနှင့် အပြင်အဆင်များတွင် အကြောင်းအရာကို အုပ်စုဖွဲ့ပေးသည့် မျဉ်းအပါးဖြစ်သည်။
nb: En skillelinje er en tynn linje som brukes til å gruppere innhold i lister og oppsett.
ne: विभाजक एउटा पातलो लाइन हो। यसले सामग्रीलाई सूची र लेआउटहरूमा समूहबद्ध गर्छ।
pa: ਵਿਭਾਜਕ ਇੱਕ ਪਤਲੀ ਲਾਈਨ ਹੈ ਜੋ ਸੂਚੀਆਂ ਅਤੇ ਖਾਕਿਆਂ ਵਿੱਚ ਸਮੱਗਰੀ ਨੂੰ ਗਰੁੱਪਬੱਧ ਕਰਦੀ ਹੈ।
pl: Separator to cienka linia oddzielająca elementy listy i layoutu.
pt: Um divisor é uma linha fina que agrupa conteúdos em listas e layouts.
pt_pt: Um divisor é uma linha fina que agrupa conteúdo em listas e esquemas.
ro: Un separator este o linie subțire care grupează conținutul în liste și aspecte.
ru: Тонкая линия, с помощью которой можно группировать контент
si: වෙන්කරණයක් යනු ලැයිස්තුවල සහ පිරිසැලසුම්වල අන්තර්ගතය සමූහ කරන තුනී රේඛාවකි.
sk: Rozdeľovač je tenká čiara umožňujúca zoskupiť obsah v zoznamoch a rozloženiach.
sq: Ndarësi është një vijë e hollë që grupon përmbajtjet në lista dhe struktura.
sr: Разделник је танка линија која групише садржај у листе и распореде.
sr_latn: Razdelnik je tanka linija koja grupiše sadržaj u liste i rasporede.
sv: En avgränsare är en tunn linje som delar upp innehåll i listor och layouter.
te: డివైడర్ అనేది లిస్ట్‌లు, లేఅవుట్‌లలోని కంటెంట్‌ను సమూహపరిచే సన్నని గీత.
th: ตัวแบ่งคือเส้นบางๆ ที่จัดเนื้อหาในรายการและเลย์เอาต์ไว้เป็นกลุ่ม
tr: Ayırıcı, içeriği listelerde ve düzenlerde gruplandıran ince bir çizgidir.
uk: Роздільник – це тонка лінія, яка групує контент у списки й макети.
ur: تقسیم کار ایک پتلی لکیر ہے جو مواد کو فہرستوں اور لے آؤٹس میں گروپ بند کرتی ہے۔
uz: Ajratkich kontentni roʻyxatlar va tartiblarda guruhlaydigan ingichka chiziq.
vi: Đường phân chia là một đường thẳng mỏng giúp nhóm nội dung thành các danh sách và bố cục.
zh_hk: 分隔線是一條細線，可分隔清單及版面配置中的內容。
zu: Isihlukanisi siwumugqa omncane ohlanganisa okuqukethwe ezinhlwini nasohlakeni.
