Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCardDescription
source: A card is a sheet of Material used to represent some related information, for example an album, a geographical location, a meal, contact details, etc.
af: 'n Kaart is 'n sigblad met materiaal wat gebruik word om verwante inligting te verteenwoordig, soos byvoorbeeld 'n album, 'n geografiese ligging, 'n maaltyd, kontakbesonderhede, ens.
am: ካርድ ማለት አንዳንድ ተዛማጅ መረጃን ለመወከል ስራ ላይ የሚውል የቁሳዊ ሉህ ነው፣ ለምሳሌ፣ አልበም፣ ጂዮግራፊያዊ አካባቢ፣ ምግብ፣ የእውቂያ ዝርዝሮች፣ ወዘተ።
ar_eg: البطاقة هي ورقة مواد تُستخدَم لتمثيل بعض المعلومات ذات الصلة، مثلاً ألبوم أو موقع جغرافي أو وجبة أو تفاصيل جهة اتصال أو ما إلى ذلك.
as: এখন কাৰ্ড হৈছে কিছুমান প্ৰাসংগিক তথ্য প্ৰতিনিধিত্ব কৰিবলৈ ব্যৱহাৰ কৰা বস্তুবোৰৰ এখন শ্বীট, যেনে এলবাম, কোনো ভৌগোলিক অৱস্থান, কোনো আহাৰ, যোগাযোগৰ সবিশেষ ইত্যাদি।
az: Kart albom, coğrafi məkan, yemək, əlaqə məlumatları və sair kimi əlaqədar məlumatların təqdim edilməsi üçün istifadə edilən Material vərəqidir.
be: На картцы можна размясціць дадатковыя даныя, напрыклад інфармацыю пра альбом, геаграфічнае месцазнаходжанне, страву, кантактныя даныя і г. д.
bn: কার্ড হল কোনও জিনিসের তৈরি পৃষ্ঠা যেখানে কিছু তথ্য থাকে, যেমন অ্যালবাম, ভৌগোলিক লোকেশন, খাবার সংক্রান্ত তথ্য, পরিচিতির বিবরণ ইত্যাদি সেখানে উল্লেখ করা হয়।
bs: Kartica je list materijala koji se koristi za prikaz povezanih podataka kao što je album, geografska lokacija, obrok, detalji o kontaktu itd.
ca: Una targeta és un full de Material Design que s'utilitza per representar informació relacionada, com ara un àlbum, una ubicació geogràfica, un àpat, dades de contacte, etc.
da: Et kort er et ark fra Material Design, der bruges til at repræsentere nogle relaterede oplysninger som f.eks. et album, en geografisk lokation, et måltid, kontaktoplysninger osv.
es_ar: Las tarjetas son hojas de material design que se usan para representar información relacionada (como un álbum, una ubicación geográfica, una comida, datos de un contacto, etc.).
et: Kaart on materjali leht, mida kasutatakse mingi seotud teabe (nt albumi, geograafilise asukoha, eine, kontaktandmete jm) esitamiseks.
eu: Material diseinuko orri bat da txartela. Haren bidez, erlazionatutako informazioa ematen da; adibidez, album bat, kokapen geografiko bat, janari bat, harremanetarako xehetasunak, etab.
fa: کارت، برگه‌ای حاوی «مطالب» است که برای ارائه برخی اطلاعات مرتبط (مثل جزئیات مخاطب، آلبوم، مکان جغرافیایی، وعده غذایی و غیره) استفاده می‌شود.
fil: Ang card ay isang sheet ng Materyal na ginagamit para katawanin ang ilang nauugnay na impormasyon, halimbawa, isang album, isang pangheyograpiyang lokasyon, isang pagkain, mga detalye sa pakikipag-ugnayan, atbp.
fr_ca: Une carte est un cadre où sont présentés des renseignements liés à une recherche, comme un album, un lieu, un plat, des coordonnées, etc.
gl: Unha tarxeta é un cadro utilizado para representar información relacionada, por exemplo, un álbum, unha localización xeográfica, unha comida, os datos de contacto etc.
gu: કાર્ડ એ એવી કેટલીક સંબંધિત માહિતીને રજૂ કરવા માટે વપરાતી સામગ્રીની શીટ હોય છે, ઉદાહરણ તરીકે, આલ્બમ, ભૌગોલિક સ્થાન, ભોજન, સંપર્કની વિગતો, વગેરે.
he: כרטיס הוא גיליון בעיצוב חדשני תלת-ממדי שמשמש לייצוג מידע קשור, לדוגמה: אלבום, מיקום גיאוגרפי, ארוחה, פרטים ליצירת קשר וכו'.
hi: कार्ड, Material Design की एक शीट होती है. इसका इस्तेमाल किसी खाेज से मिलती-जुलती जानकारी दिखाने के लिए किया जाता है. उदाहरण के लिए, कोई जगह, किसी तरह का खाना, संपर्क की जानकारी वगैरह.
hu: A kártya olyan Material-lap, amelyen kapcsolódó információ szerepel (pl. album, földrajzi hely, étkezés, kapcsolatfelvételi adatok stb.).
hy: Քարտը մի թերթիկ է, որը պարունակում է առչնվող տեղեկություններ որևէ բանի (օր․՝ ալբոմի, գտնվելու վայրի, ճաշատեսակի, կոնտակտային տվյալների) մասին։
id: Kartu adalah selembar Bahan yang digunakan untuk menampilkan beberapa informasi terkait, misalnya album, lokasi geografis, makanan, detail kontak, dll.
it: Una scheda è un foglio di Material usato per rappresentare alcune informazioni correlate, ad esempio un album, una posizione geografica, un pasto, dettagli di contatto e così via.
ja: カードは、アルバム、地理的位置、食事、連絡先の詳細など、いくつかの関連する情報を表す場合に使用するマテリアルのシートです。
ka: ბარათი არის Material-ის ფურცელი, რომელზეც წარმოდგენილია გარკვეული დაკავშირებული ინფორმაცია, მაგალითად, ალბომი, გეოგრაფიული მდებარეობა, კერძი, საკონტაქტო დეტალები და ა.შ.
km: កាតគឺជាសន្លឹក​ខ្លឹមសារមួយ​ដែលប្រើ ដើម្បីតំណាងឱ្យ​ព័ត៌មាន​ពាក់ព័ន្ធ​មួយចំនួន ឧទាហរណ៍ អាល់ប៊ុម ទីតាំង​ភូមិសាស្ត្រ អាហារ ព័ត៌មានទំនាក់ទំនង ។ល។
kn: ಆಲ್ಬಮ್‌ಗಳು, ಭೌಗೋಳಿಕ ಸ್ಥಳ, ಆಹಾರ, ಸಂಪರ್ಕ ವಿವರಗಳು ಮುಂತಾದ ಕೆಲವು ಮಾಹಿತಿಯನ್ನು ಒಳಗೊಂಡಿರುವ ವಿಷಯಗಳನ್ನು ಪ್ರತಿನಿಧಿಸುವ ಮಟೇರಿಯಲ್‌ ಶೀಟ್‌ನಿಂದ ಮಾಡಿದ ಕಾರ್ಡ್ ಇದಾಗಿದೆ.
ko: 카드는 머티리얼 디자인에서 관련 정보(예: 앨범, 지리적 위치, 식사, 연락처 세부정보)를 표시하는 데 사용되는 시트입니다.
ky: Картада Material камтылган барак көрсөтүлүп, анда тийиштүү маалымат берилет, мисалы, альбом, географиялык жер, тамак-аш, байланыштын чоо-жайы, ж.б.
lo: ບັດແມ່ນແຜ່ນເອກະສານທີ່ໃຊ້ສະແດງຂໍ້ມູນທີ່ກ່ຽວຂ້ອງ ເຊັ່ນ: ອະລະບ້ຳ, ສະຖານທີ່ຕັ້ງທາງພູມສາດ, ຄາບເຂົ້າ, ຂໍ້ມູນການຕິດຕໍ່ ແລະ ອື່ນໆ.
lt: Kortelė – tai trimačių objektų dizaino lapas, kuriame pateikiama tam tikra susijusi informacija, pvz., albumas, geografine informacija apibrėžta vietovė, patiekalas, išsami kontaktinė informacija ir pan.
lv: Kartīte ir lapas materiāls, kas tiek izmantots saistītas informācijas attēlošanai, piemēram, albumam, ģeogrāfiskajai atrašanās vietai, maltītei, kontaktinformācijai un citam saturam.
mk: Картичката е лист од материјал што се користи за прикажување поврзани податоци како, на пр., албум, географска локација, оброк, детали за контакт итн.
ml: ആൽബം, ഭൂമിശാസ്‌ത്ര ലൊക്കേഷൻ, ഭക്ഷണം, കോൺടാക്റ്റ് വിശദാംശങ്ങൾ മുതലായവ പോലുള്ള അനുബന്ധ വിവരങ്ങളെ പ്രതിനിധീകരിക്കാൻ ഉപയോഗിക്കുന്ന മെറ്റീരിയലിന്റെ ഷീറ്റാണ് ഒരു കാർഡ്.
mn: Карт нь цомог, газарзүйн байршил, хоол, харилцах дэлгэрэнгүй мэдээлэл гэх мэт зарим холбоотой мэдээллийг харуулахад ашигладаг цаасан материал юм.
mr: कार्ड म्हणजे मटेरियल ची एक शीट आहे जी काही संबंधित माहितीचे प्रतिनिधित्व करण्यासाठी वापरली जाते, उदाहरणार्थ एखादा अल्बम, भौगोलिक स्थान, जेवण, संपर्क तपशील इ.
ms: Kad merupakan helaian Bahan yang digunakan untuk mewakili beberapa maklumat berkaitan, contohnya album, lokasi geografi, hidangan, butiran hubungan dan lain-lain.
my: ကတ်ဟူသည်မှာ ဥပမာအားဖြင့် အယ်လ်ဘမ်၊ ပထဝီဝင်တည်နေရာ၊ အစားအသောက်၊ အဆက်အသွယ် အသေးစိတ် အစရှိသည့် သက်ဆိုင်ရာ အချက်အလက်အချို့ကို ဖော်ပြရန် အသုံးပြုသည့် ကတ်ပြားဖြစ်သည်။
nb: Et kort er et ark av materiale som brukes til å representere relatert informasjon, for eksempel et album, en geografisk posisjon, et måltid, kontaktdetaljer osv.
ne: कार्ड भनेको एल्बम, भौगोलिक स्थान, खाना, सम्पर्क विवरणहरू आदि जस्ता जानकारी जनाउन प्रयोग गरिने सामग्रीको एउटा पाना हो।
pa: ਕਾਰਡ, ਸਮੱਗਰੀ ਦੀ ਇੱਕ ਅਜਿਹੀ ਸ਼ੀਟ ਹੈ ਜੋ ਕੁਝ ਸੰਬੰਧਿਤ ਜਾਣਕਾਰੀ ਨੂੰ ਦਰਸਾਉਣ ਲਈ ਵਰਤੀ ਜਾਂਦੀ ਹੈ, ਉਦਾਹਰਨ ਵਜੋਂ ਕੋਈ ਐਲਬਮ, ਭੂਗੋਲਿਕ ਟਿਕਾਣਾ, ਭੋਜਨ, ਸੰਪਰਕ ਵੇਰਵੇ, ਆਦਿ।
pl: Karta to element interfejsu w stylu Material Design, na którym wyświetlane są powiązane informacje, na przykład album, położenie geograficzne, opis potrawy czy dane kontaktowe.
pt: Um card é um item do Material usado para representar informações relacionadas, como um álbum, uma localização geográfica, uma refeição, detalhes de contato etc.
pt_pt: Um cartão consiste em material utilizado para representar alguma informação relacionada, por exemplo, um álbum, uma localização geográfica, uma refeição, detalhes de contacto, etc.
ro: Cardul este o bucată de material folosită pentru a prezenta informații conexe, de exemplu, un album, o locație geografică, o masă, date de contact etc.
ru: На карточке можно разместить дополнительную информацию, например сведения об альбоме, блюде, географическом местоположении, контактных данных и т. д.
si: කාඩ්පතක් යනු සමහර අදාළ තොරතුරු නිරූපණය කිරීම සඳහා භාවිතා කරන ද්‍රව්‍ය පත්‍රිකාවකි, උදාහරණයක් ලෙස ඇල්බමයක්, භූගෝලීය ස්ථානයක්, ආහාර වේලක්, සම්බන්ධතා තොරතුරු යනාදිය.
sk: Karta je hárok vzhľadu Material, ktorá predstavuje niektoré súvisiace informácie, napríklad album, zemepisnú polohu, jedlo, kontaktné údaje a podobne.
sq: Një kartë është një fletë e materialit të përdorur për të paraqitur disa informacione përkatëse, p.sh. një album, një vendndodhje gjeografike, një vakt, detajet e kontaktit etj.
sr: Картица је елемент материјалног дизајна који се користи за представљање сродних информација, на пример, албума, географске локације, оброка, података за контакт итд.
sr_latn: Kartica je element materijalnog dizajna koji se koristi za predstavljanje srodnih informacija, na primer, albuma, geografske lokacije, obroka, podataka za kontakt itd.
sv: Ett kort är ett ark i Material Design som används för att representera relaterad information, till exempel ett album, en geografisk plats, en måltid, kontaktuppgifter osv.
te: కార్డ్ అనేది కొంత సంబంధిత సమాచారాన్ని సూచించడానికి ఉపయోగించే ఒక మెటీరియల్ షీట్, ఉదాహరణకు ఆల్బమ్, భౌగోళిక సంబంధిత లొకేషన్, భోజనం, కాంటాక్ట్ వివరాలు మొదలైనవి.
th: การ์ดคือแผ่นเอกสารที่ใช้แสดงข้อมูลที่เกี่ยวข้อง เช่น อัลบั้ม สถานที่ตั้งทางภูมิศาสตร์ มื้ออาหาร ข้อมูลติดต่อ เป็นต้น
tr: Kartlar; albüm, coğrafi konum, yemek, iletişim bilgileri gibi alakalı bilgileri temsil etmek için kullanılan Materyal sayfalarıdır.
uk: Картка – це аркуш із матеріальним дизайном, який використовується для представлення деякої пов'язаної інформації (наприклад, альбому, географічного розташування, інформації про їжу, контактних даних тощо).
ur: کارڈ کچھ متعلقہ معلومات کی نمائندگی کے لئے استعمال ہونے والے مواد کی ایک شیٹ ہے، مثال کے طور پر ایک البم، جغرافیائی مقام، کھانے، رابطے کی تفصیلات وغیرہ۔
uz: Bildirgiga qoʻshimcha axborot joylash mumkin, masalan, albom, taom, joylashuv va kontaktlar haqidagi axborotlarni.
vi: Thẻ là một tờ Vật liệu dùng để trình bày một số thông tin có liên quan, ví dụ như album, vị trí địa lý, một bữa ăn, chi tiết liên hệ, v.v.
zh_hk: 資訊卡是用於展示相關資訊的質感設計資訊頁，如相簿、地理位置、菜色、聯絡詳情等。
zu: Ikhadi yishidi lokubalulekile okusetshenziselwa ukumelela imininingwane ethile ehlobene nakho, ngokwesibonelo i-albhamu, indawo yomhlaba, ukudla, imininingwane yokukuthinta, njll.

# demoDataTableTitle
source: Data Tables
af: Datatabelle
am: የውሂብ ሠንጠረዦች
ar_eg: جداول البيانات
as: ডেটাৰ তালিকাসমূহ
az: Data Cədvəlləri
be: Табліцы з данымі
bn: ডেটা টেবিল
bs: Tabele s podacima
ca: Taules de dades
da: Datatabeller
es_ar: Tablas de datos
et: Andmetabelid
eu: Datu-taulak
fa: جدول‌های داده
fil: Mga Talahanayan ng Data
fr_ca: Tableaux de données
gl: Táboas de datos
gu: ડેટા ટેબલ
he: טבלאות נתונים
hi: डेटा टेबल
hu: Adattáblák
hy: Տվյալների աղյուսակներ
id: Tabel Data
it: Tabelle di dati
ja: データテーブル
ka: მონაცემთა ცხრილები
km: តារាងទិន្នន័យ
kn: ಡೇಟಾ ಟೇಬಲ್‌ಗಳು
ko: 데이터 표
ky: Маалымат жадыбалдары
lo: ຕາຕະລາງຂໍ້ມູນ
lt: Duomenų lentelės
lv: Datu tabulas
mk: Табели со податоци
ml: ഡാറ്റാ പട്ടികകൾ
mn: Өгөгдлийн хүснэгт
mr: डेटा सारण्या
ms: Jadual Data
my: ဒေတာဇယားများ
nb: Datatabeller
ne: डेटाको तालिका
pa: ਡਾਟਾ ਸਾਰਨੀਆਂ
pl: Tabele danych
pt: Tabelas de dados
pt_pt: Tabelas de dados
ro: Tabele de date
ru: Таблицы с данными
si: දත්ත වගු
sk: Tabuľky údajov
sq: Tabelat e të dhënave
sr: Табеле са подацима
sr_latn: Tabele sa podacima
sv: Datatabeller
te: డేటా పట్టికలు
th: ตารางข้อมูล
tr: Veri Tabloları
uk: Таблиці даних
ur: ڈیٹا کے ٹیبلز
uz: Maʼlumotlar keltirilgan jadvallar
vi: Bảng dữ liệu
zh_hk: 資料表
zu: Amathebula edatha

# demoDataTableSubtitle
source: Rows and columns of information
af: Rye en kolomme inligting
am: የመረጃ ረድፎች እና አምዶች
ar_eg: صفوف وأعمدة من المعلومات
as: তথ্যৰ শাৰী আৰু স্তম্ভসমূহ
az: Məlumat sıraları və sütunları
be: Радкі і слупкі з данымі
bn: তথ্যের সারি এবং কলাম
bs: Redovi i kolone s informacijama
ca: Files i columnes d'informació
da: Rækker og kolonner med oplysninger
es_ar: Filas y columnas de información
et: Teabe read ja veerud
eu: Informazioa duten errenkadak eta zutabeak
fa: ردیف‌ها و ستون‌های اطلاعات
fil: Mga row at column ng impormasyon
fr_ca: Lignes et colonnes d'information
gl: Filas e columnas de información
gu: માહિતીની પંક્તિઓ અને કૉલમ
he: שורות ועמודות של מידע
hi: पंक्तियां और कॉलम, जिनमें जानकारी मौजूद होती है
hu: Információkat tartalmazó sorok és oszlopok
hy: Տեղեկություններ պարունակող տողեր և սյունակներ
id: Baris dan kolom informasi
it: Righe e colonne di informazioni
ja: 情報の行と列
ka: ინფორმაციის მწკრივები და სვეტები
km: ជួរដេក និងជួរឈរ​នៃព័ត៌មាន
kn: ಮಾಹಿತಿಯ ಸಾಲುಗಳು ಮತ್ತು ಕಾಲಮ್‌ಗಳು
ko: 정보의 행과 열
ky: Маалымат камтылган саптар жана тилкелер
lo: ແຖວ ແລະ ຖັນຂໍ້ມູນ
lt: Informacijos eilutės ir stulpeliai
lv: Informācijas rindas un kolonnas
mk: Редови и колони со податоци
ml: വിവരങ്ങളുടെ വരികളും കോളങ്ങളും
mn: Мэдээллийн мөр болон баганууд
mr: माहिती असलेल्या पंक्ती आणि स्तंभ
ms: Baris dan lajur maklumat
my: အချက်အလက်၏ အတန်းနှင့် ကော်လံများ
nb: Rader og kolonner med informasjon
ne: जानकारी भएका पङ्क्ति तथा स्तम्भहरू
pa: ਜਾਣਕਾਰੀ ਦੀਆਂ ਕਤਾਰਾਂ ਅਤੇ ਕਾਲਮ
pl: Wiersze i kolumny z informacjami
pt: Linhas e colunas de informações
pt_pt: Linhas e colunas de informações
ro: Rânduri și coloane cu informații
ru: Информация, организованная в виде таблицы
si: පේළි සහ තොරතුරු තීරු
sk: Riadky a stĺpce informácií
sq: Rreshtat dhe kolonat e informacioneve
sr: Редови и колоне са информацијама
sr_latn: Redovi i kolone sa informacijama
sv: Rader och kolumner med information
te: సమాచారం గల అడ్డు వరుసలు మరియు నిలువు వరుసలు
th: แถวและคอลัมน์ข้อมูล
tr: Bilgi satırları ve sütunları
uk: Рядки та стовпці інформації
ur: معلومات کی قطاریں اور کالمز
uz: Jadval koʻrinishidagi maʼlumotlar
vi: Hàng và cột thông tin
zh_hk: 載有資訊的列和欄
zu: Imigqa namakholomu emininingwane

# dataTableColumnCarbs
source: Carbs (g)
af: Koolhidrate (g)
am: ካርቦሃድሬት (ግ)
ar_eg: الكربوهيدرات (بالغرام)
as: শ্বেতসাৰ (গ্ৰাম)
az: Karbohidrat (q)
be: Вугляводы (г)
bn: শর্করা (g)
bs: Ugljikohidrati (g)
ca: Carbohidrats (g)
da: Kulhydrat (g)
es_ar: Carbohidratos (g)
et: Süsivesikud (g)
eu: Karbohidratoak (g)
fa: کربوهیدرات (گرم)
fil: Mga Carb (g)
fr_ca: Glucides (g)
gl: Carbohidratos (g)
gu: કાર્બોહાઇડ્રેટ (ગ્રા)
he: פחמימות (ג')
hi: कार्बोहाइड्रेट (ग्रा.)
hu: Szénhidrát (g)
hy: Ածխաջրեր (գ)
id: Karbohidrat (g)
it: Carboidrati (g)
ja: 炭水化物（g）
ka: ნახშირწყლები (გ)
km: កាបូអ៊ីដ្រាត (g)
kn: ಕಾರ್ಬೊಹೈಡ್ರೇಟ್‌ಗಳು (ಗ್ರಾಂ)
ko: 탄수화물(g)
ky: Углеводдор (г.)
lo: ຄາໂບໄຮເດຣດ (g)
lt: Angliavandeniai (g)
lv: Ogļhidrāti (g)
mk: Јаглехидрати (гр.)
ml: കാർബോഹൈഡ്രേറ്റുകൾ (ഗ്രാം)
mn: Нүүрс ус (гр)
mr: कर्बोदके (ग्रॅ)
ms: Karbohidrat (g)
my: ကစီဓာတ် (g)
nb: Karbohydrater (g)
ne: कार्बोहाइड्रेट (ग्राम)
pa: ਕਾਰਬੋਹਾਈਡਰੇਟ (ਗ੍ਰਾ.)
pl: Węglowodany (g)
pt: Carboidratos (g)
pt_pt: Hidratos de carbono (g)
ro: Carbohidrați (g)
ru: Углеводы (г)
si: කාබොහයිඩ්‍රේට (ග්‍රෑම්)
sk: Sacharidy (g)
sq: Karbohidratet (g)
sr: Угљени хидрати (g)
sr_latn: Ugljeni hidrati (g)
sv: Kolhydrater (g)
te: కార్బొ. (గ్రా)
th: คาร์โบไฮเดรต (ก.)
tr: Karbonhidrat ( g)
uk: Вуглеводи (г)
ur: کاربوہائیڈریٹس (گرام)
uz: Uglevodlar (g)
vi: Carb (g)
zh_hk: 碳水化合物 (克)
zu: Amakhabhu (g)

# placeTanjore
source: Tanjore
am: ታንጆሬ
ar_eg: تانجور
as: টাঞ্জৰ
az: Tanjor
be: Танджавур
bn: তাঞ্জোর
bs: Tanjavur
ca: Thanjavur
da: Thanjavur
es_ar: Thanjavur
fa: تانجاوور
gl: Thanjavur
gu: તાંજોર
he: טנג'ורה
hi: तंजोर
hu: Tandzsávúr
hy: Թանջավուր
ja: タンジョール
ka: ტანჯური
km: ថាន់ចរ
kn: ತಂಜಾವೂರು
ko: 탄자부르
ky: Танжавур
lo: ທານຈໍ
lt: Tandžavūras
lv: Thandžāvūra
mk: Танџавур
ml: തഞ്ചാവൂർ
mn: Танжор
mr: तंजोर
nb: Thanjavur
ne: तन्जोर
pa: ਤੰਜੋਰ
pl: Tańdźawur
ru: Танджор
si: තන්ජෝර්
sk: Thanjavur
sr: Танџавур
sr_latn: Tandžavur
sv: Thanjavur
te: తంజావూర్
th: ธานจาวูร์
tr: Thanjavur
uk: Тханджавур
ur: تنجور
zh_hk: 坦賈武爾
zu: E-Tanjore

# demoGridListsTitle
source: Grid Lists
af: Roosterlyste
am: ፍርግርግ ዝርዝሮች
ar_eg: قوائم الشبكات
as: গ্ৰিডৰ সূচীসমূহ
az: Tor Siyahılar
be: Таблічныя спісы
bn: গ্রিডের তালিকা
bs: Mrežaste liste
ca: Llistes amb quadrícula
da: Gitterlister
es_ar: Listas de cuadrícula
et: Ruudustikloendid
eu: Sareta itxurako zerrendak
fa: فهرست‌های جدولی
fil: Mga Grid na Listahan
fr_ca: Liste sous forme de grille
gl: Listas con grade
gu: ગ્રિડ સૂચિઓ
he: רשימות רשתות
hi: ग्रिड सूचियां
hu: Rácsos listák
hy: Ցանցաձև ցանկեր
id: Daftar Petak
it: Elenchi in formato griglia
ja: グリッドリスト
ka: ცხრილის სახის სიები
km: បញ្ជី​ក្រឡា
kn: ಗ್ರಿಡ್ ಪಟ್ಟಿಗಳು
ko: 바둑판식 목록
ky: Торчо тизмелери
lo: ລາຍຊື່ຕາຕະລາງ
lt: Tinklelio sąrašai
lv: Režģa saraksti
mk: Списоци на табела
ml: Grid ലിസ്റ്റുകൾ
mn: Торон жагсаалт
mr: ग्रिड सूची
ms: Senarai Grid
my: ဇယားကွက်စာရင်းများ
nb: Rutenettlister
ne: ग्रिडका सूचीहरू
pa: ਗ੍ਰਿਡ ਸੂਚੀਆਂ
pl: Listy w postaci siatki
pt: Listas de grade
pt_pt: Listas de grelhas
ro: Liste grilă
ru: Табличные списки
si: ජාලක ලැයිස්තු
sk: Mriežkové zoznamy
sq: Listat në formë rrjete
sr: Листе у облику координатних мрежа
sr_latn: Liste u obliku koordinatnih mreža
sv: Rutnätslistor
te: గ్రిడ్ లిస్ట్‌లు
th: รายการแบบตารางกริด
tr: Tablo Listeler
uk: Списки-сітки
ur: گرڈ کی فہرستیں
uz: Jadval shaklidagi roʻyxatlar
vi: Danh sách dạng lưới
zh_hk: 格狀清單
zu: Uhlu lwegridi

# placeFlowerMarket
source: Flower Market
af: Blommemark
am: የአበባ ገበያ
ar_eg: سوق الزهور
as: ফুলৰ বজাৰ
az: Gül Dükanı
be: Кветкавы кірмаш
bn: ফুলের বাজার
bs: Cvjetna tržnica
ca: Mercat de flors
da: Blomstermarked
es_ar: Mercado de flores
et: Lilleturg
eu: Lore-azoka
fa: بازار گل
fil: Pamilihan ng Bulaklak
fr_ca: Marché aux fleurs
gl: Mercado de flores
gu: ફૂલ બજાર
he: שוק פרחים
hi: फूलों का बाज़ार
hu: Virágpiac
hy: Ծաղիկների շուկա
id: Pasar Bunga
it: Mercato dei fiori
ja: フラワー マーケット
ka: ყვავილების ბაზრობა
km: ផ្សារ​លក់​ផ្កា
kn: ಹೂವಿನ ಮಾರುಕಟ್ಟೆ
ko: 꽃 시장
ky: Гүл базары
lo: ຕະຫຼາດດອກໄມ້
lt: Gėlių turgus
lv: Ziedu tirgus
mk: Цветен пазар
ml: പൂ മാർക്കറ്റ്
mn: Цэцгийн зах
mr: फुल मार्केट
my: ပန်းဈေး
nb: Blomstermarked
ne: फुल बजार
pa: ਫੁੱਲਾਂ ਦਾ ਬਾਜ਼ਾਰ
pl: Targ kwiatowy
pt: Mercado de flores
pt_pt: Mercado das Flores
ro: Piață de flori
ru: Цветочный рынок
si: මල් වෙළඳපොළ
sk: Trh s kvetmi
sq: Treg lulesh
sr: Цветна пијаца
sr_latn: Cvetna pijaca
sv: Blomstermarknad
te: పూల మార్కెట్
th: ตลาดดอกไม้
tr: Çiçek Pazarı
uk: Квітковий ринок
ur: پھولوں کی مارکیٹ
uz: Gul bozori
vi: Chợ hoa
zh_hk: 花墟
zu: Imakethe yezimbali

# placeBronzeWorks
source: Bronze Works
af: Bronswerke
am: የነሐስ ሥራዎች
ar_eg: الأعمال البرونزية
as: ব্ৰ’ঞ্জৰ কাম
az: Bürünc İşləmə Müəssisəsi
be: Бронзавыя промыслы
bn: যেখানে ব্রোঞ্জের কাজ হয়
bs: Proizvodi od bronze
ca: Obres de bronze
da: Bronzestøberi
es_ar: Fundidora de bronce
eu: Brontze-meategiak
fa: کارهای برنزی
fr_ca: Fonderie de bronze
gl: Fundición de bronce
gu: બ્રૉન્ઝ વર્ક
he: יצירות ארד
hi: ब्रॉन्ज़ वर्क्स
hu: Bronzműves
hy: Բրոնզե աշխատանքներ
id: Kerajinan Perunggu
it: Fonderie bronzo
ja: ブロンズ作品
ka: ბრინჯაოს ნაკეთობები
km: រោងចក្រ​ស្ល​សំរឹទ្ធ
kn: ಕಂಚಿನ ವಸ್ತು ತಯಾರಿಕೆ ಕಾರ್ಖಾನೆ
ko: 청동 세공
ky: Колодон жасалган буюмдар
lo: ໂຮງຫຼໍ່ທອງແດງ
lt: Bronzos liejykla
lv: Bronzas lietuve
mk: Бронзени изработки
ml: ബ്രോൺസ് വർക്ക്‌സ്
mn: Хүрэл эдлэлийн урлан
mr: काशासंबंधित काम
my: ကြေးထည်
nb: Bronseverk
ne: कांस्य वस्तुहरू
pa: ਕਾਂਸੇ ਦਾ ਕੰਮ
pl: Zakład wyrobów z brązu
pt: Fundição de bronze
pt_pt: Trabalhos em bronze
ro: Obiecte din bronz
ru: Завод по производству изделий из бронзы
si: ලෝකඩ වැඩ
sk: Bronzová zlievareň
sq: Vepra prej bronzi
sr: Бронзани радови
sr_latn: Bronzani radovi
sv: Bronsverkstad
te: కాంస్య తయారీ ప్రదేశం
th: โรงหล่อทองแดง
tr: Bronz İşler
uk: Бронзворкс
ur: کانسی کے کام
uz: Bronzadan mahsulot ishlab chiqaradigan zavod
vi: Xưởng đúc đồng
zh_hk: 青銅廠
zu: Imisebenzi yebhulonzi

# placeMarket
source: Market
af: Mark
am: ገበያ
ar_eg: السوق
as: বজাৰ
be: Базар
bn: বাজার
bs: Tržnica
ca: Mercat
da: Marked
es_ar: Mercado
et: Turg
eu: Merkatua
fa: بازار
fr_ca: Marché
gl: Mercado
gu: બજાર
he: שוק
hi: बाज़ार
hu: Piac
hy: Շուկա
id: Pasar
it: Mercato
ja: マーケット
ka: ბაზრობა
km: ទីផ្សារ
kn: ಮಾರುಕಟ್ಟೆ
ko: 시장
ky: Базар
lo: ຕະຫຼາດ
lt: Prekyvietė
lv: Tirgus
mk: Пазар
ml: മാർക്കറ്റ്
mn: Маркет
mr: मार्केट
my: စျေး
nb: Marked
ne: बजार
pa: ਬਾਜ਼ਾਰ
pl: Rynek
pt: Mercado
pt_pt: Mercado
ro: Piață
ru: Рынок
si: වෙළඳපොළ
sk: Trh
sq: Tregu
sr: Пијаца
sr_latn: Pijaca
sv: Marknad
te: మార్కెట్
th: ตลาด
tr: Pazar
uk: Ринок
ur: مارکیٹ
uz: Bozor
vi: Chợ
zh_hk: 市場
zu: Emakethe

# placeThanjavurTemple
source: Thanjavur Temple
af: Thanjavur-tempel
am: የታንጁቩር ቤተ መቅደስ
ar_eg: معبد ثنجفور
as: থাঞ্জাবৰ মন্দিৰ
az: Tanjavur Məbədi
be: Храм у Танджавуры
bn: তাঞ্জাভুর মন্দির
bs: Hram u Tanjavuru
ca: Temple de Thanjavur
da: Tempel i Thanjavur
es_ar: Templo en Thanjavur
et: Thanjavuri tempel
eu: Thanjavur tenplua
fa: معبد تانجاوور
fr_ca: Temple de Thanjavur
gl: Templo de Thanjavur
gu: તંજાવુર મંદિર
he: מקדש טנג'וואר
hi: तंजावुर मंदिर
hu: Tandzsávúr temploma
hy: Թանջավուրի տաճար
id: Kuil Thanjavur
it: Tempio di Thanjavur
ja: タンジャーヴール寺院
ka: ტანჯავურის ტაძარი
km: ប្រាសាទ​ថាន់ចាវួរ
kn: ತಂಜಾವೂರು ದೇವಾಲಯ
ko: 탄자부르 사원
ky: Танжавур сыйынуучу жайы
lo: ວັນທານຈາວູ
lt: Tandžavūro šventykla
lv: Thandžāvūras templis
mk: Храм во Танџавур
ml: തഞ്ചാവൂർ ക്ഷേത്രം
mn: Танжавүр сүм
mr: तंजावर मंदिर
my: Thanjavur ဘုရားကျောင်း
nb: Brihadisvara-tempelet
ne: तन्जावुर मन्दिर
pa: ਤੰਜਾਵਰ ਮੰਦਰ
pl: Świątynia w Tańdźawur
pt: Templo Thanjavur
pt_pt: Templo Thanjavur
ro: Templul Thanjavur
ru: Храм в Танджавуре
si: තන්ජාවූර් කෝවිල
sk: Chrám v Thanjavure
sq: Tempull në Thanjavur
sr: Храм у Танџавуру
sr_latn: Hram u Tandžavuru
sv: Brihadisvaratemplet
te: తంజావూర్ గుడి
th: วัดธานจาวูร์
tr: Thanjavur Tapınağı
uk: Тханджавурський храм
ur: تنجاور مندر
uz: Thanjavurdagi ibodatxona
vi: Đền Thanjavur
zh_hk: 坦賈武爾寺廟
zu: E-Thanjavur Temple

# placeSaltFarm
source: Salt Farm
af: Soutplaas
am: የጨው እርሻ
ar_eg: ملّاحة
as: নিমখৰ ফার্ম
az: Duz Təsərrüfatı
be: Саляная ферма
bn: নুন তৈরি করার ফার্ম
bs: Solana
ca: Salina
es_ar: Salina
et: Soolafarm
eu: Gatzaga
fa: مزرعه نمک
fr_ca: Marais salant
gl: Salina
gu: મીઠાનું ફાર્મ
he: חוות מלח
hi: सॉल्ट फ़ार्म
hu: Sófarm
hy: Աղի հանք
id: Ladang Garam
it: Salina
ja: 塩田
km: ស្រែ​អំបិល
kn: ಉಪ್ಪಿನ ಕೃಷಿ
ko: 염전
ky: Туз фермасы
lo: ນາເກືອ
lt: Druskos ūkis
lv: Sāls ieguves saimniecība
mk: Фарма за сол
ml: സോൾട്ട് ഫാം
mn: Давсны ферм
mr: मीठागर
my: ဆားခြံ
nb: Saltutvinningsanlegg
ne: नुनको फार्म
pa: ਨਮਕ ਦੇ ਖੇਤ
pl: Farma solna
pt: Fazenda de sal
pt_pt: Quinta do sal
ro: Fermă de sare
ru: Соляная ферма
si: ලුණු ලේවාය
sk: Soľná farma
sq: Kripore
sr: Солана
sr_latn: Solana
sv: Saltraffinaderi
te: సాల్ట్ ఫామ్
th: นาเกลือ
tr: Tuz Çiftliği
uk: Соляна ферма
ur: نمک کا کھیت
uz: Tuz fermasi
vi: Cánh đồng muối
zh_hk: 鹽田
zu: Ifamu yotswayi

# placeScooters
source: Scooters
af: Bromponies
am: ዶቅደቄዎች
ar_eg: دراجات سكوتر
as: স্কুটাৰসমূহ
az: Skuterlər
be: Людзі на скутэрах
bn: স্কুটার
bs: Skuteri
ca: Escúters
da: Scootere
es_ar: Escúteres
et: Motorollerid
eu: Scooterrak
fa: اسکوتر
fil: Mga Scooter
fr_ca: Scouteurs
gl: Motos
gu: સ્કૂટર
he: כלי רכב דו-גלגליים
hi: स्कूटर चलाते लोग
hu: Robogók
hy: Մոտոցիկլետներ
id: Skuter
it: Scooter
ja: スクーター
ka: სკუტერები
km: កង់រុញ​ដោយ​ជើង
kn: ಸ್ಕೂಟರ್‌ಗಳು
ko: 스쿠터
ky: Скутерлер
lo: ສະກູດເຕີ
lt: Važiuojantys paspirtukais
lv: Motorolleri
mk: Скутери
ml: സ്കൂട്ടറുകൾ
mn: Скүтер
mr: स्कूटर
ms: Skuter
my: စကူတာများ
nb: Skutere
ne: स्कूटरहरू
pa: ਸਕੂਟਰ
pl: Hulajnogi
ro: Scutere
ru: Скутеристы
si: ස්කූටර්
sk: Skútre
sq: Motoçikleta
sr: Скутери
sr_latn: Skuteri
sv: Vespor
te: స్కూటర్‌లు
th: สกู๊ตเตอร์
tr: Scooter'lar
uk: Люди на скутерах
ur: اسکوٹرز
uz: Skuterchilar
vi: Xe Scooter
zh_hk: 綿羊仔電單車
zu: Izikuta
