Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# shrineProductFineLinesTee
source: Fine lines tee
af: T-hemp met dun strepies
am: ፋይን ላይንስ ቲሸርት
ar_eg: قميص بخطوط رفيعة
az: T formalı, cızıqlı koftalar
be: Кофта ў палоску
bn: ফাইন লাইন টি
bs: Majica s tankim crtama
ca: Samarreta a ratlles fines
da: T-shirt med tynde striber
es_ar: Camiseta de rayas finas
eu: Marra finak dituen elastikoa
fa: تی‌شرت فاین‌لاینز
fil: Fine lines na t-shirt
fr_ca: T-shirt à rayures fines
gl: Camiseta de raias finas
he: חולצת פסים דקים
hi: फाइन लाइंस टी-शर्ट
hu: Finom csíkozású póló
hy: Զոլավոր շապիկ
id: Kaus fine lines
it: Maglietta a righe sottili
ja: T シャツ（ファイン ラインズ）
ka: ზოლებიანი მაისური
km: អាវយឺត​ឆ្នូតៗ
kn: ಫೈನ್ ಲೈನ್ಸ್ ಟೀ
ko: 파인 라인 티
ky: Ичке сызыктуу футболка
lo: ເສື້ອຍືດລາຍຂວາງແບບຖີ່
lt: Marškinėliai su juostelėmis
lv: T-krekls ar smalkām līnijām
mk: Маица Fine lines
ml: ഫൈൻ ലൈൻസ് ടീ
mn: Нарийн судалтай футболк
nb: T-skjorte med fine linjer
ne: पातला धर्का भएको टिसर्ट
pa: ਬਰੀਕ ਲਾਈਨਾਂ ਵਾਲੀ ਟੀ-ਸ਼ਰਟ
pl: Koszulka w prążki
pt: Camiseta com listras finas
pt_pt: T-shirt Fine lines
ro: Tricou cu dungi subțiri
ru: Кофта в полоску
sk: Tričko s tenkými pásikmi
sq: Bluzë me vija të holla
sr: Мајица са танким цртама
sr_latn: Majica sa tankim crtama
sv: Smalrandig t-shirt
te: సన్నని గీతల టీషర్ట్
th: เสื้อยืดลายขวางแบบถี่
tr: İnce çizgili tişört
uk: Футболка Fine Line
ur: فائن لائن ٹی شرٹس
uz: Chiziqli kofta
vi: Áo thun sọc mảnh
zh_hk: 幼紋 T 恤
zu: I-Fine lines tee

# rallyAccountDataHomeSavings
source: Home Savings
af: Spaarrekening vir huis
am: የቤት ቁጠባ
ar_eg: المدخرات المنزلية
as: ঘৰৰ সঞ্চয়
az: Ev Qənaəti
be: Зберажэнні для дома
bn: হোম সেভিংস
bs: Štednja za kupovinu kuće
ca: Estalvis de la llar
da: Opsparing til hjemmet
es_ar: Ahorros del hogar
et: Kodulaenukonto
eu: Etxerako aurrezkiak
fa: پس‌اندازهای منزل
fil: Mga Ipon sa Bahay
fr_ca: Compte épargne maison
gl: Aforros para a casa
gu: ઘરેલુ બચત
he: חסכונות לבית
hi: घर की बचत
hu: Otthonnal kapcsolatos megtakarítások
hy: Խնայողություններ տան համար
id: Tabungan untuk Rumah
it: Risparmio familiare
ja: マイホーム貯金
ka: სახლის დანაზოგები
km: គណនីសន្សំទិញផ្ទះ
kn: ಮನೆ ಉಳಿತಾಯ
ko: 주택마련 저축
ky: Үйгө чогултулуп жаткан каражат
lo: ບັນຊີເງິນຝາກເຮືອນ
lt: Namų ūkio santaupos
lv: Mājas ietaupījumi
mk: Штедна сметка за домот
ml: ഹോം സേവിംഗ്‌സ്
mn: Гэрийн хадгаламж
mr: घर बचत
ms: Simpanan Perumahan
my: အိမ်စုငွေ‌များ
nb: Sparekonto for hjemmet
ne: घरायसी बचत खाता
pa: ਘਰੇਲੂ ਬੱਚਤਾਂ
pl: Oszczędności na dom
pt: Economias domésticas
pt_pt: Poupanças para casa
ro: Economii pentru casă
ru: Сбережения на дом
si: ගෘහ ඉතිරි කිරීම්
sk: Úspory na dom
sq: Kursimet për shtëpinë
sr: Штедња за куповину дома
sr_latn: Štednja za kupovinu doma
sv: Sparkonto för boende
te: ఇంటి పొదుపులు
th: เงินเก็บสำหรับซื้อบ้าน
tr: Ev İçin Biriktirilen
uk: Заощадження на будинок
ur: ہوم سیونگز
uz: Uy olish uchun
vi: Tài khoản tiết kiệm mua nhà
zh_hk: 家庭儲蓄
zu: Ukulondoloza kwekhaya

# rallyAccountDataChecking
source: Checking
af: Tjek
am: ተንቀሳቃሽ
ar_eg: الحساب الجاري
as: চেকিং
az: Yoxlanış
be: Разліковы
bn: চেক করা হচ্ছে
bs: Provjera
ca: Compte corrent
da: Bankkonto
es_ar: Cuenta corriente
et: Tšekikonto
eu: Egiaztatzen
fa: درحال بررسی
fr_ca: Chèque
gl: Comprobando
gu: ચેક કરી રહ્યાં છીએ
he: עובר ושב
hi: चेकिंग
hu: Folyószámla
hy: Բանկային հաշիվ
id: Giro
it: Conto
ja: 当座預金
ka: მიმდინარე
km: គណនីមូលប្បទានបត្រ
kn: ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ
ko: 자유 입출금
ky: Текшерилүүдө
lo: ເງິນຝາກປະຈຳ
lt: Tikrinama
lv: Norēķinu konts
mk: Тековна сметка
ml: പരിശോധിക്കുന്നു
mn: Чекийн
mr: चेकिंग
ms: Semasa
my: စာရင်းရှင်
nb: Brukskonto
ne: चल्ती खाता
pa: ਜਾਂਚ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ
pl: Rozliczeniowe
pt: Conta corrente
pt_pt: Corrente
ro: Curent
ru: Расчетный счет
si: චෙක්පත්
sk: Bežný
sq: Rrjedhëse
sr: Текући
sr_latn: Tekući
sv: Bankkonto
te: చెక్ చేస్తోంది
th: กระแสรายวัน
tr: Mevduat
uk: Розрахунковий
ur: چیک کیا جا رہا ہے
uz: Hisobraqam
vi: Tài khoản giao dịch
zh_hk: 支票戶口
zu: Kuyahlolwa

# rallyAccountDetailDataInterestPaidLastYear
source: Interest Paid Last Year
af: Rente wat verlede jaar betaal is
am: ወለድ ባለፈው ዓመት ተከፍሎበታል
ar_eg: الفائدة المدفوعة في العام الماضي
as: যোৱা বছৰ পৰিশোধ কৰা সুদ
az: Keçən il ödənilən faiz
be: Працэнты, выплачаныя ў мінулым годзе
bn: গত বছরে পে করা সুদ
bs: Kamate plaćene prošle godine
ca: Interessos pagats l'any passat
da: Betalte renter sidste år
es_ar: Intereses pagados el año pasado
et: Eelmisel aastal makstud intress
eu: Joan den urtean ordaindutako interesa
fa: سود پرداخت‌شده در سال گذشته
fil: Interes na Binayaran Noong Nakaraang Taon
fr_ca: Intérêt payé l'année dernière
gl: Intereses pagados o ano pasado
gu: ગયા વર્ષે ચૂકવેલું વ્યાજ
he: ריבית ששולמה בשנה שעברה
hi: पिछले साल दिया गया ब्याज
hu: Tavaly kifizetett kamatok
hy: Անցած տարի վճարված տոկոսներ
id: Bunga yang Dibayarkan Tahun Lalu
it: Interesse pagato l'anno scorso
ja: 昨年の利息
ka: გასულ წელს გადახდილი პროცენტი
km: ការប្រាក់ដែល​បានបង់ពីឆ្នាំមុន
kn: ಹಿಂದಿನ ವರ್ಷ ಪಾವತಿಸಿದ ಬಡ್ಡಿ
ko: 작년 지급 이자
ky: Өткөн жылы төлөнгөн пайыз
lo: ດອກເບ້ຍທີ່ຈ່າຍປີກາຍ
lt: Praėjusiais metais išmokėtos palūkanos
lv: Procenti, kas samaksāti pagājušajā gadā
mk: Камата платена минатата година
ml: കഴിഞ്ഞ വർഷം അടച്ച പലിശ
mn: Өнгөрсөн жил төлсөн хүү
mr: मागील वर्षी दिलेले व्याज
ms: Faedah Dibayar Pada Tahun Lalu
my: ယခင်နှစ်က ပေးထားသည့် အတိုး
nb: Renter betalt i fjor
ne: गत वर्ष तिरिएको ब्याज
pa: ਪਿਛਲੇ ਸਾਲ ਦਿੱਤਾ ਗਿਆ ਵਿਆਜ
pl: Odsetki wypłacone w ubiegłym roku
pt: Juros pagos no ano passado
pt_pt: Juros pagos no ano passado
ro: Dobânda plătită anul trecut
ru: Процент, уплаченный в прошлом году
si: පසුගිය වර්ෂයේ ගෙවූ පොලී
sk: Úroky zaplatené minulý rok
sq: Interesi i paguar vitin e kaluar
sr: Камата плаћена прошле године
sr_latn: Kamata plaćena prošle godine
sv: Betald ränta förra året
te: గత సంవత్సరం చెల్లించిన వడ్డీ
th: ดอกเบี้ยที่จ่ายเมื่อปีที่แล้ว
tr: Geçen Yıl Ödenen Faiz
uk: Проценти, виплачені минулого року
ur: پچھلے سال ادا کیا گیا سود
uz: Oʻtgan yili toʻlangan foiz
vi: Lãi suất đã thanh toán năm ngoái
zh_hk: 去年已付利息
zu: Inzuzo ekhokhelwe unyaka owedlule

# rallyAccountDetailDataNextStatement
source: Next Statement
af: Volgende staat
am: ቀጣይ መግለጫ
ar_eg: كشف الحساب التالي
as: পৰৱর্তী বিবৃতি
az: Növbəti bəyanat
be: Наступная выпіска з банкаўскага рахунку
bn: পরবর্তী স্টেটমেন্ট
bs: Sljedeći izvod
ca: Extracte següent
da: Næste kontoudtog
es_ar: Próximo resumen
et: Järgmine väljavõte
eu: Hurrengo kontu-laburpena
fa: بخش بعدی
fil: Susunod na Pahayag
fr_ca: Prochain relevé
gl: Seguinte extracto
gu: આગલું સ્ટેટમેન્ટ
he: דוח התנועות הבא
hi: अगला स्टेटमेंट
hu: Következő kimutatás
hy: Հաջորդ քաղվածքը
id: Rekening Koran Selanjutnya
it: Prossimo estratto conto
ja: 次回の取引明細書発行日
ka: შემდეგი ამონაწერი
km: របាយការណ៍​បន្ទាប់
kn: ಮುಂದಿನ ಸ್ಟೇಟ್‌ಮೆಂಟ್
ko: 다음 명세서
ky: Кийинки билдирүү
lo: ລາຍການເຄື່ອນໄຫວຂອງບັນຊີຮອບຕໍ່ໄປ
lt: Kita ataskaita
lv: Nākamais izraksts
mk: Следниот извод
ml: അടുത്ത പ്രസ്താവന
mn: Дараагийн мэдэгдэл
mr: पुढील विवरण
ms: Penyata seterusnya
my: နောက် ထုတ်ပြန်ချက်
nb: Neste kontoutskrift
ne: अर्को स्टेटमेन्ट
pa: ਅਗਲੀ ਸਟੇਟਮੈਂਟ
pl: Następne zestawienie
pt: Próximo extrato
pt_pt: Próximo extrato
ro: Următorul extras
ru: Следующая выписка по счету
si: ඊළඟ ප්‍රකාශය
sk: Ďalší výpis
sq: Pasqyra e ardhshme
sr: Следећи извод
sr_latn: Sledeći izvod
sv: Nästa utdrag
te: తర్వాతి స్టేట్‌మెంట్
th: รายการเคลื่อนไหวของบัญชีรอบถัดไป
tr: Sonraki Ekstre
uk: Наступна виписка
ur: اگلا بیان
uz: Keyingi hisob qaydnomasi
vi: Bảng kê khai tiếp theo
zh_hk: 下一張結單
zu: Isitatimende esilandelayo

# rallyAccountDetailDataAccountOwner
source: Account Owner
af: Rekeningeienaar
am: የመለያ ባለቤት
ar_eg: صاحب الحساب
as: একাউণ্টৰ গৰাকী
az: Hesab Sahibi
be: Уладальнік уліковага запісу
bn: অ্যাকাউন্টের মালিক
bs: Vlasnik računa
ca: Propietari del compte
da: Kontoejer
es_ar: Propietario de la cuenta
et: Konto omanik
eu: Kontuaren jabea
fa: صاحب حساب
fil: May-ari ng Account
fr_ca: Propriétaire du compte
gl: Propietario da conta
gu: એકાઉન્ટના માલિક
he: בעלים של החשבון
hi: खाते का मालिक
hu: Fióktulajdonos
hy: Հաշվի սեփականատեր
id: Pemilik Akun
it: Proprietario dell'account
ja: 口座所有者
ka: ანგარიშის მფლობელი
km: ម្ចាស់​គណនី
kn: ಖಾತೆಯ ಮಾಲೀಕರು
ko: 계정 소유자
ky: Аккаунттун ээси
lo: ເຈົ້າຂອງບັນຊີ
lt: Paskyros savininkas
lv: Konta īpašnieks
mk: Сопственик на сметка
ml: അക്കൗണ്ട് ഉടമ
mn: Данс эзэмшигч
mr: खाते मालक
ms: Pemilik Akaun
my: အကောင့် ပိုင်ရှင်
nb: Kontoeier
ne: खाताको मालिक
pa: ਖਾਤੇ ਦਾ ਮਾਲਕ
pl: Właściciel konta
pt: Proprietário da conta
pt_pt: Proprietário da conta
ro: Proprietarul contului
ru: Владелец аккаунта
si: ගිණුමේ හිමිකරු
sk: Vlastník účtu
sq: Zotëruesi i llogarisë
sr: Власник налога
sr_latn: Vlasnik naloga
sv: Kontots ägare
te: ఖాతా యజమాని
th: เจ้าของบัญชี
tr: Hesap Sahibi
uk: Власник рахунку
ur: اکاؤنٹ کا مالک
uz: Hisob egasi
vi: Chủ sở hữu tài khoản
zh_hk: 帳戶擁有者
zu: Umnikazo we-akhawunti

# rallyBudgetCategoryCoffeeShops
source: Coffee Shops
af: Koffiewinkels
am: ቡና ቤቶች
ar_eg: المقاهي
as: কফিৰ দোকানসমূহ
az: Kafelər
be: Кавярні
bn: কফি শপ
bs: Kafići
ca: Cafeteries
da: Kaffebarer
es_ar: Cafeterías
et: Kohvikud
eu: Kafetegiak
fa: کافه‌ها
fil: Mga Kapihan
fr_ca: Cafés
gl: Cafetarías
gu: કૉફી શૉપ
he: בתי קפה
hi: कॉफ़ी शॉप
hu: Kávézók
hy: Սրճարաններ
id: Kedai Kopi
it: Caffetterie
ja: カフェ
ka: ყავახანები
km: ហាង​កាហ្វេ
kn: ಕಾಫಿ ಶಾಪ್‌ಗಳು
ko: 커피숍
ky: Кофейнялар
lo: ຮ້ານກາເຟ
lt: Kavinės
lv: Kafejnīcas
mk: Кафе-барови
ml: കോഫി ഷോപ്പുകൾ
mn: Кофе шопууд
mr: कॉफीची दुकाने
ms: Kedai Kopi
my: ကော်ဖီဆိုင်များ
nb: Kafeer
ne: कफी पसलहरू
pa: ਕੌਫ਼ੀ ਦੀਆਂ ਦੁਕਾਨਾਂ
pl: Kawiarnie
pt: Cafés
pt_pt: Cafés
ro: Cafenele
ru: Кофейни
si: කෝපි වෙළඳසැල්
sk: Kaviarne
sq: Bar-kafe
sr: Кафићи
sr_latn: Kafići
sv: Kaféer
te: కాఫీ షాప్‌లు
th: ร้านกาแฟ
tr: Kafeler
uk: Кав'ярні
ur: کافی کی دکانیں
uz: Qahvaxonalar
vi: Quán cà phê
zh_hk: 咖啡店
zu: Izitolo zekhofi

# rallyBudgetCategoryGroceries
source: Groceries
af: Kruideniersware
am: ሸቀጣሸቀጦች
ar_eg: متاجر البقالة
as: গেলামাল
az: Ərzaq dükanları
be: Прадуктовыя тавары
bn: মুদিখানা
bs: Namirnice
ca: Queviures
da: Dagligvarer
es_ar: Compras de comestibles
et: Toiduained
eu: Jan-edanak
fa: خواربار
fil: Mga Grocery
fr_ca: Épicerie
gl: Alimentos
gu: કરિયાણું
he: מצרכים
hi: किराने का सामान
hu: Bevásárlás
hy: Մթերք
id: Minimarket
it: Spesa
ja: 食料品
ka: სურსათი
km: គ្រឿងទេស
kn: ದಿನಸಿ
ko: 식료품
ky: Азык-түлүк
lo: ເຄື່ອງໃຊ້ສອຍ
lt: Pirkiniai
lv: Pārtikas veikali
mk: Намирници
ml: പലചരക്ക് സാധനങ്ങൾ
mn: Хүнсний бүтээгдэхүүн
mr: किराणा माल
ms: Barangan runcit
my: စားသောက်ကုန်များ
nb: Dagligvarer
ne: किराना सामान
pa: ਕਰਿਆਨੇ ਦਾ ਸਮਾਨ
pl: Produkty spożywcze
pt: Supermercado
pt_pt: Produtos de mercearia
ro: Produse alimentare
ru: Продукты
si: සිල්ලර භාණ්ඩ
sk: Potraviny
sq: Ushqimore
sr: Бакалницe
sr_latn: Bakalnice
sv: Livsmedel
te: కిరాణా సరుకులు
th: ของชำ
tr: Market Alışverişi
uk: Гастрономи
ur: گروسریز
uz: Baqqollik mollari
vi: Cửa hàng tạp hóa
zh_hk: 雜貨
zu: Amagrosa

# shrineProductCeriseScallopTee
source: Cerise scallop tee
af: Kersierooi skulprand-t-hemp
am: Cerise ስካሎፕ ቲ
ar_eg: قميص قصير الأكمام باللون الكرزي الفاتح
az: T formalı qırmızı kofta
be: Светла-вішнёвая футболка
bn: সেরাইজ স্ক্যালোপ টি
bs: Tamnoroza majica sa zaobljenim rubom
ca: Samarreta de coll rodó color cirera
da: Lyserød Cerise-t-shirt
es_ar: Camiseta de cuello cerrado color cereza
eu: Gerezi-koloreko elastikoa
fa: تی‌شرت پایین دالبر کریس
fil: Cerise na scallop na t-shirt
fr_ca: T-shirt couleur cerise
gl: Camiseta de vieira de cor vermello cereixa
he: חולצת וי
hi: गुलाबी कंगूरेदार टी-शर्ट
hu: „Cerise” lekerekített alsó szegélyű póló
hy: Դեղձագույն շապիկ
id: Kaus scallop merah ceri
it: Maglietta scallop tee color ciliegia
ja: T シャツ（セリーズ スカロップ）
ka: მრგვალი ფორმის ალუბლისფერი მაისური
km: អាវយឺត​ពណ៌ក្រហមព្រឿងៗ
kn: ಸಿರೀಸ್ ಸ್ಕಾಲಪ್ ಟೀ
ko: 세리즈 스캘롭 티
ky: Футболка
lo: ເສື້ອຍືດຊາຍໂຄ້ງສີແດງອົມສີບົວ
lt: Ciklameno spalvos marškinėliai ovalia apačia
lv: Ķiršu krāsas T-krekls
mk: Порабена маица Cerise
ml: സറീസ് സ്കാലപ്പ് ടീ
mn: Долгиолсон захтай ягаан цамц
nb: Ceriserød scallop-skjorte
ne: गुलाबी रङको टिसर्ट
pa: ਗੁਲਾਬੀ ਸਿੱਪੀਦਾਰ ਟੀ-ਸ਼ਰਟ
pl: Koszulka Cerise z lamówkami
pt: Camisa abaulada na cor cereja
pt_pt: T-shirt rendilhada em cor cereja
ro: Tricou cu guler rotund Cerise
ru: Персиковая футболка
sk: Tričko s lemom Cerise
sq: Bluzë e kuqe e errët me fund të harkuar
sr: Тамноружичаста мајица са таласастим рубом
sr_latn: Tamnoružičasta majica sa talasastim rubom
sv: Ljusröd t-shirt
te: సెరిస్ స్కాల్లొప్ టీషర్ట్
th: เสื้อยืดชายโค้งสีแดงอมชมพู
tr: Kiraz kırmızısı fistolu tişört
uk: Футболка вишневого кольору з хвилястим комірцем
ur: لوئر ڈالبی کرس ٹی شرٹ
uz: Shaftolirang futbolka
vi: Áo thun viền cổ dạng vỏ sò màu đỏ hồng
zh_hk: 櫻桃色圓擺 T 恤

# rallyBudgetCategoryClothing
source: Clothing
af: Klere
am: አልባሳት
ar_eg: الملابس
as: পোছাক
az: Geyim
be: Адзенне
bn: জামাকাপড়
bs: Odjeća
ca: Roba
da: Tøj
es_ar: Indumentaria
et: Riided
eu: Arropa
fa: پوشاک
fil: Damit
fr_ca: Vêtements
gl: Roupa
gu: વસ્ત્રો
he: הלבשה
hi: कपड़े
hu: Ruházat
hy: Հագուստ
id: Pakaian
it: Abbigliamento
ja: 衣料品
ka: ტანსაცმელი
km: សម្លៀក​បំពាក់
kn: ಉಡುಗೆ
ko: 의류
ky: Кийим-кече
lo: ເສື້ອ​ຜ້າ
lt: Apranga
lv: Apģērbs
mk: Облека
ml: വസ്ത്രങ്ങൾ
mn: Хувцас
mr: कपडे
ms: Pakaian
my: အဝတ်အထည်
nb: Klær
ne: लुगा
pa: ਕੱਪੜੇ
pl: Odzież
pt: Roupas
pt_pt: Vestuário
ro: Îmbrăcăminte
ru: Одежда
si: ඇඳුම්
sk: Oblečenie
sq: Veshje
sr: Одећа
sr_latn: Odeća
sv: Kläder
te: దుస్తులు
th: เสื้อผ้า
tr: Giyim
uk: Одяг
ur: لباس
uz: Kiyim-kechak
vi: Quần áo
zh_hk: 服飾
zu: Izimpahla

# rallySettingsManageAccounts
source: Manage Accounts
af: Bestuur rekeninge
am: መለያዎችን ያስተዳድሩ
ar_eg: إدارة الحسابات
as: একাউণ্টসমূহ পৰিচালনা কৰক
az: Hesabları idarə edin
be: Кіраваць уліковымі запісамі
bn: অ্যাকাউন্ট ম্যানেজ করুন
bs: Upravljajte računima
ca: Gestiona els comptes
da: Administrer konti
es_ar: Administrar cuentas
et: Kontode haldamine
eu: Kudeatu kontuak
fa: مدیریت حساب‌ها
fil: Pamahalaan ang Mga Account
fr_ca: Gérer les comptes
gl: Xestionar contas
gu: એકાઉન્ટ મેનેજ કરો
he: ניהול חשבונות
hi: खाते मैनेज करें
hu: Fiókok kezelése
hy: Հաշիվների կառավարում
id: Kelola Akun
it: Gestisci account
ja: 口座を管理
ka: ანგარიშების მართვა
km: គ្រប់គ្រង​គណនី
kn: ಖಾತೆಗಳನ್ನು ನಿರ್ವಹಿಸಿ
ko: 계정 관리
ky: Аккаунттарды башкаруу
lo: ​ຈັດ​ການ​ບັນ​ຊີ
lt: Tvarkyti paskyras
lv: Pārvaldīt kontus
mk: Управувајте со сметките
ml: അക്കൗണ്ടുകൾ മാനേജ് ചെയ്യുക
mn: Бүртгэл удирдах
mr: खाती व्यवस्थापित करा
ms: Urus Akaun
my: အကောင့်များကို စီမံခန့်ခွဲရန်
nb: Administrer kontoer
ne: खाताहरू व्यवस्थापन गर्नुहोस्
pa: ਖਾਤੇ ਪ੍ਰਬੰਧਿਤ ਕਰੋ
pl: Zarządzaj kontami
pt: Gerenciar contas
pt_pt: Gerir contas
ro: Gestionați conturi
ru: Управление аккаунтами
si: ගිණුම් කළමනාකරණය කරන්න
sk: Spravovať účty
sq: Menaxho llogaritë
sr: Управљајте налозима
sr_latn: Upravljajte nalozima
sv: Hantera konton
te: ఖాతాలను నిర్వహించండి
th: จัดการบัญชี
tr: Hesapları Yönet
uk: Керувати рахунками
ur: اکاؤنٹس کا نظم کریں
uz: Hisoblarni boshqarish
vi: Quản lý tài khoản
zh_hk: 管理帳戶
zu: Phatha ama-akhawunti

# rallyAccountDataCarSavings
source: Car Savings
af: Spaarrekening vir motor
am: የመኪና ቁጠባ
ar_eg: المدّخرات المخصّصة للسيارة
as: গাড়ীৰ সঞ্চয়
az: Avtomobil Qənaəti
be: Зберажэнні на аўтамабіль
bn: গাড়ির জন্য সেভিং
bs: Štednja za automobil
ca: Estalvis del cotxe
da: Opsparing til bil
es_ar: Ahorros de vehículo
et: Autolaenukonto
eu: Autorako aurrezkiak
fa: پس‌انداز خودرو
fil: Mga Ipon sa Kotse
fr_ca: Compte d'épargne pour la voiture
gl: Aforros para o coche
gu: કાર બચત
he: חסכונות למכונית
hi: कार के लिए बचत
hu: Autóval kapcsolatos megtakarítások
hy: Խնայողություններ ավտոմեքենայի համար
id: Tabungan untuk Mobil
it: Risparmi per l'auto
ja: マイカー貯金
ka: დანაზოგები მანქანისთვის
km: គណនី​សន្សំទិញរថយន្ត
kn: ಕಾರ್ ಉಳಿತಾಯ
ko: 자동차 구매 저축
ky: Унаага чогултулуп жаткан каражат
lo: ເງິນທ້ອນສຳລັບຊື້ລົດ
lt: Santaupos automobiliui
lv: Ietaupījumi automašīnai
mk: Штедна сметка за автомобилот
ml: കാർ സേവിംഗ്‍സ്
mn: Автомашины хадгаламж
mr: कार बचत
ms: Simpanan Kereta
my: ကား စုငွေများ
nb: Sparekonto for bil
ne: कार खरिदका लागि बचत खाता
pa: ਕਾਰ ਲਈ ਬੱਚਤਾਂ
pl: Oszczędności na samochód
pt: Economia em transporte
pt_pt: Poupanças com o automóvel
ro: Economii pentru mașină
ru: Сбережения на машину
si: මෝටර් රථ සුරැකුම්
sk: Úspory na auto
sq: Kursimet për makinë
sr: Штедња за куповину аутомобила
sr_latn: Štednja za kupovinu automobila
sv: Sparkonto för bil
te: కారు సేవింగ్స్
th: เงินเก็บสำหรับซื้อรถ
tr: Araba İçin Biriktirilen
uk: Заощадження на автомобіль
ur: کار کی سیونگز
uz: Avtomobil olish uchun
vi: Tài khoản tiết kiệm mua ô tô
zh_hk: 買車儲蓄
zu: Ukulondoloza kwemoto

# rallySettingsTaxDocuments
source: Tax Documents
af: Belastingdokumente
am: የግብር ሰነዶች
ar_eg: المستندات الضريبية
as: কৰ সম্পর্কীয় নথিসমূহ
az: Vergi Sənədləri
be: Падатковыя дакументы
bn: ট্যাক্স ডকুমেন্ট
bs: Porezni dokumenti
ca: Documents fiscals
da: Skattedokumenter
es_ar: Documentos de impuestos
et: Maksudokumendid
eu: Zerga-dokumentuak
fa: اسناد مالیاتی
fil: Mga Dokumento ng Buwis
fr_ca: Documents fiscaux
gl: Documentos fiscais
gu: કરવેરાના દસ્તાવેજો
he: מסמכי מסים
hi: कर से जुड़े दस्तावेज़
hu: Adódokumentumok
hy: Հարկային փաստաթղթեր
id: Dokumen Pajak
it: Documenti fiscali
ja: 税務書類
ka: საგადასახადო დოკუმენტები
km: ឯកសារពន្ធ
kn: ತೆರಿಗೆ ಡಾಕ್ಯುಮೆಂಟ್‌ಗಳು
ko: 세무 서류
ky: Салык документтери
lo: ເອກະສານພາສີ
lt: Mokesčių dokumentai
lv: Nodokļu dokumenti
mk: Даночни документи
ml: നികുതി രേഖകൾ
mn: Татварын документ
mr: कर दस्तऐवज
ms: Dokumen Cukai
my: အခွန် မှတ်တမ်းများ
nb: Avgiftsdokumenter
ne: करका कागजातहरू
pa: ਟੈਕਸ ਦਸਤਾਵੇਜ਼
pl: Dokumenty podatkowe
pt: Documentos fiscais
pt_pt: Documentos fiscais
ro: Documente fiscale
ru: Налоговые документы
si: බදු ලේඛන
sk: Daňové dokumenty
sq: Dokumentet e taksave
sr: Порески документи
sr_latn: Poreski dokumenti
sv: Skattedokument
te: పన్ను డాక్యుమెంట్లు
th: เอกสารเกี่ยวกับภาษี
tr: Vergi Dokümanları
uk: Податкова документація
ur: ٹیکس کے دستاویزات
uz: Soliq hujjatlari
vi: Chứng từ thuế
zh_hk: 稅務文件
zu: Amadokhumenti ombhalo

# rallySettingsPasscodeAndTouchId
source: Passcode and Touch ID
af: Wagkode en raak-ID
am: የይለፍ ኮድ እና የንክኪ መታወቂያ
ar_eg: رمز المرور وTouch ID
as: পাছক’ড আৰু স্পৰ্শ আইডি
az: Parol və Sensor ID
be: Пароль і Touch ID
bn: পাসকোড এবং টাচ আইডি
bs: Šifra i Touch ID
ca: Contrasenya i Touch ID
da: Adgangskode og Touch ID
es_ar: Contraseña y Touch ID
et: Pääsukood ja Touch ID
eu: Pasakodea eta Touch ID
fa: گذرنویسه و شناسه لمسی
fil: Passcode at Touch ID
fr_ca: Mot de passe et Touch ID
gl: Contrasinal e Touch ID
gu: પાસકોડ અને સ્પર્શ ID
he: קוד סיסמה ומזהה מגע
hi: पासकोड और टच आईडी
hu: Biztonsági kód és Touch ID
hy: Անցակոդ և Touch ID
id: Kode sandi dan Touch ID
it: Passcode e Touch ID
ja: パスコードと Touch ID
ka: საიდუმლო კოდი და Touch ID
km: លេខកូដសម្ងាត់ និង Touch ID
kn: ಪಾಸ್‌ಕೋಡ್ ಮತ್ತು ಟಚ್ ಐಡಿ
ko: 비밀번호 및 Touch ID
ky: Өткөрүүчү код жана басуу идентификатору
lo: ລະຫັດ ແລະ Touch ID
lt: Slaptažodis ir „Touch ID“
lv: Piekļuves kods un Touch ID
mk: Лозинка и ID на допир
ml: പാസ്‌കോഡും ടച്ച് ഐഡിയും
mn: Нууц код болон Хүрэх ID
mr: पासकोड आणि स्पर्श आयडी
ms: Kod laluan dan Touch ID
my: လျှို့ဝှက်ကုဒ်နှင့် 'လက်ဗွေ ID'
nb: Adgangskode og Touch ID
ne: पासकोड वा Touch ID
pa: ਪਾਸਕੋਡ ਅਤੇ ਸਪਰਸ਼ ਆਈਡੀ
pl: Hasło i Touch ID
pt: Senha e Touch ID
pt_pt: Código secreto e Touch ID
ro: Parolă și Touch ID
ru: Код доступа и Touch ID
si: මුරකේතය සහ ස්පර්ශ ID
sk: Vstupný kód a Touch ID
sq: Kodi i kalimit dhe Touch ID
sr: Шифра и ИД за додир
sr_latn: Šifra i ID za dodir
sv: Lösenord och Touch ID
te: పాస్‌కోడ్, టచ్ ID
th: รหัสผ่านและ Touch ID
tr: Şifre kodu ve Touch ID
uk: Код доступу й Touch ID
ur: پاس کوڈ اور ٹچ ID
uz: Kirish kodi va Touch ID
vi: Mật mã và Touch ID
zh_hk: 密碼及 Touch ID
zu: I-Passcode ne-Touch ID

# rallySettingsNotifications
source: Notifications
af: Kennisgewings
am: ማሳወቂያዎች
ar_eg: إشعارات
as: জাননীসমূহ
az: Bildirişlər
be: Апавяшчэнні
bn: বিজ্ঞপ্তি
bs: Obavještenja
ca: Notificacions
da: Notifikationer
es_ar: Notificaciones
et: Märguanded
eu: Jakinarazpenak
fa: اعلان‌ها
fil: Mga Notification
gl: Notificacións
gu: નોટિફિકેશન
he: התראות
hi: सूचनाएं
hu: Értesítések
hy: Ծանուցումներ
id: Notifikasi
it: Notifiche
ja: 通知
ka: შეტყობინებები
km: ការជូនដំណឹង
kn: ಅಧಿಸೂಚನೆಗಳು
ko: 알림
ky: Билдирмелер
lo: ການແຈ້ງເຕືອນ
lt: Pranešimai
lv: Paziņojumi
mk: Известувања
ml: അറിയിപ്പുകൾ
mn: Мэдэгдэл
mr: सूचना
ms: Pemberitahuan
my: အကြောင်းကြားချက်များ
nb: Varsler
ne: सूचनाहरू
pa: ਸੂਚਨਾਵਾਂ
pl: Powiadomienia
pt: Notificações
pt_pt: Notificações
ro: Notificări
ru: Уведомления
si: දැනුම් දීම්
sk: Upozornenia
sq: Njoftimet
sr: Обавештења
sr_latn: Obaveštenja
sv: Aviseringar
te: నోటిఫికేషన్‌లు
th: การแจ้งเตือน
tr: Bildirimler
uk: Сповіщення
ur: اطلاعات
uz: Bildirishnomalar
vi: Thông báo
zh_hk: 通知
zu: Izaziso

# rallySettingsPersonalInformation
source: Personal Information
af: Persoonlike inligting
am: የግል ሁኔታ
ar_eg: المعلومات الشخصية
as: ব্যক্তিগত তথ্য
az: Şəxsi Məlumatlar
be: Асабістая інфармацыя
bn: ব্যক্তিগত তথ্য
bs: Lični podaci
ca: Informació personal
da: Personlige oplysninger
es_ar: Información personal
et: Isiklikud andmed
eu: Informazio pertsonala
fa: اطلاعات شخصی
fil: Personal na Impormasyon
fr_ca: Renseignements personnels
gl: Información persoal
gu: વ્યક્તિગત માહિતી
he: מידע אישי
hi: निजी जानकारी
hu: Személyes adatok
hy: Անձնական տվյալներ
id: Informasi Pribadi
it: Informazioni personali
ja: 個人情報
ka: პერსონალური ინფორმაცია
km: ព័ត៌មាន​ផ្ទាល់​ខ្លួន
kn: ವೈಯಕ್ತಿಕ ಮಾಹಿತಿ
ko: 개인정보
ky: Жеке маалымат
lo: ຂໍ້ມູນສ່ວນຕົວ
lt: Asmens informacija
lv: Personas informācija
mk: Лични податоци
ml: വ്യക്തിപരമായ വിവരങ്ങൾ
mn: Хувийн мэдээлэл
mr: वैयक्तिक माहिती
ms: Maklumat Peribadi
my: ကိုယ်ရေးအချက်အလက်များ
nb: Personopplysninger
ne: व्यक्तिगत जानकारी
pa: ਨਿੱਜੀ ਜਾਣਕਾਰੀ
pl: Dane osobowe
pt: Informações pessoais
pt_pt: Informações pessoais
ro: Informații cu caracter personal
ru: Персональные данные
si: පෞද්ගලික තොරතුරු
sk: Osobné údaje
sq: Të dhënat personale
sr: Лични подаци
sr_latn: Lični podaci
sv: Personliga uppgifter
te: వ్యక్తిగత సమాచారం
th: ข้อมูลส่วนบุคคล
tr: Kişisel Bilgiler
uk: Особиста інформація
ur: ذاتی معلومات
uz: Shaxsiy axborot
vi: Thông tin cá nhân
zh_hk: 個人資料
zu: Ulwazi ngawe

# rallySettingsPaperlessSettings
source: Paperless Settings
af: Paperless-instellings
am: ወረቀት-አልባ ቅንብሮች
ar_eg: إعدادات إنجاز الأعمال بدون ورق
as: কাকতবিহীন ছেটিংসমূহ
az: Kağızsız Ayarlar
be: Віртуальныя налады
bn: বিনা পেপারের সেটিংস
bs: Postavke bez papira
ca: Configuració del format digital
da: Indstillinger for Paperless
es_ar: Configuración para recibir resúmenes en formato digital
et: Paberivabad arved
eu: Paperik gabeko ezarpenak
fa: تنظیمات دیجیتال
fil: Mga Paperless na Setting
fr_ca: Paramètres sans papier
gl: Configuración sen papel
gu: પેપરલેસ સેટિંગ
he: הגדרות ללא נייר
hi: बिना कागज़ की सुविधा के लिए सेटिंग
hu: Papír nélküli beállítások
hy: Վիրտուալ կարգավորումներ
id: Setelan Tanpa Kertas
it: Impostazioni computerizzate
ja: ペーパーレスの設定
ka: Paperless-ის პარამეტრები
km: ការកំណត់​មិនប្រើក្រដាស
kn: ಕಾಗದರಹಿತ ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 페이퍼리스 설정
ky: Кагазсыз жөндөөлөр
lo: ການຕັ້ງຄ່າສຳລັບເອກະສານທີ່ບໍ່ໃຊ້ເຈ້ຍ
lt: Elektroninių ataskaitų nustatymas
lv: Datorizēti iestatījumi
mk: Поставки за пошта без хартија
ml: കടലാസില്ലാതെയുള്ള ക്രമീകരണം
mn: Цаасгүй тохиргоо
mr: पेपरलेस सेटिंग्ज
ms: Tetapan Tanpa Kertas
my: စာရွက်မသုံး ဆက်တင်များ
nb: Papirløs-innstillinger
ne: कागजरहित सेटिङ
pa: ਪੰਨਾ ਰਹਿਤ ਸੈਟਿੰਗਾਂ
pl: Ustawienia rezygnacji z wersji papierowych
pt: Configurações sem papel
pt_pt: Definições sem papel
ro: Setări fără hârtie
ru: Настройки электронных документов
si: කඩදාසි රහිත සැකසීම්
sk: Nastavenia bez papiera
sq: Cilësimet e faturës elektronike
sr: Подешавања без папира
sr_latn: Podešavanja bez papira
sv: Inställningar för Paperless
te: కాగితం వినియోగం నివారణ సెట్టింగులు
th: การตั้งค่าสำหรับเอกสารที่ไม่ใช้กระดาษ
tr: Kağıt kullanmayan Ayarlar
uk: Налаштування Paperless
ur: کاغذ کا استعمال ترک کرنے کی ترتیبات
uz: Elektron hujjatlar sozlamalari
vi: Cài đặt không dùng bản cứng
zh_hk: 無紙化設定
zu: Izilungiselelo ezingenaphepha
