Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSnackbarsSubtitle
source: Snackbars show messages at the bottom of the screen
af: Teksbalke wys boodskappe aan die onderkant van die skerm
am: ቁርስ ቤት በማያ ገጹ ግርጌ ላይ መልዕክቶችን ያሳያል
ar_eg: تعرض "أشرطة الإعلام المنبثقة" رسائل في أسفل الشاشة
as: স্নেকবাৰসমূহে স্ক্ৰীনখনৰ একেবাৰে তলত বার্তাসমূহ প্ৰদর্শন কৰে
az: Snekpanellər ekranın aşağısında mesajlar göstərir
be: Усплывальныя панэлі паказваюць паведамленні ўнізе экрана
bn: স্ক্রিনের নিচে স্ন্যাকবার মেসেজ দেখায়
bs: Kratka obavještenja prikazuju poruke na dnu ekrana
ca: Les barres de notificacions mostren missatges a la part inferior de la pantalla
da: Handlingsbekræftelser viser meddelelser nederst på skærmen.
es_ar: Las barras de notificaciones muestran mensajes en la parte inferior de la pantalla
et: Teaberibad kuvavad ekraani alaosas sõnumeid
eu: Pantailaren beheko aldean mezuak erakusten dituzte snackbar-ek
fa: نوارهای توضیحات پیام‌ها را در پایین صفحه نمایش می‌دهند
fil: Nagpapakita ang Mga Snackbar ng mga mensahe sa ibaba ng screen
fr_ca: Les casse-croûte affichent des messages dans le bas de l'écran
gl: As barras de notificacións mostran mensaxes na parte inferior da pantalla
gu: સ્નૅકબાર, સ્ક્રીનના તળિયા પર સંદેશા બતાવે છે
he: סרגלים אינטראקטיביים מציגים הודעות בתחתית המסך
hi: स्नैकबार, स्क्रीन के सबसे नीचे मैसेज दिखाते हैं
hu: Az információs sávok üzeneteket jelenítenek meg a képernyő alján
hy: Ծանուցումների տողերի հաղորդագրությունները ցուցադրվում են էկրանի ներքևի հատվածում
id: Snackbar menampilkan pesan di bagian bawah layar
it: Gli snackbar mostrano i messaggi in fondo allo schermo
ja: スナックバーでは、画面の下部にメッセージが表示されます
ka: სნეკ-ზოლები აჩვენებს შეტყობინებებს ეკრანის ქვედა ნაწილში
km: របារសារខ្លីៗ​បង្ហាញសារ​នៅផ្នែក​ខាងក្រោម​នៃអេក្រង់
kn: ಸ್ನ್ಯಾಕ್‌ಬಾರ್‌ಗಳು ಸ್ಕ್ರೀನ್‌ನ ಕೆಳಭಾಗದಲ್ಲಿ ಸಂದೇಶಗಳನ್ನು ತೋರಿಸುತ್ತದೆ
ko: 스낵바는 화면 하단에 메시지를 표시합니다.
ky: Маалымат такталары билдирүүлөрдү экрандын ылдый жагында көрсөтөт
lo: ແຖບສະແດງຂໍ້ຄວາມຈະສະແດງຂໍ້ຄວາມຢູ່ລຸ່ມສຸດຂອງໜ້າຈໍ
lt: Laikinose juostose ekrano apačioje rodomi pranešimai
lv: Paziņojumu joslās ekrāna apakšā tiek rādīti ziņojumi
mk: Снекбар-пораките се прикажуваат на дното на екранот
ml: സ്‌നാക്‌ബാറുകൾ സ്‌ക്രീനിന്റെ ചുവട്ടിൽ സന്ദേശങ്ങൾ കാണിക്കുന്നു
mn: Snackbar нь дэлгэцийн доод талд мессежийг харуулдаг
mr: स्नॅकबार स्क्रीनच्या तळाशी संदेश दाखवतात
ms: Bar snek menunjukkan mesej di bahagian bawah skrin
my: မုန့်ဘားသည် မျက်နှာပြင်၏ အောက်ခြေတွင် မက်ဆေ့ဂျ်များကို ပြသည်
nb: Snackbarer viser meldinger nederst på skjermen
ne: स्न्याकबारहरूले सन्देशहरू स्क्रिनको फेदमा देखाउँछन्
pa: ਸਨੈਕਬਾਰਾਂ ਸਕ੍ਰੀਨ ਦੇ ਹੇਠਾਂ ਸੁਨੇਹੇ ਦਿਖਾਉਂਦੀਆਂ ਹਨ
pl: Paski powiadomień wyświetlają komunikaty u dołu ekranu
pt: Os snackbars exibem mensagens na parte interior da tela
pt_pt: As barras de comentários mostram mensagens na parte inferior do ecrã.
ro: Barele de notificare afișează mesaje în partea de jos a ecranului
ru: Снэк-панели – это уведомления, которые появляются в нижней части экрана
si: ස්නැක්බාර් තිරයේ පහළ ඇති පණිවිඩ පෙන්වයි
sk: Oznámenia zobrazujú správy v dolnej časti obrazovky
sq: Shiritat e njoftimeve shfaqin mesazhe në fund të ekranit
sr: Траке за обавештења приказују поруке у дну екрана
sr_latn: Trake za obaveštenja prikazuju poruke u dnu ekrana
sv: Meddelandefält innehåller meddelanden och visas längst ned på skärmen
te: స్నాక్‌బార్‌లు స్క్రీన్ దిగువన మెసేజ్‌లను చూపిస్తాయి
th: แถบแสดงข้อความจะแสดงข้อความที่ด้านล่างของหน้าจอ
tr: Snackbar'lar ekranın alt bölümünde mesaj gösterir
uk: Панель підказок показує повідомлення внизу екрана
ur: اسنیک بارز اسکرین کے نچلے حصے میں پیغامات دکھاتے ہیں
uz: Snekbarlar ekranning quyi qismida xabarlar chiqaradi
vi: Thanh thông báo nhanh hiển thị các thông báo ở cuối màn hình
zh_hk: 資訊列會在螢幕底部顯示訊息
zu: Ama-snackbar abonisa imilayezo ngaphansi kwesikrini

# demoSnackbarsTitle
source: Snackbars
af: Teksbalke
am: ቁርስ ቤት
ar_eg: أشرطة إعلام منبثقة
as: স্নেকবাৰসমূহ
az: Snekpanellər
be: Усплывальныя панэлі
bn: স্ন্যাকবার
bs: Kratka obavještenja
ca: Barres de notificacions
da: Handlingsbekræftelser
es_ar: Barras de notificaciones
et: Teaberibad
eu: Snackbar-ak
fa: نوارهای توضیحات
fil: Mga Snackbar
fr_ca: Casse-croûte
gl: Barras de notificacións
gu: સ્નૅકબાર
he: סרגלים אינטראקטיביים
hi: स्नैकबार
hu: Információs sávok
hy: Ծանուցումների տողեր
id: Snackbar
it: Snackbar
ja: スナックバー
ka: სნეკ-ზოლები
km: របារសារខ្លីៗ
kn: ಸ್ನ್ಯಾಕ್‌ಬಾರ್‌ಗಳು
ko: 스낵바
ky: Маалымат такталары
lo: ແຖບສະແດງຂໍ້ຄວາມ
lt: Laikinos juostos
lv: Paziņojumu joslas
mk: Снекбар-пораки
ml: സ്‌നാക്‌ബാറുകൾ
mn: Snackbar
mr: स्नॅकबार
ms: Bar snek
my: မုန့်ဘား
nb: Snackbarer
ne: स्न्याकबारहरू
pa: ਸਨੈਕਬਾਰ
pl: Paski powiadomień
pt_pt: Barras de comentários
ro: Bare de notificare
ru: Cнэк-панели
si: ස්නැක්බාර්
sk: Oznámenia
sq: Shiritat e njoftimeve
sr: Траке за обавештења
sr_latn: Trake za obaveštenja
sv: Meddelandefält
te: స్నాక్‌బార్‌లు
th: แถบแสดงข้อความ
tr: Snackbar'lar
uk: Панель підказок
ur: اسنیک بارز
uz: Snekbarlar
vi: Thanh thông báo nhanh
zh_hk: 資訊列
zu: Ama-snackbar

# demoCupertinoSliderTitle
source: Slider
af: Glyer
am: ተንሸራታች
ar_eg: شريط التمرير
as: শ্লাইডাৰ
az: Slayder
be: Паўзунок
bn: স্লাইডার
bs: Klizač
ca: Control lliscant
da: Skyder
es_ar: Control deslizante
et: Liugur
eu: Graduatzailea
fa: لغزنده
fr_ca: Curseur
gl: Control desprazable
gu: સ્લાઇડર
he: מחוון
hi: स्लाइडर
hu: Csúszka
hy: Սահիչ
id: Penggeser
it: Cursore
ja: スライダー
ka: სლაიდერი
km: របាររំកិល
kn: ಸ್ಲೈಡರ್
ko: 슬라이더
ky: Сыдырма
lo: ແຖບເລື່ອນ
lt: Šliaužiklis
lv: Slīdnis
mk: Лизгач
ml: സ്ലൈഡർ
mn: Слайдер
mr: स्लायडर
ms: Peluncur
my: ရွှေ့တုံး
nb: Glidebryter
ne: स्लाइडर
pa: ਸਲਾਈਡਰ
pl: Suwak
pt: Controle deslizante
pt_pt: Controlo de deslize
ro: Glisor
ru: Ползунок
si: ස්ලයිඩරය
sk: Posúvač
sq: Rrëshqitësi
sr: Клизач
sr_latn: Klizač
sv: Skjutreglage
te: స్లయిడర్
th: แถบเลื่อน
tr: Kaydırma çubuğu
uk: Повзунок
ur: سلائیڈر
uz: Slayder
vi: Thanh trượt
zh_hk: 滑桿
zu: Isilayida

# cupertinoTabBarChatTab
source: Chat
af: Klets
am: ውይይት
ar_eg: الدردشة
az: Söhbət
be: Чат
ca: Xat
eu: Txata
fa: گپ
fr_ca: Clavarder
he: צ'אט
hu: Csevegés
hy: Զրույց
ja: チャット
ka: ჩეთი
km: ការជជែក
ko: 채팅
ky: Чат
lo: ສົນທະນາ
lt: Pokalbis
lv: Tērzēšana
mk: Разговор
mn: Чат
mr: चॅट
my: ချတ်
ne: कुराकानी
pl: Czat
ru: Чат
si: කතාබස්
sk: Čet
sq: Biseda
sr: Ћаскање
sr_latn: Ćaskanje
sv: Chatt
th: แชท
tr: Sohbet
uk: Чат
ur: چیٹ
vi: Trò chuyện
zh_hk: 即時通訊
zu: Xoxa

# cupertinoTabBarHomeTab
source: Home
af: Tuis
am: መነሻ
ar_eg: علامة التبويب الرئيسية
as: গৃহ
az: Əsas səhifə
be: Галоўная
bn: হোম
bs: Početna stranica
ca: Inici
da: Start
es_ar: Inicio
et: Avaleht
eu: Orri nagusia
fa: صفحه اصلی
fr_ca: Accueil
gl: Inicio
gu: હોમ
he: כרטיסיית הבית
hi: होम
hu: Kezdőlap
hy: Գլխավոր էջ
id: Beranda
ja: ホーム
ka: მთავარი
km: ទំព័រដើម
kn: ಹೋಮ್
ko: 홈
ky: Башкы бет
lo: ໜ້າຫຼັກ
lt: Pagrindinis
lv: Sākums
mk: Почетна страница
ml: ഹോം
mn: Нүүр хуудас
mr: होम
ms: Laman Utama
my: အိမ်
nb: Hjem
ne: घर
pa: ਹੋਮ
pl: Strona główna
pt: Início
pt_pt: Página inicial
ro: Acasă
ru: Главная
si: මුල් පිටුව
sk: Domov
sq: Skeda bazë
sr: Почетна
sr_latn: Početna
sv: Startsida
te: హోమ్
th: หน้าแรก
tr: Ana sayfa
uk: Головна
ur: ہوم
uz: Boshi
vi: Trang chủ
zh_hk: 首頁
zu: Ekhaya

# demoCupertinoTabBarDescription
source: An iOS-style bottom navigation tab bar. Displays multiple tabs with one tab being active, the first tab by default.
af: 'n Onderste navigasie-oortjiebalk in iOS-styl. Wys veelvuldige oortjies met een aktiewe oortjie; dit is by verstek die eerste oortjie.
am: የiOS-ቅጥ የታች ዳሰሳ ትር አሞሌ። አንድ ትር ገቢር ሆኖ፣ በነባሪነት የመጀመሪያው ትር፣ በርካታ ትሮችን ያሳያል።
ar_eg: شريط علامات تبويب للتنقل السفلي بنمط iOS. يعرض عدة علامات تبويب، حيث تكون هناك علامة تبويب واحدة نشطة وبشكل تلقائي تكون هي علامة التبويب الأولى.
as: এটা iOS-শৈলীৰ বুটাম নেভিগেশ্বন টেবৰ দণ্ড। একাধিক টেব প্ৰদর্শন কৰে, য'ত ডিফ'ল্ট হিচাপে প্ৰথম টেবটো সক্ৰিয় হৈ থাকে।
az: iOS üslublu alt naviqasiya tabı paneli. Bir tab aktiv olmaqla (defolt olaraq ilk tab) bir neçə tabı göstərir.
be: Ніжняя навігацыйная панэль укладак у стылі iOS. Змяшчае некалькі ўкладак, адна з якіх актыўная (стандартна – першая).
bn: iOS-স্টাইল বোতাম নেভিগেশন ট্যাব বার। একটা ট্যাব অ্যাক্টিভ থাকলে অনেক ট্যাব দেখায়।
bs: Donja traka s karticama za navigaciju u stilu iOS-a. Prikazuje više kartica dok je jedna kartica aktivna, a to je prva kartica prema zadanim postavkama.
ca: Una barra de pestanyes de navegació d'estil iOS situada a la part inferior. Mostra diverses pestanyes quan n'hi ha una d'activada, la primera de manera predeterminada.
da: En fanelinje til navigation i iOS-format i bunden. Viser flere faner med én aktiv fane. Den første fane er som standard aktiv.
es_ar: Corresponde a una barra de pestañas de navegación inferior de estilo iOS. Muestra varias pestañas (la primera activa de forma predeterminada).
et: iOS-i stiilis alumine vahekaartide navigeerimisriba. Kuvab mitu vahekaarti, millest üks on aktiivne (vaikimisi esimene vahekaart).
eu: iOS estiloko beheko nabigazioko fitxa-barra bat. Hainbat fitxa bistaratzen ditu eta fitxa horietako bat (modu lehenetsian lehena) aktibatuta dago.
fa: نوار برگه پیمایش پایین سبک iOS این نوار برگه چندین برگه را نمایش می‌دهد که یک برگه از آن (نوار اول به‌طور پیش‌فرض) فعال خواهد بود.
fil: Isang iOS-style na tab bar ng pag-navigate sa ibaba. Nagpapakita ng maraming tab habang isang tab lang ang aktibo, ang unang tab bilang default.
fr_ca: Une barre d'onglets de navigation dans le bas, style iOS Affiche plusieurs onglets avec un onglet actif, le premier onglet par défaut.
gl: Unha barra de pestanas de navegación de tipo iOS situada na parte inferior. Mostra varias pestanas e só unha delas está activa: a primeira de forma predeterminada.
gu: iOS-શૈલીના તળિયાના નૅવિગેશન ટૅબનું બાર. એક ટૅબ સક્રિય હોવાની સાથે એકથી વધુ ટૅબ બતાવે છે, જેમાં પહેલી ટૅબ ડિફૉલ્ટ તરીકે હોય છે.
he: שורת כרטיסיות תחתונה לניווט בסגנון iOS. מציגה כרטיסיות מרובות כשכרטיסייה אחת פעילה, הכרטיסייה הראשונה כברירת מחדל.
hi: सबसे नीचे मौजूद iOS की शैली वाला नेविगेशन टैब बार यह कई टैब दिखाता है जिनमें से सिर्फ़ एक चालू होता है. डिफ़ॉल्ट रूप से, सबसे पहले खुला हुआ टैब चालू होता है.
hu: iOS-stílusú, alsó navigációs lapfülsáv. Több lapfület jelenít meg, amelyek közül az egyik aktív (alapértelmezés szerint az első).
hy: iOS-ի ոճի ստորին նավիգացիայի ներդիրի գոտի։ Ցուցադրում է մի քանի ներդիրներ, որոնցից մեկն ակտիվ է։ Ըստ կանխադրման՝ ակտիվ է համարվում առաջին ներդիրը։
id: Panel tab navigasi bawah gaya iOS. Menampilkan beberapa tab dengan satu tab pertama yang aktif secara default.
it: Una barra delle schede di navigazione in stile iOS. Mostra più schede, di cui una sola (per impostazione predefinita, la prima) è attiva.
ja: iOS スタイルのボトム ナビゲーション タブバーには複数のタブが表示され、そのうちの 1 つのタブ（デフォルトでは最初のタブ）がアクティブになります。
ka: iOS-სტილის ქვედა ნავიგაციის ჩანართების ზოლი. ეკრანზე აჩვენებს რამდენიმე ჩანართს, რომელთაგან აქტიურია ერთი, ნაგულისხმევად, პირველი.
km: របារផ្ទាំង​រុករក​នៅផ្នែក​ខាងក្រោម​ដែលមាន​រចនាប័ទ្ម iOS។ បង្ហាញ​ផ្ទាំងច្រើន​ដែលមានផ្ទាំង​មួយកំពុងបើក ដែល​តាមលំនាំដើម​គឺជា​ផ្ទាំងទីមួយ។
kn: iOS-ಸ್ಟೈಲ್ ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್ ಟ್ಯಾಬ್ ಬಾರ್. ಒಂದು ಟ್ಯಾಬ್ ಸಕ್ರಿಯವಾಗಿರುವುದರ ಜೊತೆಗೆ ಬಹು ಟ್ಯಾಬ್‌ಗಳನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡುತ್ತದೆ, ಮೊದಲ ಟ್ಯಾಬ್ ಡೀಫಾಲ್ಟ್ ಆಗಿದೆ.
ko: iOS 스타일의 하단 탐색 탭바입니다. 여러 개의 탭이 표시되고 그중 하나가 활성화됩니다. 기본적으로 첫 번째 탭이 활성화됩니다.
ky: iOS стилиндеги ылдый жакта жайгашкан чабыттоо өтмөгүнүн тилкеси. Демейки катары биринчи өтмөк жигердүү болгон бир нече өтмөктү көрсөтөт.
lo: ແຖບການນຳທາງລຸ່ມສຸດແບບ iOS. ສະແດງຫຼາຍແຖບທີ່ມີແຖບນຳໃຊ້ຢູ່ແຖບດຽວ, ແຖບທຳອິດເປັນຄ່າເລີ່ມຕົ້ນ.
lt: „iOS“ stiliaus apatinė naršymo skirtukų juosta. Teikiami keli skirtukai, iš kurių vienas (pagal numatytuosius nustatymus – pirmas) aktyvus.
lv: iOS stila apakšējā navigācijas ciļņu josla Šeit tiek rādītas vairākas cilnes, un viena no tām ir aktīva. Pēc noklusējuma aktīva ir pirmā cilne.
mk: Долна лента за навигација со картички во iOS-стил. Прикажува повеќе картички, од коишто првата прикажана стандардно е активна.
ml: iOS-സ്‌റ്റൈലിലുള്ള ചുവട്ടിലെ നാവിഗേഷൻ ടാബ് ബാർ. ഒന്നിലധികം ടാബുകൾ പ്രദർശിപ്പിക്കുന്നു, ആദ്യത്തെ ടാബ് ഡിഫോൾട്ടായി സജീവമാണ്.
mn: iOS загварын доод навигацын табын самбар. Олон табыг үзүүлэх бөгөөд өгөгдмөл тохиргоогоор эхнийх нь идэвхтэй байдаг.
mr: एक iOS-शैलीतील तळाशी नेव्हिगेशन टॅब बार. एक टॅब सुरू असताना एकाहून अधिक टॅब दाखवते, पहिला टॅब बाय डीफॉल्ट असतो.
ms: Bar tab navigasi bawah gaya iOS. Memaparkan berbilang tab dengan satu tab sedang aktif, tab pertama secara lalai.
my: iOS ပုံစံ အောက်ခြေ လမ်းညွှန်တဘ်ဘား။ မူရင်းအနေနှင့် ပထမဆုံးတဘ်ကို အမြဲပြထားပြီး တဘ်ပေါင်းများစွာ ဖော်ပြပေးသည်။
nb: En nederste fanerad i iOS-stil. Viser flere faner der én er aktiv. Den første fanen er aktiv som standard.
ne: कुनै iOS-शैलीको फेदको नेभिगेसन ट्याब पट्टी। एउटा ट्याब सक्रिय भएका बहु ट्याबहरू देखाउँछ, पहिलो ट्याबचाहिँ पूर्वनिर्धारित रूपमा देखाउँछ।
pa: iOS-style ਹੇਠਲੀ ਨੈਵੀਗੇਸ਼ਨ ਟੈਬ ਪੱਟੀ ਇੱਕ ਤੋਂ ਵੱਧ ਟੈਬਾਂ ਦਿਖਾਉਂਦੀ ਹੈ, ਜਿਨ੍ਹਾਂ ਵਿੱਚੋਂ ਪੂਰਵ-ਨਿਰਧਾਰਤ ਤੌਰ 'ਤੇ ਪਹਿਲੀ ਟੈਬ ਕਿਰਿਆਸ਼ੀਲ ਹੁੰਦੀ ਹੈ।
pl: Dolny pasek nawigacyjny w stylu iOS z kartami. Wyświetla wiele kart, w tym jedną aktywną (domyślnie pierwszą).
pt: Uma barra de guias inferior no estilo iOS. Ela exibe várias guias com uma ativa, a primeira, por padrão.
pt_pt: Uma barra de separadores de navegação inferior ao estilo do iOS. Apresenta vários separadores, sendo que um separador está ativo: por predefinição, o primeiro separador.
ro: Bară cu file de navigare din partea de jos în stil iOS. Afișează mai multe file, dintre care una este activă, în mod prestabilit prima filă.
ru: Нижняя навигационная панель вкладок в стиле iOS. Содержит несколько вкладок, одна из которых активна. По умолчанию активной считается первая вкладка.
si: iOS-විලාස බොත්තම් සංචාලන ටැබ තීරුවකි. එක් ටැබයක් සක්‍රිය ව තිබී, පළමු ටැබය පෙරනිමිය අනුව බහුවිධ ටැබ සංදර්ශනය කරයි.
sk: Spodný navigačný panel kariet v štýle systému iOS. Zobrazuje viacero kariet, z ktorých je jedna aktívna. Predvolene je to prvá karta.
sq: Një shiriti i skedës së poshtme të navigimit me stilin e iOS. Shfaq shumë skeda ku një skedë është aktive, skeda e parë si parazgjedhje.
sr: Доња трака са картицама за навигацију у iOS стилу. Приказује више картица, при чему је само једна активна, а према подразумеваним подешавањима то је прва картица.
sr_latn: Donja traka sa karticama za navigaciju u iOS stilu. Prikazuje više kartica, pri čemu je samo jedna aktivna, a prema podrazumevanim podešavanjima to je prva kartica.
sv: Ett flikfält för navigering i iOS-stil längst ned på skärmen. Flera flikar visa samtidigt, men bara en är aktiverad (den första fliken som standard).
te: iOS-శైలి బటన్ నావిగేషన్ ట్యాబ్ బార్. ఒక ట్యాబ్‌ను, డిఫాల్ట్‌గా మొదటి ట్యాబ్‌ను యాక్టివ్‌గా ఉంచి, అనేక ట్యాబ్‌లను ప్రదర్శిస్తుంది.
th: แถบแท็บการนำทางด้านล่างแบบ iOS แสดงแท็บหลายแท็บที่มี 1 แท็บใช้งานอยู่ ซึ่งโดยค่าเริ่มต้นคือแท็บแรก
tr: iOS tarzında alt gezinme sekmesi çubuğu. Birden fazla sekme gösterilir. Varsayılan olarak ilk sekme olmak üzere içlerinden biri etkin durumda olur.
uk: Нижня панель навігації з вкладками в стилі iOS містить кілька вкладок, з яких одна активна (за умовчанням – перша).
ur: ایک iOS طرز کے نیچے والی نیویگیشن ٹیب بار۔ ایک ٹیب کے فعال ہونے کے ساتھ پہلا ٹیب بطور ڈیفالٹ متعدد ٹیبز ڈسپلے کرتا ہے۔
uz: iOS uslubidagi quyi navigatsiya varaqlari paneli Bir nechta faol varaqlarni chiqaradi va birinchi varaq asosiy hisoblanadi.
vi: Thanh tab điều hướng dưới cùng theo kiểu iOS. Hiển thị nhiều tab khi đang mở một tab, tab đầu tiên hiển thị theo mặc định.
zh_hk: iOS 樣式底部導覽分頁列。顯示多個分頁，其中一個為使用中 (預設為第一個分頁)。
zu: Ibha yethebhu yokuzulazula engaphansi yesitayela se-iOS. Ibonisa amathebhu amaningi ngethebhu eyodwa eyenziwe yasebenza, ithebhu yokuqala ngokuzenzakalela.

# demoCupertinoTabBarSubtitle
source: iOS-style bottom tab bar
af: Onderste oortjiebalk in iOS-styl
am: የiOS-ቅጥ የታች ትር አሞሌ
ar_eg: شريط علامات التبويب السفلي بنمط iOS
as: iOS-শৈলীৰ বুটামৰ টেবৰ দণ্ড
az: iOS üslublu alt tab paneli
be: Ніжняя панэль укладак у стылі iOS
bn: iOS-স্টাইল বোতাম ট্যাব বার
bs: Donja traka s karticama u stilu iOS-a
ca: Barra de pestanyes d'estil iOS a la part inferior
da: Fanelinje i iOS-format i bunden
es_ar: Barra de pestañas inferior de estilo iOS
et: iOS-i stiilis alumine vahekaardiriba
eu: iOS estiloko beheko fitxa-barra
fa: نوار برگه پایین سبک iOS
fil: iOS-style na tab bar sa ibaba
fr_ca: Barre d'onglets dans le bas, style iOS
gl: Barra de pestanas inferior de tipo iOS
gu: iOS-શૈલીના તળિયાની ટૅબનું બાર
he: שורת כרטיסיות תחתונה בסגנון iOS
hi: सबसे नीचे मौजूद iOS की शैली वाला टैब बार
hu: iOS-stílusú fülsáv
hy: iOS-ի ոճով ստորին ներդիրի գոտի
id: Panel tab bawah gaya iOS
it: Barra delle schede in stile iOS
ja: iOS スタイルのボトムタブバー
ka: iOS-სტილის ქვედა ჩანართების ზოლი
km: របារផ្ទាំង​នៅផ្នែក​ខាងក្រោម​ដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಸ್ಟೈಲ್ ಬಾಟಮ್ ಟ್ಯಾಬ್ ಬಾರ್
ko: iOS 스타일 하단 탭바
ky: iOS стилиндеги ылдый жакта жайгашкан өтмөк тилкеси
lo: ແຖບລຸ່ມສຸດແບບ iOS
lt: „iOS“ stiliaus apatinė skirtukų juosta
lv: iOS stila apakšējā ciļņu josla
mk: Долна лента со картички во iOS-стил
ml: iOS-സ്‌റ്റൈലിലുള്ള ചുവട്ടിലെ ടാബ് ബാർ
mn: iOS загварын доод табын самбар
mr: iOS- शैलीतील तळाशी टॅब बार
ms: Bar tab bawah gaya iOS
my: iOS ပုံစံ အောက်ခြေတဘ်ဘား
nb: Nederste fanerad i iOS-stil
ne: iOS-शैलीको फेदको ट्याब पट्टी
pa: iOS-style ਹੇਠਲੀ ਟੈਬ ਪੱਟੀ
pl: Dolny pasek kart w stylu iOS
pt: Barra de guias inferior no estilo iOS
pt_pt: Barra de separadores inferior ao estilo do iOS
ro: Bară cu file din partea de jos în stil iOS
ru: Нижняя панель вкладок в стиле iOS
si: iOS-විලාස බොත්තම් ටැබ තීරුව
sk: Spodný panel kariet v štýle systému iOS
sq: Shiriti i skedës në fund i stilit të iOS
sr: Доња трака са картицама у iOS стилу
sr_latn: Donja traka sa karticama u iOS stilu
sv: Nedre flikfält i iOS-stil
te: iOS-శైలి బటన్ ట్యాబ్ బార్
th: แถบแท็บด้านล่างแบบ iOS
tr: iOS tarzında alt sekme çubuğu
uk: Нижня панель вкладок у стилі iOS
ur: iOS طرز کے نیچے والی ٹیب بار
uz: iOS uslubidagi varaqlar paneli
vi: Thanh tab dưới cùng theo kiểu iOS
zh_hk: iOS 樣式底部分頁列
zu: Ibha yethebhu engaphansi yesitayela se-iOS

# demoOptionsFeatureTitle
source: View options
af: Sien opsies
am: አማራጮችን ይመልከቱ
ar_eg: عرض الخيارات
as: বিকল্পসমূহ চাওক
az: Seçimlərə baxın
be: Праглядзець варыянты
bn: বিকল্প দেখুন
bs: Pogledajte opcije
ca: Mostra les opcions
da: Se valgmuligheder
es_ar: Ver opciones
et: Valikute kuvamine
eu: Ikusi aukerak
fa: گزینه‌های نما
fil: Mga opsyon sa view
fr_ca: Afficher les options
gl: Ver opcións
gu: વિકલ્પો જુઓ
he: הצגת אפשרויות
hi: विकल्प देखें
hu: Lehetőségek megtekintése
hy: Դիտեք ընտրանքները
id: Opsi tampilan
it: Visualizza opzioni
ja: オプションの表示
ka: პარამეტრების ნახვა
km: មើល​ជម្រើស
kn: ಆಯ್ಕೆಗಳನ್ನು ವೀಕ್ಷಿಸಿ
ko: 옵션 보기
ky: Параметрлерди көрүү
lo: ເບິ່ງຕົວເລືອກ
lt: Žr. parinktis
lv: Skatīšanas opcijas
mk: Прикажи ги опциите
ml: ഓപ്ഷനുകൾ കാണുക
mn: Сонголтуудыг харах
mr: पर्याय पहा
ms: Lihat pilihan
my: ရွေးစရာများ ကြည့်ရန်
nb: Visningsalternativer
ne: हेराइसम्बन्धी विकल्पहरू
pa: ਵਿਕਲਪ ਦੇਖੋ
pl: Wyświetl opcje
pt: Ver opções
pt_pt: Veja as opções
ro: Afișați opțiunile
ru: Показ параметров
si: විකල්ප බලන්න
sk: Zobraziť možnosti
sq: Shiko opsionet
sr: Прегледајте опције
sr_latn: Pregledajte opcije
sv: Alternativ för vy
te: ఎంపికలను చూడండి
th: ดูตัวเลือก
tr: Seçenekleri göster
uk: Параметри перегляду
ur: اختیارات دیکھیں
uz: Variantlarni koʻrish
vi: Xem các tùy chọn
zh_hk: 查看選項
zu: Buka izinketho

# demoOptionsFeatureDescription
source: Tap here to view available options for this demo.
af: Tik hier om beskikbare opsies vir hierdie demonstrasie te bekyk.
am: ለዚህ ተግባራዊ ማሳያ ሊገኙ የሚችሉ አማራጮችን ለማየት እዚህ ላይ መታ ያድርጉ።
ar_eg: انقر هنا لعرض الخيارات المتاحة لهذا العرض التوضيحي.
as: এই ডেম’টোৰ বাবে উপলব্ধ বিকল্পসমূহ চাবলৈ ইয়াত টিপক।
az: Bu demo üçün əlçatan seçimlərə baxmaq üçün bura toxunun.
be: Націсніце тут, каб праглядзець даступныя варыянты для гэтай дэманстрацыі.
bn: এই ডেমোর জন্য উপলভ্য বিকল্প দেখতে এখানে ট্যাপ করুন।
bs: Dodirnite ovdje da pogledate opcije dostupne za ovu demonstraciju.
ca: Toca aquí per veure les opcions disponibles per a aquesta demostració.
da: Tryk her for at se de tilgængelige muligheder for denne demo.
es_ar: Presiona aquí para ver las opciones disponibles en esta demostración.
et: Puudutage siin, et vaadata selles demos saadaolevaid valikuid.
eu: Sakatu hau demoaren aukerak ikusteko.
fa: برای مشاهده گزینه‌های در دسترس برای این نسخه نمایشی، اینجا ضربه بزنید.
fil: Mag-tap dito para makita ang mga available na opsyon para sa demo na ito.
fr_ca: Touchez ici pour voir les options proposées pour cette démonstration.
gl: Toca aquí para ver as opcións dispoñibles nesta demostración.
gu: આ ડેમો માટે ઉપલબ્ધ વિકલ્પો જોવા માટે અહીં ટૅપ કરો.
he: יש להקיש כאן כדי להציג אפשרויות זמינות להדגמה זו.
hi: इस डेमो के लिए उपलब्ध विकल्पों को देखने के लिए यहां टैप करें.
hu: Koppintson ide a bemutatóhoz tartozó, rendelkezésre álló lehetőségek megtekintéséhez.
hy: Հպեք այստեղ և դիտեք հնարավոր ընտրանքները ցուցադրական տարբերակի համար։
id: Ketuk di sini guna melihat opsi yang tersedia untuk demo ini.
it: Tocca qui per visualizzare le opzioni disponibili per questa demo.
ja: ここをタップすると、このデモの利用可能なオプションが表示されます。
ka: შეეხეთ აქ ამ დემოს ხელმისაწვდომი ვარიანტების სანახავად.
km: សូមចុច​ត្រង់នេះ ដើម្បីមើល​ជម្រើសដែលមាន​សម្រាប់​ការសាកល្បង​នេះ។
kn: ಈ ಡೆಮೋಗಾಗಿ ಲಭ್ಯವಿರುವ ಆಯ್ಕೆಗಳನ್ನು ವೀಕ್ಷಿಸಲು, ಇಲ್ಲಿ ಟ್ಯಾಪ್ ಮಾಡಿ.
ko: 이 데모의 사용 가능한 옵션을 보려면 여기를 탭하세요.
ky: Бул демо версиядагы жеткиликтүү параметрлерди көрүү үчүн бул жерди таптап коюңуз.
lo: ແຕະບ່ອນນີ້ເພື່ອເບິ່ງຕົວເລືອກທີ່ສາມາດໃຊ້ໄດ້ສຳລັບການສາທິດນີ້.
lt: Palieskite čia, kad peržiūrėtumėte pasiekiamas šios demonstracinės versijos parinktis.
lv: Pieskarieties šeit, lai skatītu šai demonstrācijai pieejamās opcijas.
mk: Допрете тука за да се прикажат достапните опции за оваа демонстрација.
ml: ഈ ഡെമോയ്ക്ക് ലഭ്യമായ ഓപ്ഷനുകൾ കാണുന്നതിന് ഇവിടെ ടാപ്പ് ചെയ്യുക.
mn: Энэ демо хувилбарын боломжит сонголтуудыг харахын тулд энд товшино уу.
mr: या डेमोसाठी उपलब्ध असलेले पर्याय पाहण्यासाठी येथे टॅप करा.
ms: Ketik di sini untuk melihat pilihan yang tersedia untuk tunjuk cara ini.
my: ယခုသရုပ်ပြမှုအတွက် ရနိုင်သောရွေးစရာများ ကြည့်ရန် ဤနေရာကို တို့နိုင်သည်။
nb: Trykk her for å se tilgjengelige alternativer for denne demonstrasjonen.
ne: यो डेमोका उपलब्ध विकल्पहरू हेर्न यहाँ ट्याप गर्नुहोस्।
pa: ਇਸ ਡੈਮੋ ਲਈ ਉਪਲਬਧ ਵਿਕਲਪ ਦੇਖਣ ਲਈ ਇੱਥੇ ਟੈਪ ਕਰੋ।
pl: Kliknij tutaj, by zobaczyć opcje dostępne w tej wersji demonstracyjnej.
pt: Toque aqui para ver as opções disponíveis para esta demonstração.
pt_pt: Toque aqui para ver as opções disponíveis para esta demonstração.
ro: Atingeți aici pentru a vedea opțiunile disponibile pentru această demonstrație.
ru: Нажмите, чтобы посмотреть доступные параметры для этой демоверсии.
si: මෙම ආදර්ශනය සඳහා ලබා ගත හැකි විකල්ප බැලීමට මෙහි තට්ටු කරන්න.
sk: Klepnutím sem zobrazíte dostupné možnosti pre túto ukážku.
sq: Trokit këtu për të parë opsionet që ofrohen për këtë demonstrim.
sr: Додирните овде да бисте видели доступне опције за ову демонстрацију.
sr_latn: Dodirnite ovde da biste videli dostupne opcije za ovu demonstraciju.
sv: Tryck här om du vill visa tillgängliga alternativ för demon.
te: ఈ డెమో కోసం అందుబాటులో ఉన్న ఎంపికలను చూడటానికి ఇక్కడ నొక్కండి.
th: แตะที่นี่เพื่อดูตัวเลือกสำหรับการสาธิตนี้
tr: Bu demodaki kullanılabilir seçenekleri görmek için buraya dokunun.
uk: Натисніть, щоб переглянути параметри для цієї демо-версії.
ur: اس ڈیمو کے ليے دستیاب اختیارات دیکھنے کے ليے یہاں تھپتھپائیں۔
uz: Mavjud variantlarni koʻrish uchun bu yerga bosing.
vi: Nhấn vào đây để xem các tùy chọn có sẵn cho bản minh họa này.
zh_hk: 輕按這裡即可查看此示範的可用選項。
zu: Thepha lapha ukuze ubuke izinketho ezitholakalayo zale demo.
