Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSharedAxisDescription
source: The shared axis pattern is used for transitions between the UI elements that have a spatial or navigational relationship. This pattern uses a shared transformation on the x, y, or z axis to reinforce the relationship between elements.
af: Die gedeelde-aspatroon word gebruik vir oorgang tussen die UI-elemente wat 'n ruimtelike of navigasieverhouding het. Die patroon gebruik 'n gedeelde omskepping op die x-, y- of z-as om die verhouding tussen elemente te versterk.
am: የተጋራ የዘንግ ስርዓተ-ጥለት የቦታ ወይም የዳሰሳ ግንኙነት ባላቸው ዩአይ ክፍለ-አካላት መካከል ላሉት ሽግግሮች ያገለግላል። በክፍለ-አካላት መካከል ያለውን ግንኙነት ለማጠናከር ይህ ስርዓተ-ጥለት በ x፣ y ወይም z ዘንግ ላይ የጋራ ሽግግርን ይጠቀማል።
ar_eg: يتم استخدام نمط المحور المشترك لتأثيرات الانتقال بين العناصر في واجهة المستخدم التي تربطها علاقة انتقال أو علاقة مكانية. يستخدم هذا النمط التحويل المشترك على محور "س" أو "ص" أو "ع" لتعزيز العلاقة بين العناصر.
as: অক্ষ শ্বেয়াৰ কৰা আৰ্হিটো এটা স্থানিক অথবা নেভিগেশ্বনৰ সম্পৰ্ক থকা ইউআই উপাদানসমূহৰ মাজত হোৱা ট্ৰানজিশ্বনসমূহৰ বাবে ব্যৱহাৰ কৰা হয়। এই আৰ্হিটোৱে উপাদানসমূহৰ মাজত সম্পৰ্ক সুদৃঢ় কৰিবলৈ x, y, অথবা z অক্ষৰ ওপৰত এটা শ্বেয়াৰ কৰা ৰূপান্তৰণ ব্যৱহাৰ কৰে।
az: Paylaşılan ox modeli məkan və ya naviqasiya əlaqəsi olan UI elementləri arasında keçid üçün istifadə edilir. Bu model elementlər arasında əlaqəni gücləndirmək üçün x, y və ya z oxunda paylaşılan transformasiya istifadə edir.
be: Шаблон абагуленай восі выкарыстоўваецца для пераходаў паміж элементамі карыстальніцкага інтэрфейсу, якія маюць прасторавыя ці навігацыйныя сувязі. Гэты шаблон выкарыстоўвае абагуленае пераўтварэнне на восях x, y ці z для ўзмацнення сувязяў паміж элементамі.
bn: UI এলিমেন্টের মধ্যে ট্রানজিশন করতে শেয়ার করা অ্যাক্সিস প্যাটার্ন ব্যবহার করা হয় যেটিতে স্থানীয় অথবা নেভিগেট করার সুবিধা রয়েছে। এই প্যাটার্নটি এলিমেন্টের মধ্যে সম্পর্ক শক্তিশালী করতে x, y বা z অ্যাক্সিসের উপর শেয়ার করা পরিবর্তন ব্যবহার করে।
bs: Obrazac dijeljene ose se koristi za prijelaze između elemenata korisničkog interfejsa koji imaju prostornu ili navigacijsku vezu. Ovaj obrazac koristi dijeljenu transformaciju na x, y ili z osi da ojača vezu između elemenata.
ca: El patró d'eix compartit s'utilitza per a transicions entre elements de la IU que tenen una relació espacial o de navegació. Aquest patró utilitza una transformació compartida a l'eix x, y o z per reforçar la relació entre els elements.
da: Mønsteret for delt akse anvendes til overgange mellem brugerfladeelementer, der har et rumligt eller navigationsrelateret forhold. Dette mønster anvender en delt omdannelse på x-, y- eller z-aksen for at forstærke forholdet mellem elementer.
es_ar: El patrón de eje compartido se usa para hacer transiciones entre los elementos de la IU que tienen una relación espacial o de navegación. Este patrón utiliza una transformación compartida en los ejes X, Y o Z para reforzar la relación entre los elementos.
et: Jagatud telje mustrit kasutatakse ruumilise või navigeerimissuhtega kasutajaliidese elementide vaheliste üleminekute jaoks. Muster kasutab X-, Y- või Z-teljel jagatud üleminekut, et elementidevahelist suhet esile tõsta.
eu: Harreman espaziala edo nabigazionala daukaten erabiltzaile-interfazeko elementuen arteko trantsizioetarako erabiltzen da partekatutako ardatzaren eredua. Eredu horrek X, Y edo Z ardatzaren itxuraldaketa partekatua erabiltzen du elementuen arteko harremana sendotzeko.
fa: الگوی محور مشترک برای انتقال بین عناصر رابط کاربری‌ای استفاده می‌شود که رابطه‌ای فضایی یا پیمایشی دارند. این الگو از تبدیل مشترک در محور x،‏ y، یا z استفاده می‌کند تا رابطه بین عناصر را تقویت کند.
fil: Ginagamit ang pattern ng nakabahaging axis para sa mga transition sa pagitan ng mga element ng UI na may ugnayang spatial o para sa pag-navigate. Gumagamit ang pattern na ito ng nakabahaging pag-iiba ng anyo sa x, y, o z axis para mapatibay ang ugnayan sa pagitan ng mga element.
fr_ca: Le motif d'axe partagé est utilisé pour les transitions entre les éléments d'IU qui possèdent une relation spatiale ou de navigation. Ce motif utiliser une transformation partagée sur l'axe x, y ou z afin de renforcer la relation entre les éléments.
gl: O padrón do eixe compartido utilízase para transicións entre os elementos da IU que teñen unha relación espacial ou de navegación. Este padrón utiliza unha transformación compartida no eixe x, y ou z para reforzar a relación entre os elementos.
gu: શેર કરેલી અક્ષ પૅટર્નનો ઉપયોગ તેવા UI ઘટકોની વચ્ચે ટ્રાંઝિશન માટે થાય છે કે જેનો અંતર સંબંધી અથવા નૅવિગેશન સંબંધી સંબંધ હોય છે. આ પૅટર્ન ઘટકોની વચ્ચેના સંબંધને વધુ મજબૂત બનાવવા માટે x, y અથવા z અક્ષ પરના શેર કરેલા ટ્રાંસ્ફોર્મેશનનો ઉપયોગ કરે છે.
he: דפוס הציר המשותף משמש למעברים בין רכיבי ממשק משתמש עם קשר מרחבי או קשרי ניווט. דפוס זה משתמש בטרנספורמציה משותפת בציר x, ‏y או z כדי לשפר את הקשר בין הרכיבים.
hi: शेयर्ड ऐक्सिस वाला पैटर्न, उन यूज़र इंटरफ़ेस (यूआई) एलिमेंट के बीच ट्रांज़िशन के लिए इस्तेमाल किया जाता है जो दूरी या नेविगेशन के संदर्भ में एक-दूसरे से जुड़े होते हैं. यह पैटर्न, एलिमेंट के बीच तालमेल को बेहतर बनाने के लिए, ऐक्स, वाई या ज़ेड ऐक्सिस के बीच शेयर होने वाले बदलाव के हिसाब से काम करता है.
hu: A megosztott tengely mintát a térbeli vagy navigációs kapcsolattal rendelkező UI-elemek közötti átmenetekhez használja a rendszer. Ez a minta megosztott átalakítást használ az x, az y vagy a z tengelyen az elemek közötti kapcsolat megerősítéséhez.
hy: Ընդհանուր առանցքի էֆեկտը օգտագործվում է միջերեսի այն տարրերի միջև անցում կատարելու ամար, որոնք կարծես թե տեղակայված են մեկ առանցքի վրա։ Տարրերի միջև կապն ամրապնդելու համար օգտագործվում է համատեղ փոխակերպումը X, Y կամ Z առանցքներով։
id: Pola sumbu merata digunakan untuk transisi antara elemen UI yang memiliki hubungan spasial atau navigasi. Pola ini menggunakan transformasi yang sama pada sumbu x, y, atau z untuk memperkuat hubungan antar-elemen.
it: Il pattern di assi condivisi per le transizioni tra gli elementi UI che hanno una relazione di spazio o di navigazione. Questo pattern utilizza una trasformazione condivisa sugli assi x, y o z per rafforzare la relazione tra gli elementi.
ja: 軸共有パターンは、空間関係またはナビゲーション関係がある UI 要素間の変換に使用します。このパターンは、x 軸、y 軸、z 軸で共有変換を使用して要素間の関係を強化します。
ka: საზიარო ღერძის ნიმუში გამოიყენება UI-ის იმ ელემენტებს შორის გადასვლისთვის, რომლებსაც სივრცული ან ნავიგაციური ურთიერთობა აქვთ. ეს ნიმუში, ელემენტებს შორის ურთიერთობის გასაძლიერებლად, იყენებს საზიარო გარდაქმნას x, y ან z ღერძზე.
km: លំនាំ​អ័ក្សរួម​ត្រូវបានប្រើ​សម្រាប់ការផ្លាស់ប្ដូរ​រវាងធាតុ UI ដែលមាន​ទំនាក់ទំនងផ្នែក​ទំហំ ឬ​ការរុករក។ លំនាំនេះ​ប្រើការប្រែក្លាយរួម​លើអ័ក្ស x, y ឬ z ដើម្បី​ពង្រឹងទំនាក់ទំនង​រវាងធាតុនានា។
kn: ಪ್ರಾದೇಶಿಕ ಅಥವಾ ನ್ಯಾವಿಗೇಶನಲ್ ಸಂಬಂಧ ಹೊಂದಿರುವ UI ಅಂಶಗಳ ನಡುವಿನ ಪರಿವರ್ತನೆಗಳಿಗಾಗಿ ಹಂಚಿದ ಅಕ್ಷದ ಪ್ಯಾಟರ್ನ್ ಅನ್ನು ಬಳಸಲಾಗುತ್ತದೆ. ಈ ಪ್ಯಾಟರ್ನ್ ಅಂಶಗಳ ನಡುವಿನ ಸಂಬಂಧವನ್ನು ಬಲಪಡಿಸಲು x, y, ಅಥವಾ z ಅಕ್ಷಗಳ ಮೇಲೆ ಹಂಚಿದ ಪರಿವರ್ತನೆಯನ್ನು ಬಳಸುತ್ತದೆ.
ko: 공유된 축 패턴은 공간 또는 탐색 관계를 가진 UI 패턴 간의 전환에 사용됩니다. 이 패턴은 x, y 또는 z축의 공유된 변환을 사용하여 요소 간 관계를 강화해 줍니다.
ky: Бөлүшүлгөн ок шаблону колдонуучу интерфейсинин мейкиндик же чабыттоо катнашы бар элементтерин өзгөртүү үчүн колдонулат. Бул шаблон x, y, же z огунда элементтердин арасындагы байланышты күчүнө киргизүү үчүн, бөлүшүлгөн трансформацияны колдонот.
lo: ຮູບແບບແກນທີ່ແບ່ງປັນແມ່ນຖືກໃຊ້ສຳລັບການປ່ຽນລະຫວ່າງອົງປະກອບສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ທີ່ມີຄວາມສຳພັນກ່ຽວກັບການນຳທາງ ຫຼື ຕຳແໜ່ງ. ຮູບແບບນີ້ໃຊ້ຂໍ້ມູນທີ່ແບ່ງປັນຢູ່ແກນ x, y ຫຼື z ເພື່ອສະໜັບສະໜຸນຄວາມສຳພັນລະຫວ່າງອົງປະກອບຕ່າງໆ.
lt: Bendrinamos ašies šablonas naudojamas NS elementams, susietiems erdviniais ar naršymo ryšiais, perkelti. Šis šablonas naudoja bendrinamą transformavimą x, y arba z ašyje elementų ryšiui sustiprinti.
lv: Kopīgās ass formu izmanto pārejām starp lietotāja saskarnes elementiem, kas ir savstarpēji saistīti telpiskās vai navigācijas attiecībās. Šai pārejas formai tiek izmantota kopīga pārveidošana pa x, y vai z asi, lai uzsvērtu attiecības starp elementiem.
mk: Шемата на споделена оска се користи за транзиции меѓу елементи на корисничкиот интерфејс што имаат просторна или навигациска врска. Шемава користи споделена трансформација на оските x, y или z за да ја засили врската помеѓу елементите.
ml: സ്ഥല സംബന്ധമായോ നവിഗേഷൻ സംബന്ധമായോ ബന്ധമുള്ള UI ഘടകങ്ങൾ തമ്മിലുള്ള പരിവർത്തനത്തിനായാണ് പങ്കിട്ട ആക്‌സിസ് പാറ്റേൺ ഉപയോഗിക്കുന്നത്. ഘടകങ്ങൾ തമ്മിലുള്ള ബന്ധം പുനഃസ്ഥാപിക്കുന്നതിന് ഈ പാറ്റേൺ, x, y, z അക്ഷത്തിൽ ഒരു പങ്കിടൽ പരിവർത്തന രീതി ഉപയോഗിക്കുന്നു.
mn: Хуваалцсан тэнхлэгийн загварыг орон зайн эсвэл навигацын харилцаатай UI элементүүдийн хоорондын шилжилтэд ашигладаг. Энэ загвар нь элементүүдийн хоорондын харилцааг бэхжүүлэхийн тулд x, y, эсвэл z тэнхлэг дээр хуваалцсан өөрлөлтийг ашигладаг.
mr: अक्षाचा शेअर केलेला पॅटर्न हा जागा आणि नेव्हिगेशनशी संबंध असलेल्या UI घटकांदरम्यान बदल करण्यासाठी वापरला जातो. हा पॅटर्न घटकांमधील संबंध अधिक बळकट करण्यासाठी x, y, किंवा z अक्षावर एक शेअर केलेले रूपांतरण वापरतो.
ms: Corak paksi dikongsi digunakan untuk peralihan antara unsur UI yang mempunyai perhubungan ruang atau navigasi. Corak ini menggunakan pengubahan dikongsi pada paksi x, y atau z untuk mengukuhkan perhubungan antara unsur.
my: မျှဝေထားသော ဝင်ရိုးပုံစံကို နေရာခြား သို့မဟုတ် နေရာပြ ဆက်စပ်မှုတစ်ခုရှိသော UI အစိတ်အပိုင်းများကြားတွင် ကူးပြောင်းမှုအတွက် အသုံးပြုသည်။ ၎င်းပုံစံသည် အစိတ်အပိုင်းများကြားရှိ ဆက်နွယ်မှုကို အားဖြည့်ပေးရန်အတွက် x၊ y သို့မဟုတ် z ဝင်ရိုးများပေါ်တွင် မျှဝေထားသော အသွင်ပြောင်းမှုကို အသုံးပြုသည်။
nb: Det delte aksemønsteret brukes for overganger mellom elementene i brukergrensesnittet som har et romlig eller navigasjonsbasert forhold. Dette mønsteret bruker en delt overgang på X-, Y- eller Z-aksen for å forsterke forholdet mellom elementer.
ne: सेयर्ड एक्सिस प्याटर्न स्थानिक वा नेभिगेसनको सम्बन्ध भएका UI एलिमेन्टहरूबिच हुने ट्रान्जिसनका लागि प्रयोग गरिन्छ। यो प्याटर्नमा UI एलिमेन्टहरूबिचको सम्बन्ध सुदृढ बनाउन x, y वा z एक्सिसमा साझा ट्रान्सफर्मेसन प्रयोग गरिन्छ।
pa: ਸਾਂਝਾ ਕੀਤਾ ਧੁਰਾ ਪੈਟਰਨ ਅਜਿਹੇ UI ਤੱਤਾਂ ਵਿਚਾਲੇ ਪਰਿਵਰਤਨਾਂ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਿਨ੍ਹਾਂ ਵਿੱਚ ਸਥਾਨਕ ਜਾਂ ਨੈਵੀਗੇਸ਼ਨਲ ਸੰਬੰਧ ਹੈ। ਇਹ ਪੈਟਰਨ ਤੱਤਾਂ ਵਿਚਾਲੇ ਸੰਬੰਧਾਂ ਦੀ ਪੁਸ਼ਟੀ ਕਰਨ ਲਈ x, y, ਜਾਂ z ਧੁਰੇ 'ਤੇ ਸਾਂਝੇ ਕੀਤੇ ਰੁਪਾਂਤਰਣ ਨੂੰ ਵਰਤਦਾ ਹੈ।
pl: Wzorzec wspólnej osi jest przeznaczony dla przejść między elementami interfejsu, między którymi istnieje związek przestrzenny lub nawigacyjny. Ten wzorzec używa wspólnej transformacji na osi x, y lub z do wzmocnienia związku między elementami.
pt: O padrão do eixo compartilhado é usado para transições entre os elementos da IU que têm uma relação especial ou de navegação. Ele usa uma transformação compartilhada nos eixos x, y ou z para reforçar a relação entre os elementos.
pt_pt: O padrão de eixo partilhado é utilizado para transições entre elementos da IU que têm uma relação espacial ou de navegação. Este padrão utiliza uma transformação partilhada no eixo x, y ou z para reforçar a relação entre elementos.
ro: Modelul cu axă comună este folosit pentru tranziții între elemente IU care au o relație spațială sau de navigare. Acest model folosește o transformare comună pe axa x, y, sau z pentru a evidenția legătura dintre elemente.
ru: Эффект общей оси применяется для переходов между элементами пользовательского интерфейса, которые расположены как бы на одной оси. Для укрепления связи между элементами используется совместное преобразование по оси X, Y или Z.
si: අවකාශීය හෝ සංචාලන සම්බන්ධතාවයක් ඇති UI මූලාංග අතර සංක්‍රාන්තිය සඳහා බෙදා ගත් අක්ෂ රටාව භාවිත කරයි. මෙම රටාව මූලාංග අතර සම්බන්ධතාවය ශක්තිමත් කිරීම සඳහා x, y, හෝ z අක්ෂයේ බෙදා ගත් පරිණාමනයක් භාවිත කරයි.
sk: Vzor zdieľanej osi sa používa v prípade prechodov medzi prvkami používateľského rozhrania, ktoré sú v priestorovom alebo navigačnom vzájomnom vzťahu. Tento vzor používa zdieľanú transformáciu na osiach x, y alebo z na upevnenie vzťahov medzi prvkami.
sq: Motivi i boshtit të ndarë përdoret për kalimet mes elementeve të ndërfaqes së përdoruesit që kanë marrëdhënie hapësinore ose navigacionale. Ky motiv përdor një transformim të ndarë në boshtin x, y ose z për të përforcuar marrëdhënien mes elementeve.
sr: Шаблон заједничке осе се користи за прелаз између елемената корисничког интерфејса који имају просторни или навигациони однос. Овај шаблон користи заједничку трансформацију по X, Y или Z оси за наглашавање односа између елемената.
sr_latn: Šablon zajedničke ose se koristi za prelaz između elemenata korisničkog interfejsa koji imaju prostorni ili navigacioni odnos. Ovaj šablon koristi zajedničku transformaciju po X, Y ili Z osi za naglašavanje odnosa između elemenata.
sv: Mönstret med delad axel används för övergångar mellan element i användargränssnittet som hänger ihop rumsligt eller navigeringsmässigt. Mönstret förstärker den inbördes relationen mellan element med hjälp av en övergång längs en gemensam x-, y- eller z-axel.
te: ప్రాదేశిక లేదా నావిగేషనల్ సంబంధాలను కలిగిన UI మూలకాల మధ్య పరివర్తనల కోసం షేర్‌డ్ ఆక్సిస్ ఆకృతి ఉపయోగించబడుతుంది. ఈ ఆకృతి, మూలకాల మధ్య సంబంధాన్ని బలోపేతం చేయడానికి x, y, లేదా z ఆక్సిస్‌పై షేర్‌డ్ పరివర్తనను ఉపయోగిస్తుంది.
th: รูปแบบ "แกนร่วม" ใช้ในการเปลี่ยนระหว่างองค์ประกอบ UI ที่มีความสัมพันธ์ในการนำทางหรือเชิงพื้นที่ รูปแบบนี้ใช้การเปลี่ยนรูปแบบร่วมกันบนแกน X, Y, หรือ Z เพื่อเสริมความสัมพันธ์ระหว่างองค์ประกอบต่างๆ
tr: Paylaşılan eksen deseni, uzamsal veya gezinme ilişkisi olan kullanıcı arayüzü öğeleri arasındaki geçişler için kullanılır. Bu desen, öğeler arasındaki ilişkiyi güçlendirmek için x, y veya z eksenlerinde paylaşılan bir dönüşüm kullanır.
uk: Стиль "Спільна вісь" призначений для переходів між елементами інтерфейсу, які знаходяться поруч або між якими виконується навігація. Цей стиль використовує спільне перетворення за осями X, Y і Z, щоб чітко пов'язати елементи.
ur: مشترکہ محور کے پیٹرن کا استعمال UI عناصر کے درمیان ٹرانزیشن کے لیے کیا جاتا ہے جس میں مکانی یا نیویگیشنل رشتہ ہوتا ہے۔ یہ پیٹرن عناصر کے درمیان تعلق کو دوبارہ تقویت دینے کے لیے x، ‫y یا z کے محور پر مشترکہ ٹرانسفارمیشن کا استعمال کرتا ہے۔
uz: Umumiy oʻqlar effekti bitta oʻqda joylashgan foydalanuvchi interfeysi elementlari orasidagi oʻtishlarga moʻljallangan. Elementlar orasidagi aloqani mustahkamlash uchun X, Y yoki Z oʻqlari boʻyicha oʻzaro oʻzgartirish qoʻllaniladi.
vi: Mẫu trục chung được dùng cho quá trình chuyển đổi giữa các thành phần giao diện người dùng có mối quan hệ về hướng hoặc không gian. Mẫu này dùng sự biến đổi chung trên trục x, y hoặc z để củng cố mối quan hệ giữa các thành phần.
zh_hk: 共用軸線模式用於轉移有空間或導覽關係的使用者介面元素。此模式利用共用的 X、Y 或 Z 軸進行變形，以突顯元素之間的關係。
zu: Iphethini ye-axis eyabiwe isetshenziselwa ukuguqulwa okuphakathi kwama-elementi e-UI anobudlelwane be-spatial noma bokuzulazula. Le phethini isebenzisa ukuguqulwa okwabiwe ku-axis ka-x, y, noma u-z ukuze kuphinde kuqiniswe ubudlelwane phakathi kwama-elementi.

# demoSharedXAxisTitle
source: Shared x-axis
af: Gedeelde x-as
am: የተጋራ x-ዘንግ
ar_eg: محور "س" المشترك
as: শ্বেয়াৰ কৰা x অক্ষ
az: Paylaşılan x oxu
be: Абагуленая вось x
bn: শেয়ার করা x-অ্যাক্সিস
bs: Dijeljena x osa
ca: Eix X compartit
da: Delt x-akse
es_ar: Eje X compartido
et: Jagatud X-telg
eu: Partekatutako X ardatza
fa: محور x مشترک
fil: Nakabahaging x-axis
fr_ca: Axe x partagé
gl: Eixe x compartido
gu: શેર કરેલા x-અક્ષ
he: ציר x משותף
hi: शेयर्ड ऐक्स-ऐक्सिस
hu: Megosztott x tengely
hy: Ընդհանուր X առանցք
id: Sumbu x merata
it: Asse x condiviso
ja: x 軸共有
ka: საზიარო x-ღერძი
km: អ័ក្ស x រួម
kn: ಹಂಚಿದ x-ಅಕ್ಷ
ko: 공유된 x축
ky: Бөлүшүлгөн x-огу
lo: ແກນ x ທີ່ແບ່ງປັນ
lt: Bendrinama x ašis
lv: Kopīga x ass
mk: Споделена x-оска
ml: പങ്കിട്ട x-അക്ഷം
mn: Хуваалцсан x-тэнхлэг
mr: शेअर केलेला x अक्ष
ms: Paksi x dikongsi
my: မျှဝေထားသော x ဝင်ရိုး
nb: Delt X-akse
ne: साझा एक्स-एक्सिस
pa: ਸਾਂਝਾ ਕੀਤਾ x-ਧੁਰਾ
pl: Wspólna oś x
pt: Eixo x compartilhado
pt_pt: Eixo x partilhado
ro: Axa x comună
ru: Общая ось X
si: බෙදා ගත් x-අක්ෂය
sk: Zdieľaná os x
sq: Boshti x i ndarë
sr: Заједничка X оса
sr_latn: Zajednička X osa
sv: Delad x-axel
te: షేర్‌డ్ x-ఆక్సిస్
th: แกน X ที่ใช้ร่วมกัน
tr: Paylaşılan x ekseni
uk: Спільна вісь X
ur: مشترکہ x-axis
uz: Umumiy X oʻqi
vi: Trục x chung
zh_hk: 共用 X 軸
zu: I-x-axis eyabiwe

# demoSharedXAxisBackButtonText
source: BACK
af: TERUG
am: ተመለስ
ar_eg: رجوع
as: উভতি যাওক
az: GERİ
be: НАЗАД
bn: ফিরে যান
bs: NAZAD
ca: ENRERE
da: TILBAGE
es_ar: ATRÁS
et: TAGASI
eu: ATZERA
fa: برگشت
fil: BUMALIK
fr_ca: RETOUR
gl: ATRÁS
gu: પાછળ
he: חזרה
hi: वापस जाएं
hu: VISSZA
hy: ՀԵՏ
id: KEMBALI
it: INDIETRO
ja: 戻る
ka: უკან
km: ថយក្រោយ
kn: ಹಿಂದೆ
ko: 뒤로
ky: АРТКА
lo: ກັບຄືນ
lt: ATGAL
lv: ATPAKAĻ
mk: НАЗАД
ml: മടങ്ങുക
mn: БУЦАХ
mr: मागे
ms: KEMBALI
my: နောက်သို့
nb: TILBAKE
ne: पछाडि
pa: ਪਿੱਛੇ
pl: WSTECZ
pt: VOLTAR
pt_pt: ANTERIOR
ro: ÎNAPOI
ru: НАЗАД
si: ආපසු
sk: SPÄŤ
sq: PRAPA
sr: НАЗАД
sr_latn: NAZAD
sv: TILLBAKA
te: వెనుకకు
th: กลับ
tr: GERİ
uk: НАЗАД
ur: پیچھے
uz: ORQAGA
vi: QUAY LẠI
zh_hk: 返回
zu: EMUVA

# demoSharedXAxisNextButtonText
source: NEXT
af: VOLGENDE
am: ቀጣይ
ar_eg: التالي
as: পৰৱৰ্তী
az: NÖVBƏTİ
be: ДАЛЕЙ
bn: পরবর্তী
bs: NAPRIJED
ca: SEGÜENT
da: NÆSTE
es_ar: SIGUIENTE
et: JÄRGMINE
eu: HURRENGOA
fa: بعدی
fil: SUSUNOD
fr_ca: SUIVANT
gl: SEGUINTE
gu: આગળ
he: הבא
hi: आगे बढ़ें
hu: TOVÁBB
hy: ԱՌԱՋ
id: BERIKUTNYA
it: AVANTI
ja: 次へ
ka: შემდეგი
km: បន្ទាប់
kn: ಮುಂದೆ
ko: 다음
ky: КИЙИНКИ
lo: ຕໍ່ໄປ
lt: KITAS
lv: TĀLĀK
mk: СЛЕДНО
ml: അടുത്തത്
mn: ДАРААХ
mr: पुढे
ms: SETERUSNYA
my: ရှေ့သို့
nb: NESTE
ne: अर्को
pa: ਅੱਗੇ
pl: DALEJ
pt: PRÓXIMA
pt_pt: SEGUINTE
ro: ÎNAINTE
ru: ДАЛЕЕ
si: ඊළඟ
sk: ĎALEJ
sq: PARA
sr: ДАЉЕ
sr_latn: DALJE
sv: NÄSTA
te: తదుపరి
th: ถัดไป
tr: İLERİ
uk: ДАЛІ
ur: آگے
uz: KEYINGISI
vi: TIẾP THEO
zh_hk: 繼續
zu: OKULANDELAYO

# demoSharedXAxisCulinaryCourseTitle
source: Culinary
af: Kookkuns
am: የምግብ አሰራር
ar_eg: طهي
as: ৰন্ধন সম্পৰ্কীয়
az: Kulinariya
be: Кулінарыя
bn: রন্ধন সম্পর্কিত
bs: Kulinarstvo
ca: Sector culinari
da: Madlavning
es_ar: Cocina
et: Kokandus
eu: Sukaldaritza
fa: دوره آشپزی
fil: Pagluluto
fr_ca: Cuisine
gl: Cociña
gu: રસોઈ
he: בישול
hi: खान-पान
hu: Konyhaművészet
hy: Խոհարարություն
id: Kuliner
it: Arte culinaria
ja: 料理
ka: კულინარია
km: ការធ្វើម្ហូប
kn: ಪಾಕಶಾಲೆ
ko: 요리
ky: Кулинария
lo: ການຄົວກິນ
lt: Kulinarija
lv: Kulinārija
mk: Кулинарство
ml: പാചകസംബന്ധമായത്
mn: Хоол
mr: पाककला
ms: Kulinari
my: အချက်အပြုတ်
nb: Matlaging
ne: पाक कला
pa: ਰਸੋਈ ਸੰਬੰਧੀ
pl: Kuchnia
pt: Culinária
pt_pt: Culinária
ro: Culinar
ru: Кулинария
si: සූපවේදී
sk: Kulinárstvo
sq: Gatim
sr: Кулинарство
sr_latn: Kulinarstvo
sv: Matlagning
te: వంట కోర్స్
th: การทำอาหาร
tr: Mutfak
uk: Кулінарія
ur: فن طباخی
uz: Kulinariya
vi: Ẩm thực
zh_hk: 烹飪
zu: Okokupheka

# githubRepo
source: {repoName} GitHub repository
af: GitHub-bewaarplek {repoName}
am: {repoName} የGitHub ውሂብ ማከማቻ
ar_eg: مستودع GitHub {repoName}
as: {repoName} GitHub ৰিপ’জিটৰী
az: {repoName} GitHub yaddaşı
be: Рэпазітар GitHub {repoName}
bn: {repoName} GitHub ভান্ডার
bs: {repoName} GitHub spremište
ca: repositori de GitHub {repoName}
da: {repoName} GitHub-lager
es_ar: Repositorio de GitHub {repoName}
et: {repoName} GitHubi andmehoidla
eu: {repoName} GitHub biltegia
fa: مخزن GitHub‏ {repoName}
fil: Repository ng GitHub ng {repoName}
fr_ca: référentiel GitHub {repoName}
gl: almacén de GitHub de {repoName}
gu: {repoName} GitHub ડેટા સ્ટોરેજ સ્થાન
he: {repoName} מאגר GitHub
hi: {repoName} GitHub की डेटा स्टोर करने की जगह
hu: {repoName} GitHub-tárhely
hy: {repoName} GitHub-ի շտեմարան
id: Repositori GitHub {repoName}
it: repository GitHub {repoName}
ja: {repoName} GitHub リポジトリ
ka: {repoName} GitHub საცავი
km: ឃ្លាំង GitHub របស់ {repoName}
kn: {repoName} GitHub ಸಂಗ್ರಹಣೆ
ko: {repoName} GitHub 저장소
ky: {repoName} GitHub сактоочу жайы
lo: ບ່ອນເກັບຂໍ້ມູນ {repoName} GitHub
lt: „{repoName}“: „GitHub“ saugykla
lv: {repoName} GitHub krātuve
mk: Складиште на GitHub {repoName}
ml: {repoName} GitHub കലവറ
mn: {repoName} GitHub хадгалах газар
mr: {repoName} GitHub रीपॉझिटरी
ms: {repoName} repositori GitHub
my: {repoName} GitHub သိမ်းဆည်းရန်နေရာ
nb: {repoName} GitHub-repositorium
ne: {repoName} GitHub रिपोजिटरी
pa: {repoName} GitHub ਡਾਟਾ-ਭੰਡਾਰ
pl: repozytorium {repoName} na GitHubie
pt: Repositório {repoName} do GitHub
pt_pt: Repositório do GitHub {repoName}
ro: Directorul GitHub {repoName}
ru: репозиторий GitHub {repoName}
si: {repoName} GitHub ගබඩාව
sk: Odkladací priestor GitHub {repoName}
sq: Depoja {repoName} e GitHub
sr: {repoName} GitHub складиште
sr_latn: {repoName} GitHub skladište
sv: GitHub-lagringsplats {repoName}
te: {repoName} GitHub స్టోరేజ్‌ స్థానం
th: ที่เก็บ {repoName} ใน GitHub
tr: {repoName} GitHub havuzu
uk: Сховище GitHub "{repoName}"
ur: GitHub ذخیرہ {repoName}
uz: {repoName} GitHub repozitoriysi
vi: Kho lưu trữ {repoName} trên GitHub
zh_hk: {repoName} GitHub 存放區
zu: {repoName} Ikhosombe le-GitHub

# fortnightlyMenuUS
source: US
af: VSA
am: አሜሪካ
ar_eg: الولايات المتحدة
as: আমেৰিকা যুক্তৰাষ্ট্ৰ
az: ABŞ
be: ЗША
bn: মার্কিন যুক্তরাষ্ট্র
bs: SAD
ca: EUA
da: USA
es_ar: EE.UU.
et: USA
eu: Ameriketako Estatu Batuak
fa: آمریکا
fr_ca: États-Unis
gl: Estados Unidos
gu: યુએસ
he: ארה"ב
hi: अमेरिका
hu: USA
hy: ԱՄՆ
id: AS
it: Stati Uniti
ka: შეერთებული შტატები
km: សហរដ្ឋ​អាមេរិក
kn: ಯುಎಸ್
ko: 미국
ky: АКШ
lo: ສະຫະລັດ
lt: JAV
lv: ASV ziņas
mk: САД
ml: യുഎസ്
mn: АНУ
mr: यूएस
ms: AS
my: ယူအက်စ်
nb: USA
ne: सं. रा. अमेरिका
pa: ਅਮਰੀਕਾ
pl: Stany Zjednoczone
pt: EUA
pt_pt: EUA
ro: S.U.A.
ru: США
si: එක්සත් ජනපදය
sk: USA
sq: Shtetet e Bashkuara
sr: САД
sr_latn: SAD
sv: USA
th: สหรัฐอเมริกา
tr: ABD
uk: США
uz: AQSH
vi: Hoa Kỳ
zh_hk: 美國
zu: I-US

# fortnightlyMenuBusiness
source: Business
af: Besigheid
am: ንግድ
ar_eg: أعمال
as: ব্যৱসায়
az: Biznes
be: Бізнес
bn: ব্যবসা
bs: Biznis
ca: Negocis
da: Erhverv
es_ar: Negocios
et: Äri
eu: Negozioak
fa: تجاری
fil: Negosyo
fr_ca: Affaires
gl: Negocios
gu: વ્યવસાય
he: עסקים
hi: कारोबार
hu: Üzlet
hy: Բիզնես
id: Bisnis
it: Economia
ja: ビジネス
ka: ბიზნესი
km: អាជីវកម្ម
kn: ವ್ಯಾಪಾರ
ko: 비즈니스
ky: Ишкердик
lo: ທຸລະກິດ
lt: Verslas
lv: Uzņēmējdarbība
mk: Бизнис
ml: ബിസിനസ്
mn: Бизнес
mr: व्यवसाय
ms: Perniagaan
my: လုပ်ငန်း
nb: Næringsliv
ne: व्यवसाय
pa: ਕਾਰੋਬਾਰ
pl: Biznes
pt: Negócios
pt_pt: Negócios
ro: Afaceri
ru: Бизнес
si: ව්‍යාපාරය
sk: Biznis
sq: Biznes
sr: Бизнис
sr_latn: Biznis
sv: Ekonomi
te: బిజినెస్‌
th: ธุรกิจ
tr: İş Dünyası
uk: Бізнес
ur: کاروبار
uz: Biznes
vi: Kinh doanh
zh_hk: 商業
zu: Ibhizinisi

# fortnightlyMenuScience
source: Science
af: Wetenskap
am: ሳይንስ
ar_eg: علوم
as: বিজ্ঞান
az: Elm
be: Навука
bn: বিজ্ঞান
bs: Nauka
ca: Ciència
da: Videnskab
es_ar: Ciencia
et: Teadus
eu: Zientzia
fa: علمی
fil: Agham
fr_ca: Sciences
gl: Ciencia
gu: વિજ્ઞાન
he: מדע
hi: विज्ञान
hu: Tudomány
hy: Գիտություն
id: Sains
it: Scienza
ja: 科学
ka: მეცნიერება
km: វិទ្យាសាស្ត្រ
kn: ವಿಜ್ಞಾನ
ko: 과학
ky: Илим
lo: ວິທະຍາສາດ
lt: Mokslas
lv: Zinātne
mk: Наука
ml: ശാസ്‌ത്രം
mn: Шинжлэх ухаан
mr: विज्ञान
ms: Sains
my: သိပွံ
nb: Vitenskap
ne: विज्ञान
pa: ਵਿਗਿਆਨ
pl: Nauka
pt: Ciência
pt_pt: Ciência
ro: Știință
ru: Наука
si: විද්‍යාව
sk: Veda
sq: Shkencë
sr: Наука
sr_latn: Nauka
sv: Vetenskap
te: విజ్ఞాన శాస్త్రం
th: วิทยาศาสตร์
tr: Bilim
uk: Наука
ur: سائنس
uz: Ilm-fan
vi: Khoa học
zh_hk: 科學
zu: Isayensi

# fortnightlyMenuSports
source: Sports
af: Sport
am: ስፖርት
ar_eg: رياضة
as: খেল
az: İdman
be: Спорт
bn: খেলা
bs: Sport
ca: Esports
da: Sport
es_ar: Deportes
et: Sport
eu: Kirolak
fa: ورزشی
gl: Deportes
gu: રમતગમત
he: ספורט
hi: खेल
hu: Sport
hy: Սպորտ
id: Olahraga
it: Sport
ja: スポーツ
ka: სპორტი
km: កីឡា
kn: ಕ್ರೀಡೆ
ko: 스포츠
ky: Спорт
lo: ກິລາ
lt: Sportas
mk: Спорт
ml: സ്പോർട്‌സ്
mn: Спорт
mr: क्रीडा
ms: Sukan
my: အားကစား
nb: Sport
ne: खेलकुद
pa: ਖੇਡਾਂ
pl: Sport
pt: Esportes
pt_pt: Desporto
ro: Sport
ru: Спорт
si: ක්‍රීඩා
sk: Šport
sq: Sport
sr: Спорт
sr_latn: Sport
sv: Sport
te: క్రీడలు
th: กีฬา
tr: Spor
uk: Спорт
ur: کھیل
uz: Sport
vi: Thể thao
zh_hk: 體育
zu: Ezemidlalo
