Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# colorsDeepOrange
source: DEEP ORANGE
af: DIEPORANJE
am: ደማቅ ብርቱካናማ
ar_eg: برتقالي داكن
as: গাঢ় কমলা
az: TÜND NARINCI
be: ЦЁМНА-АРАНЖАВЫ
bn: গাঢ় কমলা
bs: JAKA NARANDŽASTA
ca: TARONJA INTENS
da: DYB ORANGE
es_ar: NARANJA OSCURO
et: SÜGAV ORANŽ
eu: LARANJA BIZIA
fa: نارنجی پررنگ
fr_ca: ORANGE FONCÉ
gl: LARANXA INTENSO
gu: ઘાટો નારંગી
he: כתום כהה
hi: गहरा नारंगी
hu: MÉLYNARANCSSÁRGA
hy: ՄՈՒԳ ՆԱՐՆՋԱԳՈՒՅՆ
id: ORANYE TUA
it: ARANCIONE SCURO
ja: ディープ オレンジ
ka: მუქი ნარინჯისფერი
km: ទឹកក្រូច​ចាស់
kn: ಕಡು ಕಿತ್ತಳೆ ಬಣ್ಣ
ko: 짙은 주황색
ky: КОЧКУЛ КЫЗГЫЛТ САРЫ
lo: ສີສົ້ມແກ່
lt: SODRI ORANŽINĖ
lv: TUMŠI ORANŽA
mk: ТЕМНОПОРТОКАЛОВА
ml: ഇരുണ്ട ഓറഞ്ച് നിറം
mn: ГҮН УЛБАР ШАР
mr: गडद नारिंगी
ms: JINGGA TUA
my: လိမ္မော်ရင့်
nb: MØRK ORANSJE
ne: गाढा सुन्तला रङ्ग
pa: ਗੂੜ੍ਹਾ ਸੰਤਰੀ
pl: GŁĘBOKI POMARAŃCZOWY
pt: LARANJA INTENSO
pt_pt: LARANJA ESCURO
ro: PORTOCALIU INTENS
ru: НАСЫЩЕННЫЙ ОРАНЖЕВЫЙ
si: ගැඹුරු තැඹිලි
sk: TMAVOORANŽOVÁ
sq: PORTOKALLI E THELLË
sr: ТАМНОНАРАНЏАСТА
sr_latn: TAMNONARANDŽASTA
sv: MÖRKORANGE
te: ముదురు నారింజ రంగు
th: ส้มแก่
tr: KOYU TURUNCU
uk: НАСИЧЕНИЙ ОРАНЖЕВИЙ
ur: گہرا نارنجی
uz: TOʻQ APELSINRANG
vi: MÀU CAM ĐẬM
zh_hk: 深橙色
zu: OKUWOLINTSHI OKUJULILE

# colorsOrange
source: ORANGE
af: ORANJE
am: ብርቱካናማ
ar_eg: برتقالي
as: কমলা
az: NARINCI
be: АРАНЖАВЫ
bn: কমলা
bs: NARANDŽASTA
ca: TARONJA
es_ar: NARANJA
et: ORANŽ
eu: LARANJA
fa: نارنجی
gl: LARANXA
gu: નારંગી
he: כתום
hi: नारंगी
hu: NARANCSSÁRGA
hy: ՆԱՐՆՋԱԳՈՒՅՆ
id: ORANYE
it: ARANCIONE
ja: オレンジ
ka: ნარინჯისფერი
km: ទឹកក្រូច
kn: ಕಿತ್ತಳೆ ಬಣ್ಣ
ko: 주황색
ky: КЫЗГЫЛТ САРЫ
lo: ສີສົ້ມ
lt: ORANŽINĖ
lv: ORANŽA
mk: ПОРТОКАЛОВА
ml: ഓറഞ്ച്
mn: УЛБАР ШАР
mr: नारिंगी
ms: JINGGA
my: လိမ္မော်
nb: ORANSJE
ne: सुन्तले रङ्ग
pa: ਸੰਤਰੀ
pl: POMARAŃCZOWY
pt: LARANJA
pt_pt: LARANJA
ro: PORTOCALIU
ru: ОРАНЖЕВЫЙ
si: තැඹිලි
sk: ORANŽOVÁ
sq: PORTOKALLI
sr: НАРАНЏАСТА
sr_latn: NARANDŽASTA
te: నారింజ
th: ส้ม
tr: TURUNCU
uk: ОРАНЖЕВИЙ
ur: نارنجی
uz: TOʻQ SARIQ
vi: MÀU CAM
zh_hk: 橙色
zu: IWOLINTSHI

# colorsAmber
source: AMBER
af: GEELBRUIN
am: አምበር
ar_eg: كهرماني
as: এম্বাৰ
az: KƏHRƏBA
be: ЯНТАРНЫ
bn: হলদে বাদামি
bs: TAMNOŽUTA
ca: AMBRE
da: ORANGEGUL
es_ar: ÁMBAR
et: MEREVAIGUKOLLANE
eu: HORIXKA
fa: کهربایی
fr_ca: AMBRE
gl: ÁMBAR
gu: અંબર
he: חום-צהבהב
hi: ऐंबर
hu: BOROSTYÁNSÁRGA
hy: ՍԱԹ
it: AMBRA
ja: アンバー
ka: ქარვისფერი
km: លឿងទុំ
kn: ಆಂಬರ್
ko: 황색
ky: ЯНТАРДАЙ
lo: ສີເຫຼືອງອຳພັນ
lt: GINTARO
lv: DZINTARKRĀSA
mk: КИЛИБАРНА
ml: മഞ്ഞ കലർന്ന ഓറഞ്ച് വർണ്ണം
mn: УЛБАР ШАР
mr: मातकट रंग
ms: KUNING JINGGA
my: ပယင်းရောင်
nb: RAVGUL
ne: एम्बर
pa: ਪੀਲਾ-ਸੰਤਰੀ
pl: BURSZTYNOWY
pt: ÂMBAR
pt_pt: ÂMBAR
ro: CHIHLIMBAR
ru: ЯНТАРНЫЙ
si: ඇම්බර්
sk: ŽLTOHNEDÁ
sq: E VERDHË PORTOKALLI
sr: ЖУТОБРАОН
sr_latn: ŽUTOBRAON
sv: BÄRNSTEN
te: కాషాయరంగు
th: เหลืองอำพัน
tr: KEHRİBAR RENNGİ
uk: БУРШТИНОВИЙ
ur: امبر
uz: QAHRABO RANG
vi: MÀU HỔ PHÁCH
zh_hk: 琥珀色
zu: I-AMBER

# colorsYellow
source: YELLOW
af: GEEL
am: ቢጫ
ar_eg: أصفر
as: হালধীয়া
az: SARI
be: ЖОЎТЫ
bn: হলুদ
bs: ŽUTA
ca: GROC
da: GUL
es_ar: AMARILLO
et: KOLLANE
eu: HORIA
fa: زرد
fil: DILAW
fr_ca: JAUNE
gl: AMARELO
gu: પીળો
he: צהוב
hi: पीला
hu: SÁRGA
hy: ԴԵՂԻՆ
id: KUNING
it: GIALLO
ja: イエロー
ka: ყვითელი
km: លឿង
kn: ಹಳದಿ ಬಣ್ಣ
ko: 노란색
ky: САРЫ
lo: ສີເຫຼືອງ
lt: GELTONA
lv: DZELTENA
mk: ЖОЛТА
ml: മഞ്ഞ
mn: ШАР
mr: पिवळा
ms: KUNING
my: အဝါ
nb: GUL
ne: पहेँलो
pa: ਪੀਲਾ
pl: ŻÓŁTY
pt: AMARELO
pt_pt: AMARELO
ro: GALBEN
ru: ЖЕЛТЫЙ
si: කහ
sk: ŽLTÁ
sq: E VERDHË
sr: ЖУТА
sr_latn: ŽUTA
sv: GUL
te: పసుపు
th: เหลือง
tr: SARI
uk: ЖОВТИЙ
ur: زرد
uz: SARIQ
vi: MÀU VÀNG
zh_hk: 黃色
zu: OKULIPHUZI

# colorsLime
source: LIME
af: LEMMETJIEGROEN
am: ሎሚ ቀለም
ar_eg: ليموني
as: নেমুৰঙী
az: AÇIQ YAŞIL
be: ЛАЙМАВЫ
bn: লেবু রঙ
bs: ŽUTOZELENA
ca: VERD LLIMA
da: LIMEGRØN
es_ar: VERDE LIMA
et: LAIMIROHELINE
eu: LIMA-KOLOREA
fa: سبز لیمویی
fr_ca: VERT LIME
gl: VERDE LIMA
gu: લિંબુડિયો
he: ירוק ליים
hi: हल्का पीला
hu: CITROMZÖLD
hy: ԼԱՅՄ
id: HIJAU LIMAU
it: VERDE LIME
ja: ライム
ka: ლაიმისფერი
km: បៃតងខ្ចី
kn: ನಿಂಬೆ ಬಣ್ಣ
ko: 라임색
ky: АЧЫК ЖАШЫЛ
lo: ສີເຫຼືອງໝາກນາວ
lt: ŽALIŲJŲ CITRINŲ
lv: LAIMA ZAĻA
mk: ЛИМЕТА
ml: മഞ്ഞകലർന്ന പച്ച
mn: НИМБЭГНИЙ НОГООН
mr: लिंबू रंग
ms: HIJAU LIMAU NIPIS
my: အစိမ်းဖျော့
ne: कागती रङ्ग
pa: ਨਿੰਬੂ ਰੰਗਾ
pl: LIMONKOWY
pt: VERDE-LIMÃO
pt_pt: LIMA
ro: VERDE DESCHIS
ru: ЛАЙМОВЫЙ
si: දෙහි
sk: ŽLTOZELENÁ
sq: LIMONI
sr: ЗЕЛЕНОЖУТА
sr_latn: ZELENOŽUTA
te: నిమ్మ రంగు
th: เหลืองมะนาว
tr: KÜF YEŞİLİ
uk: ЛИМОННО-ЗЕЛЕНИЙ
ur: لائم
uz: OCH YASHIL
vi: MÀU VÀNG CHANH
zh_hk: 青檸色
zu: I-LIME

# colorsLightGreen
source: LIGHT GREEN
af: LIGGROEN
am: ፈካ ያለ አረንጓዴ
ar_eg: أخضر فاتح
as: পাতল সেউজীয়া
az: AÇIQ YAŞIL
be: СВЕТЛА-ЗЯЛЁНЫ
bn: হালকা সবুজ
bs: SVIJETLOZELENA
ca: VERD CLAR
da: LYSEGRØN
es_ar: VERDE CLARO
et: HELEROHELINE
eu: BERDE ARGIA
fa: سبز روشن
fr_ca: VERT CLAIR
gl: VERDE CLARO
gu: આછો લીલો
he: ירוק בהיר
hi: हल्का हरा
hu: VILÁGOSZÖLD
hy: ԲԱՑ ԿԱՆԱՉ
id: HIJAU MUDA
it: VERDE CHIARO
ja: ライトグリーン
ka: ღია მწვანე
km: បៃតង​ស្រាល
kn: ತಿಳಿ ಹಸಿರು ಬಣ್ಣ
ko: 연한 초록색
ky: МАЛА ЖАШЫЛ
lo: ສີຂຽວອ່ອນ
lt: ŠVIESIAI ŽALIA
lv: GAIŠI ZAĻA
mk: СВЕТЛОЗЕЛЕНА
ml: ഇളം പച്ച
mn: ЦАЙВАР НОГООН
mr: फिकट हिरवा
ms: HIJAU CERAH
my: အစိမ်းနု
nb: LYSEGRØNN
ne: हल्का हरियो
pa: ਹਲਕਾ ਹਰਾ
pl: JASNOZIELONY
pt: VERDE-CLARO
pt_pt: VERDE CLARO
ro: VERDE DESCHIS
ru: СВЕТЛО-ЗЕЛЕНЫЙ
si: ලා කොළ
sk: SVETLOZELENÁ
sq: E GJELBËR E ÇELUR
sr: СВЕТЛОЗЕЛЕНА
sr_latn: SVETLOZELENA
sv: LJUSGRÖN
te: లేత ఆకుపచ్చ రంగు
th: เขียวอ่อน
tr: AÇIK YEŞİL
uk: СВІТЛО-ЗЕЛЕНИЙ
ur: ہلکا سبز
uz: OCH YASHIL
vi: MÀU XANH LỤC NHẠT
zh_hk: 淺綠色
zu: OKULUHLAZA OKUKHANYAYO

# colorsGreen
source: GREEN
af: GROEN
am: አረንጓዴ
ar_eg: أخضر
as: সেউজীয়া
az: YAŞIL
be: ЗЯЛЁНЫ
bn: সবুজ
bs: ZELENA
ca: VERD
da: GRØN
es_ar: VERDE
et: ROHELINE
eu: BERDEA
fa: سبز
fil: BERDE
fr_ca: VERT
gl: VERDE
gu: લીલો
he: ירוק
hi: हरा
hu: ZÖLD
hy: ԿԱՆԱՉ
id: HIJAU
it: VERDE
ja: グリーン
ka: მწვანე
km: បៃតង
kn: ಹಸಿರು ಬಣ್ಣ
ko: 초록색
ky: ЖАШЫЛ
lo: ສີຂຽວ
lt: ŽALIA
lv: ZAĻA
mk: ЗЕЛЕНА
ml: പച്ച
mn: НОГООН
mr: हिरवा
ms: HIJAU
my: အစိမ်း
nb: GRØNN
ne: हरियो
pa: ਹਰਾ
pl: ZIELONY
pt: VERDE
pt_pt: VERDE
ro: VERDE
ru: ЗЕЛЕНЫЙ
si: කොළ
sk: ZELENÁ
sq: E GJELBËR
sr: ЗЕЛЕНО
sr_latn: ZELENO
sv: GRÖN
te: ఆకుపచ్చ
th: เขียว
tr: YEŞİL
uk: ЗЕЛЕНИЙ
ur: سبز
uz: YASHIL
vi: MÀU XANH LỤC
zh_hk: 綠色
zu: OKULUHLAZA OKOTSHANI

# homeHeaderGallery
source: Gallery
af: Galery
am: የሥነ ጥበብ ማዕከል
ar_eg: معرض الصور
az: Qalereya
be: Галерэя
bn: গ্যালারি
bs: Galerija
ca: Galeria
da: Galleri
es_ar: Galería
et: Galerii
eu: Galeria
fa: گالری
fr_ca: Galerie
gl: Galería
gu: ગૅલેરી
he: גלריה
hi: गैलरी
hu: Galéria
hy: Պատկերասրահ
id: Galeri
it: Galleria
ja: ギャラリー
ka: გალერეა
km: សាល​រូបភាព
kn: ಗ್ಯಾಲರಿ
ko: 갤러리
ky: Галерея
lo: ຄັງຮູບພາບ
lt: Galerija
lv: Galerija
mk: Галерија
ml: ഗാലറി
mn: Галерей
mr: गॅलरी
ms: Galeri
my: ပြခန်း
nb: Galleri
ne: ग्यालेरी
pa: ਗੈਲਰੀ
pl: Galeria
pt: Galeria
pt_pt: Galeria
ro: Galerie
ru: Галерея
si: ගැලරිය
sk: Galéria
sq: Galeria
sr: Галерија
sr_latn: Galerija
sv: Galleri
te: గ్యాలరీ
th: แกลเลอรี
tr: Galeri
uk: Галерея
ur: گیلری
uz: Gallereya
vi: Thư viện
zh_hk: 相片集
zu: Igalari

# homeHeaderCategories
source: Categories
af: Kategorieë
am: ምድቦች
ar_eg: الفئات
as: শিতানসমূহ
az: Kateqoriyalar
be: Катэгорыі
bn: বিভাগ
bs: Kategorije
da: Kategorier
es_ar: Categorías
et: Kategooriad
eu: Kategoriak
fa: دسته‌ها
fil: Mga Kategorya
fr_ca: Catégories
gl: Categorías
gu: કૅટેગરી
he: קטגוריות
hi: श्रेणियां
hu: Kategóriák
hy: Կատեգորիաներ
id: Kategori
it: Categorie
ja: カテゴリ
ka: კატეგორიები
km: ប្រភេទ
kn: ವರ್ಗಗಳು
ko: 카테고리
ky: Категориялар
lo: ໝວດໝູ່
lt: Kategorijos
lv: Kategorijas
mk: Категории
ml: വിഭാഗങ്ങൾ
mn: Ангилал
mr: वर्गवाऱ्या
ms: Kategori
my: အမျိုးအစားများ
nb: Kategorier
ne: कोटीहरू
pa: ਸ਼੍ਰੇਣੀਆਂ
pl: Kategorie
pt: Categorias
pt_pt: Categorias
ro: Categorii
ru: Категории
si: ප්‍රවර්ග
sk: Kategórie
sq: Kategoritë
sr: Категорије
sr_latn: Kategorije
sv: Kategorier
te: కేటగిరీలు
th: หมวดหมู่
tr: Kategoriler
uk: Категорії
ur: زمرے
uz: Turkumlar
vi: Danh mục
zh_hk: 類別
zu: Izigaba

# shrineDescription
source: A fashionable retail app
af: 'n Modieuse kleinhandelprogram
am: የዘነጠ የችርቻሮ መተግበሪያ
ar_eg: تطبيق عصري للبيع بالتجزئة
as: ফেশ্বনৰ লগত জড়িত এটা খুচৰা এপ্‌
az: Dəbli pərakəndə satış tətbiqi
be: Праграма для куплі модных тавараў
bn: ফ্যাশ্যানেবল রিটেল অ্যাপ
bs: Moderna aplikacija za maloprodaju
ca: Una aplicació de botigues de moda
da: En modebevidst forhandlerapp
es_ar: Una app de venta minorista a la moda
et: Moodne jaemüügirakendus
eu: Moda-modako salmenta-aplikazioa
fa: یک برنامه خرده‌فروشی مدرن
fil: Isang fashionable na retail app
fr_ca: Une application tendance de vente au détail
gl: Aplicación de venda de moda
gu: છૂટક વેચાણ માટેની ફેશનેબલ ઍપ
he: אפליקציה קמעונאית לאופנה
hi: एक ऐसा ऐप्लिकेशन जहां फ़ैशन से जुड़ी सारी चीज़ें खुदरा में मिलती हैं
hu: Divatos kiskereskedelmi alkalmazás
hy: Ոճային իրեր գնելու հավելված
id: Aplikasi retail yang modern
it: Un'app di vendita al dettaglio alla moda
ja: お洒落なお店のアプリ
ka: მოდური აპი საცალო მოვაჭრეებისთვის
km: កម្មវិធី​លក់រាយ​ទាន់សម័យ
kn: ಫ್ಯಾಷನ್‌ಗೆ ಸಂಬಂಧಿಸಿದ ರಿಟೇಲ್ ಆ್ಯಪ್
ko: 패셔너블한 리테일 앱
ky: Саркеч кийимдерди сатуу колдонмосу
lo: ແອັບຂາຍຍ່ອຍດ້ານແຟຊັນ
lt: Madingų mažmeninių prekių programa
lv: Moderna mazumtirdzniecības lietotne
mk: Модерна апликација за малопродажба
ml: ആകർഷകമായ ചില്ലറവ്യാപാര ആപ്പ്
mn: Хувцас загварын жижиглэн борлуулах апп
mr: फॅशनेबल रिटेल अ‍ॅप
ms: Apl runcit yang mengikut perkembangan
my: ခေတ်မီသော အရောင်းဆိုင်အက်ပ်
nb: En moteriktig handleapp
ne: फेसनसँग सम्बन्धित कुराहरू खुद्रा बिक्री गरिने एप
pa: ਫੈਸ਼ਨੇਬਲ ਵਿਕਰੇਤਾ ਐਪ
pl: Aplikacja dla sklepów z modą
pt: Um app de varejo da moda
pt_pt: Uma aplicação de retalho com estilo
ro: O aplicație de vânzare cu amănuntul la modă
ru: Приложение для покупки стильных вещей
si: විලාසිතාමය සිල්ලර යෙදුමකි
sk: Módna predajná aplikácia
sq: Një aplikacion blerjesh në modë
sr: Модерна апликација за малопродају
sr_latn: Moderna aplikacija za maloprodaju
sv: En modern återförsäljningsapp
te: ఫ్యాషన్‌తో కూడిన రీటైల్ యాప్
th: แอปค้าปลีกด้านแฟชั่น
tr: Şık bir perakende uygulaması
uk: Додаток для покупки модних товарів
ur: فَيشَن پرَستی سے متعلق ریٹیل ایپ
uz: Zamonaviy buyumlarni sotib olish uchun ilova
vi: Ứng dụng bán lẻ thời thượng
zh_hk: 時尚零售應用程式
zu: Uhlelo lokusebenza lokuthenga lwemfashini

# craneDescription
source: A personalized travel app
af: 'n Gepersonaliseerde reisprogram
am: ግላዊነት የተላበሰ የጉዞ መተግበሪያ
ar_eg: تطبيق سفر مُخصَّص
as: এটা ব্যক্তিগতকৃত ভ্ৰমণৰ এপ্‌
az: Fərdiləşdirilmiş səyahət tətbiqi
be: Персаналізаваная праграма для падарожжаў
bn: নিজের মতো সাজিয়ে নেওয়া ট্রাভেল অ্যাপ
bs: Personalizirana aplikacija za putovanja
ca: Una aplicació de viatges personalitzada
da: En personligt tilpasset rejseapp
es_ar: Una app personalizada para viajes
et: Isikupärastatud reisirakendus
eu: Bidaia-aplikazio pertsonalizatua
fa: برنامه سفر شخصی‌سازی‌شده
fil: Isang naka-personalize na travel app
fr_ca: Une application de voyage personnalisée
gl: Aplicación de viaxes personalizada
gu: તમને મનગમતી બનાવાયેલી પ્રવાસ માટેની ઍપ
he: אפליקציית נסיעות מותאמת אישית
hi: आपके मनमुताबिक तैयार किया गया यात्रा ऐप्लिकेशन
hu: Személyre szabott utazási alkalmazás
hy: Անհատականացված հավելված ճամփորդությունների համար
id: Aplikasi perjalanan yang dipersonalisasi
it: Un'app personalizzata per i viaggi
ja: カスタマイズ トラベル アプリ
ka: პერსონალიზებული სამოგზაურო აპი
km: កម្មវិធីធ្វើដំណើរ​ដែលកំណត់ឱ្យស្រប​នឹងបុគ្គល
kn: ವೈಯಕ್ತೀಕರಿಸಿರುವ ಪ್ರಯಾಣದ ಆ್ಯಪ್
ko: 맞춤 여행 앱
ky: Жекелештирилген саякат колдонмосу
lo: ແອັບການທ່ອງທ່ຽວທີ່ປັບແຕ່ງສ່ວນຕົວ
lt: Suasmeninta kelionių programa
lv: Personalizēta ceļojumu lietotne
mk: Персонализирана апликација за патување
ml: വ്യക്തിപരമാക്കിയ യാത്രാ ആപ്പ്
mn: Хувийн болгосон аяллын апп
mr: पर्सनलाइझ केलेले प्रवास अ‍ॅप
ms: Apl perjalanan yang diperibadikan
my: ပုဂ္ဂိုလ်ရေးသီးသန့် ပြုလုပ်ပေးထားသည့် ခရီးသွားအက်ပ်
nb: En reiseapp med personlig preg
ne: यात्रासम्बन्धी वैयक्तीकृत एप
pa: ਇੱਕ ਵਿਅਕਤੀਗਤ ਯਾਤਰਾ ਐਪ
pl: Spersonalizowana aplikacja dla podróżujących
pt: Um app de viagens personalizado
pt_pt: Uma aplicação de viagens personalizada.
ro: O aplicație pentru călătorii personalizate
ru: Персонализированное приложение для путешествий
si: පෞද්ගලීකකරණය කළ සංචාරක යෙදුමක්
sk: Prispôsobená cestovná aplikácia
sq: Një aplikacion i personalizuar për udhëtimin
sr: Персонализована апликација за путовања
sr_latn: Personalizovana aplikacija za putovanja
sv: En anpassad reseapp
te: వ్యక్తిగతీకరించిన ట్రావెల్ యాప్
th: แอปการเดินทางที่ปรับเปลี่ยนในแบบของคุณ
tr: Kişiselleştirilmiş seyahat uygulaması
uk: Персоналізований додаток для подорожей
ur: ذاتی نوعیت کی بنائی گئی ایک سفری ایپ
uz: Sayohatlar uchun moslangan ilova
vi: Một ứng dụng du lịch cá nhân
zh_hk: 個人化旅遊應用程式
zu: Uhlelo lokusebenza lokuhamba olwenziwe ngezifiso

# homeCategoryReference
source: STYLES & OTHER
af: STYLE EN ANDER
am: ቅጦች እና ሌላ
ar_eg: الأنماط وغيرها من العروض التوضيحية
as: শৈলী আৰু অন্য
az: ÜSLUBLAR VƏ DİGƏR
be: СТЫЛІ І ІНШАЕ
bn: স্টাইল এবং অন্য
bs: STILOVI I DRUGO
ca: ESTILS I ALTRES
da: STIL OG ANDET
es_ar: ESTILOS Y MÁS
et: STIILID JA MUU
eu: ESTILOAK ETA BESTE
fa: سبک و موارد دیگر
fil: MGA ISTILO AT IBA PA
fr_ca: STYLES ET AUTRES
gl: ESTILOS E OUTRAS DEMOSTRACIÓNS
gu: શૈલી અને અન્ય
he: סגנונות ואחרים
hi: स्टाइल डेमाे और दूसरे डेमो
hu: STÍLUSOK ÉS EGYÉB
hy: ՈՃԵՐ ԵՎ ԱՅԼՆ
id: GAYA & LAINNYA
it: STILI E ALTRE
ja: スタイルなど
ka: სტილები და სხვა
km: រចនាប័ទ្ម និងផ្សេងៗ
kn: ಶೈಲಿಗಳು ಮತ್ತು ಇತರೆ
ko: 스타일 및 기타
ky: СТИЛДЕР ЖАНА БАШКАЛАР
lo: ຮູບແບບ ແລະ ອື່ນໆ
lt: STILIAI IR KITA
lv: STILU UN CITAS DEMONSTRĀCIJAS
mk: СТИЛОВИ И ДРУГО
ml: സ്‌റ്റൈലുകളും മറ്റുള്ളവയും
mn: ЗАГВАР БОЛОН БУСАД
mr: शैली आणि इतर
ms: GAYA & LAIN-LAIN
my: ပုံစံများနှင့် အခြား
nb: STILER OG ANNET
ne: शैली तथा अन्य
pa: ਸਟਾਈਲ ਅਤੇ ਹੋਰ
pl: STYLE I INNE
pt: ESTILOS E OUTRAS
pt_pt: ESTILOS E OUTROS
ro: STILURI ȘI ALTELE
ru: СТИЛИ И ДРУГОЕ
si: විලාස සහ වෙනත්
sk: ŠTÝLY A ĎALŠIE
sq: STILET DHE TË TJERA
sr: СТИЛОВИ И ДРУГО
sr_latn: STILOVI I DRUGO
sv: FORMAT OCH ANNAT
te: శైలులు, ఇతరవి
th: รูปแบบและอื่นๆ
tr: STİLLER VE DİĞERLERİ
uk: СТИЛІ ТА ІНШЕ
ur: طرزیں اور دیگر
uz: USLUBLAR VA BOSHQA
vi: BẢN MINH HỌA KIỂU VÀ CÁC BẢN MINH HỌA KHÁC
zh_hk: 樣式和其他
zu: IZITAYELA NOKUNYE

# demoInvalidURL
source: Couldn't display URL:
af: Kon nie URL wys nie:
am: ዩአርኤልን ማሳየት አልተቻለም፦
ar_eg: تعذّر عرض عنوان URL:
as: URL প্ৰদর্শন কৰিব পৰা নগ'ল:
az: URL'i göstərmək mümkün olmadı:
be: Не ўдалося адлюстраваць URL-адрас:
bn: URL ডিসপ্লে করতে পারছে না:
bs: Prikazivanje URL-a nije uspjelo:
ca: No s'ha pogut mostrar l'URL:
da: Kunne ikke vise webadressen:
es_ar: No se pudo mostrar la URL:
et: URL-i ei saanud kuvada:
eu: Ezin izan da bistaratu URLa:
fa: نشانی وب نشان داده نشد:
fil: Hindi maipakita ang URL:
fr_ca: Impossible d'afficher l'URL :
gl: Non se puido mostrar o URL:
gu: URL બતાવી શકાયું નથી:
he: לא ניתן להציג כתובת URL:
hi: यूआरएल दिखाया नहीं जा सका:
hu: Nem sikerült a következő URL megjelenítése:
hy: Չհաջողվեց ցուցադրել URL-ը՝
id: Tidak dapat menampilkan URL:
it: Impossibile mostrare l'URL:
ja: URL を表示できませんでした:
ka: URL-ის ჩვენება ვერ მოხერხდა:
km: មិនអាច​បង្ហាញ URL បានទេ៖
kn: URL ಅನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ:
ko: 다음 URL을 표시할 수 없습니다.
ky: URL'ди чагылдыруу мүмкүн эмес:
lo: ບໍ່ສາມາດສະແດງ URL ໄດ້:
lt: Nepavyko pateikti URL:
lv: Nevarēja attēlot URL:
mk: URL-адресата не може да се прикаже:
ml: URL പ്രദർശിപ്പിക്കാൻ ആയില്ല:
mn: URL-г үзүүлж чадсангүй:
mr: URL प्रदर्शित करू शकलो नाही:
ms: Tidak dapat memaparkan URL:
my: URL ကို ပြ၍မရပါ-
nb: Kunne ikke vise nettadressen:
ne: URL देखाउन सकिएन:
pa: URL ਦਿਖਾਇਆ ਨਹੀਂ ਜਾ ਸਕਿਆ:
pl: Nie udało się wyświetlić adresu URL:
pt: Não foi possível exibir o URL:
pt_pt: Não foi possível apresentar o URL:
ro: Nu s-a putut afișa adresa URL:
ru: Не удалось открыть URL:
si: URL සංදර්ශනය කළ නොහැකි විය:
sk: Webovú adresu sa nepodarilo zobraziť:
sq: URL-ja nuk mund të shfaqej:
sr: Приказивање URL-а није успело:
sr_latn: Prikazivanje URL-a nije uspelo:
sv: Det gick inte att visa webbadressen:
te: URLని ప్రదర్శించడం సాధ్యపడలేదు:
th: แสดง URL ไม่ได้:
tr: URL görüntülenemedi:
uk: Не вдалося показати URL-адресу:
ur: URL نہیں دکھایا جا سکا:
uz: URL ochilmadi:
vi: Không thể hiển thị URL:
zh_hk: 無法顯示網址：
zu: Ayikwazanga ukubonisa i-URL:

# demoOptionsTooltip
source: Options
af: Opsies
am: አማራጮች
ar_eg: الخيارات
as: বিকল্পসমূহ
az: Seçimlər
be: Параметры
bn: বিকল্প
bs: Opcije
ca: Opcions
da: Valgmuligheder
es_ar: Opciones
et: Valikud
eu: Aukerak
fa: گزینه‌ها
fil: Mga Opsyon
gl: Opcións
gu: વિકલ્પો
he: אפשרויות
hi: विकल्प
hu: Lehetőségek
hy: Ընտրանքներ
id: Opsi
it: Opzioni
ja: オプション
ka: ვარიანტები
km: ជម្រើស
kn: ಆಯ್ಕೆಗಳು
ko: 옵션
ky: Параметрлер
lo: ຕົວເລືອກ
lt: Parinktys
lv: Opcijas
mk: Опции
ml: ഓപ്‌ഷനുകൾ
mn: Сонголт
mr: पर्याय
ms: Pilihan
my: ရွေးစရာများ
nb: Alternativer
ne: विकल्पहरू
pa: ਵਿਕਲਪ
pl: Opcje
pt: Opções
pt_pt: Opções
ro: Opțiuni
ru: Параметры
si: විකල්ප
sk: Možnosti
sq: Opsionet
sr: Опције
sr_latn: Opcije
sv: Alternativ
te: ఎంపికలు
th: ตัวเลือก
tr: Seçenekler
uk: Параметри
ur: اختیارات
uz: Parametrlar
vi: Tùy chọn
zh_hk: 選項
zu: Izinketho

# demoInfoTooltip
source: Info
af: Inligting
am: መረጃ
ar_eg: معلومات
as: তথ্য
az: Məlumat
be: Інфармацыя
bn: তথ্য
bs: Informacije
ca: Informació
da: Oplysninger
es_ar: Información
et: Teave
eu: Informazioa
fa: اطلاعات
fil: Impormasyon
gl: Información
gu: માહિતી
he: מידע
hi: जानकारी
hu: Információ
hy: Տեղեկություններ
it: Informazioni
ja: 情報
ka: ინფორმაცია
km: ព័ត៌មាន
kn: ಮಾಹಿತಿ
ko: 정보
ky: Маалымат
lo: ຂໍ້ມູນ
lt: Informacija
lv: Informācija
mk: Информации
ml: വിവരം
mn: Мэдээлэл
mr: माहिती
ms: Maklumat
my: အချက်အလက်
nb: Informasjon
ne: जानकारी
pa: ਜਾਣਕਾਰੀ
pl: Informacje
pt: Informações
pt_pt: Informações
ro: Informații
ru: Информация
si: තතු
sk: Informácie
sq: Informacione
sr: Информације
sr_latn: Informacije
sv: Information
te: సమాచారం
th: ข้อมูล
tr: Bilgi
uk: Інформація
ur: معلومات
uz: Axborot
vi: Thông tin
zh_hk: 資料
zu: Ulwazi

# demoCodeTooltip
source: Demo Code
af: Demonstrasiekode
am: የማሳያ ኮድ
ar_eg: رمز تجريبي
as: ডেম’ ক’ড
az: Demo Kodu
be: Дэма-код
bn: ডেমো কোড
bs: Kôd za demo verziju
ca: Codi de demostració
da: Demokode
es_ar: Código de demostración
et: Demokood
eu: Demo-kodea
fa: کد نمونه
fr_ca: Code de démonstration
gl: Código de demostración
gu: ડેમો કોડ
he: קוד ההדגמה
hi: डेमो कोड
hu: Demókód
hy: Դեմո կոդ
id: Kode Demo
it: Codice demo
ja: デモコード
ka: დემოს კოდი
km: កូដ​សាកល្បង
kn: ಡೆಮೋ ಕೋಡ್
ko: 데모 코드
ky: Демо код
lo: ລະຫັດສາທິດ
lt: Demonstracinės versijos kodas
lv: Demonstrācijas versijas kods
mk: Код за демонстрација
ml: ഡെമോ കോഡ്
mn: Демо код
mr: डेमो कोड
ms: Kod Tunjuk Cara
my: သရုပ်ပြကုဒ်
nb: Demokode
ne: डेमो कोड
pa: ਡੈਮੋ ਕੋਡ
pl: Kod wersji demonstracyjnej
pt: Código de demonstração
pt_pt: Código de demonstração
ro: Cod demo
ru: Код демоверсии
si: ආදර්ශ කේතය
sk: Ukážkový kód
sq: Kodi i demonstrimit
sr: Демо кôд
sr_latn: Demo kôd
sv: Demokod
te: డెమో కోడ్
th: รหัสการสาธิต
tr: Demo Kodu
uk: Демокод
ur: ڈیمو کوڈ
uz: Demo versiya kodi
vi: Mã minh họa
zh_hk: 示範代碼
zu: Ikhodi ye-Demo

# demoDocumentationTooltip
source: API Documentation
af: API-dokumentasie
am: የኤፒአይ ስነዳ
ar_eg: وثائق واجهة برمجة التطبيقات
as: API নথি-পত্ৰ
az: API Sənədi
be: Дакументацыя API
bn: এপিআই ডকুমেন্টেশান
bs: Dokumentacija za API
ca: Documentació de l'API
da: API-dokumentation
es_ar: Documentación de la API
et: API dokumentatsioon
eu: APIaren dokumentazioa
fa: اسناد میانای برنامه‌سازی کاربردی
fil: Dokumentasyon ng API
fr_ca: Documentation relative aux API
gl: Documentación da API
gu: API દસ્તાવેજો
he: תיעוד API
hi: एपीआई दस्तावेज़
hu: API-dokumentáció
hy: API-ների փաստաթղթեր
id: Dokumentasi API
it: Documentazione API
ja: API ドキュメント
ka: API დოკუმენტაცია
km: ឯកសារ API
kn: API ಡಾಕ್ಯುಮೆಂಟೇಶನ್
ko: API 도움말
ky: API документтери
lo: ເອກະສານ API
lt: API dokumentacija
lv: API dokumentācija
mk: Документација за API
ml: API ഡോക്യുമെന്റേഷൻ
mn: API-н баримтжуулалт
mr: API दस्तऐवजीकरण
ms: Dokumentasi API
my: API မှတ်တမ်း
nb: API-dokumentasjon
ne: API कागजात
pa: API ਦਸਤਾਵੇਜ਼ੀਕਰਨ
pl: Dokumentacja interfejsu API
pt: Documentação da API
pt_pt: Documentação da API
ro: Documentație API
ru: Документация по API
si: API ප්‍රලේඛනය
sk: Dokumentácia rozhraní API
sq: Dokumentacioni i API-t
sr: Документација о API-јима
sr_latn: Dokumentacija o API-jima
sv: API-dokumentation
te: API డాక్యుమెంటేషన్
th: เอกสารประกอบของ API
tr: API Dokümanları
uk: Документація API
ur: API دستاویزات
uz: API hujjatlari
vi: Tài liệu API
zh_hk: API 說明文件
zu: Amadokhumenti e-API

# demoFullscreenTooltip
source: Full Screen
af: Volskerm
am: የሙሉ ገፅ ዕይታ
ar_eg: ملء الشاشة
as: সম্পূৰ্ণ স্ক্ৰীন
az: Tam Ekran
be: Поўнаэкранны рэжым
bn: ফুল-স্ক্রিন
bs: Cijeli ekran
ca: Pantalla completa
da: Fuld skærm
es_ar: Pantalla completa
et: Täisekraan
eu: Pantaila osoa
fa: تمام صفحه
fil: Buong Screen
fr_ca: Plein écran
gl: Pantalla completa
gu: પૂર્ણ સ્ક્રીન
he: מסך מלא
hi: फ़ुल स्क्रीन
hu: Teljes képernyő
hy: Լիաէկրան ռեժիմ
id: Layar Penuh
it: Schermo intero
ja: 全画面表示
ka: სრულ ეკრანზე
km: អេក្រង់ពេញ
kn: ಪೂರ್ಣ ಪರದೆ
ko: 전체 화면
ky: Толук экран
lo: ເຕັມຈໍ
lt: Visas ekranas
lv: Pilnekrāna režīms
mk: Цел екран
ml: പൂർണ്ണസ്ക്രീൻ
mn: Бүтэн дэлгэц
mr: फुल-स्क्रीन
ms: Skrin Penuh
my: မျက်နှာပြင် အပြည့်
nb: Fullskjerm
ne: फुल स्क्रिन
pa: ਪੂਰੀ-ਸਕ੍ਰੀਨ
pl: Pełny ekran
pt: Tela cheia
pt_pt: Ecrã Inteiro
ro: Ecran complet
ru: Полноэкранный режим
si: පූර්ණ තිරය
sk: Celá obrazovka
sq: Ekran i plotë
sr: Цео екран
sr_latn: Ceo ekran
sv: Helskärm
te: ఫుల్-స్క్రీన్‌
th: เต็มหน้าจอ
tr: Tam Ekran
uk: На весь екран
ur: پوری اسکرین
uz: Butun ekran
vi: Toàn màn hình
zh_hk: 全屏幕
zu: Isikrini Esigcwele

# settingsTextScaling
source: Text scaling
af: Teksskalering
am: ጽሑፍን ማመጣጠን
ar_eg: تغيير حجم النص
as: পাঠ মিলোৱা কাৰ্য
az: Mətn miqyası
be: Маштаб тэксту
bn: টেক্সট স্কেলিং
bs: Promjena veličine teksta
ca: Ajust del text
da: Skalering af tekst
es_ar: Ajuste de texto
et: Teksti skaleerimine
eu: Testuaren tamaina
fa: مقیاس‌گذاری نوشتار
fil: Sukat ng text
fr_ca: Mise à l'échelle du texte
gl: Axuste de texto
gu: ટેક્સ્ટનું કદ
he: שינוי גודל טקסט
hi: टेक्स्ट स्केलिंग
hu: Szöveg nagyítása
hy: Տեքստի մասշտաբավորում
id: Penskalaan teks
it: Ridimensionamento testo
ja: テキストの拡大縮小
ka: ტექსტის სკალირება
km: ការប្ដូរទំហំអក្សរ
kn: ಪಠ್ಯ ಸ್ಕೇಲಿಂಗ್
ko: 텍스트 크기 조정
ky: Тексттин өлчөмүн тууралоо
lo: ​ການ​ຂະ​ຫຍາຍ​ຂໍ້​ຄວາມ
lt: Teksto mastelio keitimas
lv: Teksta mērogošana
mk: Скалирање текст
ml: ടെക്‌സ്റ്റ് സ്‌കെയിലിംഗ്
mn: Текст томруулах
mr: मजकूर मापन
ms: Penskalaan teks
my: စာလုံး အရွယ်တိုင်းတာခြင်း
nb: Tekstskalering
ne: पाठको मापन
pa: ਲਿਖਤ ਸਕੇਲਿੰਗ
pl: Skalowanie tekstu
pt: Tamanho do texto
pt_pt: Escala do texto
ro: Scalarea textului
ru: Масштабирование текста
si: පෙළ පරිමාණ කිරීම
sk: Mierka písma
sq: Shkallëzimi i tekstit
sr: Промена величине текста
sr_latn: Promena veličine teksta
sv: Textskalning
te: వచన ప్రమాణం
th: อัตราส่วนข้อความ
tr: Metin ölçekleme
uk: Масштаб тексту
ur: ٹیکسٹ اسکیلنگ
uz: Matn hajmi
vi: Chuyển tỉ lệ chữ
zh_hk: 文字比例
zu: Ukukalwa kombhalo
