Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCustomSlidersDescription
source: Sliders reflect a range of values along a bar, from which users may select a single value or range of values. The sliders can be themed and customized.
af: Glyers weerspieël 'n reeks waardes langs 'n balk, waarop gebruikers 'n enkelwaarde of 'n reeks waardes kan kies. Die glyers kan temas hê en gepasmaak word.
am: ተጠቃሚዎች አንድን ነጠላ እሴት ወይም የእሴቶች ክልል ሊመርጡ የሚችሉበት አሞሌ ላይ ያሉትን የእሴቶች ክልል ተንሸራታቾች ያንጸባርቃሉ። ተንሸራታቾቹ ገጽታ ሊኖራቸው እና ብጁ ሊደረጉ ይችላሉ።
ar_eg: تعكس شرائط التمرير نطاقًا من القيم بطول شريط، ويمكن للمستخدمين اختيار قيمة واحدة أو نطاق من القيم من ذلك الشريط. يمكن تخصيص شرائط التمرير وتغيير تصميماتها.
as: শ্লাইডাৰসমূহে এডাল বাৰত মানৰ এক পৰিসৰ দেখুৱায় য’ৰ পৰা ব্যৱহাৰকাৰীসকলে এটা একক মান অথবা মানৰ এক পৰিসৰ বাছনি কৰিব পাৰে। শ্লাইডাৰসমূহত থীম প্ৰয়োগ কৰিব পাৰি আৰু কাষ্টমাইজ কৰিব পাৰি।
az: Slayderlər panel boyunca dəyərlər silsiləsini göstərir, istifadəçilər bu dəyərlərdən birini və ya dəyər silsiləsini seçə bilər. Slayderlər tema ilə bəzədilə və fərdiləşdirilə bilər.
be: Паўзункі адлюстроўваюць на панэлі дыяпазон значэнняў, з якіх карыстальнікі могуць выбраць адно ці некалькі. Паўзункі можна рабіць тэматычнымі і наладжваць.
bn: বারের সাথে সাথে স্লাইডার মানেরও ব্যাপ্তি দেখায়, যেখান থেকে ব্যবহারকারী কোনও একটি মান বা ব্যাপ্তির মান বেছে নিতে পারেন। স্লাইডারকে থিম প্রয়োগ করে সাজানো এবং কাস্টমাইজ করা যায়।
bs: Klizači prikazuju raspon vrijednosti duž trake odakle korisnici mogu odabrati jednu vrijednost ili niz vrijednosti. Klizače je moguće urediti temom i prilagoditi.
ca: Els controls lliscants mostren un interval de valors al llarg d'una barra i els usuaris poden seleccionar-ne un o un interval. Pots personalitzar els controls lliscants i aplicar-hi temes.
da: Skydere viser en række værdier langs en bjælke, og brugerne kan vælge en enkelt eller flere værdier. Skyderne kan tilpasses og anvende et tema.
es_ar: Los controles deslizantes reflejan un rango de valores en una barra, en la que los usuarios pueden elegir un solo valor o un rango. Los controles se pueden personalizar según un tema.
et: Liugurid kajastavad väärtuste vahemikku ribal, millest kasutajad saavad valida ühe väärtuse või väärtuste vahemiku. Liuguritele saab teemasid määrata ja neid kohandada.
eu: Graduatzaileek balioen barruti bat islatzen dute barra batean, eta erabiltzaileek barruti horretako balio bakarra edo azpi-barruti bat hauta dezakete bertan. Graduatzaileei gaiak ezar dakizkieke eta pertsonalizatu egin daitezke.
fa: لغزنده‌ها گستره‌ای از مقادیر را در امتداد نواری نشان می‌دهند که کاربران می‌توانند یک مقدار یا گستره‌ای از مقادیر را از آن انتخاب کنند. لغزنده‌ها می‌توانند زمینه داشته باشند یا سفارشی شوند.
fil: Nagpapakita ang mga slider ng isang hanay ng mga value sa isang bar, kung saan puwedeng pumili ng isang value o isang hanay ng mga value ang mga user. Puwedeng lagyan ng tema at i-customize ang mga slider.
fr_ca: Les curseurs présentent une plage de valeurs le long d'une barre et permettent aux utilisateurs de sélectionner une valeur ou une plage de valeurs. On peut ajouter un thème aux curseurs et les personnaliser.
gl: Os controis desprazables reflicten un intervalo de valores ao longo dunha barra e os usuarios poden seleccionar un valor ou un intervalo deles. Os controis desprazables poden estar personalizados ou incluír temas.
gu: સ્લાઇડર બારમાં મૂલ્યોની શ્રેણી બતાવે છે, જેમાંથી વપરાશકર્તાઓ એક મૂલ્ય અથવા મૂલ્યોની શ્રેણી પસંદ કરી શકે છે. સ્લાઇડરની થીમ નક્કી કરી શકાય છે અને તેઓને કસ્ટમાઇઝ પણ કરી શકાય છે.
he: מחוונים מייצגים טווח ערכים לאורך סרגל, שהמשתמשים יכולים לבחור ערך יחיד או טווח ערכים מתוכו. ניתן לעצב מחוונים ולהתאים אותם אישית.
hi: ये स्लाइडर किसी बार पर मौजूद मानों की सीमा दिखाते हैं. इससे उपयोगकर्ता किसी एक मान या मानों की सीमा को चुन सकते हैं. स्लाइडर के लिए थीम चुनकर उन्हें पसंद के मुताबिक बनाया जा सकता है.
hu: A csúszkák értéktartományt jelenítenek meg egy sáv mentén, és a felhasználók ebből a tartományból választhatják ki a kívánt értéket vagy értéktartományt. A csúszkák személyre szabhatók, és témájuk módosítható.
hy: Սահիչները թույլ են տալիս ընտրել արժեքներից որևէ մեկը կամ նշել արժեքների միջակայքը։ Սահիչները կարելի է անհատականացնել սեփական թեմայով և կարգավորումներով։
id: Penggeser menunjukkan rentang nilai di sepanjang panel, tempat pengguna dapat memilih nilai tunggal atau rentang nilai. Penggeser dapat disesuaikan dan diubah temanya.
it: I cursori rappresentano un intervallo di valori lungo una barra, da cui gli utenti possono selezionare un singolo valore o un intervallo di valori. È possibile personalizzare e applicare un tema ai cursori.
ja: スライダーはバー上の値の範囲を表すもので、ユーザーはスライダーから 1 つの値または値の範囲を選択できます。テーマを設定したりカスタマイズしたりできます。
ka: სლაიდერები ზოლის გასწვრივ ასახავს მნიშვნელობათა დიაპაზონს, რომელთაგანაც მომხმარებლებს შეუძლიათ აირჩიონ ერთი მნიშვნელობა ან მნიშვნელობათა დიაპაზონი. სლაიდერს შეიძლება ჰქონდეს თემა და იყოს მორგებული.
km: របាររំកិល​បង្ហាញ​ចន្លោះតម្លៃ​នៅលើរបារ ដែលអ្នកប្រើប្រាស់​អាចជ្រើសរើសតម្លៃមួយ ឬចន្លោះតម្លៃ។ អ្នកអាចកំណត់រចនាប័ទ្ម និងប្ដូរ​របាររំកិល​តាមបំណង។
kn: ಸ್ಲೈಡರ್‌ಗಳು ಒಂದು ನಿರ್ದಿಷ್ಟ ಶ್ರೇಣಿಯನ್ನು ಪ್ರತಿಬಿಂಬಿಸುವ ಬಾರ್ ಆಗಿದೆ. ಇದರಿಂದ ಬಳಕೆದಾರರು ಒಂದು ಮೌಲ್ಯವನ್ನು ಅಥವಾ ಮೌಲ್ಯಗಳ ಶ್ರೇಣಿಯನ್ನು ಆಯ್ಕೆಮಾಡಬಹುದು. ಸ್ಲೈಡರ್‌ಗಳನ್ನು ಥೀಮ್ ಮಾಡಬಹುದು ಮತ್ತು ಕಸ್ಟಮೈಸ್ ಮಾಡಬಹುದು.
ko: 슬라이더는 막대를 따라 분포된 값 범위를 나타내어 사용자가 특정 값이나 값 범위를 선택할 수 있게 합니다. 슬라이더에 테마와 맞춤설정을 적용할 수 있습니다.
ky: Сыдырмалардын жардамы менен, колдонуучулар тилкеде көрсөтүлгөн маанилердин диапазонунан бир же бир нече маанини тандай алышат. Сыдырмалар темаларга бөлүштүрүлгөн жана ыңгайлаштырылган болушу мүмкүн.
lo: ຕົວເລື່ອນຈະມີໄລຍະຂອງຄ່າໄປຕາມແຖບໃດໜຶ່ງ, ເຊິ່ງຜູ້ໃຊ້ສາມາດເລືອກຄ່າດຽວ ຫຼື ໄລຍະຂອງຄ່າຕ່າງໆໄດ້. ຕົວເລື່ອນສາມາດໃຊ້ຮູບແບບສີສັນ ແລະ ປັບແຕ່ງໄດ້.
lt: Šliaužikliai atspindi juostos verčių diapazoną, iš kurio naudotojai gali pasirinkti vieną vertę arba verčių diapazoną. Galima nustatyti šliaužiklių temas arba juos tinkinti.
lv: Slīdņi atspoguļo vērtību diapazonu joslā, kurā lietotāji var atlasīt atsevišķu vērtību vai vērtību diapazonu. Slīdņiem var atlasīt tēmu, un tos var pielāgot.
mk: Лизгачите прикажуваат голем број вредности на лента, а корисниците може да изберат една од тие вредности. Може да бидат со теми и приспособени.
ml: സ്ലെെഡറുകൾ ഒരു ബാറിലുടനീളം മൂല്യങ്ങളുടെ ഒരു ശ്രേണിയെ പ്രതിഫലിപ്പിക്കുന്നു. ആ മൂല്യങ്ങളിൽ നിന്ന് ഒന്നോ മൂല്യങ്ങളുടെ ഒരു ശ്രേണിയോ ഉപയോക്താക്കൾക്ക് തിരഞ്ഞെടുക്കാം. സ്ലെെഡറുകൾക്ക് തീം നൽകാനും അവ ഇഷ്ടാനുസൃതമാക്കാനും കഴിയും.
mn: Слайдер нь самбар дагуух утгын мужийг илэрхийлдэг бөгөөд хэрэглэгчид тэндээс дан утга эсвэл утгын мужийг сонгож болно. Слайдерыг загвартай болгох, өөрчлөх боломжтой.
mr: स्लाइडर बारच्या बरोबरीने मूल्यांच्या रेंज दाखवतात, ज्यामधून वापरकर्ते एखादे मूल्य किंवा मूल्यांची रेंज निवडू शकतात. स्लाइडर थीम आणि कस्टमाइझ केली जाऊ शकतात.
ms: Peluncur menggambarkan satu julat nilai di sepanjang bar dan pengguna boleh memilih satu atau beberapa nilai itu. Peluncur boleh bertema atau disesuaikan.
my: ရွှေ့တုံးများသည် ဘားတန်းတစ်ခုပေါ်တွင် တန်ဖိုးများစွာကို ကိုယ်စားပြုပေးပြီး အသုံးပြုသူသည် ၎င်းတို့အနက်မှ တန်ဖိုးတစ်ခု သို့မဟုတ် တန်ဖိုးအပိုင်းအခြားတစ်ခုကို ရွေးချယ်နိုင်ပါသည်။ ရွှေ့တုံးများကို အပြင်အဆင်ထည့်သွင်းပြီး စိတ်ကြိုက်ပြင်ဆင်နိုင်သည်။
nb: Glidebrytere gjenspeiler en rekke verdier langs en rad, som brukere kan velge én enkelt verdi eller et verdiområde fra. Glidebryterne kan få tema og tilpasses.
ne: स्लाइडरहरूले बारमा रहेका मानको दायरा प्रतिबिम्बित गर्दछन् र प्रयोगकर्ताहरू सो दायराबाट एकल मान वा मानको दायरा चयन गर्न सक्छन्। स्लाइडरहरूमा विषयवस्तुहरू भर्न र आफू अनुकूल पार्न सकिन्छ।
pa: ਸਲਾਈਡਰ ਬਾਰ ਦੇ ਨਾਲ-ਨਾਲ ਮੁੱਲ ਦੀ ਰੇਂਜ ਨੂੰ ਦਰਸਾਉਂਦੀ ਹੈ, ਜਿਸ ਤੋਂ ਵਰਤੋਂਕਾਰ ਇਕੱਲੇ ਮੁੱਲ ਜਾਂ ਮੁੱਲ ਰੇਂਜ ਦੀ ਚੋਣ ਕਰ ਸਕਦੇ ਹਨ। ਸਲਾਈਡਰਾਂ ਨੂੰ ਥੀਮਕਿਰਤ ਅਤੇ ਵਿਉਂਤਬੱਧ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।
pl: Suwaki prezentują zakres wartości na pasku, z którego użytkownicy mogą wybrać jedną wartość lub ich zakres. Suwaki mogą być dostosowane pod kątem motywu i innych cech.
pt: Os controles deslizantes refletem um intervalo de valores em uma barra, em que os usuários podem selecionar um valor ou um intervalo. Eles podem ter um tema e ser personalizados.
pt_pt: Os controlos de deslize refletem um intervalo de valores ao longo de uma barra, a partir do qual os utilizadores podem selecionar um valor único ou um intervalo de valores. É possível escolher um tema e personalizar os controlos de deslize.
ro: Glisoarele reprezintă un interval de valori de-a lungul unei bare, din care utilizatorii pot selecta o singură valoare sau un interval de valori. Glisoarele pot să fie personalizate sau să aibă teme.
ru: Ползунки позволяют выбрать одно из значений или указать диапазон значений. К ползункам также можно применить тему и собственные настройки.
si: ස්ලයිඩර් තීරුවක් ඔස්සේ අගයන් පරාසයක් පිළිබිඹු කරන අතර එමඟින් පරිශීලකයන්ට තනි අගයක් හෝ අගයන් පරාසයක් තෝරා ගත හැකිය. ස්ලයිඩර් තේමා ගත කර අභිරුචිකරණය කළ හැකිය.
sk: Posúvače predstavujú rozsah hodnôt na pruhu, z ktorých si môžu používatelia vybrať jednu hodnotu alebo určitý rozsah. Môžete im pridať motív alebo si ich prispôsobiť.
sq: Rrëshqitësit pasqyrojnë një gamë vlerash përgjatë një shiriti, nga të cilat përdoruesit mund të zgjedhin një vlerë të vetme ose një gamë vlerash. Rrëshqitësit mund të personalizohen dhe t'u ndryshohet tema.
sr: Клизачи одражавају опсег вредности на траци, а корисници могу да изаберу једну вредност или опсег вредности. Клизачи могу да имају тему и да се прилагоде.
sr_latn: Klizači odražavaju opseg vrednosti na traci, a korisnici mogu da izaberu jednu vrednost ili opseg vrednosti. Klizači mogu da imaju temu i da se prilagode.
sv: Skjutreglage är fält med ett värdeintervall som användare väljer ett värde eller ett värdeintervall från. Det går att tillämpa teman på och anpassa skjutreglage.
te: బార్ అంతటా విలువల శ్రేణిని స్లయిడర్‌లు సూచిస్తాయి. యూజర్‌లు వాటి నుండి ఒక విలువను లేదా విలువల శ్రేణిని ఎంచుకోగలరు. స్లయిడర్‌ల థీమ్‌ను మార్చవచ్చు, అనుకూలంగా మార్చవచ్చు.
th: แถบเลื่อนแสดงช่วงของค่าในแถบซึ่งให้ผู้ใช้เลือกค่าเดียวหรือช่วงค่าก็ได้ รวมถึงอาจมีธีมและการปรับแต่ง
tr: Kullanıcılar, kaydırma çubuklarını kullanarak belirtilen değer aralığı içinde bir değer veya değer aralığını seçebilir. Kaydırma çubukları temalı veya özelleştirilmiş olabilir.
uk: За допомогою повзунків можна вибирати різні значення з діапазону. Їх тема та вигляд можуть бути різними.
ur: سلائیڈرز بار کے ساتھ اقدار کے رینج کی عکاسی کرتے ہیں، جہاں سے صارفین ایک ہی قدر یا اقدار کے رینج کو منتخب کر سکتے ہیں۔ ان سلائیڈرز کو تھیم شدہ اور حسب ضرورت بنایا جا سکتا ہے۔
uz: Slayderlar yordamida berilgan diapazondagi kerakli qiymat yoki qiymatlar diapazonini tanlash mumkin. Slayderlar maxsus dizaynda va moslashtirilgan ham boʻladi.
vi: Thanh trượt biểu thị khoảng giá trị dọc theo một thanh mà người dùng có thể chọn một giá trị hoặc khoảng giá trị từ đó. Bạn có thể tùy chỉnh và tạo giao diện cho thanh trượt.
zh_hk: 滑桿上列有特定範圍內的值，使用者可選擇其中一個值或某範圍的值。您可選擇滑桿的設計主題，亦可加以自訂。
zu: Izilayidi zibonisa ibanga lamavelu kwibha, kusuka lapho abasebenzisi bangakhetha khona ivelu elilodwa noma ibanga lamavelu. Izilayidi zingaba netimu futhi zenziwe ngokwezifiso.

# demoSlidersContinuousWithEditableNumericalValue
source: Continuous with Editable Numerical Value
af: Aaneenlopend met wysigbare numeriese waarde
am: አርትዕ ሊደረግ ከሚችል አሃዛዊ እሴት ጋር ቀጣይ
ar_eg: مستمر بقيمة رقمية قابلة للتعديل
as: সম্পাদনা কৰিব পৰা সাংখ্যিক মানৰ সৈতে অবিৰত
az: Redaktə olunan Rəqəmli Dəyər ilə Davamlı
be: Бесперапынны з лічбавым значэннем, якое можна змяніць
bn: এডিট করা যাবে এমন সাংখ্যিক মান দিয়ে চালিয়ে যান
bs: Neprekidno s izmjenjivom brojčanom vrijednosti
ca: Valors continus amb un valor numèric editable
da: Kontinuerlig med redigerbar numerisk værdi
es_ar: Continuos con un valor numérico que se puede editar
et: Pidev muudetav arvväärtus
eu: Etengabea, zenbakizko balio editagarriarekin
fa: پیوسته با مقدار عددی قابل ویرایش
fil: Tuloy-tuloy na may Nae-edit na Numerong Value
fr_ca: Continu avec valeur numérique modifiable
gl: Continuo cun valor numérico editable
gu: ફેરફાર કરી શકાય તેવા સતત સંખ્યાત્મક મૂલ્યો ધરાવતું
he: רציף עם ערך מספרי שניתן לעריכה
hi: तय न की गई संख्या वाला स्लाइडर जिसके मानों में बदलाव किया जा सकता है
hu: Folyamatos csúszka szerkeszthető számértékkel
hy: Շարունակական սահիչ՝ թվային արժեքը խմբագրելու հնարավորությամբ
id: Berkelanjutan dengan Nilai Angka yang Dapat Diedit
it: Continuo con valore numerico modificabile
ja: 編集可能な数値の連続
ka: უწყვეტი რედაქტირებადი რიცხობრივი მნიშვნელობით
km: គ្មានចំណុចតម្លៃ រួមជាមួយតម្លៃលេខដែលអាចកែបាន
kn: ಎಡಿಟ್ ಮಾಡಬಹುದಾದ ನಿರಂತರ ಸಂಖ್ಯಾತ್ಮಕ ಮೌಲ್ಯ
ko: 수정 가능한 숫자값이 포함된 연속 슬라이더
ky: Үзгүлтүксүз жана түзөтүлүүчү сан
lo: ຕໍ່ເນື່ອງກັບຄ່າຕົວເລກທີ່ແກ້ໄຂໄດ້
lt: Tolydusis su redaguojama skaitine verte
lv: Nepārtraukts slīdnis ar rediģējamu skaitlisko vērtību
mk: Континуиран со нумеричка вредност што може да се изменува
ml: തിരുത്താവുന്ന സംഖ്യാപരമായ മൂല്യത്തോടൊപ്പം തുടർച്ചയായത്
mn: Засаж болдог тоон утгатай тасралтгүй
mr: संपादित करण्यायोग्य सांख्यिकीय मूल्यासह सतत
ms: Berterusan dengan Nilai Berangka Boleh Edit
my: တည်းဖြတ်နိုင်သည့် ဆက်တိုက် ကိန်းဂဏန်းတန်ဖိုး
nb: Kontinuerlig med redigerbar numerisk verdi
ne: सम्पादन गर्न मिल्ने सङ्ख्यात्मक मान भएको निरन्तर मान
pa: ਲਗਾਤਾਰ ਸੰਪਾਦਨਯੋਗ ਸੰਖਿਆਵਾਚੀ ਮੁੱਲ ਨਾਲ
pl: Ciągły z możliwością wpisania liczby
pt: Contínuo com valor numérico editável
pt_pt: Contínuo com valor numérico editável
ro: Continuu cu valoare numerică ce poate fi editată
ru: Непрерывный ползунок с возможностью редактировать числовое значение
si: සංස්කරණය කළ හැකි සංඛ්‍යාත්මක අගය සමඟ පවත්වාගෙන යයි
sk: Neobmedzený s upraviteľnou číselnou hodnotou
sq: I vazhdueshëm me vlerë numerike të modifikueshme
sr: Непрекидан са нумеричком вредношћу која може да се измени
sr_latn: Neprekidan sa numeričkom vrednošću koja može da se izmeni
sv: Kontinuerligt med redigerbart siffervärde
te: ఎడిట్ చేయదగిన స్థిరమైన సంఖ్యాత్మక విలువ
th: ต่อเนื่องโดยมีค่าตัวเลขที่แก้ไขได้
tr: Düzenlenebilir Sayısal Değere Sahip Kesintisiz
uk: Безперервні числові значення, які можна змінювати
ur: قابل ترمیم عددی قدر کے ساتھ جاری رکھیں
uz: Raqamli qiymatlari tahrirlanuvchi uzluksiz slayder
vi: Liên tục với giá trị số có thể chỉnh sửa
zh_hk: 可編輯的連續數值
zu: Ukuqhubeka ne-Editable Numerical Value

# demoSlidersDiscrete
source: Discrete
af: Diskreet
am: ውሱን
ar_eg: منفصل القيم
as: পৃথক
az: Ayrı
be: Перарывісты
bn: পৃথক মান
bs: Diskretno
ca: Valors discrets
da: Individuel
es_ar: Discretos
et: Diskreetne
eu: Erabiltzaileak zehaztutako balioak dituen graduatzailea
fa: گسسته
fr_ca: Discret
gl: Descontinuo
gu: અલગ
he: דיסקרטי
hi: तय संख्या वाला स्लाइडर
hu: Tagolt
hy: Դիսկրետ
id: Berlainan
it: Discreto
ja: 非連続
ka: დისკრეტული
km: ជាក់លាក់
kn: ಪ್ರತ್ಯೇಕ
ko: 불연속 슬라이더
ky: Дискреттик
lo: ແຍກຈາກກັນ
lt: Diskretusis
lv: Slīdnis ar atsevišķām vērtībām
mk: Дискретен
ml: ഇടവിട്ടുള്ളത്
mn: Салангид
mr: वेगळे
ms: Diskret
my: သီးခြား
nb: Atskilt
ne: पृथक
pa: ਵੱਖਰੀ
pl: Z określonymi wartościami
pt: Discreto
pt_pt: Discreto
ro: Distinct
ru: Дискретный
si: විවික්ත
sk: Diskrétny
sq: Jo i vazhdueshëm
sr: Дискретан
sr_latn: Diskretan
sv: Diskret
te: భిన్నమైన విలువలు
th: ไม่ต่อเนื่อง
tr: Ayrık
uk: Дискретний
ur: علیحدہ
uz: Diskret
vi: Rời rạc
zh_hk: 不連續
zu: Lahla

# demoSlidersDiscreteSliderWithCustomTheme
source: Discrete Slider with Custom Theme
af: Diskrete glyer met gepasmaakte tema
am: ውሱን ተንሸራታች ከብጁ ገጽታ ጋር
ar_eg: شريط تمرير منفصل القيم بتصميم مخصَّص
as: কাষ্টম থীমযুক্ত পৃথক শ্লাইডাৰ
az: Fərdi Temalı Ayrı Slayder
be: Перарывісты паўзунок з карыстальніцкай тэмай
bn: কাস্টম থিম সহ পৃথক মানের স্লাইডার
bs: Diskretni klizač s prilagođenom temom
ca: Control lliscant de valors discrets amb un tema personalitzat
da: Individuel skyder med tilpasset tema
es_ar: Control deslizante discreto con tema personalizado
et: Diskreetse vahemiku kohandatud teemaga liugur
eu: Erabiltzaileak zehaztutako balioak dituen graduatzailea gai pertsonalizatuarekin
fa: لغزنده گسسته با زمینه سفارشی
fil: Discrete Slider na may Custom na Tema
fr_ca: Curseur discret avec thème personnalisé
gl: Control desprazable descontinuo con tema personalizado
gu: કસ્ટમ થીમ સાથેનું અલગ સ્લાઇડર
he: מחוון דיסקרטי עם עיצוב מותאם אישי
hi: तय संख्या वाला स्लाइडर जिसमें पसंद के मुताबिक थीम चुनने की सुविधा मौजूद है
hu: Tagolt csúszka egyéni témával
hy: Դիսկրետ սահիչ՝ անհատականացված թեմայով
id: Penggeser Berlainan dengan Tema Kustom
it: Cursore discreto con tema personalizzato
ja: カスタムテーマが設定された非連続スライダー
ka: დისკრეტული სლაიდერი მორგებული თემით
km: របាររំកិលតម្លៃជាក់លាក់ រួម​ជាមួយរចនាប័ទ្ម​ផ្ទាល់ខ្លួន
kn: ಕಸ್ಟಮ್ ಥೀಮ್ ಜೊತೆಗೆ ಪ್ರತ್ಯೇಕ ಸ್ಲೈಡರ್
ko: 맞춤 테마가 포함된 불연속 슬라이더
ky: Ыңгайлаштырылган темаларга бөлүнгөн дискреттик сыдырма
lo: ຕົວເລື່ອນແບບແຍກຈາກກັນໂດຍມີຮູບແບບສີສັນກຳນົດເອງ
lt: Tinkintos temos diskretusis šliaužiklis
lv: Slīdnis ar atsevišķām vērtībām un pielāgotu motīvu
mk: Дискретен лизгач со приспособена тема
ml: ഇഷ്‌ടാനുസൃത തീമിനൊപ്പമുള്ള ഇടവിട്ടുള്ള സ്ലെെഡർ
mn: Захиалгат загвар болон салангид утгатай слайдер
mr: कस्टम थीमसह वेगळे स्लायडर
ms: Peluncur Diskret dengan Tema Tersuai
my: စိတ်ကြိုက်အပြင်အဆင်နှင့် သီးခြားရွှေ့တုံး
nb: Glidebryter med atskilte verdier og tilpasset tema
ne: आफू अनुकूल विषयवस्तु भएको पृथक स्लाइडर
pa: ਵਿਉਂਂਤੀ ਥੀਮ ਨਾਲ ਵੱਖਰਾ ਸਲਾਈਡਰ
pl: Suwak z określonymi wartościami i niestandardowym motywem
pt: Controle deslizante discreto com tema personalizado
pt_pt: Controlo de deslize discreto com tema personalizado
ro: Glisor distinct cu temă personalizată
ru: Дискретный ползунок с пользовательской темой
si: අභිරුචි තේමාව සමග විවික්ත ස්ලයිඩරය
sk: Diskrétny posúvač s vlastným motívom
sq: Rrëshqitësi jo i vazhdueshëm me temë të personalizuar
sr: Дискретан клизач са прилагођеном темом
sr_latn: Diskretan klizač sa prilagođenom temom
sv: Diskret skjutreglage med anpassat tema
te: అనుకూల థీమ్‌ను కలిగిన భిన్నమైన విలువల స్లయిడర్
th: แถบเลื่อนแบบค่าไม่ต่อเนื่องซึ่งมีธีมที่กำหนดเอง
tr: Özelleştirilmiş Temaya Sahip Ayrık Değerli Kaydırma Çubuğu
uk: Повзунок із дискретним діапазоном значень і власною темою
ur: حسب ضرورت تھیم کے ساتھ علیحدہ سلائیڈر
uz: Maxsus dizaynli diskret slayder
vi: Thanh trượt rời rạc có chủ đề tùy chỉnh
zh_hk: 自訂主題的不連續滑桿
zu: Lahla isilayidi ngetimu yangokwezifiso

# demoSlidersContinuousRangeSliderWithCustomTheme
source: Continuous Range Slider with Custom Theme
af: Aaneenlopende reeksglyer met gepasmaakte tema
am: ቀጣይ የክልል ተንሸራታች ከብጁ ገጽታ ጋር
ar_eg: شريط تمرير بنطاق مستمر وتصميم مخصَّص
as: কাষ্টম থীমযুক্ত অবিৰত পৰিসৰৰ শ্লাইডাৰ
az: Fərdi Temalı Davamlı Silsilə Slayder
be: Бесперапынны паўзунок дыяпазону з карыстальніцкай тэмай
bn: কাস্টম থিমের সাথে নিরবিচ্ছিন্ন ব্যাপ্তি স্লাইডার
bs: Neprekidni klizač s rasponom vrijednosti s prilagođenom temom
ca: Control lliscant d'interval amb valors continus i un tema personalitzat
da: Kontinuerlig områdeskyder med tilpasset tema
es_ar: Control deslizante de rango continuo con tema personalizado
et: Pideva vahemiku kohandatud teemaga liugur
eu: Barruti zehatzeko graduatzaile etengabea gai pertsonalizatuarekin
fa: لغزنده گستره‌ای پیوسته با زمینه سفارشی
fil: Tuloy-tuloy na Slider ng Hanay na may Custom na Tema
fr_ca: Curseur à plage continue avec thème personnalisé
gl: Control desprazable de intervalo continuo con tema personalizado
gu: કસ્ટમ થીમ સાથેનું સતત શ્રેણી ધરાવતું સ્લાઇડર
he: מחוון טווח רציף עם עיצוב מותאם אישי
hi: तय न की गई संख्या वाला स्लाइडर जिसमें पसंद के मुताबिक थीम चुनने की सुविधा मौजूद है
hu: Folyamatos tartománycsúszka egyéni témával
hy: Միջակայքի շարունակական սահիչ՝ անհատականացված թեմայով
id: Penggeser Rentang Berkelanjutan dengan Tema Kustom
it: Cursore intervallo continuo con tema personalizzato
ja: カスタムテーマが設定された連続範囲スライダー
ka: უწყვეტი დიაპაზონის სლაიდერი მორგებული თემით
km: របាររំកិល​គ្មានចំណុចតម្លៃ រួមជាមួយរចនាប័ទ្មផ្ទាល់ខ្លួន
kn: ಕಸ್ಟಮ್ ಥೀಮ್ ಜೊತೆಗೆ ನಿರಂತರ ಶ್ರೇಣಿಯ ಸ್ಲೈಡರ್
ko: 맞춤 테마가 포함된 연속 범위 슬라이더
ky: Ыңгайлаштырылган темаларга бөлүнгөн үзгүлтүксүз маанилер камтылган сыдырма
lo: ຕົວເລື່ອນໄລຍະແບບຕໍ່ເນື່ອງໂດຍມີຮູບແບບສີສັນກຳນົດເອງ
lt: Tinkintos temos tolydusis diapazono šliaužiklis
lv: Slīdnis ar nepārtrauktu vērtību diapazonu un pielāgotu motīvu
mk: Континуиран лизгач на опсег со приспособена тема
ml: ഇഷ്‌ടാനുസൃത തീമിനൊപ്പമുള്ള തുടർച്ചയായ ശ്രേണി സ്ലെെഡർ
mn: Захиалгат загвар болон тасралтгүй утгатай мужийн слайдер
mr: कस्टम थीमसह सतत असणारा रेंज स्लायडर
ms: Peluncur Julat Berterusan dengan Tema Tersuai
my: စိတ်ကြိုက်အပြင်အဆင်နှင့် ဆက်တိုက်အပိုင်းအခြားရွှေ့တုံး
nb: Glidebryter med kontinuerlig område og tilpasset tema
ne: आफू अनुकूल विषयवस्तु भएको निरन्तर दायरा प्रतिबिम्बित गर्ने स्लाइडर
pa: ਵਿਉਂਂਤੀ ਥੀਮ ਨਾਲ ਲਗਾਤਾਰ ਰੇਂਜ ਸਲਾਈਡਰ
pl: Ciągły suwak zakresowy z niestandardowym motywem
pt: Controle deslizante de intervalo contínuo com tema personalizado
pt_pt: Controlo de deslize com intervalo contínuo e tema personalizado
ro: Glisor cu interval continuu și temă personalizată
ru: Непрерывный ползунок диапазона с пользовательской темой
si: අභිරුචි තේමාව සමග අඛණ්ඩ පරාස ස්ලයිඩරය
sk: Neobmedzený posúvač rozsahu a vlastným motívom
sq: Rrëshqitësi i vazhdueshëm me gamë vlerash me temë të personalizuar
sr: Непрекидан клизач опсега са прилагођеном темом
sr_latn: Neprekidan klizač opsega sa prilagođenom temom
sv: Skjutreglage med kontinuerligt intervall och anpassat tema
te: అనుకూల థీమ్‌ను కలిగిన స్థిరమైన శ్రేణి స్లయిడర్
th: แถบเลื่อนสำหรับช่วงต่อเนื่องซึ่งมีธีมที่กำหนดเอง
tr: Özelleştirilmiş Temaya Sahip Sürekli Aralık Değerli Çubuğu
uk: Повзунок із безперервним діапазоном значень і власною темою
ur: حسب ضرورت تھیم کے ساتھ مسلسل رینج سلائیڈر
uz: Maxsus dizaynli uzluksiz diapazonli slayder
vi: Thanh trượt khoảng liên tục có chủ đề tùy chỉnh
zh_hk: 自訂主題的連續範圍滑桿
zu: Ukuqhubekisa isilayidi sebanga ngetimu yangokwezifsio

# demoSlidersContinuous
source: Continuous
af: Aaneenlopend
am: ተከታታይ
ar_eg: مستمر
as: অবিৰত
az: Davamlı
be: Бесперапынны
bn: নিরবিচ্ছিন্ন
bs: Neprekidno
ca: Valors continus
da: Kontinuerlig
es_ar: Continuos
et: Pidev
eu: Etengabea
fa: پیوسته
fil: Tuloy-tuloy
fr_ca: Continu
gl: Continuo
gu: સતત
he: רציף
hi: तय न की गई संख्या वाला स्लाइडर
hu: Folyamatos
hy: Շարունակական
id: Berkelanjutan
it: Continuo
ja: 連続
ka: უწყვეტი
km: គ្មានចំណុចតម្លៃ
kn: ನಿರಂತರ
ko: 연속 슬라이더
ky: Үзгүлтүксүз
lo: ຕໍ່ເນື່ອງ
lt: Tolydusis
lv: Nepārtraukts
mk: Континуиран
ml: തുടർച്ചയായ
mn: Тасралтгүй
mr: सतत
ms: Berterusan
my: ဆက်တိုက်
nb: Kontinuerlig
ne: निरन्तर
pa: ਲਗਾਤਾਰ
pl: Ciągły
pt: Contínuo
pt_pt: Contínuo
ro: Continuu
ru: Непрерывный
si: අඛණ්ඩ
sk: Neobmedzený
sq: I vazhdueshëm
sr: Непрекидан
sr_latn: Neprekidan
sv: Kontinuerligt
te: స్థిరమైన
th: ต่อเนื่อง
tr: Sürekli
uk: Безперервний
ur: مسلسل
uz: Uzluksiz
vi: Liên tục
zh_hk: 連續
zu: Okuqhubekayo

# placePondicherry
source: Pondicherry
am: ፖንዲቼሪ
ar_eg: بونديتشيري
as: পন্ডিচেৰী
az: Pondiçerri
be: Пондзічэры
bn: পুদুচেরী
bs: Puducherry
es_ar: Puducherry
fa: پوندیچری
fr_ca: Pondichéry
gl: Puducherry
gu: પોંડિચેરી
he: פונדיצ'רי
hi: पॉन्डिचेरी
hu: Puduccseri
hy: Պոնդիչերի
ja: ポンディシェリ
ka: პონდიჩერი
km: ផនឌីឈ័ររី
kn: ಪಾಂಡಿಚೇರಿ
ko: 퐁디셰리
ky: Путтуччери
lo: ພອນດິເຊີຣີ
lt: Pudučeris
lv: Pudučerri
mk: Пудучери
ml: പോണ്ടിച്ചേരി
mn: Пондичерри
mr: पाँडिचेरी
nb: Puducherry
ne: पोन्डिचेरी
pa: ਪੁਡੂਚੇਰੀ
pl: Puducherry
ru: Пондичерри
si: පොන්ඩිචෙරි
sq: Pondiçeri
sr: Пондишери
sr_latn: Pondišeri
sv: Puducherry
te: పుదుచ్చేరి
th: พอนดิเชอร์รี
uk: Пудучеррі
ur: پانڈچیری
uz: Pondicherri
zh_hk: 本地治里
zu: E-Pondicherry

# demoMenuTitle
source: Menu
af: Kieslys
am: ምናሌ
ar_eg: قائمة
as: মেনু
az: Menyu
be: Меню
bn: মেনু
bs: Meni
ca: Menú
es_ar: Menú
et: Menüü
eu: Menua
fa: منو
gl: Menú
gu: મેનૂ
he: תפריט
hi: मेन्यू
hu: Menü
hy: Ընտրացանկ
ja: メニュー
ka: მენიუ
km: ម៉ឺនុយ
kn: ಮೆನು
ko: 메뉴
ky: Меню
lo: ເມນູ
lt: Meniu
lv: Izvēlne
mk: Мени
ml: മെനു
mn: Цэс
mr: मेनू
my: မီနူး
nb: Meny
ne: मेनु
pa: ਮੀਨੂ
ro: Meniu
ru: Меню
si: මෙනුව
sk: Ponuka
sq: Menyja
sr: Мени
sr_latn: Meni
sv: Meny
te: మెనూ
th: เมนู
tr: Menü
uk: Меню
ur: مینیو
uz: Menyu
vi: Trình đơn
zh_hk: 選單
zu: Imenyu
