Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoCupertinoSwitchDescription
source: A switch is used to toggle the on/off state of a single setting.
af: 'n Skakelaar word gebruik om 'n enkele instelling aan of af te skakel.
am: ማብሪያ/ማጥፊያ አንድ ነጠላ ቅንብርን ለማብራት/ለማጥፋት ስራ ላይ ይውላል።
ar_eg: يُستخدَم مفتاح التبديل لتفعيل إعداد فردي أو إيقافه.
as: এটা একক ছেটিঙৰ অন/অফ স্থিতি টগ'ল কৰিবলৈ এটা ছুইচ্ছ ব্যৱহাৰ কৰা হয়।
az: Ayarı aktiv/deaktiv etmək üçün dəyişdirici istifadə edilir.
be: Пераключальнікі выкарыстоўваюцца для ўключэння і выключэння асобных налад.
bn: আপনি সিঙ্গেল সেটিংস চালু/বন্ধ করতে টগল বোতামটি ব্যবহার করতে পারেন।
bs: Prekidač se koristi za aktiviranje/deaktiviranje jedne postavke.
ca: Els interruptors s'utilitzen per commutar una única opció de configuració a activada o desactivada.
da: En kontakt bruges til at skifte tilstand for en bestemt indstilling.
es_ar: Un interruptor se utiliza para cambiar el estado de una única opción de configuración a activado o desactivado.
et: Lülitit kasutatakse ühe konkreetse seade sisse-/väljalülitatud oleku määramiseks.
eu: Ezarpen bat aktibatu eta desaktibatzeko balio du etengailuak.
fa: از کلید برای تغییر وضعیت خاموش/روشن یک تنظیم استفاده می‌شود.
fil: Ginagamit ang isang switch para i-on/i-off ang isang setting.
fr_ca: Un commutateur permet d'activer ou de désactiver un paramètre.
gl: Os interruptores utilízanse para activar e desactivar o estado dunha soa opción de configuración.
gu: સ્વિચનો ઉપયોગ સિંગલ સેટિંગની ચાલુ/બંધ સ્થિતિને ટૉગલ કરવા માટે થાય છે.
he: מתג שמשמש להחלפת מצב בין הפעלה לכיבוי של הגדרה בודדת.
hi: स्विच का इस्तेमाल किसी सेटिंग को चालू/बंद करने के लिए किया जाता है.
hu: A kapcsolóval egy adott beállítás be- vagy kikapcsolt állapotát lehet állítani.
hy: Փոխանջատիչի միջոցով կարելի է միացնել կամ անջատել առանձին կարգավորումներ։
id: Tombol akses digunakan untuk mengalihkan status aktif/nonaktif setelan tunggal.
it: Un interruttore viene utilizzato per attivare o disattivare lo stato di una singola impostazione.
ja: スイッチでは、1 つの設定のオン / オフ状態を切り替えることができます。
ka: გადამრთველი გამოიყენება ცალკეული პარამეტრის ჩართვა/გამორთვისთვის.
km: ប៊ូតុង​បិទបើក​ត្រូវបានប្រើ​ដើម្បី​បិទ/បើក​ស្ថានភាព​នៃការកំណត់​តែមួយ។
kn: ಸೆಟ್ಟಿಂಗ್ ಒಂದರ ಸ್ಥಿತಿಯನ್ನು ಟಾಗಲ್ ಆನ್/ಆಫ್ ಮಾಡಲು ಸ್ವಿಚ್ ಅನ್ನು ಬಳಸಲಾಗುತ್ತದೆ.
ko: 스위치는 단일 설정을 켜짐/꺼짐 상태 간에 전환하는 데 사용됩니다.
ky: Өзгөчө которгуч жалгыз жөндөөнүн абалын күйгүзүү/өчүрүү үчүн колдонулат.
lo: ປຸ່ມກົດແມ່ນໃຊ້ເພື່ອສະຫຼັບສະຖານະ ເປີດ/ປິດ ຂອງການຕັ້ງຄ່າດ່ຽວໃດໜຶ່ງ.
lt: Jungikliu galima įjungti ir išjungti konkretaus nustatymo būseną.
lv: Izmantojot slēdzi, var pārslēgt vienu iestatījumu no ieslēgta stāvokļa uz izslēgtu vai otrādi.
mk: Прекинувачот се користи за менување на состојбата вклучено/исклучено на една поставка.
ml: ഒരൊറ്റ ക്രമീകരണത്തിന്റെ ഓൺ/ഓഫ് നിലകൾ മാറ്റാൻ ഒരു സ്വിച്ച് ഉപയോഗിക്കുന്നു.
mn: Дан тохиргооны төлөвийг асаах/унтраахын тулд сэлгүүрийг ашигладаг.
mr: एका सेटिंगची सुरू/बंद स्थिती टॉगल करण्यासाठी स्विचचा वापर केला जातो.
ms: Suis digunakan untuk menogol keadaan hidup/mati tetapan tunggal.
my: ခလုတ်ကို ဆက်တင်တစ်ခု၏ ဖွင့်ခြင်း/ပိတ်ခြင်း အခြေအနေကို ပြောင်းရန် အသုံးပြုသည်။
nb: En bryter brukes til å veksle mellom på og av for en enkelt innstilling.
ne: स्विच कुनै एकल सेटिङको सक्रिय/निष्क्रिय अवस्थालाई टगल गर्न प्रयोग गरिन्छ।
pa: ਸਵਿੱਚ ਦੀ ਵਰਤੋਂ ਇਕਹਿਰੀ ਸੈਟਿੰਗ ਦੀ ਚਾਲੂ/ਬੰਦ ਸਥਿਤੀ ਵਿਚਾਲੇ ਟੌਗਲ ਕਰਨ ਲਈ ਕੀਤੀ ਜਾਂਦੀ ਹੈ।
pl: Przełącznik służy do włączania i wyłączania pojedynczego ustawienia.
pt: A chave é usada para alternar o estado ativado/desativado de uma única configuração.
pt_pt: É utilizado um interruptor para alternar entre o estado ativado/desativado de uma definição individual.
ro: Comutatorul este folosit pentru a comuta între stările activat și dezactivat ale unei setări.
ru: С помощью переключателя можно включить или отключить отдельную настройку.
si: ස්විචයක් තනි සැකසීමක තත්ත්වය ක්‍රියාත්මක/ක්‍රියාවිරහිත කිරීමට භාවිත කරයි.
sk: Prepínačom je možné prepínať stav zapnuté alebo vypnuté pre jedno nastavenie.
sq: Çelësi përdoret për të ndërruar gjendjen e një cilësimi të vetëm në aktive/joaktive.
sr: Прекидач се користи за укључивање/искључивање појединачних подешавања.
sr_latn: Prekidač se koristi za uključivanje/isključivanje pojedinačnih podešavanja.
sv: Ett reglage används till att aktivera eller inaktivera en enskild inställning.
te: స్విచ్ ఒక సెట్టింగ్ యొక్క ఆన్/ఆఫ్ స్థితిని స్విచ్ చేయడానికి ఉపయోగించబడుతుంది.
th: สวิตช์ใช้ในการสลับสถานะเปิด/ปิดของการตั้งค่ารายการเดียว
tr: Anahtarlar tek bir ayarın açık/kapalı durumunu değiştirmek için kullanılır.
uk: Перемикач використовують, щоб вмикати й вимикати окремі налаштування.
ur: ایک سوئچ کا استعمال ایک واحد ترتیب میں آن / آف ٹوگل کرنے کے ليے کیا جاتا ہے۔
uz: Kalit tugma biror sozlamani yoqishi yoki faolsizlantirishi mumkin.
vi: Bạn có thể dùng nút chuyển để chuyển đổi trạng thái bật/tắt của một tùy chọn cài đặt.
zh_hk: 開關可以用來切換個別設定的開關狀態。
zu: Iswishi isetshenziselwa ukuguqula isimo sokuvula/sokuvala kusilungiselelo esisodwa.

# demoSnackbarsActionButtonLabel
source: ACTION
af: HANDELING
am: ድርጊት
ar_eg: إجراء
as: একশ্বন
az: ƏMƏLİYYAT
be: ДЗЕЯННЕ
bn: অ্যাকশন
bs: RADNJA
ca: ACCIÓ
da: HANDLING
es_ar: ACCIÓN
et: MÄRUL
eu: EKINTZA
fa: کنش
fil: PAGKILOS
gl: ACCIÓN
gu: ઍક્શન
he: פעולה
hi: कार्रवाई
hu: MŰVELET
hy: ԿՈՃԱԿ
id: TINDAKAN
it: AZIONE
ja: アクション
ka: მოქმედება
km: សកម្មភាព
kn: ಆ್ಯಕ್ಷನ್
ko: 작업
ky: АРАКЕТ
lo: ຄຳສັ່ງ
lt: VEIKSMAS
lv: DARBĪBA
mk: ДЕЈСТВО
ml: പ്രവർത്തനം
mn: ҮЙЛДЭЛ
mr: अ‍ॅक्‍शन
ms: TINDAKAN
my: လုပ်ဆောင်ချက်
nb: HANDLING
ne: एक्सन
pa: ਕਾਰਵਾਈ
pl: DZIAŁANIE
pt: AÇÃO
pt_pt: AÇÃO
ro: ACȚIUNE
ru: КНОПКА
si: ක්‍රියාව
sk: AKCIA
sq: VEPRIMI
sr: РАДЊА
sr_latn: RADNJA
sv: ÅTGÄRD
te: చర్య
th: การทำงาน
tr: İŞLEM
uk: ДІЯ
ur: ایکشن
uz: AMAL
vi: HÀNH ĐỘNG
zh_hk: 動作
zu: ISENZO

# cupertinoTabBarProfileTab
source: Profile
af: Profiel
am: መገለጫ
ar_eg: الملف الشخصي
as: প্ৰ’ফাইল
az: Profil
be: Профіль
bn: প্রোফাইল
bs: Profil
ca: Perfil
da: Profil
es_ar: Perfil
et: Profiil
eu: Profila
fa: نمایه
fr_ca: Profil
gl: Perfil
gu: પ્રોફાઇલ
he: פרופיל
hi: प्रोफ़ाइल
hu: Profil
hy: Պրոֆիլ
id: Profil
it: Profilo
ja: プロフィール
ka: პროფილი
km: កម្រងព័ត៌មាន
kn: ಪ್ರೊಫೈಲ್
ko: 프로필
ky: Профиль
lo: ໂປຣໄຟລ໌
lt: Profilis
lv: Profils
mk: Профил
ml: പ്രൊഫൈൽ
mn: Профайл
mr: प्रोफाइल
ms: Profil
my: ပရိုဖိုင်
nb: Profil
ne: प्रोफाइल
pa: ਪ੍ਰੋਫਾਈਲ
pl: Profil
pt: Perfil
pt_pt: Perfil
ro: Profil
ru: Профиль
si: පැතිකඩ
sk: Profil
sq: Profili
sr: Профил
sr_latn: Profil
sv: Profil
te: ప్రొఫైల్
th: โปรไฟล์
tr: Profil
uk: Профіль
ur: پروفائل
uz: Profil
vi: Hồ sơ
zh_hk: 個人檔案
zu: Iphrofayela

# demoSnackbarsButtonLabel
source: SHOW A SNACKBAR
af: WYS 'N TEKSBALK
am: ቁርስ ቤት አሳይ
ar_eg: عرض شريط إعلام منبثق
as: এডাল স্নেকবাৰ দেখুৱাওক
az: SNEKPANEL GÖSTƏRİN
be: ПАКАЗАЦЬ УСПЛЫВАЛЬНУЮ ПАНЭЛЬ
bn: স্ন্যাকবার দেখুন
bs: PRIKAŽI KRATKO OBAVJEŠTENJE
ca: MOSTRA UNA BARRA DE NOTIFICACIONS
da: VIS EN HANDLINGSBEKRÆFTELSE
es_ar: MOSTRAR UNA BARRA DE NOTIFICACIONES
et: KUVA TEABERIBA
eu: ERAKUTSI SNACKBAR BAT
fa: نمایش نوار توضیحات
fil: MAGPAKITA NG SNACKBAR
fr_ca: AFFICHER UN CASSE-CROÛTE
gl: MOSTRAR UNHA BARRA DE NOTIFICACIÓNS
gu: સ્નૅકબાર બતાવો
he: הצגת סרגל אינטראקטיבי
hi: स्नैकबार देखें
hu: PÉLDA AZ INFORMÁCIÓS SÁVRA
hy: ՑՈՒՑԱԴՐԵԼ ԾԱՆՈՒՑՈՒՄՆԵՐԻ ՏՈՂԸ
id: TAMPILKAN SNACKBAR
it: MOSTRA UNO SNACKBAR
ja: スナックバーを表示
ka: სნეკ-ზოლის ჩვენება
km: បង្ហាញ​របារសារខ្លីៗ
kn: ಸ್ನ್ಯಾಕ್‌ಬಾರ್ ಅನ್ನು ತೋರಿಸಿ
ko: 스낵바 표시
ky: МААЛЫМАТ ТАКТАСЫН КӨРСӨТҮҮ
lo: ສະແດງແຖບສະແດງຂໍ້ຄວາມ
lt: RODYTI LAIKINĄ JUOSTĄ
lv: RĀDĪT PAZIŅOJUMU JOSLU
mk: ПРИКАЖИ СНЕКБАР-ПОРАКА
ml: ഒരു സ്‌നാക്‌ബാർ കാണിക്കുക
mn: SNACKBAR-Г ХАРУУЛАХ
mr: स्नॅकबार दाखवा
ms: TUNJUKKAN BAR SNEK
my: မုန့်ဘားကို ပြရန်
nb: VIS EN SNACKBAR
ne: कुनै स्न्याकबार देखाउनुहोस्
pa: ਸਨੈਕਬਾਰ ਦਿਖਾਓ
pl: POKAŻ PASEK POWIADOMIEŃ
pt: MOSTRAR UM SNACKBAR
pt_pt: MOSTRAR UMA BARRA DE COMENTÁRIOS
ro: AFIȘEAZĂ O BARĂ DE NOTIFICARE
ru: ПОКАЗАТЬ СНЭК-ПАНЕЛЬ
si: ස්නැක්බාර් එකක් පෙන්වන්න
sk: ZOBRAZIŤ OZNÁMENIE
sq: SHFAQ NJË SHIRIT NJOFTIMESH
sr: ПРИКАЗУЈ ТРАКУ ЗА ОБАВЕШТЕЊА
sr_latn: PRIKAZUJ TRAKU ZA OBAVEŠTENJA
sv: VISA ETT MEDDELANDEFÄLT
te: స్నాక్‌బార్‌ను చూపించు
th: แสดงแถบแสดงข้อความ
tr: SNACKBAR GÖSTER
uk: ПОКАЗАТИ ПАНЕЛЬ ПІДКАЗОК
ur: ایک اسنیک بار دکھائیں
uz: SNEKBARNI CHIQARISH
vi: HIỂN THỊ THANH THÔNG BÁO NHANH
zh_hk: 顯示資訊列
zu: BONISA I-SNACKBAR

# demoSnackbarsDescription
source: Snackbars inform users of a process that an app has performed or will perform. They appear temporarily, towards the bottom of the screen. They shouldn't interrupt the user experience, and they don't require user input to disappear.
af: Teksbalke lig gebruikers in oor ’n proses wat ’n program uitgevoer het of gaan uitvoer. Hulle verskyn tydelik naby die onderkant van die skerm. Hulle behoort nie die gebruikerervaring te onderbreek nie en geen gebruikerhandeling is nodig om hulle te laat verdwyn nie.
am: ቁርስ ቤቶች አንድ መተግበሪያ ስላከናወነው ወይም ስለሚያከናውነው ሂደት ለተጠቃሚዎች ያሳውቃል። በማያ ገጹ ግርጌ አካባቢ ለጊዜው ይታያሉ። የተጠቃሚውን ተሞክሮ ማቋረጥ የለባቸውም፣ እና ለመጥፋት የተጠቃሚው ግቤት አያስፈልጋቸውም።
ar_eg: تُعلِم "أشرطة الإعلام المنبثقة" المستخدمين بعملية نفّذها أو سينفّذها التطبيق. وتظهر مؤقتًا في أسفل الشاشة. ويُفترَض ألا تشوش هذه الأشرطة على تجربة المستخدم ولا تتطلّب تدخل المستخدم كي تختفي.
as: স্নেকবাৰসমূহে ব্যৱহাৰকাৰীসকলক তেনে কোনো প্ৰক্ৰিয়াৰ বিষয়ে জনায় যিটো কোনো এটা এপে সম্পাদন কৰিছে অথবা কৰিব। সেইবোৰ স্ক্ৰীনখনৰ একেবাৰে তলৰফালে অস্থায়ীভাৱে প্ৰদৰ্শিত হয়। সেইবোৰে ব্যৱহাৰকাৰীগৰাকীৰ অভিজ্ঞতাত ব্যাঘাত জন্মোৱা উচিত নহয় আৰু সেইবোৰ অদৃশ্য হ’বৰ বাবে ব্যৱহাৰকাৰীৰ ইনপুটৰ আৱশ্যক নহয়।
az: Snekpanellər tətbiqin icra etdiyi və ya edəcəyi prosesi istifadəçilərə bildirir. Onlar ekranın aşağısına doğru müvəqqəti göstərilir. Onlar istifadəçinin təcrübəsinə mane olmamalıdır, yoxa çıxmaq üçün istifadəçi girişinə ehtiyac duymurlar.
be: Усплывальныя панэлі паведамляюць карыстальніку пра працэсы, якія адбываюцца або будуць адбывацца ў праграмах. Такія паведамленні з'яўляюцца на кароткі час унізе экрана і самастойна знікаюць, каб не перашкаджаць карыстальніку.
bn: অ্যাপটি পারফর্ম করেছে বা পারফর্ম করবে এমন প্রসেসের সম্পর্কে ব্যবহারকারীকে স্ন্যাকবার বিজ্ঞপ্তি পাঠায়। এটি অস্থায়ীভাবে স্ক্রিনের নিচের দিকে দেখায়। এটি ব্যবহারকারীর অভিজ্ঞতায় কোনও প্রভাব ফেলবে না এবং মুছে ফেলার জন্য ব্যবহারকারীর অনুমতির প্রয়োজন নেই।
bs: Kratka obavještenja informiraju korisnike o postupku koji je aplikacija izvršila ili će tek izvršiti. Pojavljajuju se privremeno, prema dnu ekrana. Ne bi trebala ometati iskustvo korisnika, a za nestajanje ne zahtijevaju unos korisnika.
ca: Les barres de notificacions informen els usuaris dels processos que han dut o duran a terme les aplicacions i es mostren temporalment a la part inferior de la pantalla. No interrompen l'experiència d'usuari ni cal cap acció perquè deixin de mostrar-se.
da: Handlingsbekræftelser informerer brugerne om en proces, som en app enten har fuldført eller vil gennemgå senere. De vises midlertidigt nederst på skærmen. De bør ikke forstyrre brugeroplevelsen, og de forsvinder af sig selv.
es_ar: Las barras de notificaciones informan a los usuarios sobre un proceso que realizó o realizará una app. Aparecen temporalmente en la parte inferior de la pantalla. No deberían interrumpir la experiencia del usuario, y no requieren una entrada del usuario para desaparecer.
et: Teaberibad teavitavad protsessi kasutajaid rakenduse praegustest või tulevastest toimingutest. Need kuvatakse ajutiselt ekraanikuva alaosas. Need ei tohiks kasutuskogemust häirida ja kasutaja ei pea nende eemaldamiseks sekkuma.
eu: Aplikazio batek egin duen edo egingo duen prozesu baten berri ematen diete snackbar-ek erabiltzaileei. Tarte batez agertzen dira pantailaren behealdean. Ez dute etengo aplikazioa erabiltzeko modua eta ezer egin gabe desagertuko dira.
fa: نوار توضیحات فرایندی را که برنامه انجام داده است یا انجام خواهد داد به کاربران اعلام می‌کند. این نوار به‌طور موقت در پایین صفحه نمایش داده می‌شود. نوار نباید تجربه کاربر را مختل کند و برای بسته شدن نیازی به ورودی کاربر ندارد.
fil: Ipinapaalam ng Mga Snackbar sa mga user ang isang proseso na isinasagawa o isasagawa ng app. Panandaliang lumalabas ang mga ito, papunta sa ibaba ng screen. Hindi dapat makaabala ang mga ito sa experience ng user, at hindi kinakailangan ng mga ito na mawala ang input ng user.
fr_ca: Les casse-croûte informent les utilisateurs d'un processus qu'une application a effectué ou effectuera. Ils s'affichent temporairement dans le bas de l'écran. Ils ne devraient pas interrompre l'expérience utilisateur et ils n'exigent pas d'entrée pour disparaître.
gl: As barras de notificacións aparecen temporalmente na parte inferior da pantalla e ofrecen información aos usuarios sobre os procesos que unha aplicación executou ou executará. Non deberían interferir na experiencia do usuario e desaparecen da pantalla por si soas.
gu: સ્નૅકબાર વપરાશકર્તાઓને ઍપ દ્વારા કરવામાં આવેલી અથવા ભવિષ્યમાં કરવાની છે તે પ્રક્રિયા અંગે સૂચના આપે છે. તે સ્ક્રીનની નીચેની બાજુએ હંગામી રીતે દેખાય છે. તેના કારણે વપરાશકર્તાના અનુભવમાં વિક્ષેપ પડશે નહીં અને અદૃશ્ય થવા માટે તેને વપરાશકર્તાના ઇનપુટની જરૂર હોતી નથી.
he: סרגלים אינטראקטיביים נועדו ליידע את המשתמשים לגבי תהליך שאפליקציה ביצעה או תבצע. הם מוצגים באופן זמני, קרוב לתחתית של המסך. הם לא אמורים להפריע לחוויית המשתמש, ומשתמשים לא צריכים להזין קלט כלשהו כדי שהם ייעלמו.
hi: स्नैकबार, उपयोगकर्ताओं को किसी ऐप्लिकेशन की ऐसी प्रोसेस के बारे में जानकारी देते हैं जो हो चुकी है या होने वाली है. ये स्क्रीन पर सबसे नीचे, कुछ समय के लिए दिखते हैं. स्नैकबार की वजह से उपयोगकर्ता अनुभव में कोई रुकावट नहीं आनी चाहिए. साथ ही, इन्हें स्क्रीन से हटाने के लिए उपयोगकर्ता के इनपुट की ज़रूरत नहीं होती है.
hu: Az információs sávok arról tájékoztatják a felhasználókat, hogy valamelyik alkalmazás melyik folyamatot végezte el vagy fogja elvégezni. A képernyő alján, rövid időre jelennek meg. Nem zavarhatják meg a felhasználói élményt, és nem követelhetnek meg felhasználói beavatkozást ahhoz, hogy eltűnjenek.
hy: Ծանուցումների տողերը օգտատերերին տեղեկացնում են հավելվածում կատարված կամ կատարվելիք գործողությունների մասին։ Դրանք հայտնվում են կարճ ժամանակով էկրանի ներքևի հատվածում։ Ծանուցումների տողերը չեն շեղում օգտատերերին, և դրանք փակելու կարիք չկա։
id: Snackbar memberi tahu pengguna proses yang telah dilakukan atau akan dilakukan aplikasi. Snackbar muncul sementara, di bagian bawah layar. Snackbar tidak akan mengganggu pengalaman pengguna, dan tidak memerlukan masukan pengguna agar dapat menghilang.
it: Gli snackbar informano gli utenti di un processo che un'app ha eseguito o sta per eseguire. Vengono visualizzati temporaneamente in fondo allo schermo. Non dovrebbero interrompere l'esperienza utente e non richiedono interazioni per essere rimossi dallo schermo.
ja: スナックバーを使用して、アプリが実行したまたはこれから実行するプロセスをユーザーに伝えます。スナックバーは画面の下部に一時的に表示されるため、ユーザーの操作性を妨げることがありません。また、削除するためのユーザーの入力操作も必要ありません。
ka: სნეკ-ზოლები მომხმარებლებს აწვდის ინფორმაციას იმ პროცესის შესახებ, რომელიც აპმა შეასრულა ან რომელსაც შეასრულებს. ისინი ჩნდება დროებით, ეკრანის ქვედა ნაწილში. ისინი არ უნდა უშლიდეს ხელს მომხმარებელს და მათ გასაქრობად მომხმარებელს არაფრის გაკეთება სჭირდება.
km: របារសារខ្លីៗ​ប្រាប់អ្នកប្រើប្រាស់​អំពី​ដំណើរការ​ដែល​កម្មវិធី​បានធ្វើ ឬ​នឹងធ្វើ។ របារទាំងនេះ​បង្ហាញជា​បណ្ដោះអាសន្ន​នៅ​ផ្នែកខាងក្រោម​នៃអេក្រង់។ របារប្រភេទនេះ​មិនគួររំខានដល់​បទពិសោធន៍​អ្នកប្រើប្រាស់ និងមិនតម្រូវឱ្យ​អ្នកប្រើប្រាស់​ធ្វើអ្វី​ដើម្បី​ឱ្យរបារនេះបាត់នោះទេ។
kn: ಆ್ಯಪ್ ನಿರ್ವಹಿಸಿದ ಅಥವಾ ನಿರ್ವಹಿಸುವ ಪ್ರಕ್ರಿಯೆಯ ಬಗ್ಗೆ ಸ್ನ್ಯಾಕ್‌ಬಾರ್‌ಗಳು ಬಳಕೆದಾರರಿಗೆ ತಿಳಿಸುತ್ತವೆ. ಅವುಗಳು ತಾತ್ಕಾಲಿಕವಾಗಿ, ಸ್ಕ್ರೀನ್‌‍ನ ಕೆಳಭಾಗದಲ್ಲಿ ಕಾಣಿಸಿಕೊಳ್ಳುತ್ತವೆ. ಅವರು ಬಳಕೆದಾರರ ಅನುಭವವನ್ನು ಅಡ್ಡಿಪಡಿಸಬಾರದು ಮತ್ತು ಕಾಣೆಯಾಗಲು ಅವರಿಗೆ ಬಳಕೆದಾರರ ಇನ್‌ಪುಟ್‌ನ ಅಗತ್ಯವಿಲ್ಲ.
ko: 스낵바는 앱이 실행했거나 실행할 예정인 프로세스를 사용자에게 알려 줍니다. 화면 하단에 임시로 나타납니다. 사용자 환경을 방해하지 않고 사용자 입력이 없어도 사라져야 합니다.
ky: Маалымат такталары колдонмо аткарган же аткарганы жаткан процесс тууралуу кабарлап турушат. Алар экрандын ылдый жагында убактылуу пайда болушат. Алар колдонуучуга тоскоол болушпайт жана өздөрү эле көрүнбөй калышат.
lo: ແຖບສະແດງຂໍ້ຄວາມຈະແຈ້ງເຕືອນຜູ້ໃຊ້ກ່ຽວກັບຂັ້ນຕອນທີ່ແອັບໃດໜຶ່ງດຳເນີນໄປແລ້ວ ຫຼື ຈະດຳເນີນການ. ພວກມັນຈະປາກົດຊົ່ວຄາວ, ຢູ່ລຸ່ມສຸດຂອງໜ້າຈໍ. ພວກມັນຈະບໍ່ລົບກວນປະສົບການຂອງຜູ້ໃຊ້ ແລະ ຜູ້ໃຊ້ບໍ່ຈຳເປັນຕ້ອງກົດເພື່ອໃຫ້ຫາຍໄປ.
lt: Laikinos juostos informuoja naudotojus apie programos eigą: kas jau yra ir dar bus atlikta. Jos rodomos laikinai ekrano apačioje. Juostos negali trukdyti naudotojo funkcijoms ir naudotojui nereikia atlikti jokių veiksmų, kad jos dingtų.
lv: Paziņojumu joslās tiek rādīta informācija par procesiem, ko lietotnes ir veikušas vai drīz veiks. Paziņojumu joslas tiek īslaicīgi rādītas ekrāna apakšdaļā. Tās nedrīkst traucēt lietošanu, un nav nepieciešama lietotāja ievade, lai tās pazustu.
mk: Снекбар-пораките ги информираат корисниците дека некоја апликација извршила или ќе изврши некаков процес. Тие се појавуваат привремено, кон дното на екранот. Не треба да го прекинуваат корисникот и не бараат од него да внесе податоци за да исчезнат.
ml: ഒരു ആപ്പ് നിറവേറ്റിയതോ നിറവേറ്റാൻ പോകുന്നതോ ആയ പ്രോസസിനെ കുറിച്ച് സ്‌നാക്ബാറുകൾ ഉപയോക്താക്കളെ അറിയിക്കുന്നു. അവ സ്ക്രീനിന്റെ ചുവടെ താൽക്കാലികമായി ദൃശ്യമാകുന്നു. അവ ഉപയോക്തൃ അനുഭവത്തെ തടസ്സപ്പെടുത്തരുത്, മാത്രമല്ല അവ അപ്രത്യക്ഷമാകാൻ ഉപയോക്താവിന്റെ ഇൻപുട്ട് ആവശ്യമായി വരരുത്.
mn: Snackbar нь аппын гүйцэтгэсэн эсвэл гүйцэтгэх процессын тухай хэрэглэгчдэд мэдээлдэг. Энэ нь дэлгэцийн доод талд түр хугацаанд харагддаг. Энэ нь хэрэглэгчийн туршлагад саад болох ёсгүй бөгөөд алга болохын тулд хэрэглэгчээс оролт шаарддаггүй.
mr: स्नॅकबार प्रक्रिया वापरकर्त्यांना ॲप काम करत आहे किंवा काम करेल याची माहिती देते. ते स्क्रीनच्या तळाशी तात्पुरते दिसतात. ते वापरकर्त्याच्या अनुभवात व्यत्यय आणत नाही आणि त्यांना वापरकर्ता इनपुट अदृश्य करण्याची आवश्यकता नाही.
ms: Bar snek memberitahu pengguna tentang proses yang telah dilakukan atau yang akan dilakukan oleh apl. Bar snek ini dipaparkan di bahagian bawah skrin secara sementara. Bar snek tidak seharusnya mengganggu pengalaman pengguna dan tidak memerlukan input pengguna untuk hilang.
my: မုန့်ဘားများသည် အက်ပ်တစ်ခုက လုပ်ဆောင်လိုက်သော သို့မဟုတ် လုပ်ဆောင်မည်ဖြစ်သော အစီအစဉ်တစ်ခုကို အသုံးပြုသူထံ အကြောင်းကြားပေးသည်။ ၎င်းတို့သည် မျက်နှာပြင်၏ အောက်ခြေဘက်တွင် ယာယီဖော်ပြသည်။ ၎င်းတို့သည် အသုံးပြုမှုအပေါ် အနှောင့်အယှက်ဖြစ်စေခြင်း မရှိဘဲ ၎င်းကိုဖျောက်ရန် အသုံးပြုသူ၏ လုပ်ဆောင်ချက် မလိုအပ်ပါ။
nb: Snackbarer informerer brukere om en prosess en app har utført eller kommer til å utføre. De vises midlertidig nede på skjermen. De skal ikke forstyrre brukeropplevelsen, og de krever ikke brukerhandlinger for å forsvinne.
ne: स्न्याकबारहरूले प्रयोगकर्तालाई एपले गर्दै गरेको वा गर्नेसम्बन्धी प्रक्रियाका बारेमा जानकारी दिन्छन्। स्न्याकबारहरू केही समयका लागि स्क्रिनको फेदतिर देखिन्छन्। स्न्याकबारहरूले प्रयोगकर्ताको अनुभवमा बाधा पुऱ्याउँदैनन् र तिनीहरूले प्रयोगकर्ताले हालेको जानकारी लुकाउनु पर्दैन।
pa: ਸਨੈਕਬਾਰਾਂ ਵਰਤੋਂਕਾਰਾਂ ਨੂੰ ਉਸ ਪ੍ਰਕਿਰਿਆ ਬਾਰੇ ਸੂਚਿਤ ਕਰਦੀਆਂ ਹਨ ਜੋ ਐਪ ਵੱਲੋਂ ਕੀਤੀ ਗਈ ਹੈ ਜਾਂ ਕੀਤੀ ਜਾਵੇਗੀ। ਉਹ ਸਕ੍ਰੀਨ ਦੇ ਹੇਠਾਂ ਵੱਲ ਅਸਥਾਈ ਤੌਰ 'ਤੇ ਦਿਸਦੀਆਂ ਹਨ। ਉਨ੍ਹਾਂ ਨੂੰ ਵਰਤੋਂਕਾਰ ਅਨੁਭਵ ਵਿੱਚ ਰੁਕਾਵਟ ਨਹੀਂ ਪਾਉਣੀ ਚਾਹੀਦੀ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਗਾਇਬ ਹੋਣ ਲਈ ਵਰਤੋਂਕਾਰ ਇਨਪੁੱਟ ਦੀ ਲੋੜ ਨਹੀਂ ਹੁੰਦੀ।
pl: Paski powiadomień informują użytkowników o działaniach, które aplikacje wykonały lub mają wykonać. Pojawiają się tymczasowo u dołu ekranu. Zazwyczaj nie przeszkadzają w korzystaniu z urządzenia, ponieważ znikają bez żadnych działań użytkownika.
pt: Os snackbars informam os usuários sobre processos que o app realizou ou vai realizar. Eles aparecem temporariamente, na parte de baixo da tela e não interrompem a experiência do usuário. Nenhuma ação é necessária para que eles desapareçam.
pt_pt: As barras de comentários informam os utilizadores acerca de um processo que uma app executou ou vai executar. Surgem temporariamente na parte inferior do ecrã. Não devem interromper a experiência do utilizador e não requerem uma introdução do utilizador para desaparecerem.
ro: Barele de notificare informează utilizatorii cu privire la un proces care a fost sau va fi executat de o aplicație. Acestea se afișează temporar în partea de jos a ecranului. Ele nu ar trebui să întrerupă experiența utilizatorului și nu necesită date introduse de utilizator pentru a dispărea.
ru: Снэк-панели – это уведомления, которые на некоторое время появляются в нижней части экрана. Они сообщают о действии, которое было или будет выполнено в приложении. Снэк-панели не требуется закрывать вручную, и они не должны отвлекать пользователя.
si: ස්නැක්බාර් මගින් යෙදුමක් ක්‍රියා කර ඇති බව හෝ ක්‍රියා කරනු ඇති බව ක්‍රියාවලියක පරිශීලකයන්ට දැනුම් දෙයි. ඒවා තිරයේ පහළ දෙසට තාවකාලිකව දිස් වේ. ඒවා පරිශීලක අත්දැකීමට බාධා නොකළ යුතු අතර දිස් නොවී යාමට ඒවාට පරිශීලක ආදානය අවශ්‍ය නොවේ.
sk: Oznámenia informujú používateľov o procese, ktorý aplikácia vykonáva alebo bude vykonávať. Zobrazujú sa dočasne v dolnej časti obrazovky. Nemali by rušiť dojem používateľov a na zrušenie ich zobrazovania nie je zo strany používateľa potrebná žiadna akcia.
sq: Shiritat e njoftimeve i informojnë përdoruesit për një proces që ka kryer ose do të kryejë një aplikacion. Ata shfaqen përkohësisht, në drejtim të fundit të ekranit. Ata nuk duhet ta ndërpresin eksperiencën e përdoruesit dhe nuk kërkojnë ndërveprimin nga përdoruesi për t'u zhdukur.
sr: Траке за обавештења обавештавају кориснике о процесу који је нека апликација обавила или ће обавити. Привремено се приказују у дну екрана. Не би требало да ометају кориснички доживљај и не захтевају активност корисника да би нестале.
sr_latn: Trake za obaveštenja obaveštavaju korisnike o procesu koji je neka aplikacija obavila ili će obaviti. Privremeno se prikazuju u dnu ekrana. Ne bi trebalo da ometaju korisnički doživljaj i ne zahtevaju aktivnost korisnika da bi nestale.
sv: Meddelandefälten visar användarna vilken process som utförs eller ska utföras i en app. De visas tillfälligt, långt ned på skärmen. Meddelandefält ska inte störa användarupplevelsen och användarna behöver inte göra något för att de ska försvinna.
te: యాప్ చేస్తున్న లేదా చేయబోయే ప్రాసెస్ గురించి స్నాక్‌బార్‌లు యూజర్‌కు తెలియచేస్తాయి. అవి తాత్కాలికంగా, స్క్రీన్ దిగువ వైపున కనిపిస్తాయి. అవి యూజర్ అనుభవానికి అంతరాయం కలిగించకూడదు, అవి విస్మరించబడటానికి యూజర్ ఇన్‌పుట్ అవసరం లేదు.
th: แถบแสดงข้อความจะแจ้งให้ผู้ใช้ทราบเกี่ยวกับขั้นตอนที่แอปได้ทำไปแล้วหรือจะทำ แถบนี้ปรากฏชั่วคราวที่บริเวณด้านล่างของหน้าจอ ไม่ควรรบกวนประสบการณ์ของผู้ใช้ และผู้ใช้ไม่ต้องป้อนข้อมูลเพื่อให้แถบนี้หายไป
tr: Snackbar'lar bir uygulamanın gerçekleştirdiği veya gerçekleştireceği bir işlemi kullanıcılara bildirir. Ekranın altına yakın bir yerde geçici olarak görünür. Kullanıcı deneyimini engellememeli ve ekrandan kaybolması için kullanıcının bir işlem yapmasını gerektirmemelidir.
uk: Панель підказок інформує користувачів про процеси в додатках. Такі повідомлення ненадовго з’являються внизу екрана й автоматично зникають, тому вони не заважатимуть роботі користувача.
ur: اسنیک بارز صارفین کو اس کارروائی سے متعلق بتاتے ہیں جو ایک ایپ نے انجام دیا ہے یا انجام دے گا۔ وہ اسکرین کے نچلے حصے کی طرف عارضی طور پر ظاہر ہوتے ہیں۔ انہیں صارف کے تجربے میں مداخلت نہیں کرنی چاہیے، اور انہیں غیر ظاہر کرنے کے ليے صارف کے ان پٹ کی ضرورت نہیں ہے۔
uz: Snekbarlar foydalanuvchilarga ilovaning amali yoki jarayoni haqida xabar qiladi. Ular ekranning quyi qismida vaqtincha chiqadi. Snekbarlar foydalanishga xalaqit qilmasligi kerak va bezovta qilmasdan yopilish kerak.
vi: Thanh thông báo nhanh cho người dùng biết về quá trình mà một ứng dụng đã hoặc sẽ thực hiện. Những thanh thông báo này xuất hiện một cách tạm thời về phía cuối màn hình. Chúng không làm gián đoạn trải nghiệm người dùng cũng như không yêu cầu ẩn hoạt động đầu vào của người dùng.
zh_hk: 資訊列會通知使用者有關應用程式已執行或將會執行的程序。它們會在螢幕底部短暫出現，並不會干擾使用者體驗，同時無需使用者輸入任何指令便會消失。
zu: Ama-snackbar azisa abasebenzisi ngenqubo i-app eyenzile noma ezoyenza. Avela okwesikhashana, ngaphansi kwesikrini. Akumele aphazamise umuzwa womsebenzisi, futhi awadingi ukufakwa komsebenzisi ukuze anyamalale.
