Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

source: Loading
af: Laai tans
am: በመጫን ላይ
ar_eg: جارٍ التحميل
as: ল’ড হৈ আছে
az: Yüklənir
be: Загрузка
bn: লোড হচ্ছে
bs: Učitavanje
ca: S'està carregant
da: Indlæser
es_ar: Cargando
et: Laadimine
eu: Kargatzen
fa: درحال بار کردن
fil: Naglo-load
fr_ca: Chargement en cours…
gl: Cargando
gu: લોડ થઈ રહ્યું છે
he: בטעינה
hi: लोड हो रहा है
hu: Betöltés…
hy: Բեռնում
id: Memuat
it: Caricamento in corso…
ja: 読み込み中
ka: მიმდინარეობს ჩატვირთვა
km: កំពុងផ្ទុក
kn: ಲೋಡ್ ಆಗುತ್ತಿದೆ
ko: 로드 중
ky: Жүктөлүүдө
lo: ກຳລັງໂຫຼດ
lt: Įkeliama
lv: Notiek ielāde…
mk: Се вчитува
ml: ലോഡ് ചെയ്യുന്നു
mn: Ачаалж байна
mr: लोड करत आहे
ms: Memuatkan
my: ဖွင့်နေသည်
nb: Laster inn
ne: लोड हुँदै छ
pa: ਲੋਡ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ
pl: Wczytuję
pt: Carregando
pt_pt: A carregar
ro: Se încarcă
ru: Загрузка
si: පූරණය වේ
sk: Načítava sa
sq: Po ngarkohet
sr: Учитава се
sr_latn: Učitava se
sv: Läser in
te: లోడ్ అవుతోంది
th: กำลังโหลด
tr: Yükleniyor
uk: Завантаження
ur: لوڈ ہو رہا ہے
uz: Yuklanmoqda
vi: Đang tải
zh_hk: 正在載入
zu: Iyalayisha

source: Deselect
af: Ontkies
am: አትምረጥ
ar_eg: إلغاء الاختيار
as: বাছনিৰ পৰা আঁতৰাওক
az: Seçimi ləğv edin
be: Скасаваць выбар
bn: টিক চিহ্ন সরিয়ে দিন
bs: Poništi odabir
ca: Desselecciona
da: Fravælg
es_ar: Anular selección
et: Tühista valik
eu: Desautatu
fa: لغو انتخاب
fil: I-deselect
fr_ca: Désélectionner
gl: Anular a selección
gu: નાપસંદ કરો
he: ביטול הבחירה
hi: चुने हुए का निशान हटाएं
hu: Kiválasztás megszüntetése
hy: Ապընտրել
id: Batalkan pilihan
it: Deseleziona
ja: 選択を解除
ka: არჩევის გაუქმება
km: ដក​ការជ្រើសរើស
kn: ಆಯ್ಕೆ ರದ್ದುಮಾಡಿ
ko: 선택 해제
ky: Тандоодон чыгаруу
lo: ເຊົາເລືອກ
lt: Panaikinti pasirinkimą
lv: Noņemt atlasi
mk: Поништи го изборот
ml: തിരഞ്ഞെടുത്തത് മാറ്റുക
mn: Сонголтыг цуцлах
mr: निवड रद्द करा
ms: Nyahpilih
my: မရွေးပါနှင့်
nb: Velg bort
ne: चयन रद्द गर्नुहोस्
pa: ਅਣ-ਚੁਣਿਆ ਕਰੋ
pl: Odznacz
pt: Desmarcar
pt_pt: Desmarcar
ro: Debifați
ru: Отменить выбор
si: නොතෝරන්න
sk: Zrušiť výber
sq: Hiq përzgjedhjen
sr: Опозови избор
sr_latn: Opozovi izbor
sv: Avmarkera
te: ఎంపికను తొలగించండి
th: ยกเลิกการเลือก
tr: Seçimi kaldır
uk: Не вибирати
ur: غیر منتخب کریں
uz: Tanlovni bekor qilish
vi: Bỏ chọn
zh_hk: 取消選取
zu: Susa ukukhetha

source: Select
af: Kies
am: ምረጥ
ar_eg: اختيار
as: বাছনি কৰক
az: Seçin
be: Выбраць
bn: বেছে নিন
bs: Odaberi
ca: Selecciona
da: Vælg
es_ar: Seleccionar
et: Vali
eu: Hautatu
fa: انتخاب
fil: Piliin
fr_ca: Sélectionner
gl: Seleccionar
gu: પસંદ કરો
he: בחירה
hi: चुनें
hu: Kiválasztás
hy: Ընտրել
id: Pilih
it: Seleziona
ja: 選択
ka: არჩევა
km: ជ្រើសរើស
kn: ಆಯ್ಕೆಮಾಡಿ
ko: 선택
ky: Тандоо
lo: ເລືອກ
lt: Pasirinkti
lv: Atlasīt
mk: Избери
ml: തിരഞ്ഞെടുക്കുക
mn: Сонгох
mr: निवडा
ms: Pilih
my: ရွေးရန်
nb: Velg
ne: चयन गर्नुहोस्
pa: ਚੁਣੋ
pl: Zaznacz
pt: Selecionar
pt_pt: Selecionar
ro: Selectați
ru: Выбрать
si: තෝරන්න
sk: Vybrať
sq: Zgjidh
sr: Изабери
sr_latn: Izaberi
sv: Välj
te: ఎంచుకోండి
th: เลือก
tr: Seç
uk: Вибрати
ur: منتخب کریں
uz: Tanlash
vi: Chọn
zh_hk: 選取
zu: Khetha

# selectable
source: Selectable (long press)
af: Kiesbaar (langdruk)
am: ሊመረጥ የሚችል (ረዥም መጫን)
ar_eg: قابل للاختيار (بالضغط مع الاستمرار)
as: বাছনি কৰিব পৰা (দীঘলীয়াকৈ টিপক)
az: Seçilə bilən (basıb saxlayın)
be: Магчымасць выбару (доўгім націсканнем)
bn: বেছে নিতে পারেন (বেশিক্ষণ প্রেস করুন)
bs: Moguće je odabrati (dugi pritisak)
ca: Es pot seleccionar (en mantenir premut)
da: Kan vælges (langt tryk)
es_ar: Se puede seleccionar (mantener presionado)
et: Valitav (pikk vajutus)
eu: Hauta daiteke (luze sakatuta)
fa: قابل انتخاب (فشار طولانی)
fil: Napipili (matagal na pagpindot)
fr_ca: Peut être sélectionné (avec un appui prolongé)
gl: Pódese seleccionar (pulsación longa)
gu: પસંદ કરવા યોગ્ય (થોડીવાર દબાવી રાખો)
he: ניתן לבחירה (בלחיצה ארוכה)
hi: चुना जा सकने वाला (देर तक दबाने पर)
hu: Kiválasztható (hosszú megnyomással)
hy: Կարելի է ընտրել (երկար սեղմել)
id: Dapat dipilih (tekan lama)
it: Selezionabile (pressione prolungata)
ja: 選択可能（長押し）
ka: არჩევადი (ხანგრძლივი დაჭერა)
km: អាចជ្រើសរើសបាន (ចុចឱ្យយូរ)
kn: ಆಯ್ಕೆ ಮಾಡಬಹುದಾದ (ದೀರ್ಘಕಾಲ ಒತ್ತಿಹಿಡಿಯುವುದು)
ko: 선택 가능(길게 누르기)
ky: Тандалуучу (коё бербей басып туруу)
lo: ສາມາດເລືອກໄດ້ (ກົດຄ້າງໄວ້)
lt: Pasirenkama (ilgai paspaudus)
lv: Var atlasīt (nospiest un turēt)
mk: Може да се избере (со долго притискање)
ml: തിരഞ്ഞെടുക്കാവുന്നത് (ദീർഘനേരം അമർത്തുക)
mn: Сонгох боломжтой (удаан дарах)
mr: निवडण्यायोग्य (प्रेस करून ठेवा)
ms: Boleh pilih (tekan lama)
my: ရွေးနိုင်သည် (ကြာရှည်နှိပ်ထားရန်)
nb: Kan velges (langt trykk)
ne: चयन गर्न मिल्ने (केही बेरसम्म थिच्नुहोस्)
pa: ਚੁਣਨਯੋਗ (ਦਬਾਈ ਰੱਖਣਾ)
pl: Możliwość zaznaczenia (przez przytrzymanie)
pt: Selecionável (tocar pressionar)
pt_pt: Selecionável (manter premido)
ro: Se poate selecta (apăsare lungă)
ru: Можно выбрать (нажмите и удерживайте)
si: තේරිය හැකි (දිගු එබීම)
sk: Môžete vybrať (dlhým stlačením)
sq: Mund të zgjidhet (shtypje e gjatë)
sr: Може да се изабере (дуги притисак)
sr_latn: Može da se izabere (dugi pritisak)
sv: Valbar (tryck länge)
te: ఎంచుకోగలిగేది (ఎక్కువసేపు నొక్కి, ఉంచాలి)
th: เลือกได้ (กดค้าง)
tr: Seçilebilir (uzun basma)
uk: Можна вибрати (утримуванням)
ur: منتخب کرنے کے قابل (دیر تک دبائیں)
uz: Bosib turib tanlang
vi: Chọn được (nhấn và giữ)
zh_hk: 可選擇 (長按)
zu: Iyakhetheka (cindezela isikhathi eside)

source: Selected
af: Gekies
am: ተመርጧል
ar_eg: محدَّد
as: বাছনি কৰা হৈছে
az: Seçilib
be: Выбрана
bn: বেছে নেওয়া আইটেম
bs: Odabrano
ca: Seleccionat
da: Valgt
es_ar: Seleccionado
et: Valitud
eu: Hautatuta
fa: انتخاب‌شده
fil: Napili
fr_ca: Sélectionné
gl: Seleccionado
gu: પસંદ કરી
he: נבחר
hi: चुना गया
hu: Kiválasztva
hy: Ընտրված է
id: Dipilih
it: Elemento selezionato
ja: 選択中
ka: არჩეულია
km: បានជ្រើសរើស
kn: ಆಯ್ಕೆಮಾಡಲಾಗಿದೆ
ko: 선택됨
ky: Тандалды
lo: ເລືອກແລ້ວ
lt: Pasirinkta
lv: Atlasīts
mk: Избрано
ml: തിരഞ്ഞെടുത്തു
mn: Сонгосон
mr: निवडला
ms: Dipilih
my: ရွေးထားသည်
nb: Valgt
ne: चयन गरिएको छ
pa: ਚੁਣੀ ਗਈ
pl: Zaznaczono
pt: Selecionado
pt_pt: Selecionado
ro: Selectat
ru: Выбрано
si: තෝරන ලදි
sk: Vybrané
sq: Zgjedhur
sr: Изабрано је
sr_latn: Izabrano je
sv: Markerad
te: ఎంచుకోబడింది
th: เลือกแล้ว
tr: Seçili
uk: Вибрано
ur: منتخب کردہ
uz: Tanlandi
vi: Đã chọn
zh_hk: 已選取
zu: Okukhethiwe

source: Demo
af: Demonstrasie
am: ቅንጭብ ማሳያ
ar_eg: إصدار تجريبي
as: ডেম’
be: Дэмаверсія
bn: ডেমো
bs: Demo verzija
ca: Demostració
es_ar: Demostración
eu: Demo-bertsioa
fa: نسخه نمونه
fr_ca: Démo
gl: Versión de demostración
gu: ડેમો
he: הדגמה
hi: डेमो
hu: Demó
hy: Դեմո
ja: デモ
ka: დემო
km: គំរូបង្ហាញ
kn: ಡೆಮೋ
ko: 데모
ky: Демо
lo: ເດໂມ
lt: Demonstracinė versija
lv: Demonstrācija
mk: Демо
ml: ഡെമോ
mn: Демо
mr: डेमो
my: သရုပ်ပြ
nb: Demonstrasjon
ne: डेमो
pa: ਡੈਮੋ
pl: Wersja demonstracyjna
pt: Demonstração
pt_pt: Demonstração
ro: Versiune demonstrativă
ru: Демоверсия
si: ආදර්ශනය
sk: Ukážka
sq: Demonstrim
sr: Демо верзија
sr_latn: Demo verzija
te: డెమో
th: เดโม
uk: Демоверсія
ur: ڈیمو
uz: Demo versiyalar
vi: Bản minh hoạ
zh_hk: 示範
zu: Idemo

source: Bottom app bar
af: Onderste appbalk
am: የግርጌ መተግበሪያ አሞሌ
ar_eg: شريط التطبيق السفلي
as: তলত অৱস্থিত এপৰ বাৰ
az: Alt tətbiq paneli
be: Ніжняя панэль праграм
bn: স্ক্রিনের নিচের দিকে থাকা অ্যাপ বার
bs: Donja traka aplikacije
ca: Barra d'aplicacions inferior
da: Appbjælke nederst på skærmen
es_ar: Barra de la aplicación inferior
et: Alumine rakenduseriba
eu: Aplikazioaren behealdeko barra
fa: نوار برنامه پایین صفحه
fil: Bar ng app sa ibaba
fr_ca: Barre d'applications inférieure
gl: Barra de aplicacións inferior
gu: ઍપનો સૌથી નીચેનો બાર
he: סרגל האפליקציה התחתון
hi: बॉटम ऐप्लिकेशन बार
hu: Alsó alkalmazássáv
hy: Հավելվածների ստորին գոտի
id: Panel aplikasi bawah
it: Barra dell'app in basso
ja: ボトム アプリバー
ka: აპების ქვედა ზოლი
km: របារកម្មវិធី​ផ្នែកខាងក្រោម
kn: ಬಾಟಮ್ ಆ್ಯಪ್ ಬಾರ್
ko: 하단 앱 바
ky: Колдонмонун ылдый жакта жайгашкан тилкеси
lo: ແຖບທາງລຸ່ມຂອງແອັບ
lt: Apatinė programų juosta
lv: Apakšējā lietotņu josla
mk: Долна лента со апликации
ml: ചുവടെയുള്ള ആപ്പ് ബാർ
mn: Доод талын аппын талбар
mr: तळाशी असलेला ॲप बार
ms: Bar apl sebelah bawah
my: အောက်ခြေရှိ အက်ပ်ဘား
nb: Nederste apprad
ne: एपको फेदमा रहेको बार
pa: ਹੇਠਲੀ ਐਪ ਬਾਰ
pl: Dolny pasek aplikacji
pt: Barra de apps da parte de baixo
pt_pt: Barra de apps inferior
ro: Bara de aplicații din partea de jos
ru: Нижняя панель приложения
si: පහළ යෙදුම් තීරුව
sk: Dolný panel aplikácií
sq: Shiriti i aplikacioneve në fund
sr: Доња трака са апликацијама
sr_latn: Donja traka sa aplikacijama
sv: Nedre appfält
te: దిగువ యాప్ బార్
th: แถบด้านล่างของแอป
tr: Alt uygulama çubuğu
uk: Нижня панель додатків
ur: نیچے کا ایپ بار
uz: Quyi ilovalar paneli
vi: Thanh ứng dụng ở dưới cùng
zh_hk: 底部應用程式列
zu: Ibha yaphansi ye-app

source: Not selected
af: Nie gekies nie
am: አልተመረጠም
ar_eg: غير محدَّد
as: বাছনি কৰা হোৱা নাই
az: Seçilməyib
be: Не выбрана
bn: বেছে নেওয়া হয়নি
bs: Nije odabrano
ca: No seleccionat
da: Ikke valgt
es_ar: Sin seleccionar
et: Pole valitud
eu: Hautatu gabe
fa: انتخاب‌نشده
fil: Hindi napili
fr_ca: Non sélectionné
gl: Non seleccionado
gu: પસંદ કરી નથી
he: לא נבחר
hi: नहीं चुना गया
hu: Nincs kiválasztva
hy: Ընտրված չէ
id: Tidak dipilih
it: Elemento non selezionato
ja: 未選択
ka: არ არის არჩეული
km: មិនបាន​ជ្រើសរើស
kn: ಆಯ್ಕೆ ಮಾಡಿಲ್ಲ
ko: 선택되지 않음
ky: Тандалган жок
lo: ບໍ່ໄດ້ເລືອກ
lt: Nepasirinkta
lv: Nav atlasīts
mk: Не е избрано
ml: തിരഞ്ഞെടുത്തില്ല
mn: Сонгоогүй
mr: निवडलेला नाही
ms: Tidak dipilih
my: ရွေးမထားပါ
nb: Ikke valgt
ne: चयन गरिएको छैन
pa: ਚੁਣੀ ਨਹੀਂ ਗਈ
pl: Nie zaznaczono
pt: Não selecionado
pt_pt: Não selecionado
ro: Neselectat
ru: Не выбрано
si: තෝරා නැත
sk: Nevybrané
sq: Nuk është zgjedhur
sr: Није изабрано
sr_latn: Nije izabrano
sv: Inte markerad
te: ఎంచుకోబడలేదు
th: ไม่ได้เลือก
tr: Seçili değil
uk: Не вибрано
ur: منتخب نہیں کیا گیا
uz: Tanlanmagan
vi: Chưa chọn
zh_hk: 未選取
zu: Ayikhethiwe

# demoCupertinoSearchTextFieldTitle
source: Search text field
af: Soekteksveld
am: የፍለጋ ጽሑፍ መስክ
ar_eg: الحقل النصي للبحث
as: সন্ধান কৰিবলগীয়া পাঠৰ ক্ষেত্ৰ
az: Axtarış mətni sahəsi
be: Поле крытэрыю пошуку
bn: সার্চ টেক্সট ফিল্ড
bs: Polje za tekst pretraživanja
ca: Camp de text de cerca
da: Tekstfelt til søgning
es_ar: Campo de texto de búsqueda
et: Otsinguteksti väli
eu: Testua bilatzeko eremua
fa: فیلد نوشتاری جستجو
fil: Field ng text ng paghahanap
fr_ca: Champ de recherche textuelle
gl: Campo de texto de busca
gu: શોધ ટેક્સ્ટનું ફીલ્ડ
he: שדה טקסט לחיפוש
hi: सर्च टेक्स्ट फ़ील्ड
hu: Keresési szövegmező
hy: Որոնման տեքստի վանդակ
id: Kolom teks penelusuran
it: Campo di testo della ricerca
ja: 検索テキスト フィールド
ka: ძიების ტექსტური ველი
km: កន្លែងបញ្ចូល​ពាក្យស្វែងរក
kn: ಪಠ್ಯ ಹುಡುಕಾಟದ ಫೀಲ್ಡ್
ko: 검색 텍스트 입력란
ky: Издөө текстинин талаасы
lo: ຫ້ອງປ້ອນຂໍ້ຄວາມການຄົ້ນຫາ
lt: Paieškos teksto laukas
lv: Meklēšanas teksta lauks
mk: Поле за пребарување текст
ml: തിരയൽ ടെക്‌സ്റ്റ് ഫീൽഡ്
mn: Хайлтын текстийн талбар
mr: शोध फील्ड दर्शवा
ms: Medan teks carian
my: ရှာဖွေရေး စာသားအကွက်
nb: Søketekstfelt
ne: सर्च टेक्स्ट फिल्ड
pa: ਖੋਜ ਲਿਖਤ ਖੇਤਰ
pl: Pole tekstowe wyszukiwania
pt: Campo de texto da pesquisa
pt_pt: Campo de texto de pesquisa
ro: Câmp pentru căutarea textului
ru: Поле поиска
si: පෙළ ක්ෂේත්‍රය සොයන්න
sk: Textové pole vyhľadávania
sq: Fusha e kërkimit të tekstit
sr: Поље за текст претраге
sr_latn: Polje za tekst pretrage
sv: Söktextfält
te: సెర్చ్ టెక్స్ట్ ఫీల్డ్
th: ช่องข้อความค้นหา
tr: Arama metni alanı
uk: Текстове поле пошуку
ur: ٹیکسٹ تلاش کرنے کا فیلڈ
uz: Qidiruv maydoni
vi: Trường văn bản tìm kiếm
zh_hk: 搜尋文字欄位
zu: Inkambu yombhalo wosesho

# demoCupertinoPicker
source: Picker
af: Kieser
am: መራጮች
ar_eg: أداة الاختيار
as: বাছনি কৰোঁতা
az: Seçici
be: Інструмент выбару
bn: বাছাইকারী
bs: Odabirač
ca: Selector
da: Vælger
es_ar: Selector
et: Valikuvidin
eu: Hautatzailea
fa: انتخاب‌گر
fr_ca: Sélecteur
gl: Selector
gu: પિકર
he: בורר
hi: पिकर
hu: Választó
hy: Ընտրիչ
id: Alat pilih
it: Selettore
ja: 選択ツール
ka: ამომრჩევი
km: ផ្ទាំងជ្រើសរើស
kn: ಪಿಕರ್
ko: 선택 도구
ky: Тандагыч
lo: ຕົວເລືອກ
lt: Rinkiklis
lv: Atlasītājs
mk: Виџет за избор
ml: പിക്കർ
mn: Сонгогч
mr: पिकर
ms: Pemilih
my: ရွေးချယ်ရေးစနစ်
nb: Velger
ne: पिकर
pa: ਚੋਣਕਾਰ
pl: Selektor
pt: Seletor
pt_pt: Selecionador
ro: Selector
ru: Окно выбора
si: තෝරකය
sk: Výber
sq: Zgjedhësi
sr: Бирач
sr_latn: Birač
sv: Väljare
te: పిక్కర్
th: เครื่องมือเลือก
tr: Seçici
uk: Засіб вибору
ur: منتخب کنندہ
uz: Tanlash oynasi
vi: Bộ chọn
zh_hk: 點選器
zu: Isikhi

# demoCupertinoSearchTextFieldSubtitle
source: iOS-style search text field
af: Soekteksveld in iOS-styl
am: የiOS-ቅጥ የፍለጋ ጽሑፍ መስክ
ar_eg: الحقل النصي للبحث بنمط iOS
as: iOS-শৈলীৰ সন্ধান কৰিবলগীয়া পাঠৰ ক্ষেত্ৰ
az: iOS üslubunda axtarış mətni sahəsi
be: Поле крытэрыю пошуку ў стылі iOS
bn: iOS-স্টাইল সার্চ টেক্সট ফিল্ড
bs: Polje za tekst pretraživanja u stilu iOS-a
ca: Camp de text de cerca d'estil iOS
da: Tekstfelt til søgning i iOS-format
es_ar: Campo de texto de búsqueda similar al de iOS
et: iOS-stiilis otsinguteksti väli
eu: Testua bilatzeko eremua (iOS estilokoa)
fa: فیلد نوشتاری جستجو به‌سبک iOS
fil: Field ng text ng paghahanap na may istilong pang-iOS
fr_ca: Champ de texte de recherche de style iOS
gl: Campo de texto de busca de tipo iOS
gu: iOS-શૈલીનું શોધ ટેક્સ્ટનું ફીલ્ડ
he: שדה טקסט לחיפוש בסגנון iOS
hi: iOS-स्टाइल का सर्च टेक्स्ट फ़ील्ड
hu: iOS-stílusú keresési szövegmező
hy: iOS-ի ոճով որոնման տեքստի վանդակ
id: Kolom teks penelusuran bergaya iOS
it: Campo di testo della ricerca in stile iOS
ja: iOS スタイルの検索テキスト フィールド
ka: iOS-სტილის ძიების ტექსტური ველი
km: កន្លែងបញ្ចូល​ពាក្យស្វែងរក​ដែលមានរចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿಯ ಹುಡುಕಾಟ ಪಠ್ಯ ಕ್ಷೇತ್ರ
ko: iOS 스타일 검색 텍스트 입력란
ky: iOS стилиндеги издөө текстинин талаасы
lo: ຫ້ອງປ້ອນຂໍ້ຄວາມການຄົ້ນຫາຮູບແບບ iOS
lt: „iOS“ stiliaus paieškos teksto laukas
lv: iOS stila meklēšanas teksta lauks
mk: Поле за пребарување текст во iOS-стил
ml: iOS-സ്റ്റൈൽ തിരയൽ ടെക്‌സ്റ്റ് ഫീൽഡ്
mn: iOS загварын хайлтын текстийн талбар
mr: iOS च्या शैलीतील शोध मजकूर फील्ड
ms: Medan teks carian gaya iOS
my: iOS-ပုံစံ ရှာဖွေရေး စာသားအကွက်
nb: Søketekstfelt i iOS-stil
ne: iOS शैलीको सर्च टेक्स्ट फिल्ड
pa: iOS-ਸਟਾਈਲ ਖੋਜ ਲਿਖਤ ਖੇਤਰ
pl: Pole tekstowe wyszukiwania w stylu iOS
pt: Campo de texto da pesquisa no estilo do iOS
pt_pt: Campo de texto de pesquisa ao estilo do iOS
ro: Câmp pentru textul de căutare în stil iOS
ru: Поле поиска в стиле iOS
si: iOS-විලාසයේ සෙවීම් පෙළ ක්ෂේත්‍රය
sk: Textové pole vyhľadávania v štýle systému iOS
sq: Fusha e kërkimit të tekstit në stilin e iOS
sr: Поље за текст претраге у iOS стилу
sr_latn: Polje za tekst pretrage u iOS stilu
sv: Söktextfält i iOS-stil
te: iOS-స్టయిల్ సెర్చ్ టెక్స్ట్ ఫీల్డ్
th: ช่องข้อความค้นหารูปแบบ iOS
tr: iOS stili arama metin alanı
uk: Текстове поле пошуку в стилі iOS
ur: iOS طرز کا ٹیکسٹ تلاش کرنے کا فیلڈ
uz: iOS uslubidagi matn qidirish maydoni
vi: Trường văn bản tìm kiếm kiểu iOS
zh_hk: iOS 樣式的搜尋文字欄位
zu: Inkambu yombhalo wosesho wesitayela se-iOS

# demoCupertinoSearchTextFieldDescription
source: A search text field that lets the user search by entering text, and that can offer and filter suggestions.
af: ’n Soekteksveld waarmee die gebruiker kan soek deur teks in te voer, en wat voorstelle kan gee en filtreer.
am: ተጠቃሚው ጽሑፍ በማስገባት እንዲፈልግ የሚፈቅድ እና ጥቆማዎችን ማቅረብ እና ማጣራት የሚችል የፍለጋ ጽሑፍ መስክ።
ar_eg: حقل نصي للبحث يتيح للمستخدم البحث عبر إدخال نص، ويمكن أن يوفّر للمستخدم اقتراحات ويعمل على فلترتها.
as: এটা সন্ধান কৰিবলগীয়া পাঠৰ ক্ষেত্ৰ যিটোৱে ব্যৱহাৰকাৰীক পাঠৰ জৰিয়তে সন্ধান কৰিবলৈ দিয়ে আৰু যিটোৱে পৰামৰ্শ আগবঢ়াব আৰু ফিল্টাৰ কৰিব পাৰে।
az: İstifadəçiyə mətn daxil etməklə axtarış etməyə imkan verən və təkliflər vermək və filtrdən keçirmək imkanı verən axtarış mətni sahəsi.
be: Поле крытэрыю пошуку, якое дазваляе карыстальніку ўводзіць пошукавы тэрмін і прапануе і адфільтроўвае прапановы.
bn: সার্চ টেক্সট ফিল্ড ব্যবহারকারীকে টেক্সট লিখে সার্চ করতে দেয় এবং এটি বিভিন্ন সাজেশন অফার ও ফিল্টার করতে পারে।
bs: Polje za tekst pretraživanja koje omogućuje korisniku da pretražuje unosom teksta i koje može ponuditi i filtrirati prijedloge.
ca: Camp de text de cerca que permet a l'usuari fer cerques introduint text i que pot oferir i filtrar suggeriments.
da: Et tekstfelt til søgning, der giver brugeren mulighed for at søge ved at angive tekst, og som kan give og filtrere forslag.
es_ar: Es un campo de texto de búsqueda que permite al usuario ingresar texto para hacer búsquedas y que puede ofrecer y filtrar sugerencias.
et: Otsinguriba, mis võimaldab kasutajal teksti sisestades otsida ning saab pakkuda ja filtreerida soovitusi.
eu: Testua idatzita erabiltzaileari bilatzen uzten dion eremu; iradokizunak eskaini eta iragaz ditzake ere.
fa: فیلد نوشتاری جستجویی که به کاربر اجازه می‌دهد با وارد کردن نوشتار جستجو کند و می‌تواند پیشنهادهایی ارائه دهد و آن‌ها را فیلتر کند
fil: Field ng text ng paghahanap na nagbibigay-daan sa user na maghanap sa pamamagitan ng paglalagay ng text, at puwedeng mag-alok at mag-filter ng mga suhestyon.
fr_ca: Un champ de texte de recherche qui permet à l'utilisateur d'effectuer une recherche en entrant du texte, et qui peut proposer et filtrer des suggestions.
gl: Un campo de texto que permite que os usuarios fagan buscas poñendo texto. Pode ofrecer e filtrar suxestións.
gu: શોધ ટેક્સ્ટનું ફીલ્ડ કે જે વપરાશકર્તાને ટેક્સ્ટ દાખલ કરીને શોધ કરવા દે છે, અને તે સૂચનો ઑફર તથા ફિલ્ટર કરી શકે છે.
he: שדה טקסט לחיפוש שמאפשר למשתמש לחפש על ידי הזנת טקסט, ויש בו גם אפשרות להציג ולסנן הצעות.
hi: यह एक ऐसा सर्च टेक्स्ट फ़ील्ड है, जिसमें लोग टेक्स्ट डालकर खोज कर सकते हैं. इसमें, सुझावों के ऑफ़र मिलते हैं और फ़िल्टर लगाए जा सकते हैं.
hu: Keresési szövegmező, amely lehetővé teszi a felhasználók számára a szöveg megadásával történő keresést, valamint javaslatokat ajánlat és szűrhet.
hy: Որոնման տեքստի վանդակ, որի միջոցով օգտատերերը կարող են որոնում կատարել՝ մուտքագրելով տեքստ, և որը կարող է տրամադրել և զտել առաջարկներ։
id: Kolom teks penelusuran yang memungkinkan pengguna melakukan penelusuran dengan memasukkan teks, dan yang dapat menawarkan serta memfilter saran.
it: Un campo di testo della ricerca che consente all'utente di effettuare una ricerca inserendo del testo e che può offrire e filtrare suggerimenti.
ja: ユーザーがテキストを入力して検索できる検索テキスト フィールドです。候補を提示したり、フィルタしたりすることも可能です。
ka: ძიების ტექსტური ველი, რომელიც ეხმარება მომხმარებლებს ტექსტის შეყვანით ძიებაში, სთავაზობს და ფილტრავს შეთავაზებებს.
km: កន្លែងបញ្ចូល​ពាក្យស្វែងរកដែលអនុញ្ញាតឱ្យអ្នកប្រើប្រាស់​ស្វែងរក​ដោយបញ្ចូលអក្សរ ហើយកន្លែងបញ្ចូលនោះ​អាចផ្ដល់ជូន និងត្រង​ការណែនាំ។
kn: ಬಳಕೆದಾರರು ಹುಡುಕಲು ಪಠ್ಯವನ್ನು ನಮೂದಿಸಬಹುದಾದ ಹುಡುಕಾಟ ಪಠ್ಯ ಕ್ಷೇತ್ರ. ನೀವು ಸಲಹೆಗಳನ್ನು ಸಹ ಸೂಚಿಸಬಹುದು ಮತ್ತು ಫಿಲ್ಟರ್ ಮಾಡಬಹುದು.
ko: 사용자가 텍스트를 입력하여 검색할 수 있고 추천 검색어를 제시하고 필터링할 수 있는 검색 텍스트 입력란입니다.
ky: Колдонуучуга текстти терип издөө, сунуштарды көрүү жана аларды чыпкалоо мүмкүндүгүн берген издөө текстинин талаасы.
lo: ຫ້ອງປ້ອນຂໍ້ຄວາມການຄົ້ນຫາທີ່ຊ່ວຍໃຫ້ຜູ້ໃຊ້ຄົ້ນຫາໄດ້ໂດຍການປ້ອນຂໍ້ຄວາມ ແລະ ຍັງສາມາດສະເໜີ ແລະ ກັ່ນຕອງການແນະນຳໄດ້.
lt: Paieškos teksto laukas, kuriame naudotojas gali ieškoti vesdamas tekstą ir gali būti teikiami bei filtruojami pasiūlymai.
lv: Meklēšanas teksta lauks, kurā lietotājs var ievadīt tekstu un kurā var tikt piedāvāti un filtrēti ieteikumi.
mk: Поле за пребарување текст што му овозможува на корисникот да пребарува со внесување текст и што може да понудува и филтрира предлози.
ml: ടെക്സ്റ്റ് നൽകി തിരയാൻ ഉപയോക്താക്കളെ അനുവദിക്കുന്ന, ഫിൽട്ടർ ചെയ്യുകയും നിർദ്ദേശങ്ങൾ നൽകുകയും ചെയ്യുന്ന തിരയൽ ടെക്സ്റ്റ് ഫീൽഡ്.
mn: Хэрэглэгч текст оруулах замаар хайлт хийх боломжийг олгодог хайлтын текстийн талбар бөгөөд зөвлөмж санал болгож мөн шүүх боломжтой.
mr: शोध मजकूर फील्ड, जे वापरकर्त्याला मजकूर एंटर करून शोधू देते आणि जे सूचना देऊ व फिल्टर करू शकते.
ms: Medan teks carian yang membolehkan pengguna membuat carian dengan memasukkan teks dan yang boleh menawarkan dan menapis cadangan.
my: အသုံးပြုသူက စာရိုက်ပြီး ရှာဖွေနိုင်ကာ အကြံပြုချက်များ ကမ်းလှမ်းပေးပြီး စစ်ထုတ်စေနိုင်သော ရှာဖွေရေး စာသားအကွက်။
nb: Et søketekstfelt der brukeren kan skrive inn tekst for å søke. Feltet kan også vise og filtrere forslag.
ne: प्रयोगकर्ताले टेक्स्ट हालेर खोज्न मिल्ने र सुझावहरू प्रदान गर्न तथा फिल्टर गर्न सक्ने सर्च टेक्स्ट फिल्ड।
pa: ਖੋਜ ਲਿਖਤ ਖੇਤਰ ਜੋ ਵਰਤੋਂਕਾਰ ਦੀ ਲਿਖਤ ਦਾਖਲ ਕਰ ਕੇ ਖੋਜ ਕਰਨ ਵਿੱਚ ਮਦਦ ਕਰਦਾ ਹੈ, ਅਤੇ ਜੋ ਫਿਲਟਰ ਅਤੇ ਸੁਝਾਅ ਪੇਸ਼ ਕਰ ਸਕਦਾ ਹੈ।
pl: Pole pozwalające użytkownikowi na wpisanie tekstu do wyszukania, które może też wyświetlać i filtrować sugestie.
pt: Um campo que permite ao usuário fazer pesquisas inserindo texto e que pode oferecer e filtrar sugestões.
pt_pt: Um campo de texto de pesquisa que permite ao utilizador pesquisar ao introduzir texto e que pode oferecer e filtrar sugestões.
ro: Un câmp de text de căutare cu ajutorul căruia utilizatorul poate să caute prin introducerea de text și care poate oferi și filtra sugestii.
ru: Поле поиска, где пользователь может вводить текстовые запросы, а также просматривать и фильтровать подсказки.
si: පරිශීලකයාට පෙළ ඇතුළු කිරීමෙන් සෙවීමට ඉඩ දෙන, සහ යෝජනා ඉදිරිපත් කිරීමට සහ පෙරීමට හැකි සෙවීම් පෙළ ක්ෂේත්‍රයක්.
sk: Pomocou textového poľa môže používateľ vyhľadávať zadaním textu. Následne sa mu môžu zobraziť návrhy ponúk a filtrovania.
sq: Një fushë kërkimi teksti që e lejon përdoruesin të kërkojë duke futur tekstin dhe që mund të ofrojë dhe të filtrojë sugjerimet.
sr: Поље за текст претраге које омогућава кориснику да претражује уносом текста и које може да нуди и филтрира предлоге.
sr_latn: Polje za tekst pretrage koje omogućava korisniku da pretražuje unosom teksta i koje može da nudi i filtrira predloge.
sv: Ett sökfält där användaren kan söka genom att ange text och som kan erbjuda och filtrera förslag.
te: టెక్స్ట్‌ను ఎంటర్ చేయడం ద్వారా యూజర్‌ను సెర్చ్ చేయడానికి అనుమతించే సెర్చ్ టెక్స్ట్ ఫీల్డ్, అలాగే అది సూచనలను అందించగలదు ఇంకా ఫిల్టర్ చేయగలదు.
th: ช่องข้อความค้นหาที่ช่วยให้ผู้ใช้ค้นหาได้โดยการป้อนข้อความ ทั้งยังเสนอและกรองตัวเลือกที่แนะนำได้
tr: Kullanıcının metin girerek arama yapmasını sağlayan ve öneriler sunup filtreleme yapabilen bir arama metin alanı.
uk: Текстове поле пошуку, у якому користувач може ввести текст для пошуку, отримати й відфільтрувати пропозиції.
ur: ایک ٹیکسٹ تلاش کرنے کا فیلڈ جو صارف کو ٹیکسٹ درج کر کے تلاش کرنے کی اجازت دیتا ہے اور جو تجاویز پیش اور فلٹر کر سکتا ہے۔
uz: Foydalanuvchiga matn kiritish orqali qidirish imkonini beruvchi va takliflarni taklif qilishi va filtrlashi mumkin boʻlgan qidiruv matn maydoni.
vi: Một trường văn bản tìm kiếm cho phép người dùng tìm kiếm bằng cách nhập văn bản, ngoài ra còn có thể đưa ra và lọc các đề xuất.
zh_hk: 搜尋文字欄位可讓使用者透過輸入文字來搜尋，並可提供和篩選建議。
zu: Inkambu yombhalo wosesho evumela umsebenzisi ukuthi aseshe ngokufaka umbhalo, futhi enganikeza futhi ihlunge iziphakamiso.

# demoCupertinoSearchTextFieldPlaceholder
source: Enter some text
af: Voer ’n bietjie teks in
am: የተወሰነ ጽሑፍ ያስገቡ
ar_eg: يُرجى إدخال نص.
as: কিছুমান পাঠ দিয়ক
az: Mətn daxil edin
be: Увядзіце пошукавы тэрмін
bn: কিছু টেক্সট লিখুন
bs: Unesite neki tekst
ca: Introdueix text
da: Angiv tekst
es_ar: Ingresa texto
et: Sisestage teksti
eu: Idatzi testu bat
fa: نوشتاری وارد کنید
fil: Maglagay ng text
fr_ca: Entrez du texte
gl: Pon texto
gu: અમુક ટેક્સ્ટ દાખલ કરો
he: יש להזין טקסט
hi: कुछ टेक्स्ट डालें
hu: Írjon be szöveget
hy: Մուտքագրեք տեքստ
id: Masukkan beberapa teks
it: Inserisci del testo
ja: テキストを入力
ka: აკრიფეთ რაიმე ტექსტი
km: បញ្ចូល​អក្សរមួយចំនួន
kn: ಕೆಲವು ಪಠ್ಯವನ್ನು ನಮೂದಿಸಿ
ko: 텍스트를 입력하세요.
ky: Бир текстти териңиз
lo: ປ້ອນຂໍ້ຄວາມ
lt: Veskite tekstą
lv: Ievadiet tekstu
mk: Внесете некој текст
ml: കുറച്ച് ടെക്സ്റ്റ് നൽകുക
mn: Ямар нэгэн текст оруулна уу
mr: काही मजकूर एंटर करा
ms: Masukkan teks
my: စာသားအချို့ထည့်ပါ
nb: Skriv inn tekst
ne: केही टेक्स्ट हाल्नुहोस्
pa: ਲਿਖਤ ਦਾਖਲ ਕਰੋ
pl: Wpisz tekst
pt: Digite um texto
pt_pt: Introduza texto
ro: Introduceți text
ru: Введите текст
si: පෙළ කිහිපයක් ඇතුළු කරන්න
sk: Zadajte nejaký text
sq: Fut një tekst
sr: Унесите неки текст
sr_latn: Unesite neki tekst
sv: Skriv något
te: ఇదొక టెక్స్ట్‌ను ఎంటర్ చేయండి
th: ป้อนข้อความ
tr: Metin girin
uk: Введіть текст
ur: کچھ ٹیکسٹ درج کریں
uz: Matn kiriting
vi: Nhập nội dung văn bản
zh_hk: 輸入文字
zu: Faka umbhalo
