Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoBottomSheetHeader
source: Header
af: Loopkop
am: ራስጌ
ar_eg: العنوان
as: হেডাৰ
az: Başlıq
be: Загаловак
bn: হেডার
bs: Zaglavlje
ca: Capçalera
da: Overskrift
es_ar: Encabezado
et: Päis
eu: Goiburua
fa: عنوان
fr_ca: Titre
gl: Cabeceira
gu: હેડર
he: כותרת
hi: हेडर
hu: Fejléc
hy: Էջագլուխ
it: Intestazione
ja: ヘッダー
ka: ზედა კოლონტიტული
km: ក្បាលទំព័រ
kn: ಶಿರೋಲೇಖ
ko: 헤더
ky: Жогорку колонтитул
lo: ສ່ວນຫົວ
lt: Antraštė
lv: Galvene
mk: Заглавие
ml: തലക്കെട്ട്
mn: Толгой хэсэг
mr: शीर्षलेख
ms: Pengepala
my: ခေါင်းစီး
nb: Topptekst
ne: हेडर
pa: ਸਿਰਲੇਖ
pl: Nagłówek
pt: Cabeçalho
pt_pt: Cabeçalho
ro: Antet
ru: Заголовок
si: ශීර්ෂකය
sk: Hlavička
sq: Koka e faqes
sr: Заглавље
sr_latn: Zaglavlje
sv: Rubrik
te: ముఖ్య శీర్షిక
th: ส่วนหัว
tr: Üst bilgi
uk: Заголовок
ur: ہیڈر
uz: Yuqori sarlavha
vi: Tiêu đề
zh_hk: 頁首
zu: Unhlokweni

# demoBottomSheetItem
source: Item {value}
am: ንጥል {value}
ar_eg: السلعة {value}
as: বস্তু {value}
az: Element {value}
be: Элемент {value}
bn: আইটেম {value}
bs: Stavka {value}
ca: Article {value}
da: Vare {value}
es_ar: Artículo {value}
et: Üksus {value}
eu: Elementua: {value}
fa: مورد {value}
fr_ca: Élément {value}
gl: Artigo {value}
gu: આઇટમ {value}
he: פריט {value}
hi: आइटम {value}
hu: {value} elem
hy: {value}
it: Articolo {value}
ja: 項目 {value}
ka: ერთეული {value}
km: ធាតុទី {value}
kn: ಐಟಂ {value}
ko: 항목 {value}
ky: Нерсе {value}
lo: ລາຍການ {value}
lt: Prekė {value}
lv: Vienums {value}
mk: Ставка {value}
ml: ഇനം {value}
mn: Зүйл {value}
mr: आयटम {value}
my: ပစ္စည်း {value}
nb: Vare {value}
ne: वस्तु {value}
pa: ਆਈਟਮ {value}
pl: Element {value}
ro: Articol {value}
ru: Пункт {value}
si: අයිතමය {value}
sk: Položka {value}
sq: Artikulli {value}
sr: Ставка: {value}
sr_latn: Stavka: {value}
sv: Artikel {value}
te: వస్తువు {value}
th: รายการ {value}
tr: Ürün {value}
uk: Позиція {value}
ur: آئٹم {value}
uz: {value}-band
vi: Mặt hàng số {value}
zh_hk: 項目 {value}
zu: Into {value}

# demoBottomTextFieldsTitle
source: Text fields
af: Teksvelde
am: የጽሑፍ መስኮች
ar_eg: حقول النص
as: পাঠৰ ক্ষেত্ৰসমূহ
az: Mətn sahələri
be: Тэкставыя палі
bn: টেক্সট ফিল্ড
bs: Polja za tekst
ca: Camps de text
da: Tekstfelter
es_ar: Campos de texto
et: Tekstiväljad
eu: Testu-eremuak
fa: فیلدهای نوشتاری
fil: Mga field ng text
fr_ca: Champs de texte
gl: Campos de texto
gu: ટેક્સ્ટ ફીલ્ડ
he: שדות טקסט
hi: टेक्स्ट फ़ील्ड
hu: Szövegmezők
hy: Տեքստային դաշտեր
id: Kolom teks
it: Campi di testo
ja: テキスト欄
ka: ტექსტური ველები
km: កន្លែងបញ្ចូលអក្សរ
kn: ಪಠ್ಯ ಫೀಲ್ಡ್‌ಗಳು
ko: 입력란
ky: Текст киргизилүүчү талаалар
lo: ຊ່ອງຂໍ້ຄວາມ
lt: Teksto laukai
lv: Teksta lauki
mk: Полиња за текст
ml: ടെക്‌സ്റ്റ് ഫീൽഡുകൾ
mn: Текстийн талбар
mr: मजकूर भाग
ms: Medan teks
my: စာသားအကွက်များ
nb: Tekstfelter
ne: पाठ फिल्डहरू
pa: ਲਿਖਤ ਖੇਤਰ
pl: Pola tekstowe
pt: Campos de texto
pt_pt: Campos de texto
ro: Câmpuri de text
ru: Текстовые поля
si: පෙළ ක්ෂේත්‍ර
sk: Textové polia
sq: Fushat me tekst
sr: Поља за унос текста
sr_latn: Polja za unos teksta
sv: Textfält
te: వచన ఫీల్డ్‌లు
th: ช่องข้อความ
tr: Metin-alanları
uk: Текстові поля
ur: متن کے فیلڈز
uz: Matn maydonchalari
vi: Trường văn bản
zh_hk: 文字欄位
zu: Izinkambu zombhalo

# demoTextFieldTitle
source: Text fields
af: Teksvelde
am: የጽሑፍ መስኮች
ar_eg: حقول النص
as: পাঠৰ ক্ষেত্ৰসমূহ
az: Mətn sahələri
be: Тэкставыя палі
bn: টেক্সট ফিল্ড
bs: Polja za tekst
ca: Camps de text
da: Tekstfelter
es_ar: Campos de texto
et: Tekstiväljad
eu: Testu-eremuak
fa: فیلدهای نوشتاری
fil: Mga field ng text
fr_ca: Champs de texte
gl: Campos de texto
gu: ટેક્સ્ટ ફીલ્ડ
he: שדות טקסט
hi: टेक्स्ट फ़ील्ड
hu: Szövegmezők
hy: Տեքստային դաշտեր
id: Kolom teks
it: Campi di testo
ja: テキスト欄
ka: ტექსტური ველები
km: កន្លែងបញ្ចូលអក្សរ
kn: ಪಠ್ಯ ಫೀಲ್ಡ್‌ಗಳು
ko: 입력란
ky: Текст киргизилүүчү талаалар
lo: ຊ່ອງຂໍ້ຄວາມ
lt: Teksto laukai
lv: Teksta lauki
mk: Полиња за текст
ml: ടെക്‌സ്റ്റ് ഫീൽഡുകൾ
mn: Текстийн талбар
mr: मजकूर भाग
ms: Medan teks
my: စာသားအကွက်များ
nb: Tekstfelter
ne: पाठ फिल्डहरू
pa: ਲਿਖਤ ਖੇਤਰ
pl: Pola tekstowe
pt: Campos de texto
pt_pt: Campos de texto
ro: Câmpuri de text
ru: Текстовые поля
si: පෙළ ක්ෂේත්‍ර
sk: Textové polia
sq: Fushat me tekst
sr: Поља за унос текста
sr_latn: Polja za unos teksta
sv: Textfält
te: వచన ఫీల్డ్‌లు
th: ช่องข้อความ
tr: Metin-alanları
uk: Текстові поля
ur: متن کے فیلڈز
uz: Matn maydonchalari
vi: Trường văn bản
zh_hk: 文字欄位
zu: Izinkambu zombhalo

# demoTextFieldSubtitle
source: Single line of editable text and numbers
af: Een reël met redigeerbare teks en syfers
am: አርትዖት ሊደረግባቸው የሚችሉ የጽሑፍ እና ቁጥሮች ነጠላ መስመር
ar_eg: سطر واحد من النص والأرقام القابلة للتعديل
as: সম্পাদনা কৰিব পৰা পাঠ আৰু সংখ্যাসমূহৰ একক শাৰী
az: Redaktə edilə bilən mətn və rəqəmlərdən ibarət tək sıra
be: Адзін радок тэксту і лічбаў, якія можна змяніць
bn: এডিট করা যাবে এমন টেক্সট ও নম্বরের সিঙ্গল লাইন
bs: Jedan red teksta i brojeva koji se mogu uređivati
ca: Línia de text i xifres editables
da: En enkelt linje med tekst og tal, der kan redigeres
es_ar: Línea única de texto y números editables
et: Üks rida muudetavat teksti ja numbreid
eu: Testu eta zenbakien lerro editagarri bakarra
fa: یک خط نوشتار و ارقام قابل‌ویرایش
fil: Isang linya ng mae-edit na text at mga numero
fr_ca: Une seule ligne de texte et de chiffres modifiables
gl: Unha soa liña de texto editable e números
gu: ફેરફાર કરી શકાય તેવા ટેક્સ્ટ અને નંબરની સિંગલ લાઇન
he: שורה יחידה של מספרים וטקסט שניתן לערוך
hi: बदलाव किए जा सकने वाले टेक्स्ट और संख्याओं के लिए एक पंक्ति
hu: Egy sornyi szerkeszthető szöveg és számok
hy: Տեքստի և թվերի խմբագրման մեկ տող
id: Baris tunggal teks dan angka yang dapat diedit
it: Singola riga di testo modificabile e numeri
ja: 1 行（編集可能な文字と数字）
ka: რედაქტირებადი ტექსტისა და რიცხვების ერთი ხაზი
km: បន្ទាត់តែមួយ​នៃអក្សរ និងលេខដែល​អាចកែបាន
kn: ಎಡಿಟ್ ಮಾಡಬಹುದಾದ ಪಠ್ಯ ಮತ್ತು ಸಂಖ್ಯೆಗಳ ಏಕ ಸಾಲು
ko: 편집 가능한 텍스트와 숫자 행 1개
ky: Түзөтүлүүчү текст жана сандардан турган жалгыз сап
lo: ຂໍ້ຄວາມ ແລະ ຕົວເລກທີ່ແກ້ໄຂໄດ້ແຖວດຽວ
lt: Viena redaguojamo teksto ar skaičių eilutė
lv: Viena rinda teksta un ciparu rediģēšanai
mk: Еден ред текст и броеви што може да се изменуваат
ml: എഡിറ്റ് ചെയ്യാവുന്ന ടെക്‌സ്‌റ്റിന്റെയും അക്കങ്ങളുടെയും ഒറ്റ വരി
mn: Засах боломжтой текст болон дугаарын нэг мөр
mr: संपादित करता येणार्‍या मजकूर आणि अंकांची एकच ओळ
ms: Teks dan nombor boleh edit bagi garisan tunggal
my: တည်းဖြတ်နိုင်သော စာသားနှင့် နံပါတ်စာကြောင်းတစ်ကြောင်း
nb: Enkel linje med redigerbar tekst og redigerbare tall
ne: सम्पादन गर्न मिल्ने पाठ तथा अङ्कहरू समावेश भएको एउटा हरफ
pa: ਸੰਪਾਦਨਯੋਗ ਲਿਖਤ ਅਤੇ ਨੰਬਰਾਂ ਦੀ ਇਕਹਿਰੀ ਲਾਈਨ
pl: Pojedynczy, edytowalny wiersz tekstowo-liczbowy
pt: Uma linha de números e texto editáveis
pt_pt: Única linha de texto e números editáveis.
ro: Un singur rând de text și cifre editabile
ru: Одна строка для редактирования текста и чисел
si: සංස්කරණය කළ හැකි පෙළ සහ අංකවල තනි පේළිය
sk: Jeden riadok upraviteľného textu a čísel
sq: Një rresht me tekst dhe numra të redaktueshëm
sr: Један ред текста и бројева који могу да се измене
sr_latn: Jedan red teksta i brojeva koji mogu da se izmene
sv: Enkelrad med text och siffror som kan redigeras
te: సవరించదగిన వచనం, సంఖ్యలు కలిగి ఉన్న ఒకే పంక్తి
th: บรรทัดข้อความและตัวเลขที่แก้ไขได้
tr: Tek satır düzenlenebilir metin ve sayılar
uk: Один рядок тексту й цифр, які можна змінити
ur: قابل ترمیم متن اور نمبرز کے لیے واحد لائن
uz: Harf va raqamlarni tahrirlash uchun bitta qator
vi: Một dòng gồm chữ và số chỉnh sửa được
zh_hk: 單行可編輯的文字和數字
zu: Umugqa owodwa wombhalo ohlelekayo nezinombolo

# demoTextFieldDescription
source: Text fields allow users to enter text into a UI. They typically appear in forms and dialogs.
af: Teksvelde laat gebruikers toe om teks by UI te voeg. Dit verskyn gewoonlik in vorms en dialoë.
am: የጽሑፍ መስኮች ተጠቃሚዎች ቃላትን ወደ ዩአይ እንዲያስገቡ ያስችላቸዋል። በተለምዶ በቅጾች እና በመገናኛዎች ውስጥ ይታያሉ።
ar_eg: تسمح حقول النص للمستخدمين بإدخال نص في واجهة مستخدم. وتظهر عادةً في النماذج ومربّعات الحوار.
as: পাঠ ক্ষেত্ৰসমূহে ব্যৱহাৰকাৰীসকলক এটা ইউআইত পাঠ ভৰাবলৈ দিয়ে। সেইবোৰ সাধাৰণতে ফর্ম আৰু ডায়ল’গসমূহত দেখা পোৱা যায়।
az: Mətn sahələri istifadəçilərə İstifadəçi İnterfeysinə mətn daxil etmək imkanı verir. Onlar, əsasən, forma və dialoqlarda görünür.
be: Тэкставыя палі дазваляюць карыстальнікам уводзіць тэкст у карыстальніцкі інтэрфейс. Звычайна яны паяўляюцца ў формах і дыялогавых вокнах.
bn: টেক্সট ফিল্ড ব্যবহারকারীকে UI-এ টেক্সট লেখার অনুমতি দেয়। সেগুলি সাধারণত ফর্ম ও ডায়ালগ হিসেবে দেখা যায়।
bs: Polja za tekst omogućavaju korisnicima da unesu tekst u korisnički interfejs. Obično su u obliku obrazaca i dijaloških okvira.
ca: Els camps de text permeten als usuaris introduir text en una interfície d'usuari. Normalment s'inclouen en formularis i quadres de diàleg.
da: Tekstfelterne giver brugerne mulighed for at angive tekst i en brugerflade. De vises normalt i formularer og dialogbokse.
es_ar: Los campos de texto permiten que los usuarios escriban en una IU. Suelen aparecer en diálogos y formularios.
et: Tekstiväljad võimaldavad kasutajatel kasutajaliideses teksti sisestada. Need kuvatakse tavaliselt vormides ja dialoogides.
eu: Testu-eremuen bidez, erabiltzaileek testua idatz dezakete erabiltzaile-interfaze batean. Inprimaki eta leiho gisa agertu ohi dira.
fa: فیلدهای نوشتاری به کاربران امکان می‌دهد نوشتار را در واسط کاربر وارد کنند. معمولاً به‌صورت فرم‌ها و کادرهای گفتگو ظاهر می‌شوند.
fil: Ang mga field ng text ay nagbibigay-daan sa mga user na maglagay ng text sa UI. Karaniwang makikita ang mga ito sa mga form at dialog.
fr_ca: Les champs de texte permettent aux utilisateurs d'entrer du texte dans une interface utilisateur. Ils figurent généralement dans des formulaires et des boîtes de dialogue.
gl: Os campos de texto permiten aos usuarios escribir texto nunha IU. Adoitan aparecer en formularios e cadros de diálogo.
gu: ટેક્સ્ટ ફીલ્ડ વડે વપરાશકર્તાઓ UIમાં ટેક્સ્ટ દાખલ કરી શકે છે. સામાન્ય રીતે તે ફોર્મ અને સંવાદમાં આવતા હોય છે.
he: שדות טקסט מאפשרים למשתמשים להזין טקסט לממשק משתמש. לרוב הם מופיעים בטפסים ובתיבות דו-שיח.
hi: टेक्स्ट फ़ील्ड, उपयोगकर्ताओं को यूज़र इंटरफ़ेस (यूआई) में टेक्स्ट डालने की सुविधा देता है. ये फ़ॉर्म या डायलॉग की तरह दिखाई देते हैं.
hu: A szöveges mezők segítségével a felhasználók szöveget adhatnak meg egy kezelőfelületen. Jellemzően az űrlapokon és párbeszédpanelekben jelennek meg.
hy: Տեքստային դաշտերի օգնությամբ օգտատերերը կարող են լրացնել ձևեր և մուտքագրել տվյալներ երկխոսության պատուհաններում։
id: Kolom teks memungkinkan pengguna memasukkan teks menjadi UI. UI tersebut biasanya muncul dalam bentuk formulir dan dialog.
it: I campi di testo consentono agli utenti di inserire testo in un'interfaccia utente e sono generalmente presenti in moduli e finestre di dialogo.
ja: テキスト欄では、ユーザーが UI にテキストを入力できます。一般にフォームやダイアログで表示されます。
ka: ტექსტური ველები მომხმარებლებს UI-ში ტექსტის შეყვანის საშუალებას აძლევს. როგორც წესი, ისინი ჩნდება ფორმებსა და დიალოგებში.
km: កន្លែងបញ្ចូលអក្សរ​អាចឱ្យអ្នកប្រើប្រាស់​បញ្ចូលអក្សរ​ទៅក្នុង UI។ ជាទូទៅ វាបង្ហាញ​ជាទម្រង់បែបបទ និងប្រអប់បញ្ចូល។
kn: ಪಠ್ಯ ಫೀಲ್ಡ್‌ಗಳು, ಬಳಕೆದಾರರಿಗೆ UI ನಲ್ಲಿ ಪಠ್ಯವನ್ನು ನಮೂದಿಸಲು ಅನುಮತಿಸುತ್ತದೆ. ಅವುಗಳು ಸಾಮಾನ್ಯವಾಗಿ ಫಾರ್ಮ್‌ಗಳು ಮತ್ತು ಡೈಲಾಗ್‌ಗಳಲ್ಲಿ ಕಾಣಿಸಿಕೊಳ್ಳುತ್ತವೆ.
ko: 사용자는 입력란을 통해 UI에 텍스트를 입력할 수 있습니다. 일반적으로 양식 및 대화상자로 표시됩니다.
ky: Текст киргизилүүчү талаалар аркылуу колдонуучулар колдонуучу интерфейсине текст киргизе алышат. Адатта алар диалог формасында көрүнөт.
lo: ຊ່ອງຂໍ້ຄວາມຈະເຮັດໃຫ້ຜູ້ໃຊ້ສາມາດພິມຂໍ້ຄວາມໄປໃສ່ສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ໄດ້. ປົກກະຕິພວກມັນຈະປາກົດໃນແບບຟອມ ແລະ ກ່ອງໂຕ້ຕອບຕ່າງໆ.
lt: Naudotojas gali įvesti tekstą į NS per teksto laukus. Jie paprastai naudojami formose ir dialogo languose.
lv: Izmantojot teksta laukus, lietotāji var ievadīt lietotāja saskarnē tekstu. Parasti tie tiek rādīti veidlapās vai dialoglodziņos.
mk: Полињата за текст им овозможуваат на корисниците да внесуваат текст во корисничкиот интерфејс. Обично се појавуваат во формулари и дијалози.
ml: UI-ലേക്ക് ടെക്സ്റ്റ് ചേർക്കാൻ ടെക്സ്റ്റ് ഫീൽഡുകൾ ഉപയോക്താക്കളെ അനുവദിക്കുന്നു. അവ സാധാരണയായി ഫോമുകളിലും ഡയലോഗുകളിലും പ്രത്യക്ഷപ്പെടുന്നു.
mn: Текстийн талбар нь хэрэглэгчид UI-д текст оруулах боломжийг олгодог. Эдгээр нь ихэвчлэн маягт болон харилцах цонхонд гарч ирдэг.
mr: मजकूर भाग वापरकर्त्यांना UI मध्ये मजकूर एंटर करू देतात. ते सर्वसाधारणपणे फॉर्म आणि डायलॉगमध्ये दिसतात.
ms: Medan teks membolehkan pengguna memasukkan teks ke dalam UI. Medan teks ini biasanya dipaparkan dalam borang dan dialog.
my: စာသားအကွက်များသည် UI သို့ စာသားများထည့်သွင်းရန် အသုံးပြုသူအား ခွင့်ပြုသည်။ ၎င်းတို့ကို ဖောင်များနှင့် ဒိုင်ယာလော့ဂ်များတွင် ယေဘုယျအားဖြင့် တွေ့ရသည်။
nb: Tekstfelt lar brukere skrive inn tekst i et UI. De vises vanligvis i skjemaer og dialogbokser.
ne: पाठका फिल्डहरूले प्रयोगकर्तालाई UI मा पाठ प्रविष्टि गर्न दिन्छन्। सामान्यतया तिनीहरू फारम वा संवादका रूपमा देखा पर्छन्।
pa: ਲਿਖਤ ਖੇਤਰ ਵਰਤੋਂਕਾਰਾਂ ਨੂੰ UI ਵਿੱਚ ਲਿਖਤ ਦਾਖਲ ਕਰਨ ਦਿੰਦੇ ਹਨ। ਉਹ ਆਮ ਕਰਕੇ ਵਿੰਡੋ ਅਤੇ ਫ਼ਾਰਮਾਂ ਵਿੱਚ ਦਿਸਦੇ ਹਨ।
pl: Pola tekstowe w interfejsie pozwalają użytkownikom wpisywać tekst. Zazwyczaj używa się ich w formularzach i oknach.
pt: Os campos de texto permitem que o usuário digite texto em uma IU. Eles geralmente aparecem em formulários e caixas de diálogo.
pt_pt: Os campos de texto permitem aos utilizadores introduzirem texto numa IU. Normalmente, são apresentados em formulários e caixas de diálogo.
ro: Câmpurile de text le dau utilizatorilor posibilitatea de a introduce text pe o interfață de utilizare. Acestea apar de obicei în forme și casete de dialog.
ru: С помощью текстовых полей пользователи могут заполнять формы и вводить данные в диалоговых окнах.
si: පෙළ ක්ෂේත්‍ර පරිශීලකයන්ට පෙළ UI එකකට ඇතුළු කිරීමට ඉඩ දෙයි. ඒවා සාමාන්‍යයෙන් ආකෘති සහ සංවාදවල දිස් වේ.
sk: Textové polia umožňujú používateľom zadávať text do používateľského rozhrania. Zvyčajne sa nachádzajú vo formulároch a dialógových oknách.
sq: Fushat me tekst i lejojnë përdoruesit të fusin tekst në një ndërfaqe përdoruesi. Ato normalisht shfaqen në formularë dhe dialogë.
sr: Поља за унос текста омогућавају корисницима да унесу текст у кориснички интерфејс. Обично се приказују у облику образаца и дијалога.
sr_latn: Polja za unos teksta omogućavaju korisnicima da unesu tekst u korisnički interfejs. Obično se prikazuju u obliku obrazaca i dijaloga.
sv: Med textfält kan användare ange text i ett användargränssnitt. De används vanligtvis i formulär och dialogrutor.
te: వచన ఫీల్డ్‌లు అన్నవి వినియోగదారులు వచనాన్ని UIలో ఎంటర్ చేయడానికి వీలు కల్పిస్తాయి. అవి సాధారణంగా ఫారమ్‌లు, డైలాగ్‌లలో కనిపిస్తాయి.
th: ช่องข้อความให้ผู้ใช้ป้อนข้อความใน UI ซึ่งมักปรากฏอยู่ในฟอร์มและกล่องโต้ตอบ
tr: Metin alanları, kullanıcıların bir kullanıcı arayüzüne metin girmesini sağlar. Genellikle formlarda ve iletişim kutularında görünürler.
uk: Користувачі можуть вводити текст у текстові поля. Зазвичай вони з'являються у формах і вікнах.
ur: متں کی فیلڈز صارفین کو متن کو UI میں درج کرنے کی اجازت دیتی ہیں۔ وہ عام طور پر فارمز اور ڈائیلاگز میں ظاہر ہوتے ہیں۔
uz: Matn kiritish maydonchalari yordamida foydalanuvchilar grafik interfeysga matn kirita olishadi. Ular odatda shakl va muloqot oynalari shaklida chiqadi.
vi: Các trường văn bản cho phép người dùng nhập văn bản vào giao diện người dùng. Những trường này thường xuất hiện trong các biểu mẫu và hộp thoại.
zh_hk: 文字欄位讓使用者將文字輸入至使用者界面，通常在表格和對話框中出現。
zu: Izinkambu zombhalo zivumela abasebenzisi ukufaka umbhalo ku-UI. Ibonakala kumafomu nezingxoxo.

# demoTextFieldShowPasswordLabel
source: Show password
af: Wys wagwoord
am: የይለፍ ቃል አሳይ
ar_eg: عرض كلمة المرور
as: পাছৱৰ্ডটো দেখুৱাওক
az: Parol görünsün
be: Паказаць пароль
bn: পাসওয়ার্ড দেখুন
bs: Prikaži lozinku
ca: Mostra la contrasenya
da: Vis adgangskode
es_ar: Mostrar contraseña
et: Kuva parool
eu: Erakutsi pasahitza
fa: نمایش گذرواژه
fil: Ipakita ang password
fr_ca: Afficher le mot de passe
gl: Mostrar contrasinal
gu: પાસવર્ડ બતાવો
he: הצגת סיסמה
hi: पासवर्ड दिखाएं
hu: Jelszó megjelenítése
hy: Ցույց տալ գաղտնաբառը
id: Tampilkan sandi
it: Mostra password
ja: パスワードを表示
ka: პაროლის გამოჩენა
km: បង្ហាញពាក្យសម្ងាត់
kn: ಪಾಸ್‌ವರ್ಡ್ ತೋರಿಸಿ
ko: 비밀번호 표시
ky: Сырсөздү көрсөтүү
lo: ສະແດງລະຫັດຜ່ານ
lt: Rodyti slaptažodį
lv: Rādīt paroli
mk: Прикажи ја лозинката
ml: പാസ്‌വേഡ് കാണിക്കുക
mn: Нууц үгийг харуулах
mr: पासवर्ड दाखवा
ms: Tunjukkan kata laluan
my: စကားဝှက်ကို ပြရန်
nb: Se passordet
ne: पासवर्ड देखाउनुहोस्
pa: ਪਾਸਵਰਡ ਦਿਖਾਓ
pl: Pokaż hasło
pt: Mostrar senha
pt_pt: Mostrar palavra-passe
ro: Afișați parola
ru: Показать пароль
si: මුරපදය පෙන්වන්න
sk: Zobraziť heslo
sq: Shfaq fjalëkalimin
sr: Прикажи лозинку
sr_latn: Prikaži lozinku
sv: Visa lösenord
te: పాస్‌వర్డ్‌ను చూపుతుంది
th: แสดงรหัสผ่าน
tr: Şifreyi göster
uk: Показати пароль
ur: پاس ورڈ دکھائیں
uz: Parolni koʻrsatish
vi: Hiện mật khẩu
zh_hk: 顯示密碼
zu: Bonisa iphasiwedi

# demoTextFieldHidePasswordLabel
source: Hide password
af: Versteek wagwoord
am: የይለፍ ቃል ደብቅ
ar_eg: إخفاء كلمة المرور
as: পাছৱৰ্ডটো লুকুৱাওক
az: Parolu gizlədin
be: Схаваць пароль
bn: পাসওয়ার্ড লুকান
bs: Sakrivanje lozinke
ca: Amaga la contrasenya
da: Skjul adgangskode
es_ar: Ocultar contraseña
et: Peida parool
eu: Ezkutatu pasahitza
fa: پنهان کردن گذرواژه
fil: Itago ang password
fr_ca: Masquer le mot de passe
gl: Ocultar contrasinal
gu: પાસવર્ડ છુપાવો
he: הסתרת הסיסמה
hi: पासवर्ड छिपाएं
hu: Jelszó elrejtése
hy: Թաքցնել գաղտնաբառը
id: Sembunyikan sandi
it: Nascondi password
ja: パスワードを隠す
ka: პაროლის დამალვა
km: លាក់​ពាក្យ​សម្ងាត់
kn: ಪಾಸ್‌ವರ್ಡ್ ಮರೆ ಮಾಡಿ
ko: 비밀번호 숨기기
ky: Сырсөздү жашыруу
lo: ເຊື່ອງລະຫັດຜ່ານ
lt: Slėpti slaptažodį
lv: Slēpt paroli
mk: Сокријте ја лозинката
ml: പാസ്‍വേഡ് മറയ്ക്കുക
mn: Нууц үгийг нуух
mr: पासवर्ड लपवा
ms: Sembunyikan kata laluan
my: စကားဝှက်ကို ဖျောက်ရန်
nb: Skjul passordet
ne: पासवर्ड लुकाउनुहोस्
pa: ਪਾਸਵਰਡ ਲੁਕਾਓ
pl: Ukryj hasło
pt: Ocultar senha
pt_pt: Ocultar palavra-passe
ro: Ascundeți parola
ru: Скрыть пароль
si: මුරපදය සඟවන්න
sk: Skryť heslo
sq: Fshih fjalëkalimin
sr: Сакриј лозинку
sr_latn: Sakrij lozinku
sv: Dölj lösenord
te: పాస్‌వర్డ్‌ను దాస్తుంది
th: ซ่อนรหัสผ่าน
tr: Şifreyi gizle
uk: Сховати пароль
ur: پاس ورڈ چھپائیں
uz: Parolni berkitish
vi: Ẩn mật khẩu
zh_hk: 隱藏密碼
zu: Fihla iphasiwedi

# demoTextFieldFormErrors
source: Please fix the errors in red before submitting.
af: Maak asseblief die foute in rooi reg voordat jy indien.
am: ከማስገባትዎ በፊት እባክዎ በቀይ ያሉትን ስህተቶች ያስተካክሉ።
ar_eg: يُرجى تصحيح الأخطاء باللون الأحمر قبل الإرسال.
as: দাখিল কৰাৰ আগতে অনুগ্ৰহ কৰি ৰঙা হৈ থকা আসোঁৱাহসমূহ সমাধান কৰক।
az: Təqdim etməzdən əvvəl qırmızı rəngdə olan xətalara düzəliş edin.
be: Перад адпраўкай выправіце памылкі, пазначаныя чырвоным колерам.
bn: জমা দেওয়ার আগে লাল রঙের ভুলগুলি সংশোধন করুন।
bs: Prije slanja, ispravite greške označene crvenom bojom.
ca: Resol els errors marcats en vermell abans d'enviar el formulari.
da: Ret de fejl, der er angivet med rød farve, før du sender.
es_ar: Antes de enviar, corrige los errores marcados con rojo.
et: Enne esitamist parandage punasega märgitud vead.
eu: Bidali baino lehen, konpondu gorriz ageri diren erroreak.
fa: لطفاً خطاهای قرمزرنگ را قبل از ارسال برطرف کنید.
fil: Pakiayos ang mga error na kulay pula bago magsumite.
fr_ca: Veuillez corriger les erreurs en rouge avant de réessayer.
gl: Corrixe os erros marcados en vermello antes de enviar.
gu: સબમિટ કરતા પહેલાં કૃપા કરીને લાલ રંગે દર્શાવેલી ભૂલો ઠીક કરો.
he: יש לתקן את השגיאות באדום לפני השליחה.
hi: कृपया सबमिट करने से पहले लाल रंग में दिखाई गई गड़बड़ियों को ठीक करें.
hu: Kérjük, javítsa ki a piros színű hibákat a beküldés előtt.
hy: Նախքան ձևն ուղարկելը շտկեք կարմիր գույնով նշված սխալները։
id: Perbaiki error dalam warna merah sebelum mengirim.
it: Correggi gli errori in rosso prima di inviare il modulo.
ja: 送信する前に赤色で表示されたエラーを修正してください。
ka: გთხოვთ, გადაგზავნამდე გაასწოროთ შეცდომები.
km: សូមដោះស្រាយ​បញ្ហាពណ៌ក្រហម មុនពេលដាក់​បញ្ជូន។
kn: ಸಲ್ಲಿಸುವ ಮೊದಲು ಕೆಂಪು ಬಣ್ಣದಲ್ಲಿರುವ ದೋಷಗಳನ್ನು ಸರಿಪಡಿಸಿ.
ko: 제출하기 전에 빨간색으로 표시된 오류를 수정해 주세요.
ky: Тапшыруудан мурда кызыл болуп белгиленген каталарды оңдоңуз.
lo: ກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດສີແດງກ່ອນການສົ່ງຂໍ້ມູນ.
lt: Prieš pateikdami ištaisykite raudonai pažymėtas klaidas.
lv: Pirms iesniegšanas, lūdzu, labojiet kļūdas sarkanā krāsā.
mk: Поправете ги грешките означени со црвено пред да испратите.
ml: സമർപ്പിക്കുന്നതിന് മുമ്പ് ചുവപ്പ് നിറത്തിൽ അടയാളപ്പെടുത്തിയ പിശകുകൾ പരിഹരിക്കുക.
mn: Илгээхээсээ өмнө улаанаар тэмдэглэсэн алдаануудыг засна уу.
mr: सबमिट करण्यापूर्वी लाल रंगातील एरर दुरुस्त करा.
ms: Sila betulkan ralat yang berwarna merah sebelum serahan.
my: မပေးပို့မီ အနီရောင်ဖြင့်ပြထားသော အမှားများကို ပြင်ပါ။
nb: Rett opp problemene i rødt før du sender inn.
ne: कृपया पेस गर्नुअघि रातो रङले इङ्गित गरिएका त्रुटिहरू सच्याउनुहोस्।
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਪੁਰਦ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਲਾਲ ਰੰਗ ਵਾਲੀਆਂ ਗੜਬੜਾਂ ਨੂੰ ਠੀਕ ਕਰੋ।
pl: Zanim ponownie prześlesz formularz, popraw błędy oznaczone na czerwono.
pt: Corrija os erros em vermelho antes de enviar.
pt_pt: Corrija os erros a vermelho antes de enviar.
ro: Remediați erorile evidențiate cu roșu înainte de trimitere.
ru: Прежде чем отправлять форму, исправьте ошибки, отмеченные красным цветом.
si: ඉදිරිපත් කිරීමට පෙර කරුණාකර දෝෂ රතු පැහැයෙන් නිවැරදි කරන්න.
sk: Pred odoslaním odstráňte chyby označené červenou.
sq: Rregullo gabimet me të kuqe përpara se ta dërgosh.
sr: Пре слања исправите грешке означене црвеном бојом.
sr_latn: Pre slanja ispravite greške označene crvenom bojom.
sv: Åtgärda rödmarkerade fel innan du skickar in.
te: సమర్పించే ముందు దయచేసి ఎరుపు రంగులో సూచించిన ఎర్రర్‌లను పరిష్కరించండి.
th: โปรดแก้ไขข้อผิดพลาดที่แสดงเป็นสีแดงก่อนส่ง
tr: Göndermeden önce lütfen kırmızı renkle belirtilen hataları düzeltin
uk: Перш ніж надсилати, виправте помилки, позначені червоним кольором.
ur: براہ کرم جمع کرانے سے پہلے سرخ رنگ کی خرابیوں کو درست کریں۔
uz: Yuborishdan oldin qizil bilan ajratilgan xatolarni tuzating.
vi: Vui lòng sửa các trường hiển thị lỗi màu đỏ trước khi gửi.
zh_hk: 在提交前，請修正以紅色標示的錯誤。
zu: Sicela ulungise amaphutha abomvu ngaphambi kokuhambisa.

# demoTextFieldNameRequired
source: Name is required.
af: Naam word vereis.
am: ስም ያስፈልጋል።
ar_eg: الاسم مطلوب.
as: নামটো আৱশ্যক।
az: Ad tələb edilir.
be: Увядзіце назву.
bn: নাম লিখতে হবে।
bs: Ime je obavezno.
ca: El nom és obligatori.
da: Du skal angive et navn.
es_ar: El nombre es obligatorio.
et: Nimi on nõutav.
eu: Izena behar da.
fa: نام لازم است.
fil: Kinakailangan ang pangalan.
fr_ca: Veuillez entrer un nom.
gl: É necesario indicar un nome.
gu: નામ જરૂરી છે.
he: יש להזין שם.
hi: नाम डालना ज़रूरी है.
hu: A név megadása kötelező.
hy: Մուտքագրեք անունը (պարտադիր է)։
id: Nama wajib diisi.
it: Il nome è obbligatorio.
ja: 名前は必須です。
ka: საჭიროა სახელი.
km: តម្រូវ​ឱ្យ​មាន​ឈ្មោះ។
kn: ಹೆಸರು ಅಗತ್ಯವಿದೆ.
ko: 이름을 입력해야 합니다.
ky: Аталышы талап кылынат.
lo: ຕ້ອງລະບຸຊື່.
lt: Būtina nurodyti vardą ir pavardę.
lv: Ir jāievada vārds.
mk: Потребно е име.
ml: പേര് ആവശ്യമാണ്.
mn: Нэр оруулах шаардлагатай.
mr: नाव आवश्‍यक आहे.
ms: Nama diperlukan.
my: အမည် လိုအပ်ပါသည်။
nb: Navn er obligatorisk.
ne: नाम अनिवार्य छ।
pa: ਨਾਮ ਲੋੜੀਂਦਾ ਹੈ।
pl: Imię i nazwisko są wymagane.
pt: O campo "Nome" é obrigatório.
pt_pt: É necessário o nome.
ro: Numele este obligatoriu.
ru: Введите имя.
si: නම අවශ්‍යයි.
sk: Meno je povinné.
sq: Emri është i nevojshëm.
sr: Име је обавезно.
sr_latn: Ime je obavezno.
sv: Du måste ange namn.
te: పేరు అవసరం.
th: ต้องระบุชื่อ
tr: Ad gerekli.
uk: Укажіть своє ім'я.
ur: نام درکار ہے۔
uz: Ismni kiriting.
vi: Bạn phải nhập tên.
zh_hk: 必須提供名稱。
zu: Igama liyadingeka.
