Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoBannerDescription
source: A banner displays an important, succinct message, and provides actions for users to address (or dismiss the banner). A user action is required for it to be dismissed.
af: 'n Banier vertoon 'n belangrike, bondige boodskap en verskaf handelinge waaraan gebruikers moet aandag gee (of hulle moet die banier toemaak). 'n Gebruikerhandeling word vereis om dit toe te maak.
am: አንድ ሰንደቅ አስፈላጊና እጥር ምጥን ያለ መልዕክት ያሳያል፣ እና ተጠቃሚዎች የሆነ ነገር የሚያደርጓቸውን እርምጃዎች ያቀርብላቸዋል (ወይም ሰንደቁን ያሰናብታል)። እሱን ለማሰናበት የተጠቃሚ እርምጃ ያስፈልጋል።
ar_eg: يعرض البانر رسالة مهمة ومختصرة، كما يقدّم إجراءات يمكن للمستخدمين اتخاذها (أو تجاهل البانر). يجب أن يتخذ المستخدم إجراء ليتم تجاهل البانر.
as: এখন বেনাৰে কোনো গুৰুত্বপূৰ্ণ, সংক্ষিপ্ত বাৰ্তা দেখুৱায় আৰু ব্যৱহাৰকাৰীসকলৰ বাবে বিষয়টো সম্বোধন কৰাৰ (অথবা বেনাৰখন অগ্ৰাহ্য কৰাৰ) কার্যসমূহ প্ৰদান কৰে। এইটো অগ্ৰাহ্য কৰিবলৈ এটা ব্যৱহাৰকাৰীৰ কাৰ্যৰ আৱশ্যক হয়।
az: Banner vacib, qısa mesajı göstərir və istifadəçilərə yönləndirmə (və ya banneri rədd etmə) üzrə əməliyyatlar təqdim edir. Rədd edilməsi üçün istifadəçi əməliyyatı tələb edilir.
be: У банеры паказваецца важнае кароткае паведамленне і прапануюцца дзеянні карыстальніку (адкрыць або адхіліць банер). Каб адхіліць, карыстальнік павінен выканаць дзеянне.
bn: ব্যানার গুরুত্বপূর্ণ, সংক্ষিপ্ত অথচ স্পষ্ট মেসেজে দেখায় এবং সেটি নিয়ে কিছু করতে (বা ব্যানার খারিজ করতে) ব্যবহারকারীদের সুযোগ দেয়। ব্যানার খারিজ করতে ব্যবহারকারীকে পদক্ষেপ নিতে হবে।
bs: Baner prikazuje važnu i sažetu poruku i navodi radnje koje korisnici mogu izvršiti (ili mogu odbaciti baner). Za odbacivanje banera je potrebna radnja korisnika.
ca: Un bàner mostra un missatge breu important i proporciona als usuaris accions per dur a terme (o per ignorar el bàner). Per poder-lo ignorar, l'usuari ha de fer una acció.
da: Et banner viser en vigtig og kortfattet meddelelse og viser de handlinger, som brugerne skal foretage (eller de kan lukke banneret). Der skal foretages en brugerhandling for at lukke banneret.
es_ar: Los banners muestran mensajes importantes y breves con acciones para realizar. Se requiere una acción del usuario para descartarlos.
et: Bänneril kuvatakse oluline ja lakooniline sõnum ning pakutakse kasutajatele toiminguid probleemi lahendamiseks (või bännerist loobumiseks). Bännerist loobumiseks on nõutav kasutaja toiming.
eu: Bandek mezu garrantzitsu eta laburrak bistaratzen dituzte, eta erabiltzaileek gauzatu beharreko ekintzak adierazten. Bandak baztertu egin daitezke; baina ez beren kabuz, erabiltzaileek hala adierazita baizik.
fa: برنما پیامی مهم و مختصر را نمایش می‌دهد و کنش‌هایی را برای انجام دادن دراختیار کاربران قرار می‌دهد (همچنین کاربران می‌توانند برنما را رد کنند). برای رد کردن برنما، کاربر باید کنشی انجام دهد.
fil: Ang isang banner ay nagpapakita ng mahalaga at malinaw na mensahe at nagbibigay ito ng mga pagkilos para sa mga user para tugunan (o i-dismiss ang banner). Kinakailangan ng pagkilos ng user para ma-dismiss ito.
fr_ca: Une bannière comporte un message court mais important, ainsi que des suggestions d'actions pour les utilisateurs (ou une option permettant de fermer la bannière). L'utilisateur doit agir pour que la bannière disparaisse.
gl: Un báner mostra unha mensaxe importante e concisa, así como accións que poden levar a cabo os usuarios (ou unha opción para ignorar o báner). O usuario debe realizar unha acción para ignoralo.
gu: બૅનર મહત્ત્વપૂર્ણ, મુદ્દાસર સંદેશ બતાવે છે અને વપરાશકર્તા આગળ શું કરી શકે છે તે માટેની ક્રિયાઓ આપે છે (અથવા બૅનરને છોડી દેવાનો વિકલ્પ પણ આપે છે). બૅનર રદ કરવા માટે, વપરાશકર્તા ક્રિયા જરૂરી હોય છે.
he: באנר מציג הודעה חשובה ותמציתית, וכולל פעולות שהמשתמשים צריכים להתייחס אליהן (או לסגור את הבאנר). יש צורך בפעולה מצד המשתמש כדי שהבאנר ייסגר.
hi: बैनर में किसी ज़रूरी मैसेज को कम शब्दों में दिखाया जाता है. साथ ही, उपयोगकर्ता आगे क्या कर सकते हैं, उससे जुड़े विकल्प दिखाए जाते हैं (या बैनर खारिज करने का भी विकल्प हाेता है). बैनर खारिज करने के लिए, उपयोगकर्ता काे कार्रवाई करनी हाेती है.
hu: Az üzenetszalagon rövid, ugyanakkor fontos üzenetek jelennek meg, amelyekkel a kapcsolatban a felhasználók valamilyen műveletet végezhetnek el (vagy elvethetik az üzenetszalagot). Az elvetéséhez is felhasználói beavatkozásra van szükség.
hy: Ազդերիզը ցուցադրում է կարևոր, համառոտ հաղորդագրություն և գործողությունների ցանկ, որոնք պետք է կատարեն օգտատերերը (նրանք կարող են նաև փակել ազդերիզը)։ Առանց օգտատիրոջ գործողության հնարավոր չէ փակել ազդերիզը։
id: Banner menampilkan pesan penting yang ringkas, dan memberikan tindakan yang perlu dilakukan pengguna (atau menutup banner). Perlu tindakan pengguna untuk menutup banner.
it: Un banner mostra un messaggio importante e conciso e offre agli utenti azioni da compiere (o per ignorare il banner). È necessaria un'azione dell'utente per ignorare il banner.
ja: バナーでは、重要なメッセージを簡潔に表示し、ユーザーが対応する（またはバナーを閉じる）アクションを提供します。バナーを閉じるには、ユーザーのアクションが必要です。
ka: ბანერზე ნაჩვენებია მნიშვნელოვანი, სხარტი გზავნილი და მომხმარებლებს შეუძლიათ იმოქმედონ მასზე (ან დახურონ ბანერი). დასახურად საჭიროა მომხმარებლის მოქმედება.
km: ផ្ទាំងផ្សាយ​ពាណិជ្ជកម្ម​បង្ហាញ​សារសំខាន់ ច្បាស់លាស់ និងផ្ដល់​សកម្មភាព​ឱ្យ​អ្នកប្រើប្រាស់ឆ្លើយតប (ឬច្រានចោល​ផ្ទាំងផ្សាយពាណិជ្ជកម្ម)។ តម្រូវឱ្យមាន​សកម្មភាព​របស់អ្នក​ប្រើប្រាស់ ដើម្បី​ច្រានចោល​ផ្ទាំងផ្សាយពាណិជ្ជកម្ម។
kn: ಬ್ಯಾನರ್‌ಗಳು ಪ್ರಮುಖ, ಸಂಕ್ಷಿಪ್ತ ಸಂದೇಶಗಳನ್ನು ತೋರಿಸುತ್ತವೆ ಮತ್ತು ಬಳಕೆದಾರರಿಗೆ ನಿರ್ವಹಿಸಲು ಕ್ರಿಯೆಗಳನ್ನು ಒದಗಿಸುತ್ತವೆ (ಅಥವಾ ಬ್ಯಾನರ್ ಅನ್ನು ವಜಾಗೊಳಿಸಿ). ಅದನ್ನು ವಜಾಗೊಳಿಸಲು ಬಳಕೆದಾರರ ಕ್ರಿಯೆಯ ಅಗತ್ಯವಿದೆ.
ko: 배너는 중요한 메시지를 간결하게 표시하며 사용자가 작업을 실행하거나 배너를 닫을 수 있게 합니다. 배너를 닫으려면 사용자 작업이 필요합니다.
ky: Көрнөк-жарнакта маанилүү жана кыска, колдонуучуларды белгилүү бир аракетке үндөгөн билдирүү (же көрнөк-жарнакты жабуу тандоосу) көрүнөт. Аны колдонуучу жаба алат.
lo: ແບນເນີຈະສະແດງຂໍ້ຄວາມສຳຄັນສັ້ນໆ ແລະ ສະໜອງຄຳສັ່ງເພື່ອໃຫ້ຜູ້ໃຊ້ຈັດການ (ຫຼື ປິດແບນເນີ). ຜູ້ໃຊ້ຈະຕ້ອງດຳເນີນການໃດໜຶ່ງເພື່ອປິດມັນ.
lt: Reklamjuostėje pateikiamas svarbus, trumpas pranešimas ir pateikiami veiksmai, kuriuos turėtų atlikti naudotojai (arba atsisakyti reklamjuostės). Norėdamas atsisakyti reklamjuostės naudotojas turi atlikti veiksmą.
lv: Joslā tiek rādīta īsa un svarīga informācija, kā arī sniegti norādījumi lietotājam (vai iespēja paslēpt joslu). Lai joslu varētu paslēpt, ir nepieciešama lietotāja darbība.
mk: Рекламниот натпис прикажува важна, концизна порака и им обезбедува на корисниците дејства за извршување (или отфрлање на натписот). За да се отфрли, потребно е дејство на корисникот.
ml: പ്രധാനപ്പെട്ടതും സംക്ഷിപ്തവുമായ സന്ദേശം ബാനർ പ്രദർശിപ്പിക്കുന്നു ഒപ്പം ഉപയോക്താക്കൾക്ക് ബാനർ അഭിമുഖീകരിക്കാൻ (അല്ലെങ്കിൽ ബാനർ ഡിസ്‌മിസ് ചെയ്യാൻ) നടപടികൾ നൽകുന്നു. അത് ഡിസ്‌മിസ് ചെയ്യാൻ ഉപയോക്തൃ നടപടി ആവശ്യമാണ്.
mn: Баннер нь чухал, хураангуй мессеж үзүүлж, хэрэглэгчдэд зориулан хаяглах (эсвэл баннерыг үл хэрэгсэх) үйлдэл хийдэг. Үүнийг үл хэрэгсэхийн тулд хэрэглэгчийн үйлдэл шаардлагатай.
mr: बॅनर एक महत्त्वपूर्ण, संक्षिप्त मेसेज प्रदर्शित करतो आणि वापरकर्त्यांना सांगण्यासाठी क्रिया पुरवतो (किंवा बॅनर डिसमिस करतो). ते डिसमिस करण्यासाठी वापरकर्त्याची कृती आवश्यक आहे.
ms: Sepanduk memaparkan mesej yang penting, ringkas dan menyediakan tindakan untuk ditangani pengguna (atau mengetepikan sepanduk). Tindakan pengguna diperlukan untuk mengetepikan sepanduk.
my: နဖူးစည်းတွင် အရေးကြီးပြီး လိုရင်းတိုရှင်း မက်ဆေ့ဂျ်ကိုပြသပြီး အသုံးပြုသူများက ပြုလုပ်ရန် (သို့မဟုတ် နဖူးစည်းကို ပယ်ရန်) လုပ်ဆောင်ချက်များ ပေးထားသည်။ ၎င်းကိုပယ်ရန် အသုံးပြုသူ၏ လုပ်ဆောင်ချက် လိုအပ်သည်။
nb: Et banner viser en viktig, kortfattet melding og gir brukerne handlinger de kan benytte (eller avvise banneret). En brukerhandling kreves for at det skal avvises.
ne: ब्यानरले महत्त्वपूर्ण, संक्षिप्त सन्देश देखाउँछ र प्रयोगकर्ताहरूले चाल्नु पर्ने कदमहरू प्रदान गर्छ (वा ब्यानर खारेज गर्न पनि सकिन्छ)। प्रयोगकर्ताले कदम चालेपछि मात्र ब्यानर खारेज हुन्छ।
pa: ਬੈਨਰ ਮਹੱਤਵਪੂਰਨ, ਸੰਖੇਪ ਸੁਨੇਹਾ ਦਿਖਾਉਂਦਾ ਹੈ, ਅਤੇ ਕੁਝ ਕਰਨ (ਜਾਂ ਬੈਨਰ ਖਾਰਜ ਕਰਨ) ਲਈ ਵਰਤੋਂਕਾਰਾਂ ਨੂੰ ਕਾਰਵਾਈਆਂ ਮੁਹੱਈਆ ਕਰਵਾਉਂਦਾ ਹੈ। ਇਸ ਨੂੰ ਖਾਰਜ ਕਰਨ ਲਈ ਵਰਤੋਂਕਾਰ ਕਾਰਵਾਈ ਦੀ ਲੋੜ ਹੈ।
pl: Na banerze wyświetla się krótki, ważny komunikat do użytkowników wraz z możliwością podjęcia działań (lub zamknięcia banera). Aby zamknąć baner, użytkownik musi wykonać działanie.
pt: Um banner mostra uma mensagem importante e concisa, além de oferecer ações para os usuários, que também podem dispensar o banner. Uma ação do usuário é necessária para que o banner seja dispensado.
pt_pt: Uma faixa apresenta uma mensagem sucinta e importante e fornece ações para os utilizadores efetuarem (ou ignorarem a faixa). Para ser ignorada, é necessária uma ação do utilizador.
ro: Bannerul afișează un mesaj succint important și acțiuni pe care le pot face utilizatorii (inclusiv închiderea bannerului). Pentru închiderea acestuia este necesară o acțiune din partea utilizatorului.
ru: Баннер содержит короткое, но важное сообщение, а также доступные пользователю действия. Убрать баннер с экрана можно только вручную.
si: බැනරයක් වැදගත්, සංක්ෂිප්ත පණිවිඩයක් පෙන්වන අතර පරිශීලකයන්ට බැනරය ආමන්ත්‍රණය කිරීමට (හෝ බැහැර කිරීමට) ක්‍රියා ලබා දෙයි. එය බැහැර කිරීම සඳහා පරිශීලක ක්‍රියාවක් අවශ්‍ය වේ.
sk: Banner zobrazuje dôležitú nadväzujúcu správu a poskytuje akcie, pomocou ktorých môžu používatelia vybrať možnosti v ňom (alebo ho zavrieť). Na jeho zavretie sa vyžaduje akcia používateľa.
sq: Një banderolë shfaq një mesazh të përmbledhur të rëndësishëm dhe ofron veprime për përdoruesit për menaxhimin (ose heqjen) e banderolës. Kërkohet një veprim nga përdoruesi për heqjen e saj.
sr: Банер приказује важну, сажету поруку и наводи радње које корисници могу да обаве (или могу да одбаце банер). Неопходно је да корисник обави радњу одбацивања.
sr_latn: Baner prikazuje važnu, sažetu poruku i navodi radnje koje korisnici mogu da obave (ili mogu da odbace baner). Neophodno je da korisnik obavi radnju odbacivanja.
sv: En banner har ett viktigt, kortfattat meddelande om hur användare kan utföra en åtgärd (eller ignorera bannern). En användaråtgärd krävs för att ignorera den.
te: బ్యానర్‌లో ముఖ్యమైన, సంక్షిప్త మెసేజ్‌ ప్రదర్శితమవుతుంది, అలాగే యూజర్‌లు దృష్టి సారించగల చర్యలను అందిస్తుంది (లేదా బ్యానర్‌ను తీసివేస్తుంది). దీనిని తీసివేయాలంటే, యూజర్ చర్య అవసరం అవుతుంది.
th: แบนเนอร์แสดงข้อความสำคัญที่สั้นกระชับและเสนอการดำเนินการให้ผู้ใช้พูด (หรือปิดแบนเนอร์) ผู้ใช้ต้องดำเนินการอย่างใดอย่างหนึ่งหากจะปิดแบนเนอร์
tr: Bannerlar önemli kısa mesajlar görüntüler ve kullanıcıların yerine getirmeleri (veya banner'ı kapatmaları) için işlemler sunar. Banner'ın kapanması için kullanıcının işlem yapması gerekir.
uk: Банер показує важливе коротке повідомлення та пропонує користувачу виконати певні дії (або закрити банер). Щоб закрити банер, користувач має виконати дію.
ur: بینر ایک اہم، جامع پیغام ڈسپلے کرتا ہے اور صارفین کو خطاب کرنے (یا بینر کو برخاست کرنے کے لیے کارروائیاں فراہم کرتا ہے)۔ اس کو مسترد کرنے کے لئے صارف کی کارروائی ضروری ہے۔
uz: Bannerda qisqa, lekin kerakli axborot boʻladi. Bundan tashqari foydalanuvchi bajarilishi lozim boʻlgan amal joylashadi. Uni foydalanuvchi ekrandan olib tashlay oladi.
vi: Một biểu ngữ hiển thị thông điệp quan trọng, súc tích và đưa ra các hành động để người dùng xử lý (hoặc bỏ qua biểu ngữ). Cần có hành động của người dùng để bỏ qua biểu ngữ.
zh_hk: 橫額可展示重要而簡潔的訊息，並讓使用者執行操作以作回應 (或關閉橫額)。使用者需要執行操作才能關閉橫額。
zu: Isibhengezo sibonisa umlayezo obalulekile, nocacile, futhi sinikeza izenzo zokufanele kwenziwe ngumsebenzisi (noma ukucashisa leso sibhengezo). Isenzo somsebenzisi sidingekile ukuze sicashiswe.

# demoCardTitle
source: Cards
af: Kaarte
am: ካርዶች
ar_eg: البطاقات
as: কাৰ্ডসমূহ
az: Kartlar
be: Карткі
bn: কার্ড
bs: Kartice
ca: Targetes
da: Kort
es_ar: Tarjetas
et: Kaardid
eu: Txartelak
fa: کارت‌ها
fil: Mga Card
fr_ca: Cartes
gl: Tarxetas
gu: કાર્ડ
he: כרטיסים
hi: कार्ड
hu: Kártyák
hy: Քարտեր
id: Kartu
it: Schede
ja: カード
ka: ბარათები
km: កាត
kn: ಕಾರ್ಡ್‌ಗಳು
ko: 카드
ky: Карталар
lo: ບັດ
lt: Kortelės
lv: Kartītes
mk: Картички
ml: കാർഡുകൾ
mn: Картууд
mr: कार्डे
ms: Kad
my: ကတ်များ
nb: Kort
ne: कार्डहरू
pa: ਕਾਰਡ
pl: Karty
pt_pt: Cartões
ro: Carduri
ru: Карточки
si: කාඩ්පත්
sk: Karty
sq: Kartat
sr: Картице
sr_latn: Kartice
sv: Kort
te: కార్డ్‌లు
th: การ์ด
tr: Kartlar
uk: Картки
ur: کارڈز
uz: Bildirgilar
vi: Thẻ
zh_hk: 資訊卡
zu: Amakhadi

# demoCardSubtitle
source: Baseline cards with rounded corners
af: Basislynkaarte met geronde hoeke
am: የተድቦለቦሉ ጫፎች ያላቸው የመነሻ ነጥብ ካርዶች
ar_eg: بطاقات المراجع ذات الحواف الدائرية
as: ঘূৰণীয়া কোণৰ বেছলাইন কাৰ্ডসমূহ
az: Kənarları yuvarlaqlaşdırılmış əsas kartlar
be: Асноўныя карткі са скругленымі вугламі
bn: গোল কোণযুক্ত বেসলাইন কার্ড
bs: Osnovne kartice sa zaobljenim uglovima
ca: Targetes de referència amb les cantonades arrodonides
da: Standardkort med afrundede hjørner
es_ar: Tarjetas de modelo de referencia con esquinas redondeadas
et: Ümarate nurkadega aluskaardid
eu: Oinarrizko txartelak, ertz biribilduekin
fa: کارت‌های پایه با گوشه‌های گرد
fil: Mga baseline na card na may mga pakurbang kanto
fr_ca: Cartes de base avec coins arrondis
gl: Tarxetas básicas con esquinas en forma redonda
gu: બેઝલાઇન કાર્ડ કે જેના ગોળ ખૂણા હોય છે
he: כרטיסים בסיסיים עם קצוות מעוגלים
hi: बेसलाइन कार्ड, जिनके किनारे गोल होते हैं
hu: Alapkártyák lekerekített sarokkal
hy: Հիմնական քարտեր՝ կլորացված անկյուններով
id: Kartu dasar dengan sudut membulat
it: Schede di riferimento con angoli arrotondati
ja: 角に丸みがある基本カード
ka: საბაზისო ბარათები მომრგვალებული კუთხეებით
km: កាតខ្សែបន្ទាត់គោល​ដែលមាន​ជ្រុងរាងមូល
kn: ದುಂಡಾದ ಅಂಚುಗಳಿರುವ ಬೇಸ್‌ಲೈನ್ ಕಾರ್ಡ್‌ಗಳು
ko: 둥근 모서리가 사용된 기준 카드
ky: Четтери тегеректелген баштапкы карталар
lo: ບັດພື້ນຖານແບບມີມຸມໂຄ້ງມົນ
lt: Pagrindinės kortelės užapvalintais kampais
lv: Pamata kartītes ar noapaļotiem stūriem
mk: Основни картички со заоблени агли
ml: വൃത്താകൃതിയിലുള്ള മൂലകളോട് കൂടിയ ബെയ്‌സ്‌ലെെൻ കാർഡുകൾ
mn: Дугуй өнцгүүдтэй үндсэн картууд
mr: गोलाकार कोपरे असलेली बेसलाइन कार्डे
ms: Kad garis dasar dengan penjuru bulat
my: ထောင့်အနားကွေးများဖြင့် အခြေခံကတ်များ
nb: Grunnleggende kort med avrundede hjørner
ne: गोलाकार किनारा भएका आधार कार्डहरू
pa: ਗੋਲ ਕੋਨਿਆਂ ਵਾਲੇ ਆਧਾਰ-ਰੇਖਾ ਕਾਰਡ
pl: Karty bazowe z zaokrąglonymi rogami
pt: Cards de valor de referência com cantos arredondados
pt_pt: Cartões de base com cantos arredondados
ro: Carduri de bază cu colțuri rotunjite
ru: Расположенные внизу карточки со скругленными углами
si: වටකුරු කොන් සහිත මූලික කාඩ්පත්
sk: Základné karty s oblými rohmi
sq: Kartat bazë me kënde të rrumbullakosura
sr: Основне картице са заобљеним угловима
sr_latn: Osnovne kartice sa zaobljenim uglovima
sv: Baslinjekort med rundade hörn
te: గుండ్రటి అంచులు గల బేస్‌లైన్ కార్డ్‌లు
th: การ์ดพื้นฐานแบบมีมุมโค้งมน
tr: Yuvarlatılmış köşeli temel kartlar
uk: Базові картки із закругленими кутами
ur: گول کونے والے بیس لائن کارڈز
uz: Burchaklari oʻralgan pastda joylashgan bildirgilar
vi: Thẻ đường cơ sở có góc tròn
zh_hk: 圓角基準線資訊卡
zu: Amakhadi wesisekelo anamakona ayindilinga
