Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# rallySettingsFindAtms
source: Find ATMs
af: Soek OTM'e
am: ኤቲኤሞችን አግኝ
ar_eg: العثور على مواقع أجهزة الصراف الآلي
as: এটিএম বিচাৰক
az: Bankomatlar tapın
be: Знайсці банкаматы
bn: এটিএম খুঁজুন
bs: Pronađite bankomate
ca: Troba un caixer automàtic
da: Find hæveautomater
es_ar: Buscar cajeros automáticos
et: Otsige pangaautomaate
eu: Aurkitu kutxazain automatikoak
fa: یافتن خودپردازها
fil: Maghanap ng mga ATM
fr_ca: Trouver des guichets automatiques
gl: Buscar caixeiros automáticos
gu: ATMs શોધો
he: חיפוש כספומטים
hi: एटीएम ढूंढें
hu: ATM-ek keresése
hy: Գտնել բանկոմատներ
id: Temukan ATM
it: Trova bancomat
ja: ATM を探す
ka: ბანკომატების პოვნა
km: ស្វែងរក ATM
kn: ATM ಗಳನ್ನು ಹುಡುಕಿ
ko: ATM 찾기
ky: Банкоматтарды табуу
lo: ຊອກຫາຕູ້ ATM
lt: Rasti bankomatus
lv: Atrast bankomātus
mk: Најдете банкомати
ml: ATM-കൾ കണ്ടെത്തുക
mn: ATM хайх
mr: ATM शोधा
ms: Cari ATM
my: ATM များကို ရှာရန်
nb: Finn minibanker
ne: ATM हरू फेला पार्नुहोस्
pa: ATM ਲੱਭੋ
pl: Znajdź bankomaty
pt: Encontrar caixas eletrônicos
pt_pt: Localizar caixas multibanco
ro: Găsiți bancomate
ru: Найти банкоматы
si: ATMs සොයන්න
sk: Nájsť bankomaty
sq: Gjej bankomate
sr: Пронађите банкомате
sr_latn: Pronađite bankomate
sv: Hitta uttagsautomater
te: ATMలను కనుగొనండి
th: ค้นหา ATM
tr: ATMi bul
uk: Знайти банкомати
ur: ATMs تلاش کریں
uz: Bankomatlarni topish
vi: Tìm máy rút tiền tự động (ATM)
zh_hk: 尋找自動櫃員機
zu: Thola ama-ATMs

# rallySettingsHelp
source: Help
af: Hulp
am: እገዛ
ar_eg: المساعدة
as: সহায়
az: Kömək
be: Даведка
bn: সহায়তা
bs: Pomoć
ca: Ajuda
da: Hjælp
es_ar: Ayuda
et: Abi
eu: Laguntza
fa: راهنما
fil: Tulong
fr_ca: Aide
gl: Axuda
gu: સહાય
he: עזרה
hi: सहायता
hu: Súgó
hy: Օգնություն
id: Bantuan
it: Guida
ja: ヘルプ
ka: დახმარება
km: ជំនួយ
kn: ಸಹಾಯ
ko: 도움말
ky: Жардам
lo: ຊ່ວຍເຫຼືອ
lt: Pagalba
lv: Palīdzība
mk: Помош
ml: സഹായം
mn: Тусламж
mr: मदत
ms: Bantuan
my: အကူအညီ
nb: Hjelp
ne: मद्दत
pa: ਮਦਦ
pl: Pomoc
pt: Ajuda
pt_pt: Ajuda
ro: Ajutor
ru: Справка
si: උදව්
sk: Pomocník
sq: Ndihma
sr: Помоћ
sr_latn: Pomoć
sv: Hjälp
te: సహాయం
th: ความช่วยเหลือ
tr: Yardım
uk: Довідка
ur: مدد
uz: Yordam
vi: Trợ giúp
zh_hk: 說明
zu: Usizo

# rallySettingsSignOut
source: Sign out
af: Meld af
am: ዘግተህ ውጣ
ar_eg: تسجيل الخروج
as: ছাইন আউট কৰক
az: Çıxın
be: Выйсці
bn: সাইন-আউট করুন
bs: Odjava
ca: Tanca la sessió
da: Log ud
es_ar: Salir
et: Logi välja
eu: Amaitu saioa
fa: خروج از سیستم
fil: Mag-sign out
fr_ca: Se déconnecter
gl: Pechar sesión
gu: સાઇન આઉટ કરો
he: יציאה
hi: साइन आउट करें
hu: Kijelentkezés
hy: Դուրս գալ
id: Logout
it: Esci
ja: ログアウト
ka: გასვლა
km: ចេញ
kn: ಸೈನ್ ಔಟ್ ಮಾಡಿ
ko: 로그아웃
ky: Чыгуу
lo: ອອກຈາກລະບົບ
lt: Atsijungti
lv: Izrakstīties
mk: Одјавете се
ml: സൈൻ ഔട്ട് ചെയ്യുക
mn: Гарах
mr: साइन आउट करा
ms: Log keluar
my: ထွက်ရန်
nb: Logg av
ne: साइन आउट गर्नुहोस्
pa: ਸਾਈਨ-ਆਊਟ ਕਰੋ
pl: Wyloguj się
pt: Sair
pt_pt: Terminar sessão
ro: Deconectați-vă
ru: Выйти
si: වරන්න
sk: Odhlásiť sa
sq: Dil
sr: Одјавите се
sr_latn: Odjavite se
sv: Logga ut
te: సైన్ అవుట్ చేయండి
th: ออกจากระบบ
tr: Oturumu kapat
uk: Вийти
ur: سائن آؤٹ کریں
uz: Chiqish
vi: Đăng xuất
zh_hk: 登出
zu: Phuma ngemvume

# rallyAccountTotal
source: Total
af: Totaal
am: ጠቅላላ
ar_eg: الإجمالي
as: সৰ্বমুঠ
az: Cəmi
be: Усяго
bn: মোট
bs: Ukupno
da: I alt
et: Kokku
eu: Guztira
fa: مجموع
fil: Kabuuan
gu: કુલ
he: סה"כ
hi: कुल
hu: Összesen
hy: Ընդամենը
it: Totale
ja: 合計
ka: სულ
km: សរុប
kn: ಒಟ್ಟು
ko: 합계
ky: Жалпы
lo: ຮວມ
lt: Iš viso
lv: Kopā
mk: Вкупно
ml: മൊത്തം
mn: Нийт
mr: एकूण
ms: Jumlah
my: စုစုပေါင်း
nb: Sum
ne: कुल
pa: ਕੁੱਲ
pl: Łącznie
ru: Всего
si: එකතුව
sk: Celkove
sq: Totali
sr: Укупно
sr_latn: Ukupno
sv: Totalt
te: మొత్తం
th: รวม
tr: Toplam
uk: Усього
ur: کل
uz: Jami
vi: Tổng
zh_hk: 總計
zu: Isamba

# rallyBillsDue
source: Due
af: Betaalbaar
am: የሚደርሰው
ar_eg: الفواتير المستحقة
as: সম্পূৰ্ণ কৰাৰ শেষ তাৰিখ
az: Son tarix
be: Тэрмін пагашэння
bn: বাকি আছে
bs: Rok
ca: Venciment
da: Betalingsdato
es_ar: Debes
et: Maksta
eu: Epemuga:
fa: سررسید
fil: Nakatakda
fr_ca: dû
gl: Pendentes
gu: બાકી
he: לתשלום
hi: बकाया बिल
hu: Esedékes
hy: Վերջնաժամկետ
id: Batas Waktu
it: Scadenza:
ja: 期限
ka: გადასახდელია
km: ចំនួនត្រូវបង់
kn: ಅಂತಿಮ ದಿನಾಂಕ
ko: 마감일:
ky: Мөөнөтү
lo: ຮອດກຳນົດ
lt: Terminas
lv: Termiņš
mk: Краен рок
ml: അവസാന തീയതി
mn: Эцсийн хугацаа
mr: शेवटची तारीख
ms: Tarikh Akhir
my: နောက်ဆုံးထား ပေးရမည့်ရက်
nb: Skyldig
ne: तिर्न बाँकी
pa: ਦੇਣਯੋਗ
pl: Termin
pt: A pagar
pt_pt: Data de conclusão
ro: Data scadentă
ru: Срок
si: නියමිත
sk: Termín
sq: Afati
sr: Доспева на наплату
sr_latn: Dospeva na naplatu
sv: Förfaller
te: బకాయి వున్న బిల్లు
th: ครบกำหนด
tr: Ödenecek tutar:
uk: Потрібно сплатити:
ur: آخری تاریخ
uz: Muddati
vi: Khoản tiền đến hạn trả
zh_hk: 到期
zu: Ifuneka

# rallyBudgetLeft
source: Left
af: Oor
am: ግራ
ar_eg: الميزانية المتبقية
as: বাওঁ
az: Qalıq
be: Засталося
bn: বাকি আছে
bs: Preostalo
ca: Restant
da: Tilbage
es_ar: Restante
et: Järel
eu: Geratzen dena
fa: چپ
fil: Natitira
fr_ca: restant
gl: Cantidade restante
gu: બાકી
he: סכום שנותר
hi: बाकी बजट
hu: maradt
hy: Մնացել է
id: Tersisa
it: Ancora a disposizione
ja: 残
ka: დარჩენილია
km: នៅសល់
kn: ಉಳಿದಿದೆ
ko: 남음
ky: Бюджетте калган сумма
lo: ຊ້າຍ
lt: Likutis
lv: Atlikums
mk: Преостанато
ml: ഇടത്
mn: Үлдсэн
mr: शिल्लक
ms: Kiri
my: လက်ကျန်
nb: Gjenstår
ne: बाँकी रकम
pa: ਬਾਕੀ
pl: Pozostało
pt: Restantes
pt_pt: Restante(s)
ro: Stânga
ru: Остаток
si: වම
sk: Zostatok:
sq: Të mbetura
sr: Преостаје
sr_latn: Preostaje
sv: Kvar
te: మిగిలిన మొత్తం
th: ที่เหลือ
tr: Sol
uk: Залишок
ur: بائیں
uz: Qoldiq
vi: Còn lại
zh_hk: (餘額)
zu: Kwesobunxele

# rallyAccounts
source: Accounts
af: Rekeninge
am: መለያዎች
ar_eg: الحسابات
as: একাউণ্টসমূহ
az: Hesablar
be: Уліковыя запісы
bn: অ্যাকাউন্ট
bs: Računi
ca: Comptes
da: Konti
es_ar: Cuentas
et: Kontod
eu: Kontuak
fa: حساب‌ها
fil: Mga Account
fr_ca: Comptes
gl: Contas
gu: એકાઉન્ટ
he: חשבונות
hi: खाते
hu: Fiókok
hy: Հաշիվներ
id: Rekening
it: Account
ja: 口座
ka: ანგარიშები
km: គណនី
kn: ಖಾತೆಗಳು
ko: 계정
ky: Аккаунттар
lo: ບັນຊີ
lt: Paskyros
lv: Konti
mk: Сметки
ml: അക്കൗണ്ടുകൾ
mn: Данснууд
mr: खाती
ms: Akaun
my: အကောင့်များ
nb: Kontoer
ne: खाताहरू
pa: ਖਾਤੇ
pl: Konta
pt: Contas
pt_pt: Contas
ro: Conturi
ru: Банковские счета
si: ගිණුම්
sk: Účty
sq: Llogaritë
sr: Налози
sr_latn: Nalozi
sv: Konton
te: ఖాతాలు
th: บัญชี
tr: Hesaplar
uk: Рахунки
ur: اکاؤنٹس
uz: Hisoblar
vi: Tài khoản
zh_hk: 帳戶
zu: Ama-akhawunti

# rallyBills
source: Bills
af: Rekeninge
am: ሒሳብ መጠየቂያዎች
ar_eg: الفواتير
as: বিলসমূহ
az: Hesablar
be: Рахункі
bn: বিল
bs: Računi
ca: Factures
da: Fakturaer
es_ar: Facturas
et: Arved
eu: Fakturak
fa: صورت‌حساب‌ها
fil: Mga Bill
fr_ca: Factures
gl: Facturas
gu: બિલ
he: חיובים
hi: बिल
hu: Számlák
hy: Հաշիվներ
id: Tagihan
it: Fatture
ja: 請求
ka: გადასახადები
km: វិក្កយបត្រ
kn: ಬಿಲ್‌ಗಳು
ko: 청구서
ky: Эсептер
lo: ໃບບິນ
lt: Sąskaitos
lv: Rēķini
mk: Сметки
ml: ബില്ലുകൾ
mn: Тооцоо
mr: बिले
ms: Bil
my: ငွေတောင်းခံလွှာများ
nb: Regninger
ne: बिलहरू
pa: ਬਿੱਲ
pl: Rachunki
pt: Faturas
pt_pt: Faturas
ro: Facturi
ru: Счета
si: බිල්පත්
sk: Faktúry
sq: Faturat
sr: Обрачуни
sr_latn: Obračuni
sv: Fakturor
te: బిల్లులు
th: ใบเรียกเก็บเงิน
tr: Faturalar
uk: Платежі
ur: بلز
uz: Hisob-kitob
vi: Hóa đơn
zh_hk: 帳單
zu: Amabhili

# rallyBudgets
source: Budgets
af: Begrotings
am: ባጀቶች
ar_eg: الميزانيات
as: বাজেটসমূহ
az: Büdcələr
be: Бюджэты
bn: বাজেট
bs: Budžeti
ca: Pressupostos
da: Budgetter
es_ar: Presupuestos
et: Eelarved
eu: Aurrekontuak
fa: بودجه
fil: Mga Badyet
gl: Orzamentos
gu: બજેટ
he: תקציבים
hi: बजट
hu: Költségkeretek
hy: Բյուջեներ
id: Anggaran
it: Budget
ja: 予算
ka: ბიუჯეტები
km: ថវិកា
kn: ಬಜೆಟ್‌ಗಳು
ko: 예산
ky: Бюджеттер
lo: ​​ງົບ​ປະ​ມານ
lt: Biudžetai
lv: Budžeti
mk: Буџети
ml: ബജറ്റുകൾ
mn: Төсөв
mr: बजेट
ms: Belanjawan
my: ငွေစာရင်းများ
nb: Budsjetter
ne: बजेट
pa: ਬਜਟ
pl: Budżety
pt: Orçamentos
pt_pt: Orçamentos
ro: Bugete
ru: Бюджеты
si: අයවැය
sk: Rozpočty
sq: Buxhetet
sr: Буџети
sr_latn: Budžeti
sv: Budgetar
te: బడ్జెట్‌లు
th: งบประมาณ
tr: Bütçeler
uk: Бюджети
ur: بجٹس
uz: Budjetlar
vi: Ngân sách
zh_hk: 預算
zu: Amabhajethi

# rallyAlerts
source: Alerts
af: Waarskuwings
am: ማንቂያዎች
ar_eg: التنبيهات
as: সতৰ্কবার্তাসমূহ
az: Xəbərdarlıqlar
be: Абвесткі
bn: সতর্কতা
bs: Obavještenja
ca: Alertes
da: Underretninger
es_ar: Alertas
et: Hoiatused
eu: Alertak
fa: هشدارها
fil: Mga Alerto
fr_ca: Alertes
gl: Alertas
gu: અલર્ટ
he: התראות
hi: चेतावनियां
hu: Értesítések
hy: Ծանուցումներ
id: Notifikasi
it: Avvisi
ja: アラート
ka: გაფრთხილებები
km: ការជូនដំណឹង
kn: ಅಲರ್ಟ್‌ಗಳು
ko: 알림
ky: Эскертүүлөр
lo: ການແຈ້ງເຕືອນ
lt: Įspėjimai
lv: Brīdinājumi
mk: Предупредувања
ml: മുന്നറിയിപ്പുകൾ
mn: Сэрэмжлүүлэг
mr: इशारे
ms: Makluman
my: သတိပေးချက်များ
nb: Varsler
ne: अलर्टहरू
pa: ਸੁਚੇਤਨਾਵਾਂ
pl: Alerty
pt: Alertas
pt_pt: Alertas
ro: Alerte
ru: Оповещения
si: ඇඟවීම්
sk: Upozornenia
sq: Sinjalizime
sr: Обавештења
sr_latn: Obaveštenja
sv: Aviseringar
te: అలర్ట్‌లు
th: การแจ้งเตือน
tr: Uyarılar
uk: Сповіщення
ur: الرٹس
uz: Bildirishnomalar
vi: Cảnh báo
zh_hk: 通知
zu: Izexwayiso

# rallySeeAll
source: SEE ALL
af: SIEN ALLES
am: ሁሉንም ይመልከቱ
ar_eg: عرض الكل
as: সকলো চাওক
az: HAMISINA BAXIN
be: ПРАГЛЕДЗЕЦЬ УСЁ
bn: সবগুলি দেখুন
bs: PRIKAŽI SVE
ca: MOSTRA-HO TOT
da: SE ALLE
es_ar: VER TODO
et: KUVA KÕIK
eu: IKUSI GUZTIAK
fa: مشاهده همه
fil: TINGNAN LAHAT
fr_ca: TOUT AFFICHER
gl: VER TODO
gu: બધું જુઓ
he: הצגת הכול
hi: सभी देखें
hu: ÖSSZES MEGTEKINTÉSE
hy: ՏԵՍՆԵԼ ԲՈԼՈՐԸ
id: LIHAT SEMUA
it: VEDI TUTTI
ja: すべて表示
ka: ყველას ნახვა
km: មើល​ទាំងអស់​
kn: ಎಲ್ಲವನ್ನು ವೀಕ್ಷಿಸಿ
ko: 모두 보기
ky: БААРЫН КӨРҮҮ
lo: ເບິ່ງທັງໝົດ
lt: ŽIŪRĖTI VISKĄ
lv: SKATĪT VISUS
mk: ПРИКАЖИ СЀ
ml: എല്ലാം കാണുക
mn: БҮГДИЙГ ХАРАХ
mr: सर्व पहा
ms: LIHAT SEMUA
my: အားလုံးကို ကြည့်ရန်
nb: SE ALLE
ne: सबै हेर्नुहोस्
pa: ਸਭ ਦੇਖੋ
pl: ZOBACZ WSZYSTKO
pt: VER TUDO
pt_pt: VER TUDO
ro: VEDEȚI-LE PE TOATE
ru: ПОКАЗАТЬ ВСЕ
si: සියල්ල බලන්න
sk: ZOBRAZIŤ VŠETKO
sq: SHIKOJI TË GJITHË
sr: ПРИКАЖИ СВЕ
sr_latn: PRIKAŽI SVE
sv: VISA ALLA
te: అన్నీ చూడండి
th: ดูทั้งหมด
tr: TÜMÜNÜ GÖSTER
uk: ПОКАЗАТИ ВСІ
ur: سبھی دیکھیں
uz: HAMMASI
vi: XEM TẤT CẢ
zh_hk: 查看全部
zu: BONA KONKE

# rallyFinanceLeft
source: LEFT
af: OOR
am: ግራ
ar_eg: المتبقي
as: বাওঁ
az: QALIQ
be: ЗАСТАЛОСЯ
bn: বাকি আছে
bs: PREOSTALO
ca: RESTANT
da: TILBAGE
es_ar: RESTANTE
et: JÄREL
eu: ERABILTZEKE
fa: چپ
fil: NATITIRA
fr_ca: RESTANT
gl: É A CANTIDADE RESTANTE
gu: બાકી
he: נותר/ו
hi: बाकी
hu: MARADT
hy: ՄՆԱՑԵԼ Է
id: TERSISA
it: ANCORA A DISPOSIZIONE
ja: 残
ka: დარჩა
km: នៅសល់
kn: ಉಳಿದಿದೆ
ko: 남음
ky: КАЛДЫ
lo: ຊ້າຍ
lt: LIKUTIS
lv: ATLIKUMS
mk: ПРЕОСТАНАТО
ml: ഇടത്
mn: ҮЛДСЭН
mr: शिल्लक
ms: KIRI
my: လက်ကျန်
nb: GJENSTÅR
ne: बाँकी
pa: ਬਾਕੀ
pl: POZOSTAŁO
pt: RESTANTES
pt_pt: RESTANTE(S)
ro: STÂNGA
ru: ОСТАЛОСЬ
si: වම
sk: ZOSTATOK:
sq: TË MBETURA
sr: ПРЕОСТАЈЕ
sr_latn: PREOSTAJE
sv: KVAR
te: మిగిలిన మొత్తం
th: ที่เหลือ
tr: KALDI
uk: (ЗАЛИШОК)
uz: QOLDI
vi: CÒN LẠI
zh_hk: (餘額)
zu: KWESOBUNXELE

# rallyTitleOverview
source: OVERVIEW
af: OORSIG
am: አጠቃላይ ዕይታ
ar_eg: نظرة عامة
as: অৱলোকন
az: İCMAL
be: АГЛЯД
bn: এক নজরে
bs: PREGLED
ca: INFORMACIÓ GENERAL
da: OVERSIGT
es_ar: DESCRIPCIÓN GENERAL
et: ÜLEVAADE
eu: INFORMAZIO OROKORRA
fa: نمای کلی
fil: PANGKALAHATANG-IDEYA
fr_ca: APERÇU
gl: VISIÓN XERAL
gu: ઝલક
he: סקירה כללית
hi: खास जानकारी
hu: ÁTTEKINTÉS
hy: ՀԱՄԱՏԵՍՔ
id: RINGKASAN
it: PANORAMICA
ja: 概要
ka: მიმოხილვა
km: ទិដ្ឋភាពរួម
kn: ಸಮಗ್ರ ನೋಟ
ko: 개요
ky: СЕРЕП САЛУУ
lo: ພາບຮວມ
lt: APŽVALGA
lv: PĀRSKATS
mk: ПРЕГЛЕД
ml: അവലോകനം
mn: ТОЙМ
mr: अवलोकन
ms: IKHTISAR
my: အနှစ်ချုပ်
nb: OVERSIKT
ne: परिदृश्य
pa: ਰੂਪ-ਰੇਖਾ
pl: PRZEGLĄD
pt: VISÃO GERAL
pt_pt: VISTA GERAL
ro: PREZENTARE GENERALĂ
ru: ОБЗОР
si: දළ විශ්ලේෂණය
sk: PREHĽAD
sq: PËRMBLEDHJE
sr: ПРЕГЛЕД
sr_latn: PREGLED
sv: ÖVERSIKT
te: ఓవర్‌వ్యూ
th: ภาพรวม
tr: GENEL BAKIŞ
uk: ОГЛЯД
ur: مجموعی جائزہ
uz: UMUMIY
vi: TỔNG QUAN
zh_hk: 概覽
zu: UKUBUKA KONKE

# shrineProductShoulderRollsTee
source: Shoulder rolls tee
af: Skouerrol-t-hemp
am: ክፍት ትከሻ ቲሸርት
ar_eg: قميص واسعة بأكمام قصيرة
az: Çiyni dəyirmi formada açıq olan kofta
be: Футболка са свабодным рукавом
bn: শোল্ডার রোল টি
bs: Majica s podvrnutim rukavima
ca: Samarreta amb muscle descobert
da: T-shirt med åbning til skuldrene
es_ar: Camiseta con mangas
eu: Sorbalda estaltzen ez duen elastikoa
fa: بلوز یقه‌افتاده
fil: Shoulder rolls na t-shirt
fr_ca: T-shirt
gl: Camiseta de manga corta arremangada
he: חולצה עם כתפיים חשופות
hi: शोल्डर रोल्स टी-शर्ट
hu: Váll néküli felső
hy: Ազատ թևքով շապիկ
id: Kaus shoulder rolls
it: Maglietta shoulder roll
ja: T シャツ（ショルダー ロール）
ka: Shoulder rolls მაისური
km: អាវយឺត​កធ្លាក់ពីស្មា
kn: ಶೋಲ್ಡರ್ ರೋಲ್ಸ್ ಟೀ
ko: 숄더 롤 티
ky: Ийинден ылдый түшкөн футболка
lo: ເສື້ອຍືດ Shoulder Rolls
lt: Pečius apnuoginantys marškinėliai
lv: T-krekls ar apaļu plecu daļu
mk: Маица со спуштени ракави
ml: ഷോൾഡർ റോൾസ് ടീ
mn: Эргүүлдэг мөртэй футболк
nb: Shoulder rolls-t-skjorte
ne: बाहुला भएको टिसर्ट
pa: ਸ਼ੋਲਡਰ ਰੋਲਸ ਟੀ-ਸ਼ਰਟ
pl: Bluzka z odsłoniętymi ramionami
pt: Camiseta com mangas dobradas
pt_pt: T-shirt Shoulder rolls
ro: Tricou cu mâneci îndoite
ru: Футболка со свободным рукавом
sk: Tričko na plecia
sq: Bluzë me mëngë të përveshura
sr: Мајица са заврнутим рукавима
sr_latn: Majica sa zavrnutim rukavima
sv: T-shirt – Shoulder rolls
te: షోల్డర్ రోల్స్ టీ
th: เสื้อยืด Shoulder Rolls
tr: Açık omuzlu tişört
uk: Футболка з манжетами на рукавах
ur: پولرائزڈ بلاؤج
uz: Qoʻllar erkin harakatlanadigan futbolka
vi: Áo thun xắn tay
zh_hk: 露膊 T 恤
zu: I-Shoulder rolls tee

# shrineNextButtonCaption
source: NEXT
af: VOLGENDE
am: ቀጣይ
ar_eg: التالي
as: পৰৱৰ্তী
az: NÖVBƏTİ
be: ДАЛЕЙ
bn: পরবর্তী
bs: NAPRIJED
ca: SEGÜENT
da: NÆSTE
es_ar: SIGUIENTE
et: JÄRGMINE
eu: HURRENGOA
fa: بعدی
fil: SUSUNOD
fr_ca: SUIVANT
gl: SEGUINTE
gu: આગળ
he: הבא
hi: आगे बढ़ें
hu: TOVÁBB
hy: ԱՌԱՋ
id: BERIKUTNYA
it: AVANTI
ja: 次へ
ka: შემდეგი
km: បន្ទាប់
kn: ಮುಂದಿನದು
ko: 다음
ky: КИЙИНКИ
lo: ​ຕໍ່​ໄປ
lt: KITAS
lv: TĀLĀK
mk: СЛЕДНО
ml: അടുത്തത്
mn: ДАРААХ
mr: पुढील
ms: SETERUSNYA
my: ရှေ့သို့
nb: NESTE
ne: अर्को
pa: ਅੱਗੇ
pl: DALEJ
pt: PRÓXIMA
pt_pt: SEGUINTE
ro: ÎNAINTE
ru: ДАЛЕЕ
si: ඊළඟ
sk: ĎALEJ
sq: PËRPARA
sr: ДАЉЕ
sr_latn: DALJE
sv: NÄSTA
te: తర్వాత
th: ถัดไป
tr: SONRAKİ
uk: ДАЛІ
ur: اگلا
uz: KEYINGISI
vi: TIẾP THEO
zh_hk: 繼續
zu: OKULANDELAYO

# rallyTitleBudgets
source: BUDGETS
af: BEGROTINGS
am: ባጀቶች
ar_eg: الميزانيات
as: বাজেটসমূহ
az: BÜDCƏLƏR
be: БЮДЖЭТЫ
bn: বাজেট
bs: BUDŽETI
ca: PRESSUPOSTOS
da: BUDGETTER
es_ar: PRESUPUESTOS
et: EELARVED
eu: AURREKONTUAK
fa: بودجه
fil: MGA BADYET
gl: ORZAMENTOS
gu: બજેટ
he: תקציבים
hi: बजट
hu: KÖLTSÉGKERETEK
hy: ԲՅՈՒՋԵՆԵՐ
id: ANGGARAN
it: BUDGET
ja: 予算
ka: ბიუჯეტები
km: ថវិកា
kn: ಬಜೆಟ್‌ಗಳು
ko: 예산
ky: БЮДЖЕТТЕР
lo: ​​ງົບ​ປະ​ມານ
lt: BIUDŽETAI
lv: BUDŽETI
mk: БУЏЕТИ
ml: ബജറ്റുകൾ
mn: ТӨСӨВ
mr: बजेट
ms: BELANJAWAN
my: ငွေစာရင်းများ
nb: Budsjetter
ne: बजेट
pa: ਬਜਟ
pl: BUDŻETY
pt: ORÇAMENTOS
pt_pt: ORÇAMENTOS
ro: BUGETE
ru: БЮДЖЕТЫ
si: අයවැය
sk: ROZPOČTY
sq: BUXHETET
sr: БУЏЕТИ
sr_latn: BUDŽETI
sv: BUDGETAR
te: బడ్జెట్‌లు
th: งบประมาณ
tr: BÜTÇELER
uk: БЮДЖЕТИ
ur: بجٹس
uz: BUDJETLAR
vi: NGÂN SÁCH
zh_hk: 預算
zu: AMABHAJETHI

# rallyTitleSettings
source: SETTINGS
af: INSTELLINGS
am: ቅንብሮች
ar_eg: الإعدادات
as: ছেটিংসমূহ
az: AYARLAR
be: НАЛАДЫ
bn: সেটিংস
bs: POSTAVKE
ca: CONFIGURACIÓ
da: INDSTILLINGER
es_ar: CONFIGURACIÓN
et: SEADED
eu: EZARPENAK
fa: تنظیمات
fil: MGA SETTING
fr_ca: PARAMÈTRES
gl: CONFIGURACIÓN
gu: સેટિંગ
he: הגדרות
hi: सेटिंग
hu: BEÁLLÍTÁSOK
hy: ԿԱՐԳԱՎՈՐՈՒՄՆԵՐ
id: SETELAN
it: IMPOSTAZIONI
ja: 設定
ka: პარამეტრები
km: ការ​កំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 설정
ky: ЖӨНДӨӨЛӨР
lo: ການຕັ້ງຄ່າ
lt: NUSTATYMAI
lv: IESTATĪJUMI
mk: ПОСТАВКИ
ml: ക്രമീകരണം
mn: ТОХИРГОО
mr: सेटिंग्ज
ms: TETAPAN
my: ဆက်တင်များ
nb: INNSTILLINGER
ne: सेटिङ
pa: ਸੈਟਿੰਗਾਂ
pl: USTAWIENIA
pt: CONFIGURAÇÕES
pt_pt: DEFINIÇÕES
ro: SETĂRI
ru: НАСТРОЙКИ
si: සැකසීම්
sk: NASTAVENIA
sq: CILËSIMET
sr: ПОДЕШАВАЊА
sr_latn: PODEŠAVANJA
sv: INSTÄLLNINGAR
te: సెట్టింగ్‌లు
th: การตั้งค่า
tr: AYARLAR
uk: НАЛАШТУВАННЯ
ur: ترتیبات
uz: SOZLAMALAR
vi: CÀI ĐẶT
zh_hk: 設定
zu: IZILUNGISELELO

# rallyLoginLoginToRally
source: Login to Rally
af: Meld by Rally aan
am: ወደ Rally ይግቡ
ar_eg: تسجيل الدخول إلى Rally
as: Rallyত লগ ইন কৰক
az: Rally'ya daxil olun
be: Уваход у Rally
bn: Rally-তে লগ-ইন করুন
bs: Prijavite se u aplikaciju Rally
ca: Inicia la sessió a Rally
da: Log ind for at bruge Rally
es_ar: Accede a Rally
et: Sisselogimine rakendusse Rally
eu: Hasi saioa Rally-n
fa: ورود به سیستم Rally
fil: Mag-log in sa Rally
fr_ca: Connexion à Rally
gl: Inicia sesión en Rally
gu: Rallyમાં લૉગ ઇન કરો
he: התחברות אל Rally
hi: Rally में लॉग इन करें
hu: Bejelentkezés a Rally szolgáltatásba
hy: Մուտք Rally
id: Login ke Rally
it: Accedi all'app Rally
ja: Rally にログイン
ka: Rally-ში შესვლა
km: ចូលទៅ Rally
kn: ರ್‍ಯಾಲಿಗೆ ಲಾಗಿನ್ ಮಾಡಿ
ko: Rally 로그인
ky: Раллиге кирүү
lo: ເຂົ້າສູ່ລະບົບ Rally
lt: Prisijungimas prie „Rally“
lv: Pieteikties lietotnē Rally
mk: Најавете се на Rally
ml: Rally-ലേക്ക് ലോഗിൻ ചെയ്യുക
mn: Rally-д нэвтрэх
mr: Rally साठी लॉग इन करा
ms: Log masuk ke Rally
my: Rally သို့ အကောင့်ဝင်ရန်
nb: Logg på Rally
ne: Rally मा लग इन गर्नुहोस्
pa: Rally ਵਿੱਚ ਲੌਗ-ਇਨ ਕਰੋ
pl: Zaloguj się w Rally
pt: Fazer login no Rally
pt_pt: Inicie sessão no Rally
ro: Conectați-vă la Rally
ru: Вход в Rally
si: Rally වෙත ඇතුළු වන්න
sk: Prihlásenie do aplikácie Rally
sq: Identifikohu në Rally
sr: Пријавите се у апликацију Rally
sr_latn: Prijavite se u aplikaciju Rally
sv: Logga in i Rally
te: Rallyలో లాగిన్ చేయండి
th: เข้าสู่ระบบของ Rally
tr: Rally'ye giriş yapın
uk: Увійти в Rally
ur: ریلی میں لاگ ان کریں
uz: Rally hisobiga kirish
vi: Đăng nhập vào Rally
zh_hk: 登入 Rally
zu: Ngena ku-Rally

# rallyLoginNoAccount
source: Don't have an account?
af: Het jy nie 'n rekening nie?
am: መለያ የለዎትም?
ar_eg: أليس لديك حساب؟
as: কোনো একাউণ্ট নাই নেকি?
az: Hesabınız yoxdur?
be: Няма ўліковага запісу?
bn: কোনো অ্যাকাউন্ট নেই?
bs: Nemate račun?
ca: No tens cap compte?
da: Har du ikke en konto?
es_ar: ¿No tienes una cuenta?
et: Kas teil pole kontot?
eu: Ez duzu konturik?
fa: حساب ندارید؟
fil: Walang account?
fr_ca: Vous ne possédez pas de compte?
gl: Non tes unha conta?
gu: કોઈ એકાઉન્ટ નથી?
he: אין לך חשבון?
hi: कोई खाता नहीं है?
hu: Nincs fiókja?
hy: Չունե՞ք հաշիվ
id: Belum punya akun?
it: Non hai un account?
ja: 口座を開設する
ka: არ გაქვთ ანგარიში?
km: មិន​មាន​គណនី​មែន​ទេ?
kn: ಖಾತೆ ಇಲ್ಲವೇ?
ko: 계정이 없나요?
ky: Аккаунтуңуз жокпу?
lo: ຍັງບໍ່ມີບັນຊີເທື່ອບໍ?
lt: Neturite paskyros?
lv: Vai jums vēl nav konta?
mk: Немате ли сметка?
ml: ഒരു അക്കൗണ്ട് ഇല്ലേ?
mn: Та бүртгэлгүй юу?
mr: तुमच्याकडे खाते नाही?
ms: Tiada akaun?
my: အကောင့်မရှိဘူးလား။
nb: Har du ikke konto?
ne: खाता छैन?
pa: ਕੀ ਤੁਹਾਡੇ ਕੋਲ ਖਾਤਾ ਨਹੀਂ ਹੈ?
pl: Nie masz konta?
pt: Não tem uma conta?
pt_pt: Não tem uma conta?
ro: Nu aveți un cont?
ru: Нет аккаунта?
si: ගිණුමක් නොමැතිද?
sk: Nemáte účet?
sq: Nuk ke llogari?
sr: Немате налог?
sr_latn: Nemate nalog?
sv: Har du inget konto?
te: ఖాతా లేదా?
th: หากยังไม่มีบัญชี
tr: Hesabınız yok mu?
uk: Не маєте облікового запису?
ur: کیا آپ کے پاس اکاؤنٹ نہیں ہے؟
uz: Hisobingiz yoʻqmi?
vi: Không có tài khoản?
zh_hk: 還未有帳戶嗎？
zu: Awunayo i-akhawunti?

# rallyLoginSignUp
source: SIGN UP
af: SLUIT AAN
am: ተመዝገብ
ar_eg: الاشتراك
as: ছাইন আপ কৰক
az: QEYDİYYATDAN KEÇİN
be: ЗАРЭГІСТРАВАЦЦА
bn: সাইন আপ করুন
bs: REGISTRACIJA
ca: REGISTRA'T
da: TILMELD DIG
es_ar: REGISTRARSE
et: REGISTREERU
eu: ERREGISTRATU
fa: ثبت‌نام
fil: MAG-SIGN UP
fr_ca: S'INSCRIRE
gl: REXISTRARSE
gu: સાઇન અપ કરો
he: הרשמה
hi: साइन अप करें
hu: REGISZTRÁCIÓ
hy: ԳՐԱՆՑՎԵԼ
id: DAFTAR
it: REGISTRATI
ja: 登録
ka: რეგისტრაცია
km: ចុះឈ្មោះ
kn: ಸೈನ್ ಅಪ್ ಮಾಡಿ
ko: 가입
ky: КАТТАЛУУ
lo: ລົງທະບຽນ
lt: PRISIREGISTRUOTI
lv: REĢISTRĒTIES
mk: РЕГИСТРИРАЈТЕ СЕ
ml: സൈൻ അപ്പ് ചെയ്യുക
mn: БҮРТГҮҮЛЭХ
mr: साइन अप करा
ms: DAFTAR
my: စာရင်းသွင်းရန်
nb: REGISTRER DEG
ne: साइन अप गर्नुहोस्
pa: ਸਾਈਨ-ਅੱਪ ਕਰੋ
pl: ZAREJESTRUJ SIĘ
pt: INSCREVER-SE
pt_pt: INSCREVER-SE
ro: ÎNSCRIEȚI-VĂ
ru: ЗАРЕГИСТРИРОВАТЬСЯ
si: ලියාපදිංචි වන්න
sk: REGISTROVAŤ SA
sq: REGJISTROHU
sr: РЕГИСТРУЈ МЕ
sr_latn: REGISTRUJ ME
sv: REGISTRERA DIG
te: సైన్ అప్ చేయి
th: ลงชื่อสมัครใช้
tr: KAYDOL
uk: ЗАРЕЄСТРУВАТИСЯ
ur: سائن اپ کریں
uz: ROʻYXATDAN OʻTISH
vi: ĐĂNG KÝ
zh_hk: 申請
zu: BHALISA

# rallyLoginUsername
source: Username
af: Gebruikernaam
am: የተጠቃሚ ስም
ar_eg: اسم المستخدم
as: ব্যৱহাৰকাৰীৰ নাম
az: İstifadəçi adı
be: Імя карыстальніка
bn: ইউজারনেম
bs: Korisničko ime
ca: Nom d'usuari
da: Brugernavn
es_ar: Nombre de usuario
et: Kasutajanimi
eu: Erabiltzaile-izena
fa: نام کاربری
fr_ca: Nom d'utilisateur
gl: Nome de usuario
gu: વપરાશકર્તાનું નામ
he: שם משתמש
hi: उपयोगकर्ता नाम
hu: Felhasználónév
hy: Օգտանուն
id: Nama pengguna
it: Nome utente
ja: ユーザー名
ka: მომხმარებლის სახელი
km: ឈ្មោះអ្នក​ប្រើប្រាស់
kn: ಬಳಕೆದಾರರ ಹೆಸರು
ko: 사용자 이름
ky: Колдонуучунун аты
lo: ຊື່ຜູ້ໃຊ້
lt: Naudotojo vardas
lv: Lietotājvārds
mk: Корисничко име
ml: ഉപയോക്തൃനാമം
mn: Хэрэглэгчийн нэр
mr: वापरकर्ता नाव
ms: Nama Pengguna
my: အသုံးပြုသူအမည်
nb: Brukernavn
ne: युजरनेम
pa: ਵਰਤੋਂਕਾਰ ਨਾਮ
pl: Nazwa użytkownika
pt: Nome de usuário
pt_pt: Nome de utilizador
ro: Nume de utilizator
ru: Имя пользователя
si: පරිශීලක නම
sk: Používateľské meno
sq: Emri i përdoruesit
sr: Корисничко име
sr_latn: Korisničko ime
sv: Användarnamn
te: వినియోగదారు పేరు
th: ชื่อผู้ใช้
tr: Kullanıcı adı
uk: Ім'я користувача
ur: صارف نام
uz: Foydalanuvchi nomi
vi: Tên người dùng
zh_hk: 使用者名稱
zu: Igama lomsebenzisi

# rallyLoginPassword
source: Password
af: Wagwoord
am: የይለፍ ቃል
ar_eg: كلمة المرور
as: পাছৱৰ্ড
az: Parol
be: Пароль
bn: পাসওয়ার্ড
bs: Lozinka
ca: Contrasenya
da: Adgangskode
es_ar: Contraseña
et: Parool
eu: Pasahitza
fa: گذرواژه
fr_ca: Mot de passe
gl: Contrasinal
gu: પાસવર્ડ
he: סיסמה
hi: पासवर्ड
hu: Jelszó
hy: Գաղտնաբառ
id: Sandi
ja: パスワード
ka: პაროლი
km: ពាក្យសម្ងាត់
kn: ಪಾಸ್‌ವರ್ಡ್
ko: 비밀번호
ky: Сырсөз
lo: ລະຫັດຜ່ານ
lt: Slaptažodis
lv: Parole
mk: Лозинка
ml: പാസ്‌വേഡ്
mn: Нууц үг
mr: पासवर्ड
ms: Kata laluan
my: စကားဝှက်
nb: Passord
ne: पासवर्ड
pa: ਪਾਸਵਰਡ
pl: Hasło
pt: Senha
pt_pt: Palavra-passe
ro: Parolă
ru: Пароль
si: මුරපදය
sk: Heslo
sq: Fjalëkalimi
sr: Лозинка
sr_latn: Lozinka
sv: Lösenord
te: పాస్‌వర్డ్
th: รหัสผ่าน
tr: Şifre
uk: Пароль
ur: پاس ورڈ
uz: Parol
vi: Mật khẩu
zh_hk: 密碼
zu: Iphasiwedi

# rallyLoginLabelLogin
source: Login
af: Meld aan
am: ግባ
ar_eg: تسجيل الدخول
as: লগ ইন কৰক
az: Giriş
be: Увайсці
bn: লগ-ইন
bs: Prijava
ca: Inicia la sessió
da: Log ind
es_ar: Acceder
et: Logi sisse
eu: Hasi saioa
fa: ورود به سیستم
fil: Mag-log in
fr_ca: Connexion
gl: Iniciar sesión
gu: લૉગ ઇન
he: התחברות
hi: लॉग इन करें
hu: Bejelentkezés
hy: Մուտք
it: Accedi
ja: ログイン
ka: შესვლა
km: ចូល
kn: ಲಾಗಿನ್ ಮಾಡಿ
ko: 로그인
ky: Кирүү
lo: ເຂົ້າສູ່ລະບົບ
lt: Prisijungti
lv: Pieteikties
mk: Најавете се
ml: ലോഗിൻ ചെയ്യുക
mn: Нэвтрэх
mr: लॉग इन करा
ms: Log masuk
my: အကောင့်ဝင်ရန်
nb: Logg på
ne: लग इन गर्नुहोस्
pa: ਲੌਗ-ਇਨ ਕਰੋ
pl: Zaloguj się
pt: Fazer login
pt_pt: Início de sessão
ro: Conectați-vă
ru: Войти
si: පුරන්න
sk: Prihlásiť sa
sq: Identifikohu
sr: Пријави ме
sr_latn: Prijavi me
sv: Logga in
te: లాగిన్ చేయి
th: เข้าสู่ระบบ
tr: Giriş yapın
uk: Увійти
ur: لاگ ان کریں
uz: Kirish
vi: Đăng nhập
zh_hk: 登入
zu: Ngena ngemvume
