Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTextFieldRequiredField
source: * indicates required field
af: * dui vereiste veld aan
am: * የሚያስፈልግ መስክ መሆኑን ያመለክታል
ar_eg: تشير علامة * إلى حقل مطلوب.
as: * চিহ্নই প্ৰয়োজনীয় ক্ষেত্ৰক চিহ্নিত কৰে
az: * tələb olunan sahələri göstərir
be: * абавязковае поле
bn: * প্রয়োজনীয় ফিল্ড নির্দেশ করে
bs: * označava obavezno polje
ca: * indica que el camp és obligatori
da: * angiver et obligatorisk felt
es_ar: El asterisco (*) indica que es un campo obligatorio
et: * tähistab kohustuslikku välja
eu: * ikurrak derrigorrezko eremua dela adierazten du
fa: * نشانگر به فیلد نیاز دارد
fil: * tumutukoy sa kinakailangang field
fr_ca: * indique un champ obligatoire
gl: O símbolo "*" indica que o campo é obrigatorio
gu: * ફરજિયાત ફીલ્ડ સૂચવે છે
he: הסימן * מציין שדה חובה
hi: * बताता है कि इस फ़ील्ड को भरना ज़रूरी है
hu: * kötelező mezőt jelöl
hy: * պարտադիր դաշտ
id: * menunjukkan kolom wajib diisi
it: L'asterisco (*) indica un campo obbligatorio
ja: * は必須項目です
ka: * აღნიშნავს აუცილებელ ველს
km: * បង្ហាញថាជាកន្លែងត្រូវបំពេញ
kn: * ಅಗತ್ಯ ಕ್ಷೇತ್ರವನ್ನು ಸೂಚಿಸುತ್ತದೆ
ko: * 기호는 필수 입력란을 의미합니다.
ky: * сөзсүз түрдө толтурулушу керек
lo: * ເປັນຊ່ອງທີ່ຕ້ອງລະບຸຂໍ້ມູນ
lt: * nurodo būtiną lauką
lv: * norāda obligātu lauku
mk: * означува задолжително поле
ml: * ചിഹ്നം ഈ ഭാഗം പൂരിപ്പിക്കേണ്ടതുണ്ട് എന്ന് സൂചിപ്പിക്കുന്നു
mn: * заавал бөглөх хэсгийг илэрхийлнэ
mr: * आवश्यक फील्ड सूचित करते
ms: * menandakan medan yang diperlukan
my: * သည် ဖြည့်ရန် လိုအပ်ကြောင်း ဖော်ပြခြင်းဖြစ်သည်
nb: * indikerer at feltet er obligatorisk
ne: * ले उक्त फिल्ड अनिवार्य हो भन्ने कुरा जनाउँछ
pa: * ਲੋੜੀਂਦੇ ਖੇਤਰ ਦਾ ਸੂਚਕ ਹੈ
pl: * pole wymagane
pt: * indica um campo obrigatório
pt_pt: * indica um campo obrigatório
ro: * indică un câmp obligatoriu
ru: Звездочкой (*) отмечены поля, обязательные для заполнения.
si: * අවශ්‍ය ක්ෂේත්‍රය දක්වයි
sk: * Označuje povinné pole.
sq: * tregon fushën e kërkuar
sr: * означава обавезно поље
sr_latn: * označava obavezno polje
sv: * anger att fältet är obligatoriskt
te: * అవసరమైన ఫీల్డ్‌ను సూచిస్తుంది
th: * เป็นช่องที่ต้องกรอก
tr: * zorunlu alanı belirtir
uk: * позначає обов'язкове поле
ur: * مطلوبہ فیلڈ کی نشاندہی کرتا ہے
uz: * kiritish shart
vi: * biểu thị trường bắt buộc
zh_hk: * 代表必填欄位
zu: * ibonisa inkambu edingekayo

# demoBottomNavigationTitle
source: Bottom navigation
af: Navigasie onder
am: የታች ዳሰሳ
ar_eg: شريط التنقل السفلي
as: একেবাৰে নিম্নাংশৰ নেভিগেশ্বন
az: Alt naviqasiya
be: Навігацыя ўнізе экрана
bn: নিচের দিকে নেভিগেশন
bs: Donja navigacija
ca: Navegació inferior
da: Navigation i bunden
es_ar: Navegación inferior
et: Alla liikumine
eu: Beheko nabigazioa
fa: پیمایش پایین صفحه
fil: Navigation sa ibaba
fr_ca: Barre de navigation inférieure
gl: Navegación da parte inferior
gu: બોટમ નૅવિગેશન
he: ניווט בחלק התחתון
hi: बॉटम नेविगेशन
hu: Alsó navigáció
hy: Նավիգացիա էկրանի ներքևի հատվածում
id: Navigasi bawah
it: Navigazione in basso
ja: ボトム ナビゲーション
ka: ნავიგაცია ქვედა ნაწილში
km: ការរុករក​ខាងក្រោម
kn: ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್
ko: 하단 탐색 메뉴
ky: Ылдый чабыттоо
lo: ການນຳທາງລຸ່ມສຸດ
lt: Apatinė naršymo juosta
lv: Navigācija apakšā
mk: Долна навигација
ml: ബോട്ടം നാവിഗേഷൻ
mn: Доод навигац
mr: तळाचे नेव्हिगेशन
ms: Navigasi bawah
my: အောက်ခြေတွင် လမ်းညွှန်ခြင်း
nb: Navigering nederst
ne: फेदको नेभिगेसन
pa: ਹੇਠਾਂ ਵੱਲ ਨੈਵੀਗੇਸ਼ਨ
pl: Dolna nawigacja
pt: Navegação na parte inferior
pt_pt: Navegação inferior
ro: Navigarea în partea de jos
ru: Навигация внизу экрана
si: පහළ සංචාලනය
sk: Dolná navigácia
sq: Navigimi poshtë
sr: Доња навигација
sr_latn: Donja navigacija
sv: Navigering längst ned på skärmen
te: కిందికి నావిగేషన్
tr: Alt gezinme
uk: Навігація в нижній частині екрана
ur: نیچے نیویگیشن
uz: Ekran pastidagi navigatsiya
vi: Thanh điều hướng dưới cùng
zh_hk: 底部導覽
zu: Ukuzulela phansi

# settingsLightTheme
source: Light
af: Lig
am: ብርሃን
ar_eg: فاتح
as: পাতল
az: İşıqlı
be: Светлая
bn: আলো
bs: Svijetla
ca: Clar
da: Lyst
es_ar: Claro
et: Hele
eu: Argia
fa: روشن
fil: Maliwanag
fr_ca: Clair
gl: Claro
gu: આછી
he: בהיר
hi: हल्के रंग की थीम
hu: Világos
hy: Բաց
id: Terang
it: Chiaro
ja: ライト
ka: ღია
km: ភ្លឺ
kn: ಲೈಟ್
ko: 밝게
ky: Жарык
lo: ແຈ້ງ
lt: Šviesioji tema
lv: Gaišs
mk: Светла
ml: പ്രകാശം
mn: Цайвар
mr: फिकट
ms: Cerah
my: အလင်း
nb: Lyst
ne: उज्यालो
pa: ਹਲਕਾ
pl: Jasny
pt: Claro
pt_pt: Claro
ro: Luminoasă
ru: Светлая
si: සැහැල්ලු
sk: Svetlý
sq: E ndriçuar
sr: Светла
sr_latn: Svetla
sv: Ljust
te: కాంతివంతం
th: สีสว่าง
tr: Açık
uk: Світла
ur: ہلکی
uz: Kunduzgi
vi: Sáng
zh_hk: 淺色
zu: Ukukhanya

# settingsTheme
source: Theme
af: Tema
am: ገጽታ
ar_eg: التصميم
as: থীম
az: Tema
be: Тэма
bn: থিম
bs: Tema
ca: Tema
da: Tema
es_ar: Tema
et: Teema
eu: Gaia
fa: زمینه
fil: Tema
fr_ca: Thème
gl: Tema
gu: થીમ
he: עיצוב
hi: थीम
hu: Téma
hy: Թեմա
id: Tema
it: Tema
ja: テーマ
ka: თემა
km: រចនាប័ទ្ម
kn: ಥೀಮ್
ko: 테마
ky: Тема
lo: ຮູບແບບສີສັນ
lt: Tema
lv: Motīvs
mk: Тема
ml: തീം
mn: Загвар
mr: थीम
ms: Tema
my: အပြင်အဆင်
nb: Tema
ne: विषयवस्तु
pa: ਥੀਮ
pl: Motyw
pt: Tema
pt_pt: Tema
ro: Temă
ru: Тема
si: තේමාව
sk: Motív
sq: Tema
sr: Тема
sr_latn: Tema
sv: Tema
te: థీమ్
th: ธีม
tr: Tema
uk: Тема
ur: تھیم
uz: Mavzu
vi: Giao diện
zh_hk: 主題
zu: itimu

# settingsTextDirectionRTL
source: RTL
af: R.N.L.
am: ቀኝ-ወደ-ግራ
ar_eg: من اليمين إلى اليسار
as: সোঁফালৰ পৰা বাওঁফাললৈ
az: Sağdan sola
be: Справа налева
bs: Zdesna nalijevo
ca: Dreta a esquerra
da: HTV
es_ar: DER. a IZQ.
et: Paremalt vasakule
eu: Eskuinetik ezkerrera
fa: راست به چپ
fr_ca: De droite à gauche
gl: De dereita a esquerda
he: מימין לשמאל
hi: दाएं से बाएं
hu: Jobbról balra
hy: Աջից ձախ
it: Da destra a sinistra
ka: მარჯვნიდან მარცხნივ დამწერლობებისათვის
km: ពីស្ដាំ​ទៅឆ្វេង
kn: ಬಲದಿಂದ ಎಡಕ್ಕೆ
ko: 오른쪽에서 왼쪽으로
ky: ОС
lt: Iš dešinės į kairę
lv: No labās puses uz kreiso pusi
mk: Десно кон лево
mn: Баруунаас зүүн
nb: HTV
ne: दायाँबाट बायाँ
pl: Od prawej do lewej
ro: De la dreapta la stânga
ru: Справа налево
sk: P-Ľ
sr: Здесна налево
sr_latn: Zdesna nalevo
sv: Höger till vänster
uk: Справа наліво
uz: Oʻngdan chapga
vi: Phải qua trái
zh_hk: 由右至左顯示文字

# settingsTextScalingHuge
source: Huge
af: Baie groot
am: ግዙፍ
ar_eg: ضخم
as: বৃহৎ
az: Böyük
be: Вялізны
bn: সবচেয়ে বড়
bs: Ogromno
ca: Molt gran
da: Meget stor
es_ar: Enorme
et: Väga suur
eu: Erraldoia
fa: بسیار بزرگ
fil: Napakalaki
fr_ca: Très grande
gl: Moi grande
gu: વિશાળ
he: ענק
hi: बहुत बड़ा
hu: Óriási
hy: Շատ մեծ
id: Sangat besar
it: Molto grande
ja: 極大
ka: უზარმაზარი
km: ធំសម្បើម
kn: ಬಹಳ ದೊಡ್ಡದು
ko: 아주 크게
ky: Өтө чоң
lo: ໃຫຍ່ຫຼາຍ
lt: Didžiulis
lv: Milzīgs
mk: Огромен
ml: വളരെ വലുത്
mn: Асар том
mr: प्रचंड
ms: Sangat Besar
my: ဧရာမ
nb: Enorm
ne: विशाल
pa: ਵਿਸ਼ਾਲ
pl: Wielki
pt: Enorme
pt_pt: Enorme
ro: Foarte mare
ru: Очень крупный
si: දැවැන්ත
sk: Veľmi veľké
sq: Shumë i madh
sr: Огроман
sr_latn: Ogroman
sv: Mycket stor
te: భారీగా
th: ใหญ่มาก
tr: Çok büyük
uk: Дуже великий
ur: بہت بڑا
uz: Juda katta
vi: Rất lớn
zh_hk: 巨大
zu: Nkulu kakhulu

# cupertinoButton
source: Button
af: Knoppie
am: አዝራር
ar_eg: زر
as: বুটাম
az: Düymə
be: Кнопка
bn: বোতাম
bs: Dugme
ca: Botó
da: Knap
es_ar: Botón
et: Nupp
eu: Botoia
fa: دکمه
fr_ca: Bouton
gl: Botón
gu: બટન
he: לחצן
hi: बटन
hu: Gomb
hy: Կոճակ
id: Tombol
it: Pulsante
ja: ボタン
ka: ღილაკი
km: ប៊ូតុង
kn: ಬಟನ್
ko: 버튼
ky: Баскыч
lo: ປຸ່ມ
lt: Mygtukas
lv: Poga
mk: Копче
ml: ബട്ടൺ
mn: Товчлуур
mr: बटण
ms: Butang
my: ခလုတ်
nb: Knapp
ne: बटन
pa: ਬਟਨ
pl: Przycisk
pt: Botão
pt_pt: Botão
ro: Buton
ru: Кнопка
si: බොත්තම
sk: Tlačidlo
sq: Butoni
sr: Дугме
sr_latn: Dugme
sv: Knapp
te: బటన్
th: ปุ่ม
tr: Düğme
uk: Кнопка
ur: بٹن
uz: Tugma
vi: Nút
zh_hk: 按鈕
zu: Inkinobho

# settingsTextScalingNormal
source: Normal
af: Normaal
am: መደበኛ
ar_eg: عادي
as: সাধাৰণ
be: Звычайны
bn: সাধারণ
bs: Normalno
et: Tavaline
eu: Normala
fa: عادی
fr_ca: Normale
gu: સામાન્ય
he: רגיל
hi: सामान्य
hu: Normál
hy: Սովորական
it: Normale
ja: 標準
ka: ჩვეულებრივი
km: ធម្មតា
kn: ಸಾಮಾನ್ಯ
ko: 보통
ky: Орточо
lo: ປົກກະຕິ
lt: Įprastas
lv: Parasts
mk: Нормално
ml: സാധാരണം
mn: Энгийн
mr: सामान्य
ms: Biasa
my: ပုံမှန်
nb: Vanlig
ne: साधारण
pa: ਸਧਾਰਨ
pl: Normalny
ru: Обычный
si: සාමාන්‍ය
sk: Normálna
sq: Normale
sr: Уобичајен
sr_latn: Uobičajen
te: సాధారణం
th: ปกติ
uk: Звичайний
ur: عام
vi: Thường
zh_hk: 中
zu: Jwayelekile

# settingsTextScalingSmall
source: Small
af: Klein
am: ትንሽ
ar_eg: صغير
as: সৰু
az: Kiçik
be: Дробны
bn: ছোট
bs: Malo
ca: Petit
da: Lille
es_ar: Pequeño
et: Väike
eu: Txikia
fa: کوچک
fil: Maliit
fr_ca: Petite
gl: Pequena
gu: નાનું
he: קטן
hi: छोटा
hu: Kicsi
hy: Փոքր
id: Kecil
it: Piccolo
ja: 小
ka: მცირე
km: តូច
kn: ಸಣ್ಣದು
ko: 작게
ky: Кичине
lo: ນ້ອຍ
lt: Mažas
lv: Mazs
mk: Мал
ml: ചെറുത്
mn: Жижиг
mr: लहान
ms: Kecil
my: အသေး
nb: Liten
ne: सानो
pa: ਛੋਟਾ
pl: Mały
pt: Pequeno
pt_pt: Pequeno
ro: Mic
ru: Мелкий
si: කුඩා
sk: Malé
sq: I vogël
sr: Мали
sr_latn: Mali
sv: Liten
te: చిన్నవిగా
th: เล็ก
tr: Küçük
uk: Малий
ur: چھوٹا
uz: Kichik
vi: Nhỏ
zh_hk: 小
zu: Omncane

# settingsSystemDefault
source: System
af: Stelsel
am: ሥርዓት
ar_eg: النظام
as: ছিষ্টেম
az: Sistem
be: Сістэма
bn: সিস্টেম
bs: Sistem
ca: Sistema
es_ar: Sistema
et: Süsteem
eu: Sistema
fa: سیستم
fr_ca: Système
gl: Sistema
gu: સિસ્ટમ
he: מערכת
hi: सिस्टम
hu: Rendszer
hy: Համակարգ
id: Sistem
it: Sistema
ja: システム
ka: სისტემა
km: ប្រព័ន្ធ
kn: ಸಿಸ್ಟಂ
ko: 시스템
ky: Тутум
lo: ລະບົບ
lt: Sistema
lv: Sistēma
mk: Систем
ml: സിസ്റ്റം
mn: Систем
mr: सिस्टम
ms: Sistem
my: စနစ်
ne: प्रणाली
pa: ਸਿਸਟਮ
pl: Systemowy
pt: Sistema
pt_pt: Sistema
ro: Sistem
ru: Системные настройки
si: පද්ධතිය
sk: Systém
sq: Sistemi
sr: Систем
sr_latn: Sistem
te: సిస్టమ్
th: ระบบ
tr: Sistem
uk: Система
ur: سسٹم
uz: Tizim
vi: Hệ thống
zh_hk: 系統
zu: Isistimu

# settingsTitle
source: Settings
af: Instellings
am: ቅንብሮች
ar_eg: الإعدادات
as: ছেটিংসমূহ
az: Ayarlar
be: Налады
bn: সেটিংস
bs: Postavke
ca: Configuració
da: Indstillinger
es_ar: Configuración
et: Seaded
eu: Ezarpenak
fa: تنظیمات
fil: Mga Setting
fr_ca: Paramètres
gl: Configuración
gu: સેટિંગ
he: הגדרות
hi: सेटिंग
hu: Beállítások
hy: Կարգավորումներ
id: Setelan
it: Impostazioni
ja: 設定
ka: პარამეტრები
km: ការកំណត់
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ko: 설정
ky: Параметрлер
lo: ການຕັ້ງຄ່າ
lt: Nustatymai
lv: Iestatījumi
mk: Поставки
ml: ക്രമീകരണം
mn: Тохиргоо
mr: सेटिंग्ज
ms: Tetapan
my: ဆက်တင်များ
nb: Innstillinger
ne: सेटिङ
pa: ਸੈਟਿੰਗਾਂ
pl: Ustawienia
pt: Configurações
pt_pt: Definições
ro: Setări
ru: Настройки
si: සැකසීම්
sk: Nastavenia
sq: Cilësimet
sr: Подешавања
sr_latn: Podešavanja
sv: Inställningar
te: సెట్టింగ్‌లు
th: การตั้งค่า
tr: Ayarlar
uk: Налаштування
ur: ترتیبات
uz: Sozlamalar
vi: Cài đặt
zh_hk: 設定
zu: Izilungiselelo

# rallyDescription
source: A personal finance app
af: 'n Program vir jou persoonlike geldsake
am: የግል የፋይናንስ መተግበሪያ
ar_eg: تطبيق للتمويل الشخصي
as: এটা ব্যক্তিগত বিত্তীয় এপ্‌
az: Şəxsi maliyyə tətbiqi
be: Праграма для кіравання асабістымі фінансамі
bn: ব্যক্তিগত ফাইনান্স অ্যাপ
bs: Aplikacija za lične finansije
ca: Una aplicació de finances personal
da: En personlig økonomiapp
es_ar: Una app personal de finanzas
et: Isiklik finantsrakendus
eu: Finantza-aplikazio pertsonala
fa: یک برنامه مالی شخصی
fil: Isang personal na finance app
fr_ca: Une application pour les finances personnelles
gl: Aplicación financeira persoal
gu: વ્યક્તિગત નાણાંકીય આયોજન માટેની ઍપ
he: אפליקציה אישית לניהול פיננסי
hi: निजी तौर पर पैसाें से जुड़ी सुविधाएं देने वाला ऐप्लिकेशन
hu: Személyes pénzügyi alkalmazás
hy: Բյուջեի պլանավորման հավելված
id: Aplikasi keuangan pribadi
it: Un'app per le finanze personali
ja: 資産管理アプリ
ka: პირადი ფინანსების აპი
km: កម្មវិធីហិរញ្ញវត្ថុ​ផ្ទាល់ខ្លួន
kn: ವೈಯಕ್ತಿಕ ಹಣಕಾಸು ಆ್ಯಪ್
ko: 개인 자산관리 앱
ky: Жеке каржы колдонмосу
lo: ແອັບການເງິນສ່ວນຕົວ
lt: Asmeninių finansų programa
lv: Personisko finanšu lietotne
mk: Апликација за лични финансии
ml: വ്യക്തിഗത ഫിനാൻസ് ആപ്പ്
mn: Хувийн санхүүгийн апп
mr: वैयक्तिक अर्थसहाय्य अ‍ॅप
ms: Apl kewangan peribadi
my: ကိုယ်ပိုင် ငွေကြေးဆိုင်ရာ အက်ပ်
nb: En app for privatøkonomi
ne: व्यक्तिगत वित्त व्यवस्थापनसम्बन्धी एप
pa: ਨਿੱਜੀ ਵਿੱਤੀ ਐਪ
pl: Aplikacja do zarządzania finansami osobistymi
pt: Um app de finanças pessoais
pt_pt: Uma aplicação de finanças pessoal
ro: O aplicație pentru finanțe personale
ru: Приложение для планирования бюджета
si: පුද්ගලික මූල්‍ය යෙදුමක්
sk: Osobná finančná aplikácia
sq: Një aplikacion për financat personale
sr: Апликација за личне финансије
sr_latn: Aplikacija za lične finansije
sv: En app för privatekonomi
te: పర్సనల్ ఫైనాన్స్ యాప్
th: แอปการเงินส่วนบุคคล
tr: Kişisel finans uygulaması
uk: Додаток для керування особистими фінансами
ur: ایک ذاتی اقتصادی ایپ
uz: Budjetni rejalashtirish uchun ilova
vi: Một ứng dụng tài chính cá nhân
zh_hk: 個人理財應用程式
zu: Uhlelo lokusebenza lezezimali zomuntu

# aboutDialogDescription
source: To see the source code for this app, please visit the {repoLink}.
af: Besoek die {repoLink} om hierdie program se bronkode te sien.
am: የዚህ መተግበሪያ ኮድ ምንጭ ኮድን ለማየት እባክዎ {repoLink}ን ይጎብኙ።
ar_eg: للاطّلاع على رمز المصدر لهذا التطبيق، يُرجى زيارة {repoLink}.
as: এই এপ্‌টোৰ উৎস ক’ডটো চাবলৈ, অনুগ্ৰহ কৰি {repoLink}লৈ যাওক।
az: Bu tətbiqin mənbə koduna baxmaq üçün {repoLink} ünvanına daxil olun.
be: Каб праглядзець зыходны код гэтай праграмы, акрыйце старонку {repoLink}.
bn: এই অ্যাপের সোর্স কোড দেখতে {repoLink}-এ দেখুন।
bs: Da vidite izvorni kôd za ovu aplikaciju, posjetite {repoLink}.
ca: Per consultar el codi font d'aquesta aplicació, visita el {repoLink}.
da: Gå til {repoLink}. for at se kildekoden for denne app.
es_ar: Para ver el código fuente de esta app, visita {repoLink}.
et: Selle rakenduse lähtekoodi nägemiseks vaadake siia: {repoLink}.
eu: Aplikazio honen iturburu-kodea ikusteko, joan hona: {repoLink}.
fa: برای دیدن کد منبع این برنامه ، لطفاً به {repoLink} بروید.
fil: Para makita ang source code para sa app na ito, pakibisita ang {repoLink}.
fr_ca: Pour voir le code source de cette application, veuillez consulter le {repoLink}.
gl: Para ver o código fonte desta aplicación, accede ao {repoLink}.
gu: આ ઍપનો સૉર્સ કોડ જોવા માટે, કૃપા કરીને {repoLink}ની મુલાકાત લો.
he: כדי לראות את קוד המקור של האפליקציה הזו, יש להיכנס אל {repoLink}.
hi: इस ऐप्लिकेशन का सोर्स कोड देखने के लिए, कृपया {repoLink} पर जाएं.
hu: Az alkalmazás forráskódjának megtekintéséhez keresse fel a következőt: {repoLink}.
hy: Այս հավելվածի կոդը տեսնելու համար բացեք {repoLink} էջը։
id: Untuk melihat kode sumber aplikasi ini, buka {repoLink}.
it: Per visualizzare il codice sorgente di questa app, visita il {repoLink}.
ja: このアプリのソースコードは {repoLink} で確認できます。
ka: ამ აპის საწყისი კოდის სანახავად, გთხოვთ, მოინახულოთ {repoLink}.
km: ដើម្បី​មើល​កូដ​ប្រភព​សម្រាប់​កម្មវិធី​នេះ សូមចូល​ទៅកាន់ {repoLink}​។
kn: ಈ ಆ್ಯಪ್‌ನ ಮೂಲ ಕೋಡ್ ಅನ್ನು ನೋಡಲು, {repoLink} ಗೆ ಭೇಟಿ ನೀಡಿ.
ko: 앱의 소스 코드를 보려면 {repoLink}(으)로 이동하세요.
ky: Бул колдонмонун кодун көрүү үчүн төмөнкүгө баш багыңыз: {repoLink}.
lo: ເພື່ອເບິ່ງຊອດໂຄດສຳລັບແອັບນີ້, ກະລຸນາໄປທີ່ {repoLink}.
lt: Norėdami peržiūrėti šios programos šaltinio kodą apsilankykite adresu {repoLink}.
lv: Lai skatītu šīs lietotnes pirmkodu, lūdzu, apmeklējiet: {repoLink}.
mk: За да го видите изворниот код на апликацијава, одете на {repoLink}.
ml: ഈ ആപ്പിനുള്ള സോഴ്‌സ് കോഡ് കാണാൻ {repoLink} സന്ദർശിക്കുക.
mn: Энэ аппын эх кодыг харахын тулд {repoLink} хаягаар зочилно уу.
mr: या अ‍ॅपसाठी स्रोत कोड पाहण्याकरिता, कृपया {repoLink} ला भेट द्या.
ms: Untuk melihat kod sumber apl ini, sila lawati {repoLink}.
my: ဤအက်ပ်အတွက် ကုဒ်အရင်းအမြစ်ကို ကြည့်ရန် {repoLink} သို့ သွားပါ။
nb: For å se kildekoden for denne appen, gå til {repoLink}.
ne: यो एपको सोर्स कोड हेर्न कृपया {repoLink} मा जानुहोस्।
pa: ਇਸ ਐਪ ਲਈ ਸਰੋਤ ਕੋਡ ਦੇਖਣ ਲਈ, ਕਿਰਪਾ ਕਰਕੇ {repoLink} 'ਤੇ ਜਾਓ।
pl: Aby zobaczyć kod źródłowy tej aplikacji, odwiedź {repoLink}.
pt: Para ver o código-fonte desse app, acesse {repoLink}.
pt_pt: Para ver o código-fonte desta app, visite o {repoLink}.
ro: Ca să vedeți codul sursă al acestei aplicații, accesați {repoLink}.
ru: Чтобы посмотреть код этого приложения, откройте {repoLink}.
si: මෙම යෙදුම සඳහා මූලාශ්‍ර කේතය බැලීමට කරුණාකර {repoLink} වෙත පිවිසෙන්න.
sk: Ak si chcete zobraziť zdrojový kód tejto aplikácie, prejdite na {repoLink}.
sq: Për të parë kodin burimor për këtë aplikacion, vizito {repoLink}.
sr: Да бисте видели изворни кôд за ову апликацију, посетите {repoLink}.
sr_latn: Da biste videli izvorni kôd za ovu aplikaciju, posetite {repoLink}.
sv: Besök {repoLink} om du vill se källkoden för den här appen.
te: ఈ యాప్ సోర్స్ కోడ్‌ను చూడటానికి, దయచేసి {repoLink}ను సందర్శించండి.
th: โปรดไปที่ {repoLink} เพื่อดูซอร์สโค้ดของแอปนี้
tr: Bu uygulamanın kaynak kodunu görmek için lütfen {repoLink} sayfasını ziyaret edin.
uk: Щоб переглянути вихідний код цього додатка, відвідайте сторінку {repoLink}.
ur: اس ایپ کے لیے ماخذ کوڈ دیکھنے کے لیے، براہ کرم {repoLink} کا ملاحظہ کریں۔
uz: Bu ilovaning manba kodini koʻrish uchun bu yerga kiring: {repoLink}.
vi: Để xem mã nguồn của ứng dụng này, vui lòng truy cập vào {repoLink}.
zh_hk: 如要查看此應用程式的原始碼，請前往 {repoLink}。
zu: Ukuze ubone ikhodi yomthombo yalolu hlelo lokusebenza, sicela uvakashele i-{repoLink}.

# bottomNavigationCommentsTab
source: Comments
af: Opmerkings
am: አስተያየቶች
ar_eg: التعليقات
as: মন্তব্যসমূহ
az: Şərhlər
be: Каментарыі
bn: মন্তব্য
bs: Komentari
ca: Comentaris
da: Kommentarer
es_ar: Comentarios
et: Kommentaarid
eu: Iruzkinak
fa: نظرات
fil: Mga Komento
fr_ca: Commentaires
gl: Comentarios
gu: કૉમેન્ટ
he: תגובות
hi: टिप्पणियां
hu: Megjegyzések
hy: Մեկնաբանություններ
id: Komentar
it: Commenti
ja: コメント
ka: კომენტარები
km: មតិ
kn: ಕಾಮೆಂಟ್‌ಗಳು
ko: 댓글
ky: Пикирлер
lo: ຄຳເຫັນ
lt: Komentarai
lv: Komentāri
mk: Коментари
ml: കമന്റുകൾ
mn: Сэтгэгдлүүд
mr: टिप्पण्या
ms: Ulasan
my: မှတ်ချက်များ
nb: Kommentarer
ne: टिप्पणीहरू
pa: ਟਿੱਪਣੀਆਂ
pl: Komentarze
pt: Comentários
pt_pt: Comentários
ro: Comentarii
ru: Комментарии
si: අදහස් දැක්වීම්
sk: Komentáre
sq: Komente
sr: Коментари
sr_latn: Komentari
sv: Kommentarer
te: కామెంట్‌లు
th: ความคิดเห็น
tr: Yorumlar
uk: Коментарі
ur: تبصرے
uz: Fikrlar
vi: Bình luận
zh_hk: 留言
zu: Amazwana

# starterAppGenericBody
source: Body
af: Liggaam
am: አካል
ar_eg: النص
as: মূল অংশ
az: Əsas
be: Асноўны тэкст
bn: মুখ্য অংশ
bs: Glavni tekst
ca: Cos
da: Brødtekst
es_ar: Cuerpo
et: Sisu
eu: Gorputza
fa: متن اصلی
fil: Nilalaman
fr_ca: Corps du texte
gl: Corpo
gu: મુખ્ય ભાગ
he: גוף הטקסט
hi: मुख्य भाग
hu: Szövegtörzs
hy: Հիմնական տեքստ
id: Isi
it: Corpo
ja: 本文
ka: ძირითადი ტექსტი
km: តួ​អត្ថបទ
kn: ಮುಖ್ಯ ಭಾಗ
ko: 본문
ky: Негизги текст
lo: ສ່ວນເນື້ອຫາ
lt: Pagrindinė dalis
lv: Pamatteksts
mk: Главен текст
ml: ബോഡി
mn: Үндсэн хэсэг
mr: मुख्य मजकूर
ms: Kandungan
my: စာကိုယ်
nb: Brødtekst
ne: मुख्य भाग
pa: ਬਾਡੀ
pl: Treść
pt: Corpo
pt_pt: Corpo
ro: Corp
ru: Основной текст
si: අන්තර්ගතය
sk: Obsahová časť
sq: Trupi
sr: Главни текст
sr_latn: Glavni tekst
sv: Brödtext
te: ప్రధాన భాగం
th: เนื้อความ
tr: Gövde
uk: Основний текст
ur: مضمون
uz: Asosiy qism
vi: Nội dung
zh_hk: 內文
zu: Umzimba

# starterAppGenericHeadline
source: Headline
af: Hoofopskrif
am: አርዕስተ ዜና
ar_eg: العنوان
as: শীৰ্ষ শিৰোনাম
az: Başlıq
be: Загаловак
bn: শিরোনাম
bs: Naslov
ca: Títol
da: Overskrift
es_ar: Título
et: Pealkiri
eu: Goiburua
fa: عنوان
fr_ca: Titre
gl: Titular
gu: હેડલાઇન
he: כותרת
hi: टाइटल
hu: Címsor
hy: Խորագիր
id: Judul
it: Titolo
ja: 見出し
ka: სათაური
km: ចំណង​ជើង
kn: ಶೀರ್ಷಿಕೆ
ko: 헤드라인
ky: Башкы сап
lo: ​ຫົວ​ຂໍ້
lt: Antraštė
lv: Virsraksts
mk: Наслов
ml: തലക്കെട്ട്
mn: Толгой гарчиг
mr: ठळक शीर्षक
ms: Tajuk
my: ခေါင်းစီး
nb: Overskrift
ne: शीर्षक
pa: ਸੁਰਖੀ
pl: Nagłówek
pt: Título
pt_pt: Título
ro: Titlu
ru: Заголовок
si: සිරස්තලය
sk: Nadpis
sq: Titulli
sr: Наслов
sr_latn: Naslov
sv: Rubrik
te: ప్రధాన శీర్షిక
th: บรรทัดแรก
tr: Başlık
uk: Заголовок
ur: سرخی
uz: Sarlavha
vi: Tiêu đề
zh_hk: 標題
zu: Isihlokwana

# starterAppGenericSubtitle
source: Subtitle
af: Subtitel
am: የግርጌ ጽሁፍ
ar_eg: العنوان الفرعي
as: ছাবটাইটেল
az: Alt başlıq
be: Падзагаловак
bn: সাবটাইটেল
bs: Titlovi
ca: Subtítol
da: Undertekst
es_ar: Subtítulo
et: Alapealkiri
eu: Azpititulua
fa: زیرنویس
fr_ca: Sous-titre
gl: Subtítulo
gu: ઉપશીર્ષક
he: כתובית
hi: सबटाइटल
hu: Alcím
hy: Ենթավերնագիր
id: Subtitel
it: Sottotitolo
ja: 字幕
ka: სუბტიტრი
km: ចំណងជើង​រង
kn: ಉಪಶೀರ್ಷಿಕೆ
ko: 자막
ky: Коштомо жазуу
lo: ຄຳແປ
lt: Paantraštė
lv: Apakšvirsraksts
mk: Поднаслов
ml: സബ്ടൈറ്റിൽ
mn: Дэд гарчиг
mr: उपशीर्षक
ms: Tajuk kecil
my: ခေါင်းစဉ်ငယ်
nb: Undertittel
ne: उपशीर्षक
pa: ਉਪਸਿਰੇਲਖ
pl: Podtytuł
pt: Subtítulo
pt_pt: Legenda
ro: Subtitlu
ru: Подзаголовок
si: උපසිරැසිය
sk: Podnadpis
sq: Nënemërtim
sr: Титл
sr_latn: Titl
sv: Underrubrik
te: ఉప శీర్షిక
th: คำบรรยาย
tr: Alt başlık
uk: Підзаголовок
ur: سب ٹائٹل
uz: Taglavha
vi: Phụ đề
zh_hk: 副標題
zu: Umbhalo ongezansi

# starterAppGenericTitle
source: Title
af: Titel
am: ርዕስ
ar_eg: العنوان
as: শিৰোনাম
az: Başlıq
be: Назва
bn: শীর্ষক
bs: Naslov
ca: Títol
da: Titel
es_ar: Título
et: Pealkiri
eu: Izena
fa: عنوان
fil: Pamagat
fr_ca: Titre
gl: Título
gu: શીર્ષક
he: כותרת
hi: टाइटल
hu: Cím
hy: Անուն
id: Judul
it: Titolo
ja: タイトル
ka: სათაური
km: ចំណង​ជើង
kn: ಶೀರ್ಷಿಕೆ
ko: 제목
ky: Аталышы
lo: ຊື່
lt: Pavadinimas
lv: Nosaukums
mk: Наслов
ml: പേര്
mn: Гарчиг
mr: शीर्षक
ms: Tajuk
my: ခေါင်းစဉ်
nb: Tittel
ne: शीर्षक
pa: ਸਿਰਲੇਖ
pl: Tytuł
pt: Título
pt_pt: Título
ro: Titlu
ru: Название
si: මාතෘකාව
sk: Názov
sq: Titulli
sr: Наслов
sr_latn: Naslov
sv: Titel
te: పేరు
th: ชื่อ
tr: Başlık
uk: Назва
ur: عنوان
uz: Nomi
vi: Tiêu đề
zh_hk: 標題
zu: Isihloko

# starterAppTooltipSearch
source: Search
af: Soek
am: ፍለጋ
ar_eg: البحث
az: Axtarış
be: Пошук
bs: Pretražite
ca: Cerca
da: Søg
es_ar: Buscar
et: Otsing
eu: Bilatu
fa: جستجو
fil: Maghanap
fr_ca: Rechercher
gl: Buscar
he: חיפוש
hu: Keresés
hy: Որոնում
id: Telusuri
it: Cerca
ja: 検索
ka: ძიება
km: ស្វែងរក
ko: 검색
ky: Издөө
lo: ຊອກຫາ
lt: Ieškoti
lv: Meklēt
mk: Пребарување
mn: Хайлт
ms: Carian
my: ရှာဖွေရန်
nb: Søk
ne: खोज्नुहोस्
pl: Szukaj
pt: Pesquisar
pt_pt: Pesquisar
ro: Căutați
ru: Поиск
si: සෙවීම
sk: Hľadať
sq: Kërko
sr: Претрага
sr_latn: Pretraga
sv: Sök
th: ค้นหา
tr: Ara
uk: Пошук
ur: تلاش
uz: Qidiruv
vi: Tìm kiếm
zh_hk: 搜尋
zu: Sesha

# starterAppTooltipShare
source: Share
af: Deel
am: አጋራ
ar_eg: مشاركة
as: শ্বেয়াৰ কৰক
az: Paylaşın
be: Абагуліць
bn: শেয়ার করুন
bs: Dijeljenje
ca: Comparteix
da: Del
es_ar: Compartir
et: Jaga
eu: Partekatu
fa: هم‌رسانی
fil: Ibahagi
fr_ca: Partager
gl: Compartir
gu: શેર કરો
he: שיתוף
hi: शेयर करें
hu: Megosztás
hy: Կիսվել
id: Bagikan
it: Condividi
ja: 共有
ka: გაზიარება
km: ចែករំលែក
kn: ಹಂಚಿಕೊಳ್ಳಿ
ko: 공유
ky: Бөлүшүү
lo: ແບ່ງປັນ
lt: Bendrinti
lv: Kopīgot
mk: Сподели
ml: പങ്കിടുക
mn: Хуваалцах
mr: शेअर करा
ms: Kongsi
my: မျှဝေရန်
nb: Del
ne: सेयर गर्नुहोस्
pa: ਸਾਂਝਾ ਕਰੋ
pl: Udostępnij
pt: Compartilhar
pt_pt: Partilhar
ro: Trimiteți
ru: Поделиться
si: බෙදා ගන්න
sk: Zdieľať
sq: Ndaj
sr: Делите
sr_latn: Delite
sv: Dela
te: షేర్ చేస్తుంది
th: แชร์
tr: Paylaş
uk: Поділитися
ur: اشتراک کریں
uz: Ulashish
vi: Chia sẻ
zh_hk: 分享
zu: Yabelana

# starterAppTooltipFavorite
source: Favorite
af: Merk as gunsteling
am: ተወዳጅ
ar_eg: الإضافة إلى السلع المفضّلة
as: প্ৰিয়
az: Sevimli
be: Абранае
bn: পছন্দ
bs: Omiljeno
ca: Preferit
da: Angiv som favorit
es_ar: Favoritos
et: Lisa lemmikutesse
eu: Gogokoa
fa: دلخواه
fil: Paborito
fr_ca: Favori
gl: Favorito
gu: મનપસંદ
he: פריט מועדף
hi: पसंदीदा
hu: Hozzáadás a Kedvencekhez
hy: Ընտրանի
id: Favorit
it: Aggiungi ai preferiti
ja: お気に入り
ka: რჩეული
km: សំណព្វ
kn: ಮೆಚ್ಚಿನದು
ko: 즐겨찾기
ky: Тандалмаларга кошуу боюнча кеңештер
lo: ລາຍການທີ່ມັກ
lt: Mėgstamiausi
lv: Izlase
mk: Омилена
ml: പ്രിയപ്പെട്ടത്
mn: Дуртай
mr: आवडते
ms: Kegemaran
my: အကြိုက်ဆုံး
nb: Favoritt
ne: मन पर्ने
pa: ਮਨਪਸੰਦ
pl: Ulubione
pt: Favorito
pt_pt: Favoritos
ro: Preferat
ru: Избранное
si: ප්‍රියතම
sk: Zaradiť medzi obľúbené
sq: Të preferuara
sr: Омиљено
sr_latn: Omiljeno
sv: Favorit
te: ఇష్టమైనది
th: รายการโปรด
tr: Favoriler listesine ekle
uk: Вибране
ur: پسندیدہ
uz: Sevimli
vi: Mục yêu thích
zh_hk: 我的最愛
zu: Intandokazi
