Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# dialogSelectedOption
source: You selected: "{value}"
af: Jy het gekies: "{value}"
am: እርስዎ ይህን መርጠዋል፦ «{value}»
ar_eg: لقد اخترت القيمة التالية: "{value}"
as: আপুনি এইটো বাছনি কৰিছে: "{value}"
az: "{value}" seçdiniz
be: Вы выбралі: "{value}"
bn: আপনি বেছে নিয়েছেন: "{value}"
bs: Odabrali ste: "{value}"
ca: Has seleccionat: "{value}"
da: Du valgte: "{value}"
es_ar: Seleccionaste: "{value}"
et: Teie valik: „{value}”
eu: Hau hautatu duzu: "{value}"
fa: «{value}» را انتخاب کردید
fil: Pinili mo ang: "{value}"
fr_ca: Vous avez sélectionné : "{value}"
gl: Seleccionaches: "{value}"
gu: તમે પસંદ કર્યું: "{value}"
he: בחרת: "{value}"
hi: आपने चुना है: "{value}"
hu: Az Ön által választott érték: „{value}”
hy: Դուք ընտրել եք՝ «{value}»
id: Anda memilih: "{value}"
it: Hai selezionato: "{value}"
ja: 「{value}」を選択しました
ka: თქვენ აირჩიეთ: „{value}“
km: អ្នកបាន​ជ្រើសរើស៖ "{value}"
kn: ನೀವು ಆಯ್ಕೆಮಾಡಿದ್ದೀರಿ: "{value}"
ko: '{value}'을(를) 선택했습니다.
ky: Сиз төмөнкүнү тандадыңыз: "{value}"
lo: ທ່ານເລືອກ: "{value}" ແລ້ວ
lt: Pasirinkote: "{value}"
lv: Jūs atlasījāt: “{value}”
mk: Избравте: „{value}“
ml: നിങ്ങൾ തിരഞ്ഞെടുത്തത്: "{value}"
mn: Та дараахыг сонгосон: "{value}"
mr: तुम्ही निवडली: "{value}"
ms: Anda memilih: "{value}"
my: သင်ရွေးထားသည့်အရာ- "{value}"
nb: Du valgte «{value}»
ne: तपाईंले यो चयन गर्नुभयो: "{value}"
pa: ਤੁਸੀਂ ਚੁਣਿਆ: "{value}"
pl: Wybrano: „{value}”
pt: Você selecionou: "{value}"
pt_pt: Selecionou: "{value}"
ro: Ați selectat: „{value}”
ru: Вы выбрали значение "{value}".
si: ඔබ මෙය තෝරා ඇත: "{value}"
sk: Vybrali ste: {value}
sq: Zgjodhe: "{value}"
sr: Изабрали сте: „{value}“
sr_latn: Izabrali ste: „{value}“
sv: Du har valt {value}
te: మీరు ఎంపిక చేసింది: "{value}"
th: คุณเลือก "{value}"
tr: Şunu seçtiniz: "{value}"
uk: Вибрано: "{value}"
ur: آپ نے منتخب کیا: "{value}"
uz: Siz tanlagan qiymat: "{value}"
vi: Bạn đã chọn: "{value}"
zh_hk: 您已選取：「{value}」
zu: Ukhethe: "{value}"

# dialogDiscardTitle
source: Discard draft?
af: Gooi konsep weg?
am: ረቂቅ ይጣል?
ar_eg: هل تريد تجاهل المسودة؟
as: খচৰা প্ৰত্যাখ্যান কৰিবনে?
az: Qaralama silinsin?
be: Адхіліць чарнавік?
bn: ড্রাফ্ট বাতিল করতে চান?
bs: Odbaciti nedovršenu verziju?
ca: Vols descartar l'esborrany?
da: Vil du kassere kladden?
es_ar: ¿Quieres descartar el borrador?
et: Kas loobuda mustandist?
eu: Zirriborroa baztertu nahi duzu?
fa: از پیش‌نویس صرف‌نظر شود؟
fil: I-discard ang draft?
fr_ca: Supprimer le brouillon?
gl: Queres descartar o borrador?
gu: ડ્રાફ્ટ કાઢી નાખવો છે?
he: האם למחוק את הטיוטה?
hi: ड्राफ़्ट खारिज करें?
hu: Elveti a piszkozatot?
hy: Հեռացնե՞լ սևագիրը:
id: Hapus draf?
it: Eliminare la bozza?
ja: 下書きを破棄しますか？
ka: გსურთ მონახაზის გაუქმება?
km: លុបចោល​សេចក្ដី​ព្រាង?
kn: ಡ್ರಾಫ್ಟ್ ತ್ಯಜಿಸುವುದೇ?
ko: 초안을 삭제할까요?
ky: Сомдомо өчүрүлсүнбү?
lo: ຍົກເລີກຮ່າງຖິ້ມບໍ?
lt: Atmesti juodraštį?
lv: Vai atmest melnrakstu?
mk: Да се отфрли нацртот?
ml: ഡ്രാഫ്റ്റ് റദ്ദാക്കണോ?
mn: Нооргийг устгах уу?
mr: मसुदा काढून टाकायचा आहे का?
ms: Buang draf?
my: စာကြမ်းကို ဖယ်ပစ်လိုသလား။
nb: Vil du forkaste utkastet?
ne: मस्यौदा हटाउने हो?
pa: ਕੀ ਡਰਾਫਟ ਰੱਦ ਕਰਨਾ ਹੈ?
pl: Odrzucić wersję roboczą?
pt: Descartar rascunho?
pt_pt: Pretende rejeitar o rascunho?
ro: Ștergeți mesajul nefinalizat?
ru: Удалить черновик?
si: කෙටුම්පත ඉවත ලන්නද?
sk: Chcete zahodiť koncept?
sq: Të hidhet poshtë drafti?
sr: Желите ли да одбаците радну верзију?
sr_latn: Želite li da odbacite radnu verziju?
sv: Vill du slänga utkastet?
te: డ్రాఫ్ట్‌ను విస్మరించాలా?
th: ทิ้งฉบับร่างไหม
tr: Taslak silinsin mi?
uk: Закрити чернетку?
ur: مسودہ مسترد کریں؟
uz: Qoralama bekor qilinsinmi?
vi: Hủy bản nháp?
zh_hk: 要捨棄草稿嗎？
zu: Lahla okusalungiswa?

# dialogLocationTitle
source: Use Google's location service?
af: Gebruik Google se liggingdiens?
am: የGoogle አካባቢ አገልግሎትን ይጠቀም?
ar_eg: هل تريد استخدام خدمة الموقع الجغرافي من Google؟
as: Googleৰ অৱস্থান সেৱা ব্যৱহাৰ কৰিবনে?
az: Google'un məkan xidmətindən istifadə edilsin?
be: Выкарыстоўваць службу геалакацыі Google?
bn: Google-এর লোকেশন সংক্রান্ত পরিষেবা ব্যবহার করতে চান?
bs: Koristiti Googleovu uslugu lokacije?
ca: Vols fer servir els serveis d'ubicació de Google?
da: Vil du bruge Googles lokationstjeneste?
es_ar: ¿Quieres usar el servicio de ubicación de Google?
et: Kas kasutada Google'i asukohateenuseid?
eu: Google-ren kokapen-zerbitzua erabili nahi duzu?
fa: از «خدمات مکان Google» استفاده شود؟
fil: Gamitin ang serbisyo ng lokasyon ng Google?
fr_ca: Utiliser le service de localisation Google?
gl: Queres utilizar o servizo de localización de Google?
gu: Googleની સ્થાન સેવાનો ઉપયોગ કરીએ?
he: האם להשתמש בשירות המיקום של Google?
hi: क्या आप Google की जगह की जानकारी देने वाली सेवा का इस्तेमाल करना चाहते हैं?
hu: Használni kívánja a Google Helyszolgáltatásokat?
hy: Օգտագործե՞լ Google-ի տեղորոշման ծառայությունը
id: Gunakan layanan lokasi Google?
it: Utilizzare il servizio di geolocalizzazione di Google?
ja: Google の位置情報サービスを使用しますか？
ka: გსურთ Google-ის მდებარეობის სერვისის გამოყენება?
km: ប្រើ​សេវាកម្ម​ទីតាំង​របស់ Google?
kn: Google ನ ಸ್ಥಳ ಸೇವೆಯನ್ನು ಬಳಸುವುದೇ?
ko: Google의 위치 서비스를 사용하시겠습니까?
ky: Google'дун жайгашкан жерди аныктоо кызматы колдонулсунбу?
lo: ໃຊ້ບໍລິການສະຖານທີ່ຂອງ Google ບໍ?
lt: Naudoti „Google“ vietovės paslaugą?
lv: Vai izmantot Google atrašanās vietas pakalpojumu?
mk: Да се користи услугата според локација на Google?
ml: Google-ന്റെ ലൊക്കേഷൻ സേവനം ഉപയോഗിക്കണോ?
mn: Google-н байршлын үйлчилгээг ашиглах уу?
mr: Google ची स्थान सेवा वापरायची का?
ms: Gunakan perkhidmatan lokasi Google?
my: Google ၏ တည်နေရာ ဝန်ဆောင်မှုကို သုံးလိုသလား။
nb: Vil du bruke Googles posisjonstjeneste?
ne: Google को लोकेसन सर्भिस प्रयोग गर्ने हो?
pa: ਕੀ Google ਦੀ ਟਿਕਾਣਾ ਸੇਵਾ ਨੂੰ ਵਰਤਣਾ ਹੈ?
pl: Użyć usługi lokalizacyjnej Google?
pt: Usar serviço de localização do Google?
pt_pt: Pretende utilizar o serviço de localização da Google?
ro: Folosiți serviciul de localizare Google?
ru: Использовать геолокацию Google?
si: Google හි පිහිටීම් සේවාව භාවිත කරන්නද?
sk: Chcete použiť službu určovania polohy od Googlu?
sq: Të përdoret shërbimi "Vendndodhjet Google"?
sr: Желите ли да користите Google услуге локације?
sr_latn: Želite li da koristite Google usluge lokacije?
sv: Vill du använda Googles platstjänst?
te: Google లొకేషన్ సేవను ఉపయోగించాలా?
th: ใช้บริการตำแหน่งของ Google ไหม
tr: Google'ın konum hizmeti kullanılsın mı?
uk: Використовувати Служби локації Google?
ur: Google کی مقام کی سروس کا استعمال کریں؟
uz: Googlening joylashuvni aniqlash xizmatidan foydalanilsinmi?
vi: Sử dụng dịch vụ vị trí của Google?
zh_hk: 要使用 Google 的定位服務嗎？
zu: Sebenzisa isevisi yendawo ye-Google?

# dialogLocationDescription
source: Let Google help apps determine location. This means sending anonymous location data to Google, even when no apps are running.
af: Laat Google programme help om ligging te bepaal. Dit beteken dat anonieme liggingdata na Google toe gestuur word, selfs wanneer geen programme laat loop word nie.
am: መተግበሪያዎች አካባቢ እንዲያውቁ Google ያግዛቸው። ይሄ ማለት ስም-አልባ የአካባቢ ውሂብ ለGoogle መላክ ማለት ነው፣ ምንም እያሄዱ ያሉ መተግበሪያዎች ባይኖሩም እንኳ።
ar_eg: يمكنك السماح لشركة Google بمساعدة التطبيقات في تحديد الموقع الجغرافي. ويعني هذا أنه سيتم إرسال بيانات مجهولة المصدر عن الموقع الجغرافي إلى Google، حتى عند عدم تشغيل أي تطبيقات.
as: Googleক এপ্‌সমূহে অৱস্থান নির্ধাৰণ কৰাত সহায় কৰিবলৈ দিয়ক। এই কার্যই কোনো এপ্ চলি নাথাকিলেও Googleলৈ নামবিহীনভাৱে অৱস্থানৰ ডেটা পঠিওৱা বুজায়।
az: Google'a məkanı müəyyənləşdirməkdə tətbiqlərə kömək etmək imkanı verin. Bu, hətta heç bir tətbiq icra olunmadıqda belə Google'a anonim məkan məlumatları göndərmək deməkdir.
be: Дазвольце Google вызначаць ваша месцазнаходжанне для розных праграм. Ананімныя даныя пра месцазнаходжанне будуць адпраўляцца ў Google, нават калі ніякія праграмы не запушчаны.
bn: অ্যাপ যাতে লোকেশন বেছে নিতে পারে তার জন্য Google-কে সাহায্য করুন। এর মানে হল, যখন কোন অ্যাপ চালা থাকে না, তখনও Google-এ যে কোনও লোকেশনের তথ্য পাঠানো হবে।
bs: Dozvolite da Google pomogne aplikacijama da odrede lokaciju. To podrazumijeva slanje anonimnih podataka o lokaciji Googleu, čak i kada nijedna aplikacija nije pokrenuta.
ca: Permet que Google pugui ajudar les aplicacions a determinar la ubicació, és a dir, que s'enviïn dades d'ubicació anònimes a Google fins i tot quan no s'estigui executant cap aplicació.
da: Lad Google gøre det nemmere for apps at fastlægge din lokation. Det betyder, at der sendes anonyme lokationsdata til Google, også når der ikke er nogen apps, der kører.
es_ar: Permite que Google ayude a las apps a determinar la ubicación. Esto implica el envío de datos de ubicación anónimos a Google, incluso cuando no se estén ejecutando apps.
et: Lubage Google'il rakendusi asukoha tuvastamisel aidata. See tähendab, et Google'ile saadetakse anonüümseid asukohaandmeid isegi siis, kui ükski rakendus ei tööta.
eu: Utzi Google-ri aplikazioei kokapena zehazten laguntzen. Horretarako, kokapen-datu anonimoak bidaliko zaizkio Google-ri, baita aplikazioak martxan ez daudenean ere.
fa: به Google اجازه دهید به برنامه‌ها کمک کند مکان را تعیین کنند. با این کار، داده‌های مکانی به‌صورت ناشناس به Google ارسال می‌شوند، حتی وقتی هیچ برنامه‌ای اجرا نمی‌شود.
fil: Payagan ang Google na tulungan ang mga app na tukuyin ang lokasyon. Nangangahulugan ito na magpapadala ng anonymous na data ng lokasyon sa Google, kahit na walang gumaganang app.
fr_ca: Permettre à Google d'aider les applications à déterminer la position. Cela signifie envoyer des données de localisation anonymes à Google, même si aucune application n'est en cours d'exécution.
gl: Permite que Google axude ás aplicacións a determinar a localización. Esta acción supón o envío de datos de localización anónimos a Google, aínda que non se execute ningunha aplicación.
gu: Googleને સ્થાન નિર્ધારિત કરવામાં ઍપની સહાય કરવા દો. આનો અર્થ છે જ્યારે કોઈ ઍપ ચાલી ન રહી હોય ત્યારે પણ Googleને અનામ સ્થાન ડેટા મોકલવો.
he: Google תוכל לעזור לאפליקציות לזהות מיקום: כלומר, נתוני מיקום אנונימיים נשלחים אל Google, גם כאשר לא פועלות אפליקציות.
hi: Google को ऐप्लिकेशन की मदद से जगह का पता लगाने में मदद करने दें. इसका मतलब है कि भले ही कोई ऐप्लिकेशन न चल रहा हो फिर भी Google को जगह की जानकारी का अनजान डेटा भेजा जाएगा.
hu: Hagyja, hogy a Google segítsen az alkalmazásoknak a helymeghatározásban. Ez névtelen helyadatok küldését jelenti a Google-nak, még akkor is, ha egyetlen alkalmazás sem fut.
hy: Google-ին տեղադրության անանուն տվյալների ուղարկումը թույլ է տալիս հավելվածներին ավելի ճշգրիտ որոշել ձեր գտնվելու վայրը։ Տվյալները կուղարկվեն, նույնիսկ երբ ոչ մի հավելված գործարկված չէ։
id: Izinkan Google membantu aplikasi menentukan lokasi. Ini berarti data lokasi anonim akan dikirimkan ke Google, meskipun tidak ada aplikasi yang berjalan.
it: Consenti a Google di aiutare le app a individuare la posizione. Questa operazione comporta l'invio a Google di dati anonimi sulla posizione, anche quando non ci sono app in esecuzione.
ja: Google を利用してアプリが位置情報を特定できるようにします。この場合、アプリが起動していなくても匿名の位置情報が Google に送信されます。
ka: Google-ისთვის ნების დართვა, რომ აპებს მდებარეობის ამოცნობაში დაეხმაროს. ეს ნიშნავს, რომ Google-ში გადაიგზავნება მდებარეობის ანონიმური მონაცემები მაშინაც კი, როდესაც აპები გაშვებული არ არის.
km: ឱ្យ Google ជួយ​កម្មវិធី​ក្នុងការកំណត់​ទីតាំង។ មានន័យថា​ផ្ញើទិន្នន័យ​ទីតាំង​អនាមិក​ទៅ Google ទោះបីជា​មិនមាន​កម្មវិធី​កំពុងដំណើរការ​ក៏ដោយ។
kn: ಸ್ಥಳವನ್ನು ಪತ್ತೆಹಚ್ಚುವುದಕ್ಕೆ ಆ್ಯಪ್‌ಗಳಿಗೆ ಸಹಾಯ ಮಾಡಲು Google ಗೆ ಅವಕಾಶ ನೀಡಿ. ಅಂದರೆ, ಯಾವುದೇ ಆ್ಯಪ್‌ಗಳು ರನ್ ಆಗದೇ ಇರುವಾಗಲೂ, Google ಗೆ ಅನಾಮಧೇಯ ಸ್ಥಳದ ಡೇಟಾವನ್ನು ಕಳುಹಿಸುವುದು ಎಂದರ್ಥ.
ko: 앱이 Google을 통해 위치 정보를 파악할 수 있도록 설정하세요. 이 경우 실행되는 앱이 없을 때도 익명의 위치 데이터가 Google에 전송됩니다.
ky: Google'га колдонмолорго жайгашкан жерди аныктоого уруксат бериңиз. Бул жайгашкан жердин дайындары Google'га колдонмолор иштебей турганда да жашырууун жөнөтүлөрүн түшүндүрөт.
lo: ໃຫ້ Google ຊ່ວຍລະບຸສະຖານທີ່. ນີ້ໝາຍເຖິງການສົ່ງຂໍ້ມູນສະຖານທີ່ທີ່ບໍ່ລະບຸຕົວຕົນໄປໃຫ້ Google, ເຖິງແມ່ນວ່າຈະບໍ່ມີແອັບເປີດໃຊ້ຢູ່ກໍຕາມ.
lt: Leisti „Google“ padėti programoms nustatyti vietovę. Tai reiškia anoniminių vietovės duomenų siuntimą „Google“, net kai nevykdomos jokios programos.
lv: Google varēs palīdzēt lietotnēm noteikt atrašanās vietu. Tas nozīmē, ka uzņēmumam Google tiks nosūtīti anonīmi atrašanās vietas dati, pat ja neviena lietotne nedarbosies.
mk: Дозволете Google да им помогне на апликациите да ја утврдуваат локацијата. Тоа подразбира испраќање анонимни податоци за локација до Google, дури и кога не се извршуваат апликации.
ml: ലൊക്കേഷൻ നിർണ്ണയിക്കുന്നതിന് ആപ്പുകളെ സഹായിക്കാൻ Google-നെ അനുവദിക്കുക. ആപ്പുകളൊന്നും പ്രവർത്തിക്കാത്തപ്പോൾ പോലും Google-ലേക്ക് അജ്ഞാത ലൊക്കേഷൻ ഡാറ്റ അയയ്‌ക്കുന്നുവെന്നാണ് ഇത് അർത്ഥമാക്കുന്നത്.
mn: Google-д аппуудад байршлыг тодорхойлоход туслахыг зөвшөөрнө үү. Ингэснээр ямар ч апп ажиллаагүй байсан ч байршлын өгөгдлийг үл мэдэгдэх байдлаар Google-д илгээнэ.
mr: अ‍ॅप्सना स्थान शोधण्यात Google ला मदत करू द्या. म्हणजेच कोणतीही अ‍ॅप्स सुरू नसतानादेखील Google ला अनामित स्थान डेटा पाठवणे.
ms: Benarkan Google membantu apl menentukan lokasi. Ini bermakna menghantar data lokasi awanama kepada Google, walaupun semasa tiada apl yang berjalan.
my: အက်ပ်များက တည်နေရာဆုံးဖြတ်ရာတွင် Google အား ကူညီခွင့်ပြုလိုက်ပါ။ ဆိုလိုသည်မှာ မည်သည့်အက်ပ်မျှ အသုံးပြုနေခြင်းမရှိသည့်အခါတွင်ပင် တည်နေရာဒေတာများကို Google သို့ အမည်မဖော်ဘဲ ပို့ခြင်းဖြစ်သည်။
nb: La Google hjelpe apper med å fastslå posisjoner. Dette betyr å sende anonyme posisjonsdata til Google, selv når ingen apper kjører.
ne: Google लाई एपहरूलाई स्थान निर्धारण गर्ने कार्यमा मद्दत गर्न दिनुहोस्। यसले कुनै पनि एप सञ्चालन नभएको बेला पनि Google मा स्थानसम्बन्धी बेनामी डेटा पठाइन्छ भन्ने कुरा बुझाउँछ।
pa: Google ਨੂੰ ਟਿਕਾਣਾ ਨਿਰਧਾਰਿਤ ਕਰਨ ਵਿੱਚ ਐਪਾਂ ਦੀ ਮਦਦ ਕਰਨ ਦਿਓ। ਇਸਦਾ ਮਤਲਬ ਹੈ Google ਨੂੰ ਅਨਾਮ ਟਿਕਾਣਾ ਡਾਟਾ ਭੇਜਣਾ, ਭਾਵੇਂ ਕੋਈ ਵੀ ਐਪ ਨਾ ਚੱਲ ਰਹੀ ਹੋਵੇ।
pl: Google może ułatwiać aplikacjom określanie lokalizacji. Wymaga to wysyłania do Google anonimowych informacji o lokalizacji, nawet gdy nie są uruchomione żadne aplikacje.
pt: Deixe o Google ajudar os apps a determinar locais. Isso significa enviar dados de local anônimos para o Google, mesmo quando nenhum app estiver em execução.
pt_pt: Permita que a Google ajude as aplicações a determinar a localização. Isto significa enviar dados de localização anónimos para a Google, mesmo quando não estiverem a ser executadas aplicações.
ro: Acceptați ajutor de la Google pentru ca aplicațiile să vă detecteze locația. Aceasta înseamnă că veți trimite la Google date anonime privind locațiile, chiar și când nu rulează nicio aplicație.
ru: Отправка анонимных геоданных в Google помогает приложениям точнее определять ваше местоположение. Данные будут отправляться, даже если не запущено ни одно приложение.
si: යෙදුම්වලට ස්ථානය තීරණය කිරීම සඳහා සහාය වීමට Google හට ඉඩ දෙන්න. මෙයින් අදහස් කරන්නේ කිසිදු යෙදුමක් හෝ ධාවනය නොවන විට පවා Google වෙත නිර්නාමික ස්ථාන දත්ත යැවීමයි.
sk: Povoľte, aby mohol Google pomáhať aplikáciám určovať polohu. Znamená to, že do Googlu budú odosielané anonymné údaje o polohe, aj keď nebudú spustené žiadne aplikácie.
sq: Lejo Google të ndihmojë aplikacionet që të përcaktojnë vendndodhjen. Kjo do të thotë të dërgosh të dhëna te Google edhe kur nuk ka aplikacione në punë.
sr: Дозволите да Google помаже апликацијама у одређивању локације. То значи да се Google-у шаљу анонимни подаци о локацији, чак и када ниједна апликација није покренута.
sr_latn: Dozvolite da Google pomaže aplikacijama u određivanju lokacije. To znači da se Google-u šalju anonimni podaci o lokaciji, čak i kada nijedna aplikacija nije pokrenuta.
sv: Google hjälper appar att avgöra enhetens plats. Detta innebär att anonym platsinformation skickas till Google, även när inga appar körs.
te: యాప్‌లు లొకేషన్‌ను గుర్తించేందుకు సహాయపడటానికి Googleను అనుమతించండి. దీని అర్థం ఏమిటంటే, యాప్‌లు ఏవీ అమలులో లేకపోయినా కూడా, Googleకు అనామకమైన లొకేషన్ డేటా పంపబడుతుంది.
th: ให้ Google ช่วยแอประบุตำแหน่ง ซึ่งหมายถึงการส่งข้อมูลตำแหน่งแบบไม่เปิดเผยชื่อไปยัง Google แม้ว่าจะไม่มีแอปทำงานอยู่
tr: Google'ın, uygulamaların konum tespiti yapmasına yardımcı olmasına izin verin. Bu, hiçbir uygulama çalışmıyorken bile anonim konum verilerinin Google'a gönderilmesi anlamına gelir.
uk: Дозвольте Google допомагати додаткам визначати місцезнаходження. Це означає, що в Google надсилатимуться анонімні геодані, навіть коли на пристрої взагалі не запущено додатків.
ur: Google کو مقام کا تعین کرنے میں ایپس کی مدد کرنے دیں۔ اس کا مطلب یہ ہے کہ Google کو گمنام مقام کا ڈیٹا تب بھی بھیجا جائے گا، جب کوئی بھی ایپ نہیں چل رہی ہیں۔
uz: Google ilovalarga joylashuvni aniqlashda yordam berishi uchun ruxsat bering. Bu shuni bildiradiki, hech qanday ilova ishlamayotgan boʻlsa ham joylashuv axboroti maxfiy tarzda Googlega yuboriladi.
vi: Cho phép Google giúp ứng dụng xác định vị trí. Điều này có nghĩa là gửi dữ liệu vị trí ẩn danh cho Google, ngay cả khi không chạy ứng dụng nào.
zh_hk: 允許 Google 協助應用程式判斷您的位置。這麼做會將匿名的位置資料傳送給 Google (即使您未執行任何應用程式)。
zu: Vumela i-Google isize izinhlelo zokusebenza zithole indawo. Lokhu kusho ukuthumela idatha yendawo engaziwa ku-Google, nanoma kungekho zinhlelo zokusebenza ezisebenzayo.

# dialogCancel
source: CANCEL
af: KANSELLEER
am: ተወው
ar_eg: إلغاء
as: বাতিল কৰক
az: LƏĞV EDİN
be: СКАСАВАЦЬ
bn: বাতিল করুন
bs: OTKAŽI
ca: CANCEL·LA
da: ANNULLER
es_ar: CANCELAR
et: TÜHISTA
eu: UTZI
fa: لغو
fil: KANSELAHIN
fr_ca: ANNULER
gl: CANCELAR
gu: રદ કરો
he: ביטול
hi: रद्द करें
hu: MÉGSE
hy: ՉԵՂԱՐԿԵԼ
id: BATAL
it: ANNULLA
ja: キャンセル
ka: გაუქმება
km: បោះបង់
kn: ರದ್ದುಗೊಳಿಸಿ
ko: 취소
ky: ЖОККО ЧЫГАРУУ
lo: ຍົກເລີກ
lt: ATŠAUKTI
lv: ATCELT
mk: ОТКАЖИ
ml: റദ്ദാക്കുക
mn: ЦУЦЛАХ
mr: रद्द करा
ms: BATAL
my: မလုပ်တော့
nb: AVBRYT
ne: रद्द गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: ANULUJ
pt: CANCELAR
pt_pt: CANCELAR
ro: ANULAȚI
ru: ОТМЕНА
si: අවලංගු කරන්න
sk: ZRUŠIŤ
sq: ANULO
sr: ОТКАЖИ
sr_latn: OTKAŽI
sv: AVBRYT
te: రద్దు చేయండి
th: ยกเลิก
tr: İPTAL
uk: СКАСУВАТИ
ur: منسوخ کریں
uz: BEKOR QILISH
vi: HỦY
zh_hk: 取消
zu: KHANSELA

# dialogDiscard
source: DISCARD
af: GOOI WEG
am: አስወግድ
ar_eg: تجاهل
as: প্ৰত্যাখ্যান কৰক
az: İMTİNA EDİN
be: АДХІЛІЦЬ
bn: বাতিল করুন
bs: ODBACI
ca: DESCARTA
da: KASSÉR
es_ar: DESCARTAR
et: LOOBU
eu: BAZTERTU
fa: صرف‌نظر کردن
fil: I-DISCARD
fr_ca: SUPPRIMER
gl: DESCARTAR
gu: કાઢી નાખો
he: סגירה
hi: खारिज करें
hu: ELVETÉS
hy: ՀԵՌԱՑՆԵԼ
id: HAPUS
it: ANNULLA
ja: 破棄
ka: გაუქმება
km: លុបចោល
kn: ತ್ಯಜಿಸಿ
ko: 삭제
ky: ӨЧҮРҮҮ
lo: ຍົກເລີກ
lt: ATMESTI
lv: ATMEST
mk: ОТФРЛИ
ml: നിരസിക്കുക
mn: БОЛИХ
mr: काढून टाका
ms: BUANG
my: ဖယ်ပစ်ရန်
nb: FORKAST
ne: खारेज गर्नुहोस्
pa: ਰੱਦ ਕਰੋ
pl: ODRZUĆ
pt: DESCARTAR
pt_pt: REJEITAR
ro: RENUNȚAȚI
ru: УДАЛИТЬ
si: ඉවත ලන්න
sk: ZAHODIŤ
sq: HIDH POSHTË
sr: ОДБАЦИ
sr_latn: ODBACI
sv: SLÄNG
te: విస్మరించు
th: ทิ้ง
tr: SİL
uk: ВІДХИЛИТИ
ur: رد کریں
uz: BEKOR QILISH
vi: HỦY
zh_hk: 捨棄
zu: LAHLA

# dialogDisagree
source: DISAGREE
af: STEM NIE SAAM NIE
am: አትስማማ
ar_eg: لا أوافق
as: অসন্মত
az: RAZI DEYİLƏM
be: НЕ ЗГАДЖАЮСЯ
bn: অসম্মত
bs: NE SLAŽEM SE
ca: NO ACCEPTIS
da: ACCEPTÉR IKKE
es_ar: RECHAZAR
et: EI NÕUSTU
eu: EZ ONARTU
fa: موافق نیستم
fil: HINDI SUMASANG-AYON
fr_ca: REFUSER
gl: NON ACEPTAR
gu: અસંમત
he: לא מסכים/ה
hi: असहमत
hu: ELUTASÍTOM
hy: ՉԵՂԱՐԿԵԼ
id: TIDAK SETUJU
it: NON ACCETTO
ja: 同意しない
ka: არ ვეთანხმები
km: មិនយល់ព្រម
kn: ನಿರಾಕರಿಸಿ
ko: 동의 안함
ky: МАКУЛ ЭМЕСМИН
lo: ບໍ່ຍອມຮັບ
lt: NESUTINKU
lv: NEPIEKRĪTU
mk: НЕ СЕ СОГЛАСУВАМ
ml: അംഗീകരിക്കുന്നില്ല
mn: ЗӨВШӨӨРӨХГҮЙ
mr: सहमत नाही
ms: TIDAK SETUJU
my: သဘောမတူပါ
nb: AVSLÅ
ne: असहमत
pa: ਅਸਹਿਮਤ
pl: NIE ZGADZAM SIĘ
pt: DISCORDO
pt_pt: NÃO ACEITAR
ro: NU SUNT DE ACORD
ru: ОТМЕНА
si: එකඟ නොවේ
sk: NESÚHLASÍM
sq: NUK PRANOJ
sr: НЕ ПРИХВАТАМ
sr_latn: NE PRIHVATAM
sv: GODKÄNNER INTE
te: అంగీకరించడం లేదు
th: ไม่ยอมรับ
tr: KABUL ETMİYORUM
uk: ВІДХИЛИТИ
ur: غیر متفق ہوں
uz: ROZI EMASMAN
vi: KHÔNG ĐỒNG Ý
zh_hk: 不同意
zu: UNGAVUMI

# dialogAgree
source: AGREE
af: STEM IN
am: እስማማለሁ
ar_eg: موافق
as: সন্মত
az: RAZIYAM
be: ЗГАДЖАЮСЯ
bn: সম্মত
bs: PRIHVATAM
ca: ACCEPTA
da: ACCEPTÉR
es_ar: ACEPTAR
et: NÕUSTU
eu: ONARTU
fa: موافق
fil: SUMANG-AYON
fr_ca: ACCEPTER
gl: ACEPTAR
gu: સંમત
he: מסכים/ה
hi: सहमत
hu: ELFOGADOM
hy: ԸՆԴՈՒՆԵԼ
id: SETUJU
it: ACCETTO
ja: 同意する
ka: ვეთანხმები
km: យល់ព្រម
kn: ಸಮ್ಮತಿಸಿ
ko: 동의
ky: МАКУЛ
lo: ເຫັນດີ
lt: SUTINKU
lv: PIEKRĪTU
mk: СЕ СОГЛАСУВАМ
ml: അംഗീകരിക്കുക
mn: ЗӨВШӨӨРӨХ
mr: सहमत आहे
ms: SETUJU
my: သဘောတူသည်
nb: GODTA
ne: सहमत
pa: ਸਹਿਮਤ
pl: ZGADZAM SIĘ
pt: CONCORDO
pt_pt: ACEITAR
ro: SUNT DE ACORD
ru: ОК
si: එකඟයි
sk: SÚHLASÍM
sq: PRANOJ
sr: ПРИХВАТАМ
sr_latn: PRIHVATAM
sv: GODKÄNN
te: అంగీకరిస్తున్నాను
th: ยอมรับ
tr: KABUL EDİYORUM
uk: ПРИЙНЯТИ
ur: متفق ہوں
uz: ROZIMAN
vi: ĐỒNG Ý
zh_hk: 同意
zu: VUMA

# dialogSetBackup
source: Set backup account
af: Stel rugsteunrekening
am: የምትኬ መለያ አቀናብር
ar_eg: اختيار الحساب الاحتياطي
as: বেকআপ একাউণ্ট ছেট কৰক
az: Yedəkləmə hesabı ayarlayın
be: Задаць уліковы запіс для рэзервовага капіравання
bn: ব্যাক-আপ অ্যাকাউন্ট সেট করুন
bs: Postavljanje računa za sigurnosne kopije
ca: Defineix el compte de la còpia de seguretat
da: Konfigurer konto til backup
es_ar: Configurar cuenta para copia de seguridad
et: Varundamiskonto määramine
eu: Ezarri babeskopiak egiteko kontua
fa: تنظیم حساب پشتیبان
fil: Itakda ang backup na account
fr_ca: Définir le compte de sauvegarde
gl: Definir conta para a copia de seguranza
gu: બૅકઅપ એકાઉન્ટ સેટ કરો
he: הגדרת חשבון לגיבוי
hi: बैकअप खाता सेट करें
hu: Helyreállítási fiók beállítása
hy: Պահուստավորման հաշվի կարգավորում
id: Setel akun pencadangan
it: Imposta account di backup
ja: バックアップ アカウントの設定
ka: სარეზერვო ანგარიშის დაყენება
km: កំណត់​គណនី​បម្រុង​ទុក
kn: ಬ್ಯಾಕಪ್ ಖಾತೆಯನ್ನು ಹೊಂದಿಸಿ
ko: 백업 계정 설정
ky: Көмөкчү аккаунтту жөндөө
lo: ຕັ້ງບັນຊີສຳຮອງ
lt: Atsarginės kopijos paskyros nustatymas
lv: Dublējuma konta iestatīšana
mk: Поставете резервна сметка
ml: ബാക്കപ്പ് അക്കൗണ്ട് സജ്ജീകരിക്കൂ
mn: Нөөц бүртгэл тохируулна уу
mr: बॅकअप खाते सेट करा
ms: Tetapkan akaun sandaran
my: အရန်အကောင့် စနစ်ထည့်သွင်းရန်
nb: Velg konto for sikkerhetskopi
ne: ब्याकअप खाता सेट गर्नुहोस्
pa: ਬੈਕਅੱਪ ਖਾਤਾ ਸੈੱਟ ਕਰੋ
pl: Ustaw konto kopii zapasowej
pt: Definir conta de backup
pt_pt: Defina a conta de cópia de segurança
ro: Setați contul pentru backup
ru: Настройка аккаунта для резервного копирования
si: උපස්ථ ගිණුම සකසන්න
sk: Nastavenie zálohovacieho účtu
sq: Cakto llogarinë e rezervimit
sr: Подесите резервни налог
sr_latn: Podesite rezervni nalog
sv: Ange konto för säkerhetskopiering
te: బ్యాకప్ ఖాతాను సెట్ చేయి
th: ตั้งค่าบัญชีสำรอง
tr: Yedekleme hesabı ayarla
uk: Налаштуйте резервний обліковий запис
ur: بیک اپ اکاؤنٹ ترتیب دیں
uz: Hisobni tanlash
vi: Thiết lập tài khoản sao lưu
zh_hk: 設定備份帳戶
zu: Setha i-akhawunti yokwenza isipele

# colorsBlueGrey
source: BLUE GREY
af: BLOUGRYS
am: ሰማያዊ ግራጫ
ar_eg: أزرق رمادي
as: নীলা ধোঁৱাবৰণীয়া
az: MAVİ-BOZ
be: ШЫЗЫ
bn: নীলচে ধূসর
bs: PLAVOSIVA
ca: GRIS BLAVÓS
da: BLÅGRÅ
es_ar: GRIS AZULADO
et: SINAKASHALL
eu: URDIN GRISAXKA
fa: آبی خاکستری
fr_ca: GRIS BLEU
gl: GRIS AZULADO
gu: વાદળી ગ્રે
he: כחול-אפור
hi: नीला-स्लेटी
hu: KÉKESSZÜRKE
hy: ԿԱՊՏԱՄՈԽՐԱԳՈՒՅՆ
id: BIRU KEABU-ABUAN
it: GRIGIO BLU
ja: ブルーグレー
ka: მოლურჯო ნაცრისფერი
km: ប្រផេះ​ខៀវ
kn: ನೀಲಿ ಬೂದು ಬಣ್ಣ
ko: 푸른 회색
ky: КӨГҮШ БОЗ
lo: ສີຟ້າເທົາ
lt: MELSVAI PILKA
lv: ZILPELĒKA
mk: СИНОСИВА
ml: നീല കലർന്ന ചാരനിറം
mn: ХӨХ СААРАЛ
mr: निळसर राखाडी
ms: KELABU KEBIRUAN
my: မီးခိုးပြာ
nb: BLÅGRÅ
ne: निलो मिश्रित खैरो
pa: ਨੀਲਾ ਸਲੇਟੀ
pl: NIEBIESKOSZARY
pt: CINZA-AZULADO
pt_pt: CINZENTO AZULADO
ro: GRI-ALBĂSTRUI
ru: СИНЕ-СЕРЫЙ
si: නීල අළු
sk: MODROSIVÁ
sq: GRI NË BLU
sr: ПЛАВОСИВА
sr_latn: PLAVOSIVA
sv: BLÅGRÅ
te: నీలి బూడిద రంగు
th: เทาน้ำเงิน
tr: MAVİYE ÇALAN GRİ
uk: СІРО-СИНІЙ
ur: نیلا خاکستری
uz: MOVIY KULRANG
vi: MÀU XANH XÁM
zh_hk: 灰藍色
zu: OKUMPUNGA SALUHLAZA OKWESIBHAKABHAKA
