Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# shrineProductVagabondSack
source: Vagabond sack
af: Vagabond-sak
am: Vagabond ጆንያ
ar_eg: حقيبة من ماركة Vagabond
az: Vegabond çantası
be: Сумка-ранец
bn: ভ্যাগাবন্ড স্যাক
bs: Torba Vagabond
ca: Motxilla Vagabond
da: Vagabond-rygsæk
es_ar: Bolso Vagabond
eu: Vagabond bizkar-zorroa
fa: کیف واگابوند
fil: Vagabond na sack
fr_ca: Sac vagabond
gl: Saco de vagabundo
he: תיק קטן
hi: झाेला
hu: „Vagabond” zsák
hy: Թիկնապայուսակ
id: Ransel vagabond
it: Borsa Vagabond
ja: バガボンド サック
ka: Vagabond-ის ტომარა
km: កាបូប Vagabond
kn: ವ್ಯಾಗಬಾಂಡ್ ಸ್ಯಾಕ್
ko: 배가본드 색
ky: Вагабонд кабы
lo: ຖົງສະພາຍ
lt: „Vagabond“ krepšys
lv: Klaidoņa pauna
mk: Ранец Vagabond
ml: വാഗബോണ്ട് സാക്ക്
mn: Vagabond-н даавуун тор
nb: Landstrykersekk
ne: Vagabond का झोलाहरू
pa: Vagabond ਥੈਲਾ
pl: Worek podróżny
pt: Mochila Vagabond
pt_pt: Saco Vagabond
ro: Geantă Vagabond
ru: Сумка-ранец
sk: Taška Vagabond
sq: Çantë model "vagabond"
sr: Врећаста торба
sr_latn: Vrećasta torba
sv: Ryggsäck – Vagabond
te: వెగాబాండ్ శాక్
th: ถุงย่าม
tr: Vagabond çanta
uk: Сумка-мішок Vagabond
ur: واگابونڈ سیگ
uz: Vagabond sumkasi
vi: Túi vải bố Vagabond
zh_hk: Vagabond 背囊
zu: I-Vagabond sack

# rallyAccountDetailDataInterestYtd
source: Interest YTD
af: Rente in jaar tot nou
am: የወለድ ዓመት እስከ ቀን
ar_eg: الفائدة منذ بداية العام حتى اليوم
as: সুদ YTD
az: Faiz: İlin əvvəlindən bəri
be: Працэнты ад пачатку года да сённяшняга дня
bn: সুদ YTD
bs: Kamate od početka godine
ca: Interessos fins a l'actualitat
da: Renter ÅTD
es_ar: Interés del comienzo del año fiscal
et: Aastane intress tänase kuupäevani
eu: Urte-hasieratik gaurdainoko interesak
fa: بهره از ابتدای امسال تاکنون
fil: YTD ng Interes
fr_ca: Cumul annuel des intérêts
gl: Xuros do ano ata a data de hoxe
gu: વ્યાજ YTD
he: ריבית שנתית עד ליום הנוכחי
hi: इस साल अब तक का ब्याज
hu: Kamat eddig az évben
hy: Տոկոսադրույքը տարեսկզբից
id: Bunga YTD
it: Interesse dall'inizio dell'anno
ja: 年累計利息
ka: პროცენტრი წლის დასაწყისიდან დღევანდელ თარიღამდე
km: ការប្រាក់ YTD
kn: ಬಡ್ಡಿ YTD
ko: 연간 발생 이자
ky: Үстөк YTD
lo: ດອກເບ້ຍຕັ້ງແຕ່ຕົ້ນປີຮອດປັດຈຸບັນ
lt: Palūkanos nuo metų pradžios iki dabar
lv: Procenti YTD
mk: Годишна камата до денес
ml: പലിശ YTD
mn: Оны эхнээс өнөөдрийг хүртэлх хүү
mr: व्‍याज YTD
ms: Faedah YTD
my: အတိုး YTD
nb: Renter så langt i år
ne: वर्षको सुरुदेखि आजसम्मको ब्याज
pa: ਵਿਆਜ YTD
pl: Odsetki od początku roku
pt: Juros acumulados do ano
pt_pt: Juros do ano até à data
ro: Dobânda de la începutul anului până în prezent
ru: Процент с начала года
si: පොලී YTD
sk: Úrok od začiatku roka dodnes
sq: Interesi vjetor deri më sot
sr: Камата од почетка године до данас
sr_latn: Kamata od početka godine do danas
sv: Ränta sedan årsskiftet
te: వడ్డీ YTD
th: ดอกเบี้ยตั้งแต่ต้นปีจนถึงปัจจุบัน
tr: Yılın Başından Bugüne Faiz
uk: Проценти від початку року до сьогодні
ur: YTD سود
uz: Yil boshidan beri foizlar
vi: Lãi suất từ đầu năm đến nay
zh_hk: 年初至今利息
zu: I-YTD yenzalo

# shrineProductWhitneyBelt
source: Whitney belt
am: Whitney ቀበቶ
ar_eg: حزام "ويتني"
az: Vitni kəməri
be: Скураны рамень
bn: হুইটনি বেল্ট
bs: Pojas Whitney
ca: Cinturó Whitney
da: Whitney-bælte
es_ar: Cinturón
eu: Whitney gerrikoa
fa: کمربند ویتنی
fil: Whitney na sinturon
fr_ca: Ceinture Whitney
gl: Cinto Whitney
he: חגורת Whitney
hi: व्हिटनी बेल्ट
hu: „Whitney” öv
hy: Կաշվե գոտի
id: Sabuk Whitney
it: Cintura Whitney
ja: ホイットニー ベルト
ka: Whitney-ს ქამარი
km: ខ្សែក្រវ៉ាត់ Whitney
kn: ವಿಟ್ನೀ ಬೆಲ್ಟ್
ko: 휘트니 벨트
ky: Уитни куру
lo: ສາຍແອວ Whitney
lt: „Whitney“ diržas
lv: Whitney josta
mk: Ремен Whitney
ml: വിറ്റ്നി ബെൽറ്റ്
mn: Уитни бүс
nb: Whitney-belte
ne: ह्विट्नी बेल्ट
pa: ਵਾਇਟਨੀ ਬੈਲਟ
pl: Pasek Whitney
pt: Cinto Whitney
pt_pt: Cinto Whitney
ro: Curea Whitney
ru: Кожаный ремень
sk: Opasok Whitney
sq: Rrip Whitney
sr: Каиш Whitney
sr_latn: Kaiš Whitney
sv: Bälte – Whitney
te: విట్నీ బెల్ట్
th: เข็มขัด Whitney
tr: Whitney kemer
uk: Ремінь Whitney
ur: وہائٹنے نیلٹ
uz: Charm kamar
vi: Thắt lưng Whitney
zh_hk: Whitney 腰帶
zu: Ibhande le-Whitney

# shrineProductGardenStrand
source: Garden strand
af: Tuindraad
ar_eg: خيوط زينة للحدائق
be: Кветачныя пацеркі
bn: গার্ডেন স্ট্র্যান্ড
bs: Vrtno ukrasno uže
ca: Collarets de granadura
es_ar: Hebras para jardín
eu: Alez egindako lepokoa
fa: کلاف گاردن
fil: Panghardin na strand
fr_ca: Collier
gl: Praia con xardín
he: סיבי גינה
hi: गार्डन स्ट्रैंड
hu: Kerti sodrott kötél
hy: Այգու ճոպաններ
it: Elemento da giardino
ja: ガーデン スタンド
km: ខ្សែ Garden
kn: ಗಾರ್ಡನ್ ಸ್ಟ್ರ್ಯಾಂಡ್
ko: 가든 스트랜드
ky: Бакча тирөөчү
lo: ເຊືອກເຮັດສວນ
lt: „Garden“ vėrinys
lv: Dārza mala
mk: Орнамент за во градина
ml: ഗാർഡൻ സ്ട്രാൻഡ്
mn: Гарден странд
ne: बगैँचाको किनारा
pa: ਗਾਰਡਨ ਸਟਰੈਂਡ
pl: Ogród
pt: Fio de jardinagem
pt_pt: Ambiente de jardim
ro: Toron pentru grădină
ru: Цветочные бусы
sk: Záhradný pás
sq: Gardh kopshti
sr: Баштенски конопац
sr_latn: Baštenski konopac
sv: Halsband – Garden strand
te: గార్డెన్ స్ట్రాండ్
th: เชือกทำสวน
tr: Bahçe teli
uk: Садовий кабель
ur: گارڈن اسٹرینڈ
uz: Gulchambar
vi: Dây làm vườn
zh_hk: 園藝繩索
zu: I-Garden strand

# shrineProductStrutEarrings
source: Strut earrings
af: Strut-oorbelle
am: ደረቅ ጆሮ ጌጦች
ar_eg: أقراط فاخرة
az: Əl işi sırğalar
be: Завушніцы "цвікі"
bn: স্ট্রাট ইয়াররিং
bs: Naušnice Strut
ca: Arracades
da: Strut-øreringe
es_ar: Aros Strut
eu: Strut belarritakoak
fa: گوشواره‌های استرات
fil: Mga strut earring
fr_ca: Boucles d'oreilles Strut
gl: Pendentes Strut
he: עגילי Strut
hi: स्ट्रट ईयर-रिंग्स
hu: „Strut” fülbevalók
hy: Ականջօղեր
id: Anting-anting Strut
it: Orecchini Strut
ja: ストラット イヤリング
ka: Strut-ის საყურეები
km: ក្រវិល Strut
kn: ಸ್ಟ್ರಟ್ ಈಯರ್‌ರಿಂಗ್ಸ್
ko: 스트러트 귀고리
ky: Сөйкөлөр
lo: ຕຸ້ມຫູ Strut
lt: „Strut“ auskarai
lv: Auskari
mk: Обетки Strut
ml: സ്റ്റ്രട്ട് ഇയർറിംഗ്‌സ്
mn: Strut-н ээмэг
nb: Strut-øreringer
ne: स्ट्रट मुन्द्राहरू
pa: ਸਟਰਟ ਵਾਲੀਆਂ
pl: Kolczyki
pt: Brincos Strut
pt_pt: Brincos Strut
ro: Cercei Strut
ru: Серьги на кольцах
sk: Náušnice Strut
sq: Vathë Strut
sr: Strut минђуше
sr_latn: Strut minđuše
sv: Örhängen – Strut
te: దారంతో వేలాడే చెవిపోగులు
th: ต่างหู Strut
tr: Strut küpeler
uk: Сережки Strut
ur: کان کی زبردست بالیاں
uz: Halqali zirak
vi: Hoa tai Strut
zh_hk: Strut 耳環
zu: Amacici e-Strut

# shrineProductVarsitySocks
source: Varsity socks
af: Universiteitskouse
am: Varsity ካልሲዎች
ar_eg: جوارب من نوع "فارسيتي"
az: Kollec corabları
be: Спартыўныя шкарпэткі
bn: ভারসিটি সক্‌স
bs: Čarape s prugama
ca: Mitjons d'estil universitari
da: Varsity-sokker
es_ar: Medias varsity
eu: Unibertsitateko taldeko galtzerdiak
fa: جوراب وارسیتی
fil: Mga pang-varsity na medyas
fr_ca: Chaussettes de sport
gl: Calcetíns universitarios
he: גרביים לקבוצת ספורט במוסד לימודים
hi: वार्सिटी सॉक्स
hu: „Varsity” zokni
hy: Սպորտային գուլպաներ
id: Kaus kaki varsity
it: Calze di squadre universitarie
ja: ソックス（ヴァーシティ）
ka: Varsity-ს წინდები
km: ស្រោមជើង Varsity
kn: ವಾರ್ಸಿಟಿ ಸಾಕ್ಸ್
ko: 스포츠 양말
ky: Университет байпактары
lo: ຖົງຕີນທີມກິລາມະຫາວິທະຍາໄລ
lt: „Varsity“ kojinės
lv: Karsējmeiteņu zeķes
mk: Чорапи Varsity
ml: വാഴ്‌സിറ്റി സോക്‌സ്
mn: Түрийгээрээ судалтай оймс
nb: Varsity-sokker
ne: Varsity मोजा
pa: Varsity ਜੁਰਾਬਾਂ
pl: Długie skarpety sportowe
pt: Meias Varsity
pt_pt: Meias Varsity
ro: Șosete Varsity
ru: Спортивные носки
sk: Ponožky Varsity
sq: Çorape sportive
sr: Чарапе са пругама
sr_latn: Čarape sa prugama
sv: Universitetsstrumpor
te: వార్సిటి సాక్స్‌లు
th: ถุงเท้าทีมกีฬามหาวิทยาลัย
tr: Varis çorabı
uk: Шкарпетки Varsity
ur: وارسٹی کی جرابیں
uz: Sport paypoqlari
vi: Tất học sinh
zh_hk: 校園風襪子
zu: Amasokisi e-Varsity

# shrineProductWeaveKeyring
source: Weave keyring
af: Geweefde sleutelhouer
am: የቁልፍ ቀለበትን ይሸምኑ
ar_eg: سلسلة مفاتيح Weave
az: Toxunma açarlıq
be: Плеценая бірулька
bn: উইভ কীরিং
bs: Pleteni privjesak za ključeve
ca: Clauer teixit
da: Weave-nøglering
es_ar: Llavero de tela
eu: Giltzatako txirikordatua
fa: حلقه‌کلید بافتی
fil: Hinabing keychain
fr_ca: Porte-clés tressé
gl: Chaveiro de punto
he: צמיד עם מחזיק מפתחות
hi: वीव की-रिंग
hu: Kulcstartó
hy: Բանալու հյուսածո կախազարդ
id: Gantungan kunci tenun
it: Portachiavi intrecciato
ja: ウィーブ キーリング
ka: Weave -ს გასაღებების ასხმა
km: បន្តោង​សោក្រង
kn: ವೀವ್ ಕೀರಿಂಗ್
ko: 위빙 열쇠고리
ky: Токулма ачкычка таккыч
lo: ພວງກະແຈຖັກ
lt: Raktų pakabukas
lv: Austs atslēgu turētājs
mk: Привезок за клучеви Weave
ml: വീവ് കീറിംഗ്
mn: Түлхүүрийн сүлжмэл бүл
nb: Vevd nøkkelring
ne: विभ किरिङ्ग
pa: ਧਾਗੇਦਾਰ ਕੁੰਜੀ-ਛੱਲਾ
pl: Pleciony brelok
pt: Chaveiro trançado
pt_pt: Porta-chaves em tecido
ro: Breloc împletit
ru: Плетеный брелок
sk: Kľúčenka Weave
sq: Mbajtëse çelësash e thurur
sr: Плетени привезак за кључеве
sr_latn: Pleteni privezak za ključeve
sv: Flätad nyckelring
te: వీవ్ కీరింగ్
th: พวงกุญแจถัก
tr: Örgülü anahtarlık
uk: Брелок із плетеним ремінцем
ur: بنائی والی کی رنگ
uz: Toʻqilgan jevak
vi: Móc khóa kiểu tết dây
zh_hk: 編織鑰匙扣
zu: I-Weave keyring

# shrineProductGatsbyHat
source: Gatsby hat
af: Gatsby-hoed
am: Gatsby ኮፍያ
ar_eg: قبعة "غاتسبي"
az: Yastı papaq
be: Картуз
bn: গ্যাস্টবি হ্যাট
bs: Kapa Gatsby
ca: Barret Gatsby
es_ar: Boina gatsby
eu: Gatsby kapela
fa: کلاه گتس‌بی
fr_ca: Casquette Gatsby
gl: Pucho de tipo Gatsby
he: כובע גטסבי
hi: गैट्सबी हैट
hu: Gatsby sapka
hy: Գետսբի գլխարկ
id: Topi gatsby
it: Cappello Gatsby
ja: ギャツビー ハット
ka: Gatsby-ს ქუდი
km: មួក Gatsby
kn: ಗ್ಯಾಟ್ಸ್‌ಬೀ ಹ್ಯಾಟ್
ko: 개츠비 햇
ky: Гэтсби шляпасы
lo: ໝວກ Gatsby
lt: Getsbio skrybėlė
lv: Gatsby stila cepure
mk: Капа Gatsby
ml: ഗാറ്റ്സ്ബി തൊപ്പി
mn: Гэтсби малгай
nb: Gatsby-hatt
ne: Gatsby टोपी
pa: ਗੈੱਟਸਬਾਏ ਟੋਪੀ
pl: Kaszkiet
pt: Chapéu Gatsby
pt_pt: Chapéu Gatsby
ro: Pălărie Gatsby
ru: Шляпа в стиле Гэтсби
sk: Klobúk Gatsby
sq: Kapelë Gatsby
sr: Качкет
sr_latn: Kačket
sv: Hatt – Gatsby
te: గాట్స్‌బి టోపీ
th: หมวก Gatsby
tr: Gatsby şapka
uk: Картуз
ur: گیٹسوے ٹوپی
uz: Getsbi shlyapa
vi: Mũ bê rê nam
zh_hk: 報童帽
zu: Isigqoko se-Gatsby

# shrineProductShrugBag
source: Shrug bag
af: Shrug-sak
am: ቦርሳዎች
ar_eg: حقيبة كتف
az: Çiyin çantası
be: Сумка балеро
bn: শ্রাগ ব্যাগ
bs: Torba za nošenje na ramenu
ca: Bossa
da: Shrug-taske
es_ar: Bolso de hombro
eu: Eskuko poltsa
fa: کیف کیسه‌ای
fr_ca: Sac Shrug
gl: Bolso de ombreiro
he: תיק עם רצועה ארוכה
hi: कंधे पर लटकाने वाले बैग
hu: Táska
hy: Հոբո պայուսակ
id: Tas bahu
it: Borsa a tracolla
ja: シュラグバッグ
ka: მხარზე გადასაკიდი ჩანთა
km: កាបូប Shrug
kn: ಶ್ರಗ್ ಬ್ಯಾಗ್
ko: 슈러그 백
ky: Ийинге асып алма баштык
lo: ກະເປົາສະພາຍໄຫຼ່
lt: Ant peties nešiojama rankinė
lv: Plecu soma
mk: Чанта Shrug
ml: തോൾ സഞ്ചി
mn: Нэг мөртэй цүнх
my: လက်ဆွဲအိတ်
nb: Shrug-veske
ne: काँधमा भिर्ने झोला
pa: ਸ਼ਰੱਗ ਬੈਗ
pl: Torba
pt: Bolsa Shrug
pt_pt: Saco Shrug
ro: Geantă Shrug
ru: Сумка хобо
si: උරහිස් සෙලවීමේ බෑගය
sk: Kabelka na plece
sq: Çantë pazari
sr: Торба са ручком за ношење на рамену
sr_latn: Torba sa ručkom za nošenje na ramenu
sv: Väska – Shrug
te: భుజాన వేసుకునే సంచి
th: กระเป๋าทรงย้วย
tr: Askılı çanta
uk: Сумка Shrug
ur: شرگ بیک
uz: Hobo sumka
vi: Túi xách Shrug
zh_hk: 單肩袋
zu: I-Shrug bag

# shrineProductGiltDeskTrio
source: Gilt desk trio
af: Drietal vergulde tafels
am: ባለሶስት ጠረጴዛ
ar_eg: طقم أدوات مكتبية ذهبية اللون من 3 قطع
az: Üçlü masa dəsti
be: Трайны стол
bn: গিল্ট ডেস্ক ট্রাও
bs: Tri pozlaćena stolića
ca: Accessoris d'escriptori daurats
da: Tre-i-et-skrivebord fra Gilt
es_ar: Juego de tres mesas
eu: Urre-koloreko idazmahai-trioa
fa: میز سه‌تایی گیلت
fr_ca: Trois accessoires de bureau dorés
gl: Accesorios de escritorio dourados
he: שלישיית שולחנות צד
hi: गिल्ट डेस्क ट्रायो
hu: Gilt íróasztal trió
hy: Սեղանի հավաքածու
it: Tris di scrivanie Gilt
ja: ギルト デスク トリオ
ka: სამი მოოქრული სამუშაო მაგიდა
km: តុបីតាមទំហំ
kn: ಗಿಲ್ಟ್ ಡೆಸ್ಕ್ ಟ್ರಿಯೋ
ko: 길트 데스크 3개 세트
ky: Үч столдон турган топтом
lo: ໂຕະເຄືອບຄຳ 3 ອັນ
lt: Trijų paauksuotų stalų rinkinys
lv: Darba galda komplekts
mk: Три масички Gilt
ml: ഗിൽറ്റ് ഡെസ്‌ക് ട്രൈയോ
mn: Алтан шаргал оруулгатай гурван хос ширээ
ne: तीनवटा डेस्कको सेट
pa: Gilt ਦਾ ਤਿੰਨ ਡੈੱਸਕਾਂ ਦਾ ਸੈੱਟ
pl: Potrójny stolik z pozłacanymi elementami
pt: Trio de acessórios dourados para escritório
pt_pt: Trio de mesas Gilt
ro: Birou trio aurit
ru: Настольный набор
sk: Trio pozlátených stolíkov
sq: Set me tri tavolina
sr: Трио позлаћених сточића
sr_latn: Trio pozlaćenih stočića
sv: Skrivbordstrio – guld
te: గిల్ట్ డెస్క్ ట్రయో
th: โต๊ะขอบทอง 3 ตัว
tr: Yaldızlı üçlü sehpa
uk: Три позолочені столики
ur: جلیٹ کا ٹرپل ٹیبل
uz: Stol jamlanmasi
vi: Bộ ba dụng cụ mạ vàng để bàn
zh_hk: 鍍金書桌 3 件裝
zu: Okuthathu kwetafula ye-Gilt

# shrineProductCopperWireRack
source: Copper wire rack
af: Koperdraadrak
am: የመዳብ ገመድ መደርደሪያ
ar_eg: رف سلكي نحاسي
az: Mis rəngli tor asılqan
be: Драцяная стойка
bn: কপার ওয়্যার তাক
bs: Bakarna vješalica
ca: Cistella de reixeta de coure
da: Hylde med kobbergitter
es_ar: Estante de metal color cobre
eu: Kobrezko apalategia
fa: قفسه سیمی کاپر
fil: Copper wire na rack
fr_ca: Grille en cuivre
gl: Estante de fío de cobre
he: מדף מנחושת
hi: कॉपर वायर रैक
hu: Rézből készült tároló
hy: Պղնձե մետաղալարերից պատրաստված զամբյուղ
id: Rak kawat tembaga
it: Rastrelliera di rame
ja: 銅製ワイヤー ラック
ka: სპილენძის მავთულის საკიდი
km: ធ្នើរស្ពាន់
kn: ಕಾಪರ್ ವೈರ್ ರ್‍ಯಾಕ್
ko: 코퍼 와이어 랙
ky: Жез тордон жасалган тосмо
lo: ຕະແກງສີທອງແດງ
lt: Vario laidų lentyna
lv: Vara stiepļu statīvs
mk: Полица од бакарна жица
ml: കോപ്പർ വയർ റാക്ക്
mn: Зэс утсан тавиур
nb: Stativ i kobbertråd
ne: तामाको तारको ऱ्याक
pa: ਤਾਂਬੇ ਦੀ ਤਾਰ ਦਾ ਰੈਕ
pl: Półka z drutu miedzianego
pt: Prateleira de fios de cobre
pt_pt: Grade em fio de cobre
ro: Rastel din sârmă de cupru
ru: Корзинка из медной проволоки
sk: Medený drôtený stojan
sq: Rafti prej bakri
sr: Бакарна вешалица
sr_latn: Bakarna vešalica
sv: Trådhylla – koppar
te: కాపర్ వైర్ ర్యాక్
th: ตะแกรงสีทองแดง
tr: Bakır tel raf
uk: Дротяна стійка мідного кольору
ur: کاپر وائر رینک
uz: Mis simli savat
vi: Giá bằng dây đồng
zh_hk: 銅製儲物架
zu: I-Copper wire rack

# shrineProductSootheCeramicSet
source: Soothe ceramic set
af: Soothe-keramiekstel
am: Soothe ሴራሚክ ስብስብ
ar_eg: طقم سيراميك باللون الأبيض الراقي
az: Soothe keramika dəsti
be: Набор керамічнага посуду
bn: মসৃণ সেরামিক সেট
bs: Keramički set Soothe
ca: Joc de ceràmica relaxant
da: Soothe-keramiksæt
es_ar: Juego de cerámica
eu: Zeramikazko sorta
fa: مجموعه سرامیکی سوت
fil: Soothe na ceramic set
fr_ca: Ensemble céramique apaisant
gl: Xogo de cerámica Soothe
he: סט Soothe מקרמיקה
hi: सूद सिरामिक सेट
hu: Kerámiakészlet
hy: Կերամիկական սպասքի հավաքածու
id: Set keramik soothe
it: Set di ceramiche Soothe
ja: スーズ セラミック セット
ka: Soothe-ის კერამიკული ნაკრები
km: ឈុតសេរ៉ាមិច Soothe
kn: ಸೂತ್ ಸೆರಾಮಿಕ್ ಸೆಟ್
ko: 수드 세라믹 세트
ky: Керамика топтому
lo: ຊຸດເຄື່ອງເຄືອບສີລະມຸນ
lt: „Soothe“ keramikos rinkinys
lv: Keramikas izstrādājumu komplekts
mk: Керамички сет Soothe
ml: സൂത്ത് സെറാമിൽ സെറ്റ്
mn: Тайвшруулах керамик иж бүрдэл
nb: Soothe-keramikksett
ne: सुथ सेरामिकका कप र प्लेटको सेट
pa: ਵਧੀਆ ਚੀਨੀ ਮਿੱਟੀ ਦਾ ਸੈੱਟ
pl: Zestaw ceramiczny Soothe
pt: Kit de cerâmica relaxante
pt_pt: Conjunto de cerâmica suave
ro: Set de ceramică Soothe
ru: Набор керамической посуды
sk: Keramická súprava Soothe
sq: Set qeramike për zbutje
sr: Керамички сет Soothe
sr_latn: Keramički set Soothe
sv: Keramikservis – Soothe
te: సూత్ సెరామిక్ సెట్
th: ชุดเครื่องเคลือบสีละมุน
tr: Rahatlatıcı seramik takım
uk: Набір керамічної плитки Soothe
ur: سوس سیرامک سیٹ
uz: Sopol idishlar jamlanmasi
vi: Bộ đồ gốm tao nhã
zh_hk: Soothe 瓷器套裝
zu: Isethi ye-Soothe ceramic

# shrineProductHurrahsTeaSet
source: Hurrahs tea set
af: Hurrahs-teestel
am: ሁራህ ሻይ ዕቃዎች
ar_eg: طقم شاي مميّز
az: Əla çay dəsti
be: Чайны набор
bn: হারাহ্‌য়ের টি সেট
bs: Čajni set Hurrahs
ca: Joc per al te
da: Hurrahs-testel
es_ar: Juego de té de cerámica
eu: Tea zerbitzatzeko Hurrahs sorta
fa: ست چایخوری هوراهس
fil: Hurrahs na tea set
fr_ca: Service à thé Hurrahs
gl: Xogo de té Hurrahs
he: סט כלי תה של Hurrahs
hi: हुर्राह्स टी सेट
hu: „Hurrahs” teáskészlet
hy: Hurrahs թեյի սպասքի հավաքածու
id: Set alat minum teh Hurrahs
it: Set da tè Hurrahs
ja: フラーズ ティー セット
ka: Hurrahs-ის ჩაის ფინჯნების ნაკრები
km: ឈុតពែងតែ Hurrahs
kn: ಹುರ್ರಾಸ್ ಟೀ ಸೆಟ್
ko: 허라스 티 세트
ky: Hurrahs чай сервиси
lo: ຊຸດນ້ຳຊາ Hurrahs
lt: „Hurrahs“ arbatos servizas
lv: Hurrahs tējas komplekts
mk: Сет за чај Hurrahs
ml: ഹുറാസ് ടീ സെറ്റ്
mn: Hurrahs цайны иж бүрдэл
nb: Hurrahs-tesett
ne: Hurrahs को चियाका कपको सेट
pa: Hurrahs ਚਾਹਦਾਨੀ ਸੈੱਟ
pl: Zestaw do herbaty Hurrahs
pt: Jogo de chá Hurrahs
pt_pt: Conjunto de chá Hurrahs
ro: Set de ceai Hurrahs
ru: Прозрачный чайный набор
sk: Čajová súprava Hurrahs
sq: Set çaji Hurrahs
sr: Чајни сет Hurrahs
sr_latn: Čajni set Hurrahs
sv: Teservis – Hurrahs
te: హుర్రాస్ టీ సెట్
th: ชุดน้ำชา Hurrahs
tr: Hurrahs çay takımı
uk: Чайний сервіз Hurrahs
ur: ہوراس ٹی سیٹ
uz: Choy ichish uchun jamlanma
vi: Bộ ấm chén trà Hurrahs
zh_hk: Hurrahs 茶具套裝
zu: Isethi yetiya ye-Hurrahs

# shrineProductBlueStoneMug
source: Blue stone mug
af: Blou erdebeker
am: ሰማያዊ የድንጋይ ኩባያ
ar_eg: قدح حجري أزرق
az: Mavi daş parç
be: Сіні кубак
bn: নীল রঙের পাথরের মগ
bs: Plava kamena šolja
ca: Tassa Blue Stone
da: Blue Stone-krus
es_ar: Taza de color azul piedra
eu: Harrizko pitxer urdina
fa: لیوان دسته‌دار بلواِستون
fil: Blue stone na tasa
fr_ca: Tasse bleu pierre
gl: Cunca de pedra azul
he: ספל אבן כחול
hi: ब्लू स्टोन मग
hu: „Blue Stone” bögre
hy: Կապույտ գավաթ
id: Mug blue stone
it: Tazza in basalto blu
ja: ストーンマグ（ブルー）
ka: Blue Stone-ის ფინჯანი
km: ពែងថ្ម​ពណ៌ខៀវ
kn: ಬ್ಲೂ ಸ್ಟೋನ್ ಮಗ್
ko: 블루 스톤 머그잔
ky: Көк таштан жасалган кружка
lo: ຈອກກາເຟບລູສະໂຕນ
lt: Mėlynas keraminis puodelis
lv: Zila akmens krūze
mk: Сина камена шолја
ml: ബ്ലൂ സ്റ്റോൺ മഗ്
mn: Цэнхэр чулуун аяга
nb: Blått steinkrus
ne: ब्लु स्टोन मग
pa: ਬਲੂ ਸਟੋਨ ਮੱਗ
pl: Niebieski kubek z kamionki
pt: Caneca Blue Stone
pt_pt: Caneca de pedra azul
ro: Cană Blue Stone
ru: Синяя кружка
si: නිල් ගල් ජෝගුව
sk: Modrý keramický pohár
sq: Filxhan blu prej guri
sr: Плава камена шоља
sr_latn: Plava kamena šolja
sv: Blå mugg i stengods
te: బ్లూ స్టోన్ మగ్
th: แก้วกาแฟสีบลูสโตน
tr: Mavi taş kupa
uk: Чашка Blue Stone
ur: نیلے پتھر کا پیالا
uz: Koʻk finjon
vi: Cốc đá xanh lam
zh_hk: 藍色石製咖啡杯
zu: I-mug yetshe eluhlaza okwesibhakabhaka

# shrineProductRainwaterTray
source: Rainwater tray
af: Reënwaterlaai
am: የዝናብ ውሃ መያዣ
ar_eg: صينية عميقة
az: Yağış suyu çuxuru
be: Латок для дажджавой вады
bn: বৃষ্টির জল পাস করানোর ট্রে
bs: Posuda za kišnicu
ca: Safata
da: Rende til regnvand
es_ar: Bandeja para recolectar agua de lluvia
eu: Euri-uretarako erretilua
fa: سینی رینواتر
fil: Tray para sa tubig-ulan
fr_ca: Bac à eau de pluie
gl: Rexistro para a auga da chuvia
he: פתח ניקוז
hi: रेनवॉटर ट्रे
hu: Esővíztálca
hy: Ջրհորդան
id: Penampung air hujan
it: Contenitore per l'acqua piovana
ja: レインウォーター トレイ
ka: წვიმის წყლის ლანგარი
km: ទត្រងទឹក
kn: ರೇನ್‌ವಾಟರ್ ಟ್ರೇ
ko: 빗물받이
ky: Жаандын суусу үчүн батыныс
lo: ຮາງນ້ຳຝົນ
lt: Lietvamzdis
lv: Lietus ūdens trauks
mk: Послужавник Rainwater
ml: റെയ്‌ൻവാട്ടർ ട്രേ
mn: Борооны усны тосгуур
nb: Regnvannsskuff
ne: वर्षाको पानी सङ्कलन गर्ने थाली
pa: ਰੇਨ ਵਾਟਰ ਟ੍ਰੇ
pl: Pojemnik na deszczówkę
pt: Recipiente para água da chuva
pt_pt: Escoamento
ro: Colector pentru apă de ploaie
ru: Минималистичный поднос
si: වැසි වතුර තැටිය
sk: Zberná nádoba na dažďovú vodu
sq: Tabaka për ujin e shiut
sr: Посуда за кишницу
sr_latn: Posuda za kišnicu
sv: Bricka – Rainwater
te: రెయిన్ వాటర్ ట్రే
th: รางน้ำฝน
tr: Yağmur gideri
uk: Дощоприймальний жолоб
ur: رین واٹر ٹرے
uz: Yomgʻir suvi tarnovi
vi: Khay hứng nước mưa
zh_hk: 雨水盤
zu: Ithreyi ye-Rainwater

# shrineProductChambrayNapkins
source: Chambray napkins
af: Chambray-servette
am: Chambray ሶፍት
ar_eg: مناديل "شامبراي"
az: Kətan dəsmallar
be: Ільняныя сурвэткі
bn: শ্যামব্র্যয় ন্যাপকিন
bs: Ubrusi od chambraya
ca: Tovallons de cambrai
da: Chambrayservietter
es_ar: Servilletas de chambray
eu: Chambray estiloko ezpainzapiak
fa: دستمال‌سفره چمبری
fr_ca: Serviettes Chambray
gl: Panos de mesa de chambray
he: מפיות שמבריי
hi: शैम्ब्रे नैपकिन
hu: Chambray anyagú szalvéta
hy: Բամբակյա անձեռոցիկներ
id: Kain serbet chambray
it: Tovaglioli Chambray
ja: シャンブレー ナプキン
ka: შამბრის ხელსახოცები
km: កន្សែង Chambray
kn: ಶ್ಯಾಂಬ್ರೇ ನ್ಯಾಪ್ಕಿನ್ಸ್
ko: 샴브레이 냅킨
ky: Шамбрай майлыктары
lo: ຜ້າເຊັດປາກແຊມເບຣ
lt: Džinso imitacijos servetėlės
lv: Chambray salvetes
mk: Салфети Chambray
ml: ഷാംബ്രേ നാപ്കിൻസ്
mn: Тааран даавуун амны алчуур
nb: Chambray-servietter
ne: स्याम्ब्रे न्याप्किन
pa: ਸ਼ੈਂਬਰੇ ਨੈਪਕਿਨ
pl: Batystowe chusteczki
pt: Guardanapos em chambray
pt_pt: Guardanapos Chambray
ro: Șervete din Chambray
ru: Хлопковые салфетки
sk: Obrúsky Chambray
sq: Shami Chambray
sr: Платнене салвете
sr_latn: Platnene salvete
sv: Chambrayservetter
te: ఛాంబ్రే నాప్కిన్‌లు
th: ผ้าเช็ดปากแชมเบรย์
tr: Şambre peçete
uk: Серветки з тканини шамбре
ur: چمبری نیپکنز
uz: Paxtali sochiqlar
vi: Khăn ăn bằng vải chambray
zh_hk: 水手布餐巾
zu: I-Chambray napkins

# shrineProductSucculentPlanters
source: Succulent planters
af: Vetplantplanter
am: ውሃማ ተካዮች
ar_eg: أحواض عصرية للنباتات
az: Sukkulent bitkilər
be: Вазоны для сукулентаў
bn: সাকলেন্ট প্ল্যান্টার্স
bs: Posude za sukulentne biljke
ca: Testos per a suculentes
da: Sukkulente planter
es_ar: Macetas de suculentas
eu: Landare zukutsuetarako loreontziak
fa: گلدان‌های تزیینی ساکلنت
fil: Mga paso para sa succulent
fr_ca: Pots pour plantes grasses
gl: Testos para plantas suculentas
he: צמחים סוקולנטים
hi: सक्युलेंट प्लांटर
hu: Cserép pozsgásokhoz
hy: Սուկուլենտների տնկարկներ
id: Tanaman sukulen
it: Vasi per piante grasse
ja: サキュレント プランター
ka: სუკულენტის ქოთნები
km: រុក្ខជាតិ Succulent
kn: ಸಕ್ಯುಲೆಂಟ್ ಪ್ಲಾಂಟರ್ಸ್
ko: 다육식물 화분
ky: Ширелүү өсүмдүк өстүргүчтөр
lo: ກະຖາງສຳລັບພືດໂອບນ້ຳ
lt: Sukulento sodinukai
lv: Sukulenti
mk: Саксии за сукуленти
ml: സക്കുലന്റ് പ്ലാന്റേഴ്‌സ്
mn: Шүүслэг ургамлын сав
nb: Sukkulentplantere
ne: रसिला बगानका मालिक
pa: ਸਕਿਊਲੇਂਟ ਪਲਾਂਟਰ
pl: Doniczki na sukulenty
pt: Vasos de suculentas
ro: Ghivece pentru plante suculente
ru: Суккуленты
sk: Sukulenty
sq: Bimë mishtore
sr: Саксије за сочнице
sr_latn: Saksije za sočnice
sv: Suckulentkrukor
te: ఊట మొక్కలు ఉంచే ప్లాంటర్‌లు
th: กระถางสำหรับพืชอวบน้ำ
tr: Sukulent bitki saksıları
uk: Горщики для сукулентів
ur: سکلینٹ پلانٹرز
uz: Sukkulent oʻsimliklari
vi: Chậu cây xương rồng
zh_hk: 多肉植物盆栽
zu: I-Succulent planters

# shrineProductQuartetTable
source: Quartet table
af: Kwartettafel
am: ባለአራት ጠረጴዛ
ar_eg: طاولة رباعية الأرجل
az: Dörbucaq masa
be: Квадратны стол
bn: চৌকো টেবিল
bs: Stol za četiri osobe
ca: Taula rodona
da: Bord med fire stole
es_ar: Mesa para cuatro
eu: Laurentzako mahaia
fa: میز کوارتت
fil: Quartet na mesa
fr_ca: Table de quatre
gl: Mesa redonda
he: שולחן לארבעה
hi: क्वॉर्टेट टेबल
hu: Négyzet alakú asztal
hy: Կլոր սեղան
id: Meja kuartet
it: Tavolo Quartet
ja: カルテット テーブル
ka: Quartet-ის მაგიდა
km: តុ Quartet
kn: ಕ್ವಾರ್ಟೆಟ್ ಟೇಬಲ್
ko: 테이블 4개 세트
ky: Квартет столу
lo: ໂຕະສຳລັບ 4 ຄົນ
lt: Keturių dalių stalas
lv: Četrvietīgs galds
mk: Маса Quartet
ml: ക്വാർട്ടറ്റ് പട്ടിക
mn: Квадрат ширээ
nb: Quartet-bord
ne: वर्गाकार टेबुल
pa: ਕਵਾਰਟੈੱਟ ਮੇਜ਼
pl: Kwadratowy stół
pt: Mesa de quatro pernas
pt_pt: Quarteto de mesas
ro: Masă Quartet
ru: Круглый стол
sk: Štvorcový stôl
sq: Set me katër tavolina
sr: Сто за четири особе
sr_latn: Sto za četiri osobe
sv: Bord – Quartet
te: క్వార్టెట్ బల్ల
th: โต๊ะสำหรับ 4 คน
tr: Dört kişilik masa
uk: Стіл для чотирьох осіб
ur: کوآرٹیٹ ٹیبل
uz: Aylana stol
vi: Bàn bốn người
zh_hk: 4 座位桌子
zu: Ithebula lekota
