Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# rallyLoginRememberMe
source: Remember Me
af: Onthou my
am: አስታውሰኝ
ar_eg: تذكُّر بيانات تسجيل الدخول إلى حسابي
as: মোক মনত ৰাখক
az: Məni yadda saxlayın
be: Запомніць мяне
bn: আমাকে মনে রাখো
bs: Zapamti me
ca: Recorda'm
da: Husk mig
es_ar: Recordarme
et: Mäleta mind
eu: Gogora nazazu
fa: مرا به‌خاطر بسپار
fil: Tandaan Ako
fr_ca: Rester connecté
gl: Lembrarme
gu: મને યાદ રાખો
he: אני רוצה לשמור את פרטי ההתחברות שלי
hi: मेरी दी हुई जानकारी याद रखें
hu: Jelszó megjegyzése
hy: Հիշել ինձ
id: Ingat Saya
it: Ricordami
ja: 次回から入力を省略する
ka: დამიმახსოვრე
km: ចងចាំខ្ញុំ
kn: ನನ್ನನ್ನು ನೆನಪಿಟ್ಟುಕೊಳ್ಳಿ
ko: 로그인 유지
ky: Мени эстеп калсын
lo: ຈື່ຂ້ອຍໄວ້
lt: Atsiminti mane
lv: Atcerēties mani
mk: Запомни ме
ml: എന്നെ ഓർക്കൂ
mn: Намайг сануул
mr: मला लक्षात ठेवा
ms: Ingat saya
my: ကျွန်ုပ်ကို မှတ်ထားရန်
nb: Husk meg
ne: मलाई सम्झनुहोस्
pa: ਮੈਨੂੰ ਯਾਦ ਰੱਖੋ
pl: Zapamiętaj mnie
pt: Lembrar meus dados
pt_pt: Memorizar-me
ro: Ține-mă minte
ru: Запомнить меня
si: මාව මතක තබා ගන්න
sk: Zapamätať si ma
sq: Kujto të dhënat e mia
sr: Запамти ме
sr_latn: Zapamti me
sv: Kom ihåg mig
te: నన్ను గుర్తుంచుకో
th: จดจำข้อมูลของฉัน
tr: Beni Hatırla
uk: Запам'ятати мене
ur: مجھے یاد رکھیں
uz: Eslab qolinsin
vi: Ghi nhớ thông tin đăng nhập của tôi
zh_hk: 記住我
zu: Ngikhumbule

# rallyLoginButtonLogin
source: LOGIN
af: MELD AAN
am: ግባ
ar_eg: تسجيل الدخول
as: লগ ইন কৰক
az: GİRİŞ
be: УВАЙСЦІ
bn: লগ-ইন
bs: PRIJAVA
ca: INICIA LA SESSIÓ
da: LOG IND
es_ar: ACCEDER
et: LOGI SISSE
eu: HASI SAIOA
fa: ورود به سیستم
fil: MAG-LOG IN
fr_ca: CONNEXION
gl: INICIAR SESIÓN
gu: લૉગ ઇન
he: התחברות
hi: लॉग इन करें
hu: BEJELENTKEZÉS
hy: ՄՈՒՏՔ
it: ACCEDI
ja: ログイン
ka: შესვლა
km: ចូល
kn: ಲಾಗಿನ್ ಮಾಡಿ
ko: 로그인
ky: КИРҮҮ
lo: ເຂົ້າສູ່ລະບົບ
lt: PRISIJUNGTI
lv: PIETEIKTIES
mk: НАЈАВЕТЕ СЕ
ml: ലോഗിൻ ചെയ്യുക
mn: НЭВТРЭХ
mr: लॉग इन करा
ms: LOG MASUK
my: အကောင့်ဝင်ရန်
nb: LOGG PÅ
ne: लग इन गर्नुहोस्
pa: ਲੌਗ-ਇਨ ਕਰੋ
pl: ZALOGUJ SIĘ
pt: FAZER LOGIN
pt_pt: INICIAR SESSÃO
ro: CONECTAȚI-VĂ
ru: ВОЙТИ
si: පුරන්න
sk: PRIHLÁSIŤ SA
sq: IDENTIFIKOHU
sr: ПРИЈАВИ МЕ
sr_latn: PRIJAVI ME
sv: LOGGA IN
te: లాగిన్ చేయి
th: เข้าสู่ระบบ
tr: GİRİŞ YAP
uk: УВІЙТИ
ur: لاگ ان کریں
uz: KIRISH
vi: ĐĂNG NHẬP
zh_hk: 登入
zu: NGENA NGEMVUME

# rallyAlertsMessageHeadsUpShopping
source: Heads up, you've used up {percent} of your Shopping budget for this month.
af: Pasop. Jy het al {percent} van jou inkopiebegroting vir hierdie maand gebruik.
am: ማሳሰቢያ፣ ለዚህ ወር ከታሰበው የእርስዎ የግዢ በጀት {percent} ያህል ተጠቅመዋል።
ar_eg: تنبيه: لقد استهلكت {percent} من ميزانية التسوّق لهذا الشهر.
as: সতৰ্ক হওক, আপুনি এই মাহৰ বাবে আপোনাৰ শ্বপিং বাজেটৰ {percent} খৰচ কৰিছে।
az: Nəzərə alın ki, bu aylıq Alış-veriş büdcənizin {percent} qədərindən çoxunu istifadə etmisiniz.
be: Увага! Вы зрасходавалі {percent} свайго месячнага бюджэту на пакупкі.
bn: আপডেট, আপনি এই মাসে কেনাকাটার বাজেটের মধ্যে {percent} ব্যবহার করে ফেলেছেন।
bs: Pažnja! Iskoristili ste {percent} budžeta za kupovinu za ovaj mjesec.
ca: Atenció! Has fet servir un {percent} del teu pressupost per a compres d'aquest mes.
da: Vær opmærksom på, at du har brugt {percent} af denne måneds shoppingbudget.
es_ar: Atención, utilizaste un {percent} del presupuesto para compras de este mes.
et: Tähelepanu! Olete sel kuu kulutanud {percent} oma ostueelarvest.
eu: Egon adi: hilabete honetako erosketa-aurrekontuaren {percent} erabili duzu.
fa: مراقب باشید، {percent} از بودجه خرید این ماه را مصرف کرده‌اید.
fil: Babala, nagamit mo na ang {percent} ng iyong Badyet sa pamimili para sa buwang ito.
fr_ca: Avertissement : Vous avez utilisé {percent} de votre budget de magasinage ce mois-ci.
gl: Aviso: Consumiches o {percent} do teu orzamento de compras para este mes.
gu: સચેત રહો, તમે ખરીદી માટેના આ મહિનાના તમારા બજેટમાંથી {percent} વાપર્યા છે.
he: לידיעתך, ניצלת {percent} מתקציב הקניות שלך לחודש הזה.
hi: ध्यान दें, आपने इस महीने के खरीदारी बजट का {percent} इस्तेमाल कर लिया गया है.
hu: Előrejelzés: Az e havi Shopping-költségkeret {percent}-át használta fel.
hy: Ուշադրությո՛ւն։ Դուք ծախսել եք այս ամսվա բյուջեի {percent}-ը։
id: Perhatian, Anda telah menggunakan {percent} dari anggaran Belanja untuk bulan ini.
it: Avviso: hai usato {percent} del tuo budget per gli acquisti di questo mese.
ja: 今月のショッピング予算の {percent} を使いました。
ka: გაცნობებთ, რომ ამ თვეში უკვე დახარჯეთ საყიდლებისთვის განკუთვნილი ბიუჯეტის {percent}.
km: សេចក្ដី​ជូន​ដំណឹង អ្នកបានប្រើអស់ {percent} នៃថវិកាទិញ​ទំនិញរបស់អ្នក​សម្រាប់ខែនេះ។
kn: ಗಮನಿಸಿ, ಈ ತಿಂಗಳ ನಿಮ್ಮ ಶಾಪಿಂಗ್ ಬಜೆಟ್‌ನಲ್ಲಿ ನೀವು ಶೇಕಡಾ {percent} ರಷ್ಟು ಬಳಸಿದ್ದೀರಿ.
ko: 알림: 이번 달 쇼핑 예산의 {percent}를 사용했습니다.
ky: Көңүл буруңуз, бул айда Соода кылуу бюджетиңиздин {percent} сарптадыңыз.
lo: ກະລຸນາຮັບຊາບ, ຕອນນີ້ທ່ານໃຊ້ງົບປະມານຊື້ເຄື່ອງເດືອນນີ້ໄປແລ້ວ {percent}.
lt: Dėmesio, šį mėnesį išnaudojote {percent} apsipirkimo biudžeto.
lv: Uzmanību! Jūs esat izmantojis {percent} no sava iepirkšanās budžeta šim mēnesim.
mk: Внимавајте, сте искористиле {percent} од буџетот за купување месецов.
ml: ശ്രദ്ധിക്കുക, നിങ്ങൾ ഈ മാസത്തെ ഷോപ്പിംഗ് ബജറ്റിന്റെ {percent} ചെലവഴിച്ചു.
mn: Анхаараарай, та энэ сарын худалдан авалтынхаа төсвийн {percent}-г ашигласан байна.
mr: पूर्वसूचना, तुम्ही या महिन्यासाठी तुमच्या खरेदीच्या बजेटमधील {percent} वापरले आहेत.
ms: Makluman, anda telah menggunakan {percent} daripada belanjawan Beli-belah anda untuk bulan ini.
my: သတိ၊ ဤလအတွက် ‘ဈေးဝယ်ခြင်း’ ငွေစာရင်းမှနေ၍ {percent} သုံးပြီးသွားပါပြီ။
nb: Obs! Du har brukt {percent} av handlebudsjettet ditt for denne måneden.
ne: तपाईंले यस महिनाको आफ्नो किनमेलको बजेटमध्ये {percent} रकम खर्च गरिसक्नुभएको छ भन्ने कुरा ख्याल गर्नुहोस्।
pa: ਧਿਆਨ ਦਿਓ, ਤੁਸੀਂ ਇਸ ਮਹੀਨੇ ਦੇ ਆਪਣੇ ਖਰੀਦਦਾਰੀ ਬਜਟ ਦਾ {percent} ਵਰਤ ਚੁੱਕੇ ਹੋ।
pl: Uwaga – budżet zakupowy na ten miesiąc został już wykorzystany w {percent}.
pt: Atenção! Você usou {percent} do seu orçamento de compras para este mês.
pt_pt: Aviso: usou {percent} do orçamento para compras deste mês.
ro: Atenție, ați folosit {percent} din bugetul de cumpărături pentru luna aceasta.
ru: Внимание! Вы израсходовали {percent} своего бюджета на этот месяц.
si: දැනුම්දීමයි, ඔබ මේ මාසය සඳහා ඔබගේ සාප්පු සවාරි අයවැයෙන් {percent} භාවිත කර ඇත.
sk: Upozorňujeme, že ste minuli {percent} rozpočtu v Nákupoch na tento mesiac.
sq: Kujdes, ke përdorur {percent} të buxhetit të "Blerjeve" për këtë muaj.
sr: Пажња! Искористили сте {percent} буџета за куповину за овај месец.
sr_latn: Pažnja! Iskoristili ste {percent} budžeta za kupovinu za ovaj mesec.
sv: Du har använt {percent} av din budget för inköp den här månaden.
te: జాగ్రత్త పడండి, ఈ నెల మీరు షాపింగ్ బడ్జెట్‌లో {percent} ఉపయోగించారు.
th: โปรดทราบ คุณใช้งบประมาณสำหรับการช็อปปิ้งของเดือนนี้ไปแล้ว {percent}
tr: Dikkat! Bu ayki alışveriş bütçenizi {percent} oranında harcadınız.
uk: Попередження. Ви витратили {percent} місячного бюджету на покупки.
ur: آگاہ رہیں، آپ نے اس ماہ کے لیے اپنی خریداری کے بجٹ کا {percent} استعمال کر لیا ہے۔
uz: Diqqat! Bu oy budjetingizdan {percent} sarfladingiz.
vi: Xin lưu ý rằng bạn đã dùng hết {percent} ngân sách Mua sắm của mình trong tháng này.
zh_hk: 請注意，您在這個月已經使用了「購物」預算的 {percent}。
zu: Bheka phambili, usebenzise u-{percent} webhajethi yakho Yokuthenga kule nyanga.

# rallyAlertsMessageSpentOnRestaurants
source: You've spent {amount} on Restaurants this week.
af: Jy het hierdie week {amount} by restaurante bestee.
am: በዚህ ሳምንት ምግብ ቤቶች ሂደው {amount} አውጥተዋል።
ar_eg: لقد أنفقْت هذا الشهر مبلغ {amount} على تناول الطعام في المطاعم.
as: আপুনি এই সপ্তাহত ৰেষ্টুৰেণ্টত {amount} খৰচ কৰিছে।
az: Bu həftə restoranlarda {amount} xərcləmisiniz.
be: На гэтым тыдні вы выдаткавалі {amount} на рэстараны.
bn: এই সপ্তাহে রেস্তোরাঁয় আপনি {amount} খরচ করেছেন।
bs: Ove sedmice ste potrošili {amount} na restorane.
ca: Has gastat {amount} en restaurants aquesta setmana.
da: Du har brugt {amount} på restaurantbesøg i denne uge.
es_ar: Esta semana, gastaste {amount} en restaurantes.
et: Olete sel nädalal restoranides kulutanud {amount}.
eu: Aste honetan {amount} gastatu dituzu jatetxeetan.
fa: این هفته {amount} برای رستوران پرداخت کرده‌اید.
fil: Gumastos ka ng {amount} sa Mga Restaurant ngayong linggo.
fr_ca: Vos dépenses en restaurants s'élèvent à {amount} cette semaine.
gl: Gastaches {amount} en restaurantes esta semana.
gu: આ અઠવાડિયે તમે રેસ્ટોરન્ટ પાછળ {amount} વાપર્યા છે.
he: הוצאת {amount} על ארוחות במסעדות השבוע.
hi: इस हफ़्ते रेस्टोरेंट में आपने {amount} खर्च किए.
hu: {amount} összeget költött el éttermekben ezen a héten.
hy: Դուք այս շաբաթ ռեստորաններում ծախսել եք {amount}։
id: Anda telah menghabiskan {amount} di Restoran minggu ini.
it: Questo mese hai speso {amount} per i ristoranti.
ja: 今週はレストランに {amount}使いました。
ka: რესტორნებში ამ კვირაში დახარჯეთ {amount}.
km: អ្នកបាន​ចំណាយអស់ {amount} លើភោជនីយដ្ឋាន​នៅសប្ដាហ៍នេះ។
kn: ನೀವು ಈ ವಾರ ರೆಸ್ಟೋರೆಂಟ್‌ಗಳಲ್ಲಿ {amount} ಖರ್ಚುಮಾಡಿದ್ದೀರಿ.
ko: 이번 주에 음식점에서 {amount}을(를) 사용했습니다.
ky: Бул аптада ресторандарда {amount} сарптадыңыз.
lo: ທ່ານໃຊ້ເງິນຢູ່ຮ້ານອາຫານໃນອາທິດນີ້ໄປແລ້ວ {amount}.
lt: Šią savaitę išleidote {amount} restoranuose.
lv: Šonedēļ esat iztērējis {amount} restorānos.
mk: Потрошивте {amount} на ресторани седмицава.
ml: നിങ്ങൾ ഈ ആഴ്‌ച {amount} റെസ്റ്റോറന്റുകളിൽ ചെലവഴിച്ചു.
mn: Та энэ сар ресторанд {amount} зарцуулсан байна.
mr: तुम्ही या आठवड्यात रेस्टॉरंटवर {amount} खर्च केले.
ms: Anda sudah membelanjakan {amount} pada Restoran minggu ini.
my: ဤအပတ်ထဲတွင် ‘စားသောက်ဆိုင်များ’ အတွက် {amount} သုံးပြီးပါပြီ။
nb: Du har brukt {amount} på restauranter denne uken.
ne: तपाईंले यस महिना रेस्टुरेन्टहरूमा {amount} खर्च गर्नुभएको छ।
pa: ਤੁਸੀਂ ਇਸ ਹਫ਼ਤੇ {amount} ਰੈਸਟੋਰੈਂਟਾਂ 'ਤੇ ਖਰਚ ਕੀਤੇ ਹਨ।
pl: Kwota wydana w restauracjach w tym tygodniu to {amount}.
pt: Você gastou {amount} em restaurantes nesta semana.
pt_pt: Gastou {amount} em restaurantes esta semana.
ro: Săptămâna aceasta ați cheltuit {amount} în restaurante.
ru: На этой неделе вы потратили {amount} на еду и напитки в ресторанах.
si: ඔබ මේ සතියේ අවන්හල් සඳහා {amount} වියදම් කර ඇත
sk: Tento týždeň ste minuli {amount} v reštauráciách.
sq: Ke shpenzuar {amount} në restorante këtë javë.
sr: Ове недеље сте потрошили {amount} на ресторане.
sr_latn: Ove nedelje ste potrošili {amount} na restorane.
sv: Du har lagt {amount} på restaurangbesök den här veckan.
te: మీరు ఈ వారం రెస్టారెంట్‌లలో {amount} ఖర్చు చేశారు.
th: สัปดาห์นี้คุณใช้จ่ายไปกับการทานอาหารในร้าน {amount}
tr: Bu hafta restoranlarda {amount} harcadınız.
uk: Цього тижня ви витратили в ресторанах {amount}.
ur: آپ نے اس ہفتے ریسٹورینٹس پر {amount} خرچ کیے ہیں۔
uz: Bu hafta restoranlar uchun {amount} sarfladingiz.
vi: Bạn đã chi tiêu {amount} cho Nhà hàng trong tuần này.
zh_hk: 您這個星期已於「餐廳」方面花了 {amount}。
zu: Usebenzise u-{amount} Ezindaweni Zokudlela kuleli viki.

# rallyAlertsMessageATMFees
source: You've spent {amount} in ATM fees this month
af: Jy het hierdie maand kitsbankfooie van {amount} betaal
am: በዚህ ወር ለኤቲኤም ክፍያዎች {amount} አውጥተዋል
ar_eg: لقد أنفقْت هذا الشهر مبلغ {amount} كرسوم لأجهزة الصراف الآلي.
as: আপুনি এই মাহত এটিএমৰ মাচুলৰ বাবদ {amount} খৰচ কৰিছে
az: Bu ay bankomat rüsumları üçün {amount} xərcləmisiniz
be: У гэтым месяцы вы патрацілі {amount} на аплату камісіі ў банкаматах
bn: এই মাসে এটিএম ফি হিসেবে আপনি {amount} খরচ করেছেন
bs: Ovog mjeseca ste potrošili {amount} na naknade bankomata
ca: Has gastat {amount} en comissions de caixers automàtics aquest mes.
da: Du har brugt {amount} på hæveautomatgebyrer i denne måned
es_ar: Este mes, gastaste {amount} en tarifas de cajeros automáticos.
et: Olete sel kuul pangaautomaatidest välja võtnud {amount}.
eu: Hilabete honetan {amount} gastatu dituzu kutxazain automatikoetako komisioetan
fa: این ماه {amount} بابت کارمزد خودپرداز پرداخت کرده‌اید
fil: Gumastos ka ng {amount} sa mga bayarin sa ATM ngayong buwan
fr_ca: Vos frais relatifs à l'utilisation de guichets automatiques s'élèvent à {amount} ce mois-ci
gl: Gastaches {amount} en comisións de caixeiro automático este mes
gu: આ મહિને તમે ATM ફી માટે {amount} વાપર્યા છે
he: הוצאת {amount} על עמלות כספומטים החודש
hi: इस महीने आपने {amount} का एटीएम शुल्क दिया है
hu: {amount} összeget költött ATM-díjakra ebben a hónapban
hy: Այս ամիս դուք բանկոմատների միջնորդավճարների վրա ծախսել եք {amount}։
id: Anda telah menghabiskan {amount} biaya penggunaan ATM bulan ini
it: Questo mese hai speso {amount} di commissioni per prelievi in contanti
ja: 今月は ATM 手数料に {amount}使いました
ka: ბანკომატის საკომისიოებში ამ თვეში დახარჯეთ {amount}
km: អ្នកបានចំណាយអស់ {amount} សម្រាប់ថ្លៃសេវា ATM នៅខែនេះ
kn: ನೀವು ಈ ತಿಂಗಳು ATM ಶುಲ್ಕಗಳಲ್ಲಿ {amount} ವ್ಯಯಿಸಿದ್ದೀರಿ
ko: 이번 달에 ATM 수수료로 {amount}을(를) 사용했습니다.
ky: Бул айда банкомат сыйакылары катары {amount} төлөдүңүз
lo: ທ່ານຈ່າຍຄ່າທຳນຽມ ATM ໃນເດືອນນີ້ໄປ {amount}
lt: Šį mėnesį išleidote {amount} bankomato mokesčiams
lv: Šomēnes esat iztērējis {amount} par maksu bankomātos.
mk: Потрошивте {amount} на провизија за банкомат месецов
ml: നിങ്ങൾ ഈ മാസം {amount} ATM ഫീസ് അടച്ചു
mn: Та энэ сар ATM-н хураамжид {amount} зарцуулсан байна
mr: तुम्ही या महिन्यात ATM शुल्क म्हणून {amount} खर्च केले
ms: Anda sudah membelanjakan {amount} untuk yuran ATM pada bulan ini
my: ဤလထဲတွင် ATM ကြေး {amount} အသုံးပြုပြီးပါပြီ
nb: Du har brukt {amount} på minibankgebyrer denne måneden.
ne: तपाईंले यो महिना ATM शुल्कबापत {amount} खर्च गर्नुभएको छ
pa: ਤੁਸੀਂ ਇਸ ਮਹੀਨੇ {amount} ATM ਫ਼ੀਸ ਵਜੋਂ ਖਰਚ ਕੀਤੇ ਹਨ
pl: Opłaty pobrane za wypłaty w bankomatach w tym miesiącu wyniosły {amount}
pt: Você gastou {amount} em taxas de caixa eletrônico neste mês.
pt_pt: Gastou {amount} em taxas de multibanco este mês
ro: Luna aceasta ați cheltuit {amount} pentru comisioanele de la bancomat
ru: В этом месяце вы потратили {amount} на оплату комиссии в банкоматах.
si: ඔබ මේ මාසයේ ATM ගාස්තු සඳහා {amount} වියදම් කර ඇත
sk: Tento mesiac ste minuli {amount} na poplatky v bankomatoch
sq: Ke shpenzuar {amount} në tarifa bankomati këtë muaj
sr: Овог месеца сте потрошили {amount} на накнаде за банкомате
sr_latn: Ovog meseca ste potrošili {amount} na naknade za bankomate
sv: Du har lagt {amount} på avgifter för uttag den här månaden
te: మీరు ఈ నెల ATM ఫీజుల రూపంలో {amount} ఖర్చు చేశారు
th: เดือนนี้คุณจ่ายค่าธรรมเนียมการใช้ ATM {amount}
tr: Bu ay {amount} ATM komisyonu ödediniz
uk: Цього місяця ви витратили {amount} на комісії банкоматів.
ur: آپ نے اس مہینے ATM فیس میں {amount} خرچ کیے ہیں
uz: Siz bu oy bankomatlar komissiyasi uchun {amount} sarfladingiz
vi: Bạn đã chi tiêu {amount} cho phí sử dụng ATM trong tháng này
zh_hk: 您這個月已支付 {amount} 的自動櫃員機費用
zu: Usebenzise u-{amount} enkokhelweni ye-ATM kule nyanga

# rallyAlertsMessageCheckingAccount
source: Good work! Your checking account is {percent} higher than last month.
af: Mooi so! Jou tjekrekening is {percent} hoër as verlede maand.
am: ጥሩ ስራ! የእርስዎ ተንቀሳቃሽ ሒሳብ ከባለፈው ወር በ{percent} ጨምሯል።
ar_eg: عمل رائع! الرصيد الحالي في حسابك الجاري أعلى بنسبة {percent} من الشهر الماضي.
as: ভাল কাম কৰিছে! আপোনাৰ চেকিং একাউণ্ট যোৱা মাহতকৈ {percent} বেছি।
az: Afərin! Ödəniş hesabınızın balansı keçən ayla müqayisədə {percent} çoxdur.
be: Выдатна! У гэтым месяцы на вашым разліковым рахунку засталося на {percent} больш сродкаў, чым у мінулым.
bn: ভাল হয়েছে! আপনার চেকিং অ্যাকাউন্ট আগের মাসের থেকে {percent} বেশি।
bs: Odlično! Na tekućem računu imate {percent} više nego prošlog mjeseca.
ca: Ben fet. El teu compte corrent és un {percent} superior al mes passat.
da: Flot! Din bankkonto er steget med {percent} i forhold til sidste måned.
es_ar: ¡Buen trabajo! El saldo de la cuenta corriente es un {percent} mayor al mes pasado.
et: Tubli! Teie deposiidikonto saldo on eelmise kuuga võrreldes {percent} suurem.
eu: Primeran. Joan den hilean baino {percent} diru gehiago duzu kontu korrontean.
fa: آفرین! حساب جاری‌تان {percent} بالاتر از ماه گذشته است.
fil: Magaling! Mas mataas nang {percent} ang iyong checking account kaysa sa nakaraang buwan.
fr_ca: Bon travail! Le montant dans votre compte chèque est {percent} plus élevé que le mois dernier.
gl: Fantástico! A túa conta corrente ten un {percent} máis de fondos que o mes pasado.
gu: ઘણું સરસ! તમારું ચેકિંગ એકાઉન્ટ પાછલા મહિના કરતાં {percent} વધારે છે.
he: כל הכבוד! הסכום בחשבון העו"ש שלך גבוה ב-{percent} בהשוואה לחודש הקודם.
hi: बहुत बढ़िया! आपके चेकिंग खाते की रकम पिछले महीने की तुलना में {percent} ज़्यादा है.
hu: Nagyszerű! Folyószámlája {percent}-kal magasabb, mint múlt hónapban.
hy: Հրաշալի է։ Անցած ամսվա համեմատ՝ այս ամիս ձեր հաշվին {percent}-ով ավել գումար կա։
id: Kerja bagus. Rekening giro Anda {percent} lebih tinggi daripada bulan sebelumnya.
it: Ottimo lavoro. Il saldo del tuo conto corrente è più alto di {percent} rispetto al mese scorso.
ja: がんばりました！当座預金口座の残高が先月より {percent} 増えました。
ka: კარგია! თქვენს მიმდინარე ანგარიშზე ნაშთი გასულ თვესთან შედარებით {percent}-ით მეტია.
km: ល្អណាស់! គណនីមូលប្បទានបត្រ​របស់អ្នកគឺ​ខ្ពស់ជាង​ខែមុន {percent}។
kn: ಒಳ್ಳೆಯ ಕೆಲಸ ಮಾಡಿದ್ದೀರಿ! ನಿಮ್ಮ ಪರಿಶೀಲನೆ ಖಾತೆಯು ಹಿಂದಿನ ತಿಂಗಳಿಗಿಂತ ಶೇಕಡಾ {percent} ಹೆಚ್ಚಿದೆ.
ko: 잘하고 계십니다. 입출금계좌 잔고가 지난달에 비해 {percent} 많습니다.
ky: Азаматсыз! Текшерүү эсебиңиз акыркы айга салыштырмалуу {percent} жогорураак болду.
lo: ດີຫຼາຍ! ບັນຊີເງິນຝາກຂອງທ່ານມີເງິນຫຼາຍກວ່າເດືອນແລ້ວ {percent}.
lt: Puiku! Einamoji sąskaita {percent} didesnė nei pastarąjį mėnesį.
lv: Labs darbs! Jūsu norēķinu konts ir par {percent} augstāks nekā iepriekšējā mēnesī.
mk: Одлично! Салдото на сметката ви е {percent} поголемо од минатиот месец.
ml: തകർപ്പൻ പ്രകടനം! നിങ്ങളുടെ ചെക്കിംഗ് അക്കൗണ്ട് കഴിഞ്ഞ മാസത്തേക്കാൾ {percent} കൂടുതലാണ്.
mn: Сайн ажиллалаа! Таны чекийн данс өнгөрсөн сарынхаас {percent}-р илүү байна.
mr: उत्तम कामगिरी! तुमचे चेकिंग खाते मागील महिन्यापेक्षा {percent} वर आहे.
ms: Syabas! Akaun semasa anda adalah {percent} lebih tinggi daripada bulan lalu.
my: ကောင်းပါသည်။ သင်၏ ဘဏ်စာရင်းရှင် အကောင့်သည် ယခင်လထက် {percent} ပိုများနေသည်။
nb: Godt gjort! Det er {percent} mer på brukskontoen din nå enn forrige måned.
ne: स्याबास! तपाईंको चल्ती खाताको मौज्दात गत महिनाको तुलनामा {percent} बढी छ।
pa: ਵਧੀਆ ਕੰਮ! ਤੁਹਾਡੇ ਵੱਲੋਂ ਚੈੱਕਿੰਗ ਖਾਤੇ ਵਿੱਚ ਜਮਾਂ ਕੀਤੀ ਰਕਮ ਪਿਛਲੇ ਮਹੀਨੇ ਤੋਂ {percent} ਜ਼ਿਆਦਾ ਹੈ।
pl: Dobra robota. Saldo na Twoim koncie rozliczeniowym jest o {percent} wyższe niż w zeszłym miesiącu.
pt: Bom trabalho! Sua conta corrente está {percent} maior do que no mês passado.
pt_pt: Bom trabalho! A sua conta corrente é {percent} superior ao mês passado.
ro: Felicitări! Contul dvs. curent este cu {percent} mai bogat decât luna trecută.
ru: Отлично! В этом месяце на вашем счете на {percent} больше средств по сравнению с прошлым месяцем.
si: හොඳ වැඩක්! ඔබගේ ගෙවීම් ගිණුම පසුගිය මාසයට වඩා {percent} වැඩිය.
sk: Dobrá práca. Zostatok na vašom bežnom účte je oproti minulému mesiacu o {percent} vyšší.
sq: Të lumtë! Llogaria jote rrjedhëse është {percent} më e lartë se muajin e kaluar.
sr: Одлично! На текућем рачуну имате {percent} више него прошлог месеца.
sr_latn: Odlično! Na tekućem računu imate {percent} više nego prošlog meseca.
sv: Bra jobbat! Du har {percent} mer på kontot den här månaden.
te: మంచి పని చేశారు! మీ చెకింగ్ ఖాతా గత నెల కంటే {percent} అధికంగా ఉంది.
th: ดีมาก คุณมีเงินฝากมากกว่าเดือนที่แล้ว {percent}
tr: Harika! Çek hesabınız geçen aya göre {percent} daha fazla.
uk: Чудова робота! На вашому розрахунковому рахунку на {percent} більше коштів, ніж минулого місяця.
ur: بہت خوب! آپ کا چیکنگ اکاؤنٹ پچھلے مہینے سے {percent} زیادہ ہے۔
uz: Juda yaxshi! Bu oy hisobingizda oldingi oyga nisbatan {percent} koʻp mablagʻ bor.
vi: Chúc mừng bạn! Số dư trong tài khoản giao dịch của bạn cao hơn {percent} so với tháng trước.
zh_hk: 做得好！您的支票帳戶結餘比上個月多了 {percent}。
zu: Umsebenzi omuhle! I-akhawunti yakho yokuhlola ngu-{percent} ngaphezulu kunenyanga edlule.

# shrineMenuCaption
source: MENU
af: KIESLYS
am: ምናሌ
ar_eg: القائمة
as: মেনু
az: MENYU
be: МЕНЮ
bn: মেনু
bs: MENI
ca: MENÚ
es_ar: MENÚ
et: MENÜÜ
eu: MENUA
fa: منو
gl: MENÚ
gu: મેનૂ
he: תפריט
hi: मेन्यू
hu: MENÜ
hy: ԸՆՏՐԱՑԱՆԿ
ja: メニュー
ka: მენიუ
km: ម៉ឺនុយ
kn: ಮೆನು
ko: 메뉴
ky: МЕНЮ
lo: ເມນູ
lt: MENIU
lv: IZVĒLNE
mk: МЕНИ
ml: മെനു
mn: ЦЭС
mr: मेनू
my: မီနူး
nb: MENY
ne: मेनु
pa: ਮੀਨੂ
ro: MENIU
ru: МЕНЮ
si: මෙනුව
sk: PONUKA
sq: MENYJA
sr: МЕНИ
sr_latn: MENI
sv: MENY
te: మెనూ
th: เมนู
tr: MENÜ
uk: МЕНЮ
ur: مینیو
uz: MENYU
vi: TRÌNH ĐƠN
zh_hk: 選單
zu: IMENYU

# shrineCategoryNameAll
source: ALL
af: ALLES
am: ሁሉም
ar_eg: الكل
as: সকলো
az: HAMISI
be: УСЕ
bn: সব
bs: SVE
ca: TOT
da: ALLE
es_ar: TODAS
et: KÕIK
eu: GUZTIAK
fa: همه
fil: LAHAT
fr_ca: TOUS
gl: TODO
gu: બધા
he: הכול
hi: सभी
hu: ÖSSZES
hy: ԲՈԼՈՐԸ
id: SEMUA
it: TUTTI
ja: すべて
ka: ყველა
km: ទាំង​អស់
kn: ಎಲ್ಲಾ
ko: 전체
ky: БААРЫ
lo: ທັງໝົດ
lt: VISKAS
lv: VISAS
mk: СИТЕ
ml: എല്ലാം
mn: БҮХ
mr: सर्व
ms: SEMUA
my: အားလုံး
nb: ALLE
ne: सबै
pa: ਸਭ
pl: WSZYSTKIE
pt: TODOS
pt_pt: TODOS
ro: TOATE
ru: ВСЕ
si: සියල්ල
sk: VŠETKO
sq: TË GJITHA
sr: СВЕ
sr_latn: SVE
sv: ALLA
te: అన్నీ
th: ทั้งหมด
tr: TÜMÜ
uk: УСІ
ur: سبھی
uz: HAMMASI
vi: TẤT CẢ
zh_hk: 全部
zu: KONKE

# shrineCategoryNameAccessories
source: ACCESSORIES
af: BYKOMSTIGHEDE
am: ተቀጥላዎች
ar_eg: الإكسسوارات
as: আনুষংগিক সামগ্ৰী
az: AKSESUARLAR
be: АКСЕСУАРЫ
bn: অ্যাক্সেসরি
bs: ODJEVNI DODACI
ca: ACCESSORIS
da: TILBEHØR
es_ar: ACCESORIOS
et: AKSESSUAARID
eu: OSAGARRIAK
fa: لوازم جانبی
fil: MGA ACCESSORY
fr_ca: ACCESSOIRES
gl: ACCESORIOS
gu: ઍક્સેસરી
he: אביזרים
hi: एक्सेसरी
hu: KIEGÉSZÍTŐK
hy: ԼՐԱՍԱՐՔԵՐ
id: AKSESORI
it: ACCESSORI
ja: アクセサリ
ka: აქსესუარები
km: គ្រឿង​តុបតែង
kn: ಆ್ಯಕ್ಸೆಸರಿಗಳು
ko: 액세서리
ky: АКСЕССУАРЛАР
lo: ອຸປະກອນເສີມ
lt: PRIEDAI
lv: AKSESUĀRI
mk: ДОДАТОЦИ
ml: ആക്‌സസറികൾ
mn: ГОЁЛ ЧИМЭГЛЭЛ
mr: अ‍ॅक्सेसरी
ms: AKSESORI
my: ဆက်စပ်ပစ္စည်းများ
nb: TILBEHØR
ne: सामानहरू
pa: ਐਕਸੈਸਰੀ
pl: DODATKI
pt: ACESSÓRIOS
pt_pt: ACESSÓRIOS
ro: ACCESORII
ru: АКСЕССУАРЫ
si: ආයිත්තම්
sk: DOPLNKY
sq: AKSESORË
sr: ДОДАЦИ
sr_latn: DODACI
sv: TILLBEHÖR
te: యాక్సెసరీలు
th: อุปกรณ์เสริม
tr: AKSESUARLAR
uk: АКСЕСУАРИ
ur: لوازمات
uz: AKSESSUARLAR
vi: PHỤ KIỆN
zh_hk: 配飾
zu: IZINSIZA

# shrineCategoryNameClothing
source: CLOTHING
af: KLERE
am: አልባሳት
ar_eg: الملابس
as: পোছাক
az: GEYİM
be: АДЗЕННЕ
bn: পোশাক
bs: ODJEĆA
ca: ROBA
da: TØJ
es_ar: INDUMENTARIA
et: RIIDED
eu: ARROPA
fa: پوشاک
fil: DAMIT
fr_ca: VÊTEMENTS
gl: ROUPA
gu: કપડાં
he: הלבשה
hi: कपड़े
hu: RUHÁZAT
hy: ՀԱԳՈՒՍՏ
id: PAKAIAN
it: ABBIGLIAMENTO
ja: ファッション
ka: ტანსაცმელი
km: សម្លៀក​បំពាក់
kn: ಉಡುಗೆ
ko: 의류
ky: КИЙИМ-КЕЧЕ
lo: ເສື້ອ​ຜ້າ
lt: APRANGA
lv: APĢĒRBS
mk: ОБЛЕКА
ml: വസ്ത്രങ്ങൾ
mn: ХУВЦАС
mr: कपडे
ms: PAKAIAN
my: အဝတ်အထည်
nb: KLÆR
ne: लुगा
pa: ਕੱਪੜੇ
pl: ODZIEŻ
pt: ROUPAS
pt_pt: VESTUÁRIO
ro: ÎMBRĂCĂMINTE
ru: ОДЕЖДА
si: ඇඳුම්
sk: OBLEČENIE
sq: VESHJE
sr: ОДЕЋА
sr_latn: ODEĆA
sv: KLÄDER
te: దుస్తులు
th: เสื้อผ้า
tr: GİYİM
uk: ОДЯГ
ur: کپڑے
uz: KIYIMLAR
vi: HÀNG MAY MẶC
zh_hk: 服飾
zu: IZINGUBO

# shrineCategoryNameHome
source: HOME
af: TUIS
am: መነሻ
ar_eg: المنزل
as: ঘৰ
az: EV
be: ДОМ
bn: বাড়ি
bs: Tipka DOM
ca: CASA
da: STARTSIDE
es_ar: HOGAR
et: KODU
eu: ETXEA
fa: خانه
fr_ca: MAISON
gl: CASA
gu: હોમ
he: בית
hi: होम पेज
hu: OTTHON
hy: ՏՈՒՆ
id: RUMAH
it: CASA
ja: 家
ka: მთავარი
km: ផ្ទះ
kn: ಮನೆ
ko: 홈
ky: ҮЙ
lo: ເຮືອນ
lt: Namai
lv: MĀJAI
mk: ДОМАЌИНСТВО
ml: ഹോം
mn: ГЭРИЙН
mr: घर
ms: RUMAH
my: အိမ်
nb: HJEMME
ne: घर
pa: ਘਰੇਲੂ
pl: AGD
pt: CASA
pt_pt: LAR
ro: CASĂ
ru: ДЛЯ ДОМА
si: ගෘහ
sk: DOMÁCNOSŤ
sq: SHTËPIA
sr: КУЋА
sr_latn: KUĆA
sv: HEM
te: ఇల్లు
th: บ้าน
tr: EV
uk: ТОВАРИ ДЛЯ ДОМУ
ur: ہوم
uz: UY
vi: ĐỒ GIA DỤNG
zh_hk: 家居
zu: IKHAYA
