Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneFormTime
source: Select Time
af: Kies tyd
am: ጊዜ ምረጥ
ar_eg: اختيار الوقت
as: সময় বাছনি কৰক
az: Vaxt seçin
be: Выберыце час
bn: সময় বেছে নিন
bs: Odaberite vrijeme
ca: Selecciona l'hora
da: Vælg tidspunkt
es_ar: Seleccionar hora
et: Valige aeg
eu: Hautatu ordua
fa: انتخاب زمان
fil: Pumili ng Oras
fr_ca: Sélectionner l'heure
gl: Seleccionar hora
gu: સમય પસંદ કરો
he: בחירת שעה
hi: समय चुनें
hu: Időpont kiválasztása
hy: Ընտրել ժամը
id: Pilih Waktu
it: Seleziona ora
ja: 時間を選択
ka: აირჩიეთ დრო
km: ជ្រើសរើស​ពេលវេលា
kn: ಸಮಯವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 시간 선택
ky: Убакыт тандоо
lo: ເລືອກເວລາ
lt: Pasirinkite laiką
lv: Atlasiet laiku
mk: Изберете време
ml: സമയം തിരഞ്ഞെടുക്കുക
mn: Цаг сонгох
mr: वेळ निवडा
ms: Pilih Masa
my: အချိန်ရွေးပါ
nb: Velg klokkeslett
ne: समय चयन गर्नुहोस्
pa: ਸਮਾਂ ਚੁਣੋ
pl: Wybierz godzinę
pt: Selecionar horário
pt_pt: Selecionar hora
ro: Selectați ora
ru: Выберите время
si: වේලාව තෝරන්න
sk: Vyberte čas
sq: Zgjidh orën
sr: Изаберите време
sr_latn: Izaberite vreme
sv: Välj tid
te: సమయాన్ని ఎంచుకోండి
th: เลือกเวลา
tr: Saat Seçin
uk: Виберіть час
ur: وقت منتخب کریں
uz: Vaqtni tanlang
vi: Chọn thời gian
zh_hk: 選取時間
zu: Khetha isikhathi

# craneFormLocation
source: Select Location
af: Kies ligging
am: አካባቢ ምረጥ
ar_eg: اختيار الموقع جغرافي
as: অৱস্থান বাছনি কৰক
az: Məkan seçin
be: Выберыце месца
bn: লোকেশন বেছে নিন
bs: Odaberite lokaciju
ca: Selecciona la ubicació
da: Vælg placering
es_ar: Seleccionar ubicación
et: Asukoha valimine
eu: Hautatu kokapena
fa: انتخاب موقعیت مکانی
fil: Pumili ng Lokasyon
fr_ca: Sélectionner un lieu
gl: Seleccionar localización
gu: સ્થાન પસંદ કરો
he: בחירת מיקום
hi: जगह चुनें
hu: Hely kiválasztása
hy: Ընտրել վայր
id: Pilih Lokasi
it: Seleziona località
ja: 場所を選択
ka: მდებარეობის არჩევა
km: ជ្រើស​រើសទីតាំង
kn: ಸ್ಥಳವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 지역 선택
ky: Жайгашкан жерди тандоо
lo: ເລືອກສະຖານທີ່
lt: Pasirinkite vietą
lv: Atlasiet atrašanās vietu
mk: Изберете локација
ml: ലൊക്കേഷൻ തിരഞ്ഞെടുക്കുക
mn: Байршил сонгох
mr: स्थान निवडा
ms: Pilih Lokasi
my: တည်နေရာ ရွေးရန်
nb: Velg et sted
ne: स्थान चयन गर्नुहोस्
pa: ਟਿਕਾਣਾ ਚੁਣੋ
pl: Wybierz lokalizację
pt: Selecionar local
pt_pt: Selecionar localização
ro: Selectați o locație
ru: Выберите местоположение
si: ස්ථානය තෝරන්න
sk: Vyberte miesto
sq: Zgjidh vendndodhjen
sr: Изаберите локацију
sr_latn: Izaberite lokaciju
sv: Välj plats
te: లొకేషన్‌ను ఎంచుకోండి
th: เลือกสถานที่ตั้ง
tr: Konum Seçin
uk: Виберіть місцезнаходження
ur: مقام منتخب کریں
uz: Joylashuvni tanlang
vi: Chọn vị trí
zh_hk: 選取位置
zu: Khetha indawo

# craneFormTravelers
source: Travelers
af: Reisigers
am: ተጓዦች
ar_eg: المسافرون
as: ভ্ৰমণকাৰীসকল
az: Səyahətçilər
be: Падарожнікі
bn: ভ্রমণকারী
bs: Putnici
ca: Viatgers
da: Rejsende
es_ar: Viajeros
et: Reisijad
eu: Bidaiariak
fa: مسافران
fil: Mga Bumibiyahe
fr_ca: Voyageurs
gl: Viaxeiros
gu: મુસાફરો
he: נוסעים
hi: यात्रियों की संख्या
hu: Utasok száma
hy: Ճանապարհորդներ
id: Pelancong
it: Viaggiatori
ja: 訪問者数
ka: მოგზაურები
km: អ្នក​ធ្វើ​ដំណើរ
kn: ಪ್ರಯಾಣಿಕರು
ko: 여행자 수
ky: Жүргүнчүлөр
lo: ນັກທ່ອງທ່ຽວ
lt: Keliautojai
lv: Ceļotāji
mk: Патници
ml: സഞ്ചാരികൾ
mn: Аялагчид
mr: प्रवासी
ms: Pengembara
my: ခရီးသွားများ
nb: Reisende
ne: यात्रीहरू
pa: ਯਾਤਰੀ
pl: Podróżujący
pt: Viajantes
pt_pt: Viajantes
ro: Călători
ru: Число путешествующих
si: සංචාරකයන්
sk: Cestujúci
sq: Udhëtarët
sr: Путници
sr_latn: Putnici
sv: Resenärer
te: ప్రయాణికులు
th: นักเดินทาง
tr: Yolcu sayısı
uk: Мандрівники
ur: سیاح
uz: Sayohatchilar
vi: Số du khách
zh_hk: 旅客人數
zu: Abavakashi

# craneEat8
source: Atlanta, United States
af: Atlanta, Verenigde State
am: አትላንታ፣ አሜሪካ
ar_eg: أتلانتا، الولايات المتحدة
as: আটলাণ্টা, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Atlanta, ABŞ
be: Атланта, ЗША
bn: আটলান্টা, মার্কিন যুক্তরাষ্ট্র
bs: Atlanta, Sjedinjene Američke Države
ca: Atlanta, Estats Units
da: Atlanta, USA
es_ar: Atlanta, Estados Unidos
et: Atlanta, Ameerika Ühendriigid
eu: Atlanta (Ameriketako Estatu Batuak)
fa: آتلانتا، ایالات متحده
fr_ca: Atlanta, États-Unis
gl: Atlanta, Estados Unidos
gu: એટલાન્ટા, યુનાઇટેડ સ્ટેટ્સ
he: אטלנטה, ארצות הברית
hi: अटलांटा, अमेरिका
hu: Atlanta, Amerikai Egyesült Államok
hy: Ատլանտա, ԱՄՆ
id: Atlanta, Amerika Serikat
it: Atlanta, Stati Uniti
ja: アトランタ（米国）
ka: ატლანტა, შეერთებული შტატები
km: អាត្លង់តា សហរដ្ឋ​អាមេរិក
kn: ಅಟ್ಲಾಂಟಾ, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 애틀랜타
ky: Атланта, Америка Кошмо Штаттары
lo: ແອັດລັນຕາ, ສະຫະລັດ
lt: Atlanta, Jungtinės Amerikos Valstijos
lv: Atlanta, ASV
mk: Атланта, САД
ml: അറ്റ്ലാന്റ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн улс, Атланта
mr: अटलांटा, युनायटेड स्टेट्स
ms: Atlanta, Amerika Syarikat
my: အတ္တလန်တာ၊ အမေရိကန် ပြည်ထောင်စု
nb: Atlanta, USA
ne: एटलान्टा, संयुक्त राज्य अमेरिका
pa: ਅਟਲਾਂਟਾ, ਸੰਯੁਕਤ ਰਾਜ
pl: Atlanta, Stany Zjednoczone
pt: Atlanta, Estados Unidos
pt_pt: Atlanta, Estados Unidos
ro: Atlanta, Statele Unite
ru: Атланта, США
si: ඇට්ලන්ටා, එක්සත් ජනපදය
sk: Atlanta, USA
sq: Atlanta, Shtetet e Bashkuara
sr: Атланта, Сједињене Америчке Државе
sr_latn: Atlanta, Sjedinjene Američke Države
sv: Atlanta, USA
te: అట్లాంటా, యునైటెడ్ స్టేట్స్
th: แอตแลนตา สหรัฐอเมริกา
tr: Atlanta, ABD
uk: Атланта, США
ur: اٹلانٹا، ریاستہائے متحدہ
uz: Atlanta, AQSH
vi: Atlanta, Hoa Kỳ
zh_hk: 美國亞特蘭大
zu: I-Atlanta, United States

# craneFormDestination
source: Choose Destination
af: Kies bestemming
am: መድረሻ ይምረጡ
ar_eg: اختيار الوجهة
as: গন্তব্যস্থান বাছনি কৰক
az: Təyinat yeri seçin
be: Выберыце пункт прызначэння
bn: গন্তব্য বেছে নিন
bs: Odaberite odredište
ca: Tria una destinació
da: Vælg destination
es_ar: Seleccionar destino
et: Sihtkoha valimine
eu: Aukeratu helmuga
fa: انتخاب مقصد
fil: Pumili ng Destinasyon
fr_ca: Choisir une destination
gl: Escoller destino
gu: નિર્ધારિત સ્થાન પસંદ કરો
he: בחירת יעד
hi: मंज़िल चुनें
hu: Válasszon úti célt
hy: Ընտրել նպատակակետ
id: Pilih Tujuan
it: Scegli destinazione
ja: 目的地を選択
ka: აირჩიეთ დანიშნულების ადგილი
km: ជ្រើសរើស​គោលដៅ
kn: ತಲುಪಬೇಕಾದ ಸ್ಥಳವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 목적지 선택
ky: Бара турган жерди тандоо
lo: ເລືອກປາຍທາງ
lt: Pasirinkite kelionės tikslą
lv: Izvēlieties galamērķi
mk: Изберете дестинација
ml: ലക്ഷ്യസ്ഥാനം തിരഞ്ഞെടുക്കുക
mn: Очих газар сонгох
mr: गंतव्यस्थान निवडा
ms: Pilih Destinasi
my: သွားရောက်လိုသည့်နေရာအား ရွေးချယ်ပါ
nb: Velg et reisemål
ne: गन्तव्य छनौट गर्नुहोस्
pa: ਮੰਜ਼ਿਲ ਚੁਣੋ
pl: Wybierz cel podróży
pt: Escolha o destino
pt_pt: Escolher destino
ro: Alegeți destinația
ru: Выберите пункт назначения
si: ගමනාන්තය තෝරන්න
sk: Vyberte cieľ
sq: Zgjidh destinacionin
sr: Одаберите одредиште
sr_latn: Odaberite odredište
sv: Välj destination
te: గమ్యస్థానాన్ని ఎంచుకోండి
th: เลือกจุดหมาย
tr: Varış Noktası Seçin
uk: Виберіть пункт призначення
ur: منزل منتخب کریں
uz: Yakuniy manzilni tanlang
vi: Chọn điểm đến
zh_hk: 選取目的地
zu: Khetha indawo okuyiwa kuyo

# craneFormDates
source: Select Dates
af: Kies datums
am: ቀኖችን ይምረጡ
ar_eg: اختيار تواريخ
as: তাৰিখবোৰ বাছনি কৰক
az: Tarixlər seçin
be: Выберыце даты
bn: তারিখ বেছে নিন
bs: Odaberite datume
ca: Selecciona les dates
da: Vælg datoer
es_ar: Seleccionar fechas
et: Valige kuupäevad
eu: Hautatu datak
fa: انتخاب تاریخ‌ها
fil: Pumili ng Mga Petsa
fr_ca: Sélectionner les dates
gl: Seleccionar datas
gu: તારીખ પસંદ કરો
he: בחירת תאריכים
hi: तारीख चुनें
hu: Válassza ki a dátumtartományt
hy: Ընտրել ամսաթվեր
id: Pilih Tanggal
it: Seleziona date
ja: 日付を選択
ka: თარიღების არჩევა
km: ជ្រើសរើស​កាល​បរិច្ឆេទ
kn: ದಿನಾಂಕಗಳನ್ನು ಆಯ್ಕೆಮಾಡಿ
ko: 날짜 선택
ky: Күндөрдү тандоо
lo: ເລືອກວັນທີ
lt: Pasirinkite datas
lv: Atlasiet datumus
mk: Изберете датуми
ml: തീയതികൾ തിരഞ്ഞെടുക്കുക
mn: Огноо сонгох
mr: तारखा निवडा
ms: Pilih Tarikh
my: ရက်များကို ရွေးချယ်ပါ
nb: Velg datoer
ne: मितिहरू चयन गर्नुहोस्
pa: ਤਾਰੀਖਾਂ ਚੁਣੋ
pl: Wybierz daty
pt: Selecionar datas
pt_pt: Selecionar datas
ro: Selectați datele
ru: Выберите даты
si: දින තෝරන්න
sk: Vyberte dátumy
sq: Zgjidh datat
sr: Изаберите датуме
sr_latn: Izaberite datume
sv: Välj datum
te: తేదీలను ఎంచుకోండి
th: เลือกวันที่
tr: Tarihleri Seçin
uk: Виберіть дати
ur: تاریخیں منتخب کریں
uz: Sanalarni tanlang
vi: Chọn ngày
zh_hk: 選取日期
zu: Khetha amadethi

# craneFly
source: FLY
af: VLIEG
ar_eg: الطيران
as: উৰণ
az: UÇUŞ
be: РЭЙС
bn: উড়া
bs: LETITE
ca: VOLAR
da: FLYV
es_ar: VUELOS
et: LENDAMINE
eu: HEGALDIAK
fa: پرواز
fil: LUMIPAD
fr_ca: VOLER
gl: VOAR
gu: ઉડાન
he: טיסות
hi: उड़ानें
hu: REPÜLÉS
hy: ՉՎԵՐԹՆԵՐ
id: TERBANG
it: VOLI
ja: 飛行機
ka: ფრენა
km: ជើង​ហោះ​ហើរ
kn: ಪ್ರಯಾಣಿಸಿ
ko: 항공편
ky: УЧУУ
lo: ບິນ
lt: SKRYDIS
lv: LIDOJUMI
mk: ЛЕТАЊЕ
mn: НИСЭХ
mr: उडणे
ms: TERBANG
my: ပျံသန်းခြင်း
ne: उड्नुहोस्
pa: ਉਡਾਣਾਂ
pl: LOTY
pt: VOAR
pt_pt: VOAR
ro: AVIOANE
ru: АВИАПЕРЕЛЕТЫ
sk: LETY
sq: FLUTURIM
sr: ЛЕТ
sr_latn: LET
sv: FLYG
th: เที่ยวบิน
tr: UÇUŞ
uk: ПОЛЬОТИ
uz: UCHISH
vi: CHUYẾN BAY
zh_hk: 航班
zu: I-FLY

# craneSleep
source: SLEEP
af: SLAAP
am: እንቅልፍ
ar_eg: السكون
as: টোপনি
az: YUXU
be: НАЧЛЕГ
bn: ঘুম
bs: STANJE MIROVANJA
ca: DORMIR
da: OVERNAT
es_ar: ALOJAMIENTO
et: UNEREŽIIM
eu: Lotarako tokia
fa: خواب
fil: MATULOG
fr_ca: SOMMEIL
gl: DURMIR
gu: સ્લીપ
he: שינה
hi: नींद मोड (कम बैटरी मोड)
hu: ALVÁS
hy: ՔՈՒՆ
id: TIDUR
it: DOVE DORMIRE
ja: 宿泊
ka: ძილი
km: កន្លែង​គេង
kn: ನಿದ್ರಾವಸ್ಥೆ
ko: 숙박
ky: УКТОО
lo: ນອນ
lt: NAKVYNĖ
lv: NAKTSMĪTNES
mk: СПИЕЊЕ
ml: ഉറക്കം
mn: ХОНОГЛОХ
mr: स्लीप
ms: TIDUR
my: အိပ်စက်ခြင်း
nb: SOV
ne: शयन अवस्थामा लानुहोस्
pa: ਸਲੀਪ ਮੋਡ
pl: SEN
pt: SONO
pt_pt: DORMIR
ro: SOMN
ru: ГДЕ ПЕРЕНОЧЕВАТЬ
si: නිද්‍රාව
sk: REŽIM SPÁNKU
sq: GJUMI
sr: НОЋЕЊЕ
sr_latn: NOĆENJE
sv: SÖMN
te: స్లీప్
th: ที่พัก
tr: UYKU
uk: СОН
ur: نیند
uz: UYQU
vi: CHỖ NGỦ
zh_hk: 過夜
zu: LALA

# craneEat
source: EAT
af: EET
ar_eg: المأكولات
as: খোৱা
az: YEMƏK
be: ЕЖА
bn: খাদ্য
bs: HRANA
ca: MENJAR
da: SPIS
es_ar: GASTRONOMÍA
et: SÖÖMINE
eu: JATEKOAK
fa: غذا خوردن
fil: KUMAIN
fr_ca: MANGER
gl: COMIDA
gu: ખાવા માટેના સ્થાન
he: אוכל
hi: खाने की जगहें
hu: ÉTKEZÉS
hy: ՍՆՈՒՆԴ
id: MAKAN
it: DOVE MANGIARE
ja: 食事
ka: ჭამა24
km: អាហារដ្ឋាន
ko: 음식점
ky: ТАМАК-АШ
lo: ກິນ
lt: MAISTAS
lv: ĒDIENS
mk: ЈАДЕЊЕ
ml: കഴിക്കുക
mn: ЗООГЛОХ
mr: खाण्याची ठिकाणे
ms: MAKAN
my: စား
nb: SPIS
ne: खानुहोस्
pa: ਖਾਣ-ਪੀਣ ਦੀਆਂ ਥਾਂਵਾਂ
pl: JEDZENIE
pt: ALIMENTAÇÃO
pt_pt: COMER
ro: MÂNCARE
ru: ЕДА
sk: JEDLO
sq: NGRËNIE
sr: ИСХРАНА
sr_latn: ISHRANA
sv: MAT
th: ร้านอาหาร
tr: YEME
uk: ЇЖА
ur: کھائیں
uz: OVQATLAR
vi: CHỖ ĂN
zh_hk: 食肆
zu: I-EAT

# craneFlySubhead
source: Explore Flights by Destination
af: Verken vlugte volgens bestemming
am: በረራዎችን በመድረሻ ያስሱ
ar_eg: استكشاف الرحلات حسب الوجهة
as: গন্তব্যস্থানৰ অনুসৰি ফ্লাইটবোৰ অন্বেষণ কৰক
az: Təyinat yeri üzrə uçuşları araşdırın
be: Агляд рэйсаў у пункт прызначэння
bn: গন্তব্যের হিসেবে ফ্লাইট খুঁজুন
bs: Istražite letove po odredištima
ca: Explora vols per destinació
da: Find fly efter destination
es_ar: Explora vuelos por destino
et: Lendude avastamine sihtkoha järgi
eu: Arakatu hegaldiak helmugaren arabera
fa: پروازها را براساس مقصد کاوش کنید
fil: Mag-explore ng Mga Flight ayon sa Destinasyon
fr_ca: Explorez les vols par destination
gl: Explorar voos por destino
gu: નિર્ધારિત સ્થાન દ્વારા ફ્લાઇટની શોધખોળ કરો
he: עיון בטיסות לפי יעד
hi: मंज़िल के हिसाब से उड़ानें ढूंढें
hu: Fedezzen fel repülőjáratokat úti cél szerint
hy: Դիտեք չվերթներն ըստ նպատակակետի
id: Jelajahi Penerbangan berdasarkan Tujuan
it: Trova voli in base alla destinazione
ja: 目的地でフライトを検索
ka: აღმოაჩინეთ ფრენები დანიშნულების ადგილის მიხედვით
km: ស្វែងរក​ជើង​ហោះហើរ​តាម​គោលដៅ
kn: ತಲುಪಬೇಕಾದ ಸ್ಥಳಕ್ಕೆ ಹೋಗುವ ಫ್ಲೈಟ್‌ಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್ ಮಾಡಿ
ko: 목적지별 항공편 살펴보기
ky: Аба каттамдарын бара турган жер боюнча изилдөө
lo: ສຳຫຼວດຖ້ຽວບິນຕາມປາຍທາງ
lt: Ieškokite skrydžių pagal kelionės tikslą
lv: Izpētiet lidojumus pēc galamērķa
mk: Истражувајте летови по дестинација
ml: ലക്ഷ്യസ്ഥാനം അനുസരിച്ച് ഫ്ലൈറ്റുകൾ അടുത്തറിയുക
mn: Нислэгийг очих газраар нь судлах
mr: गंतव्यस्थानानुसार फ्लाइट शोधा
ms: Terokai Penerbangan mengikut Destinasi
my: သွားရောက်ရန်နေရာအလိုက် လေယာဉ်ခရီးစဉ်များကို စူးစမ်းခြင်း
nb: Utforsk flyvninger etter reisemål
ne: गन्तव्यअनुसार उडानको अन्वेषण गर्नुहोस्
pa: ਮੰਜ਼ਿਲਾਂ ਮੁਤਾਬਕ ਉਡਾਣਾਂ ਦੀ ਪੜਚੋਲ ਕਰੋ
pl: Przeglądaj loty według celu podróży
pt: Ver voos por destino
pt_pt: Explore voos por destino.
ro: Explorați zborurile după destinație
ru: Куда бы вы хотели отправиться?
si: ගමනාන්තය අනුව ගුවන් ගමන් ගවේෂණය කරන්න
sk: Prieskum letov podľa cieľa
sq: Eksploro fluturimet sipas destinacionit
sr: Истражујте летове према дестинацији
sr_latn: Istražujte letove prema destinaciji
sv: Utforska flyg efter destination
te: గమ్యస్థానం ఆధారంగా విమానాలను అన్వేషించండి
th: ค้นหาเที่ยวบินตามจุดหมาย
tr: Varış Noktasına Göre Uçuş Araştırma
uk: Огляд авіарейсів за пунктом призначення
ur: منزل کے لحاظ سے فلائیٹس دریافت کریں
uz: Turli manzillarga parvozlar
vi: Khám phá chuyến bay theo điểm đến
zh_hk: 根據目的地探索航班
zu: Hlola izindiza ngendawo

# craneSleepSubhead
source: Explore Properties by Destination
af: Verken eiendomme volgens bestemming
am: ንብረቶችን በመድረሻ ያስሱ
ar_eg: استكشاف العقارات حسب الوجهة
as: গন্তব্যস্থান অনুসৰি সম্পত্তিসমূহ অন্বেষণ কৰক
az: Təyinat yeri üzrə əmlakları araşdırın
be: Агляд месцаў для пражывання ў пункце прызначэння
bn: গন্তব্যের হিসেবে প্রপার্টি দেখুন
bs: Istražite smještaje po odredištima
ca: Explora propietats per destinació
da: Find ejendomme efter placering
es_ar: Explora propiedades por destino
et: Atribuutide avastamine sihtkoha järgi
eu: Arakatu jabetzak helmugaren arabera
fa: ویژگی‌ها را براساس مقصد کاوش کنید
fil: Mag-explore ng Mga Property ayon sa Destinasyon
fr_ca: Explorez les propriétés par destination
gl: Explorar propiedades por destino
gu: નિર્ધારિત સ્થાન દ્વારા પ્રોપર્ટીની શોધખોળ કરો
he: עיון בנכסים לפי יעד
hi: मंज़िल के हिसाब से प्रॉपर्टी ढूंढें
hu: Fedezzen fel ingatlanokat úti cél szerint
hy: Դիտեք հյուրանոցներն ըստ նպատակակետի
id: Jelajahi Properti berdasarkan Tujuan
it: Trova proprietà in base alla destinazione
ja: 目的地で物件を検索
ka: აღმოაჩინეთ უძრავი ქონება დანიშნულების ადგილის მიხედვით
km: ស្វែងរក​អចលន​ទ្រព្យ​តាម​គោលដៅ
kn: ತಲುಪಬೇಕಾದ ಸ್ಥಳದಲ್ಲಿನ ಸ್ವತ್ತುಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್ ಮಾಡಿ
ko: 목적지별 숙박업체 살펴보기
ky: Жайларды бара турган жер боюнча изилдөө
lo: ສຳຫຼວດທີ່ພັກຕາມປາຍທາງ
lt: Ieškokite nuomojamų patalpų pagal kelionės tikslą
lv: Izpētiet īpašumus pēc galamērķa
mk: Истражувајте сместувања по дестинација
ml: ലക്ഷ്യസ്ഥാനം അനുസരിച്ച് പ്രോപ്പർട്ടികൾ അടുത്തറിയുക
mn: Үл хөдлөх хөрөнгийг очих газраар нь судлах
mr: गंतव्यस्थानानुसार मालमत्ता शोधा
ms: Terokai Hartanah mengikut Destinasi
my: သွားရောက်ရန်နေရာအလိုက် အိမ်ရာများကို စူးစမ်းခြင်း
nb: Utforsk eiendommer etter reisemål
ne: गन्तव्यअनुसार आवास अन्वेषण गर्नुहोस्
pa: ਮੰਜ਼ਿਲਾਂ ਮੁਤਾਬਕ ਸੰਪਤੀਆਂ ਦੀ ਪੜਚੋਲ ਕਰੋ
pl: Przeglądaj miejsca zakwaterowania według celu podróży
pt: Ver propriedades por destino
pt_pt: Explore propriedades por destino.
ro: Explorați proprietățile după destinație
ru: Варианты жилья
si: ගමනාන්තය අනුව කුලී නිවාස ගවේෂණය කරන්න
sk: Prieskum objektov podľa cieľa
sq: Eksploro pronat sipas destinacionit
sr: Истражујте смештајне објекте према одредишту
sr_latn: Istražujte smeštajne objekte prema odredištu
sv: Utforska boenden efter destination
te: గమ్యస్థానం ఆధారంగా ప్రాపర్టీలను అన్వేషించండి
th: ค้นหาที่พักตามจุดหมาย
tr: Varış Noktasına Göre Mülk Araştırma
uk: Огляд готелів чи житла за пунктом призначення
ur: منزل کے لحاظ سے پراپرٹیز دریافت کریں
uz: Turli manzillardagi joylar
vi: Khám phá khách sạn theo điểm đến
zh_hk: 根據目的地探索住宿
zu: Hlola izinto ngendawo

# craneEatSubhead
source: Explore Restaurants by Destination
af: Verken restaurante volgens bestemming
am: ምግብ ቤቶችን በመድረሻ ያስሱ
ar_eg: استكشاف المطاعم حسب الوجهة
as: গন্তব্যস্থান অনুসৰি ৰেষ্টুৰেণ্টসমূহ অন্বেষণ কৰক
az: Təyinat yeri üzrə restoranları araşdırın
be: Агляд рэстаранаў у пункце прызначэння
bn: গন্তব্যের হিসেবে রেস্তোরাঁ দেখুন
bs: Istražite restorane po odredištima
ca: Explora restaurants per destinació
da: Find restauranter efter destination
es_ar: Explora restaurantes por ubicación
et: Restoranide avastamine sihtkoha järgi
eu: Arakatu jatetxeak helmugaren arabera
fa: رستوران‌ها را براساس مقصد کاوش کنید
fil: Mag-explore ng Mga Restaurant ayon sa Destinasyon
fr_ca: Explorez les restaurants par destination
gl: Explorar restaurantes por destino
gu: નિર્ધારિત સ્થાન દ્વારા રેસ્ટોરન્ટની શોધખોળ કરો
he: עיון במסעדות לפי יעד
hi: मंज़िल के हिसाब से रेस्टोरेंट ढूंढें
hu: Fedezzen fel éttermeket úti cél szerint
hy: Դիտեք ռեստորաններն ըստ նպատակակետի
id: Jelajahi Restoran berdasarkan Tujuan
it: Trova ristoranti in base alla destinazione
ja: 目的地でレストランを検索
ka: აღმოაჩინეთ რესტორნები დანიშნულების ადგილის მიხედვით
km: ស្វែងរក​ភោជនីយ​ដ្ឋាន​តាម​គោលដៅ
kn: ತಲುಪಬೇಕಾದ ಸ್ಥಳದಲ್ಲಿರುವ ರೆಸ್ಟೋರೆಂಟ್‌ಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್ ಮಾಡಿ
ko: 목적지별 음식점 살펴보기
ky: Ресторандарды бара турган жер боюнча изилдөө
lo: ສຳຫຼວດຮ້ານອາຫານຕາມປາຍທາງ
lt: Ieškokite restoranų pagal kelionės tikslą
lv: Izpētiet restorānus pēc galamērķa
mk: Истражувајте ресторани по дестинација
ml: ലക്ഷ്യസ്ഥാനം അനുസരിച്ച് റെസ്റ്റോറന്റുകൾ അടുത്തറിയുക
mn: Рестораныг очих газраар нь судлах
mr: गंतव्यस्थानानुसार रेस्टॉरंट शोधा
ms: Terokai Restoran mengikut Destinasi
my: သွားရောက်ရန်နေရာအလိုက် စားသောက်ဆိုင်များကို စူးစမ်းခြင်း
nb: Utforsk restauranter etter reisemål
ne: गन्तव्यअनुसार भोजनालयहरूको अन्वेषण गर्नुहोस्
pa: ਮੰਜ਼ਿਲਾਂ ਮੁਤਾਬਕ ਰੈਸਟੋਰੈਂਟਾਂ ਦੀ ਪੜਚੋਲ ਕਰੋ
pl: Przeglądaj restauracje według celu podróży
pt: Ver restaurantes por destino
pt_pt: Explore restaurantes por destino.
ro: Explorați restaurantele după destinație
ru: Рестораны
si: ගමනාන්තය අනුව අවන්හල් ගවේෂණය කරන්න
sk: Prieskum reštaurácií podľa cieľa
sq: Eksploro restorantet sipas destinacionit
sr: Истражујте ресторане према одредишту
sr_latn: Istražujte restorane prema odredištu
sv: Utforska restauranger efter destination
te: గమ్యస్థానం ఆధారంగా రెస్టారెంట్‌లను అన్వేషించండి
th: ค้นหาร้านอาหารตามจุดหมาย
tr: Varış Noktasına Göre Restoran Araştırma
uk: Огляд ресторанів за пунктом призначення
ur: منزل کے لحاظ سے ریستوران دریافت کریں
uz: Turli manzillardagi restoranlar
vi: Khám phá nhà hàng theo điểm đến
zh_hk: 根據目的地探尋餐廳
zu: Hlola izindawo zokudlela ngendawo
