Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTooltipDescription
source: Tooltips provide text labels that help explain the function of a button or other user interface action. Tooltips display informative text when users hover over, focus on, or long press an element.
af: Nutswenke verskaf teksetikette wat help om die funksie van 'n knoppie of ander gebruikerkoppelvlakhandeling te verduidelik. Nutswenke wys insiggewende teks wanneer gebruikers oor 'n element hou, op een fokus, of lank op een druk.
am: የመሣሪያ ጥቆማዎች የአዝራርን ወይም ሌላ የተጠቃሚ በይነገጽ እርምጃ ለማብራራት የሚያግዙ የጽሑፍ መሰየሚያዎችን ያቀርባሉ። የመሣሪያ ጥቆማዎች ተጠቃሚዎች አንድ አባለ ነገር ላይ ሲያንዣብቡ፣ ሲያተኩሩ ወይም በረዥም ሲጫኑ መረጃ ሰጪ ጽሑፍን ያሳያል።
ar_eg: توفّر التلميحات تصنيفات نصية تساعد في شرح وظيفة زر أو إجراء آخر من إجراءات واجهة المستخدم. تعرض التلميحات نص إخباري عندما يمرّر المستخدمون مؤشر الماوس على عنصر أو يركزون عليه أو يضغطون عليه مع الاستمرار.
as: টুলটিপসমূহে পাঠ লেবেলসমূহ প্ৰদান কৰে, যিবোৰে কোনো বুটাম অথবা অন্য ব্যৱহাৰকাৰীৰ ইণ্টাৰফে’চৰ কার্য বর্ণনা কৰাত সহায় কৰে। ব্যৱহাৰকাৰীসকলে কোনো উপাদানৰ ওপৰত ধৰি থাকিলে, মনোযোগ দিলে অথবা দীঘলীয়া সময় ধৰি টিপি থাকিলে টুলটিপে তথ্যমূলক পাঠ প্ৰদর্শন কৰে।
az: İpucular düymə funksiyasını və ya digər istifadəçi interfeysi əməliyyatını izah etməyə kömək edən mətn etiketləri təmin edir. İstifadəçilər elementin üzərində sürüşdürdükdə, fokuslandıqda və ya basıb saxladıqda ipucular məlumatlandırıcı mətn göstərir.
be: Падказкі дапамагаюць зразумець, як працуюць кнопкі і іншыя элементы інтэрфейса. Яны паяўляюцца пры доўгім націсканні на элемент, пераходзе да яго ці навядзенні на яго курсора.
bn: টুলটিপস এমন একটি টেক্সট লেবেল দেখায় যেটি বোতাম বা অন্যান্য ইউজার ইন্টারফেসের অ্যাকশন কীভাবে কাজ করে সেই বিষয়ে বোঝাতে সহায়তা করে। ব্যবহারকারীরা যখন কোনও এলিমেন্টের উপর কারসার নিয়ে যান, ফোকাস করেন বা অনেকক্ষণ প্রেস করে ধরে থাকেন তখন টুলটিপ তথ্যপূর্ণ মেসেজ দেখায়।
bs: Opisi pružaju tekstualne oznake kojima se objašnjava funkcija dugmeta ili druge radnje korisničkog interfejsa. Opisi prikazuju informativni tekst kada korisnik postavi kursor iznad elementa, fokusira se na njega ili ga dugo pritisne.
ca: Les descripcions emergents proporcionen etiquetes de text que ajuden a explicar la funció d'un botó o d'altres accions de la interfície d'usuari. Les descripcions emergents mostren text informatiu quan els usuaris passen el cursor per sobre d'un element, el seleccionen amb el teclat o el mantenen premut.
da: Værktøjstips leverer tekstetiketter, der hjælper med at forklare en knaps funktion eller andre brugerfladehandlinger. Værktøjstips viser tekst med oplysninger, når brugerne holder markøren over et element eller trykker på elementet i lang tid.
es_ar: La información sobre la herramienta proporciona etiquetas de texto para explicar la función que cumple un botón, o bien otra acción de la interfaz de usuario. Este texto informativo se muestra cuando un usuario coloca el cursor sobre un elemento, lo enfoca o lo mantiene presionado.
et: Kohtspikrid kuvavad tekstisildid, mis aitavad selgitada nupu või muud kasutajaliidese toimingu funktsiooni. Kohtspikrid kuvavad informatiivse teksti, kui kasutaja kursorit elemendil hõljutab, sellele fokuseerib või seda pikalt vajutab.
eu: Aholkuak testu-etiketak dira, zeinek botoi baten edo erabiltzaile-interfazeko ekintza baten funtzioa azaltzen baitute. Aholkuek testu informatibo bat bistaratzen dute erabiltzaileak aukera baten gainetik pasatzen direnean, aukera baten gainean fokua jartzen dutenean edo aukera bat luze sakatzen dutenean.
fa: نکته‌ابزارها برچسبی نوشتاری نشان می‌دهد که عملکرد دکمه‌ها یا کنش‌های دیگر واسط کاربر را توضیح می‌دهد. وقتی کاربران نشانگر را روی عنصری نگه می‌دارند، روی آن تمرکز می‌کنند، یا فشار طولانی می‌دهند، نکته‌ابزار نوشتار مفیدی نمایش می‌دهد.
fil: Nagbibigay ang mga tooltip ng mga text na label na nakakatulong sa pagpapaliwanag sa function ng isang button o iba pang pagkilos sa user interface. Nagpapakita ang mga tooltip ng text na nagbibigay ng impormasyon kapag nag-hover, tumutok, o pumindot nang matagal ang mga user sa isang element.
fr_ca: Les infobulles sont des libellés textuels qui expliquent la fonction d'un bouton ou d'une autre action d'une interface utilisateur. Le texte informatif s'affiche lorsque les utilisateurs passent leur souris, placent leur curseur ou appuient de manière prolongée sur un élément.
gl: Os cadros de información proporcionan etiquetas de texto que axudan a explicar a función dun botón ou outra acción da interface de usuario. Amosan texto informativo cando os usuarios pasan por enriba dun elemento, se centran nel ou o manteñen premido.
gu: ટૂલટિપ ટેક્સ્ટ લેબલ આપે છે, જે બટન અથવા યૂઝર ઇન્ટરફેસની અન્ય ક્રિયાના ફંક્શન સમજાવવામાં સહાય કરે છે. જ્યારે વપરાશકર્તા કોઈ ઘટક પર લઈ જાય, તેના પર ફોકસ કરે અથવા તેના પર થોડીવાર દબાવી રાખે, ત્યારે ટૂલટિપ માહિતીપ્રદ ટેક્સ્ટ પ્રદર્શિત કરે છે.
he: הסברים קצרים מספקים תוויות טקסט עם הסברים לגבי פעולת לחצן או פעולה אחרת בממשק המשתמש. הסברים קצרים מציגים טקסט אינפורמטיבי כשמשתמשים מעבירים את העכבר מעל אלמנט, מתמקדים עליו או לוחצים עליו לחיצה ארוכה.
hi: टूलटिप में टेक्स्ट लेबल दिखाई देता है, जो बताता है कि बटन का क्या काम है या यूज़र इंटरफ़ेस के दूसरे कामों की जानकारी देता है. जब उपयोगकर्ता किसी आइटम पर माउस घुमाते हैं, फ़ोकस करते हैं या उसे दबाकर रखते हैं, तो टूलटिप उससे जुड़ी जानकारी दिखाती है.
hu: Az elemleírások szöveges címkéket tartalmaznak, amelyek segítik az adott gomb vagy más kezelőfelületi művelet funkciójának a megértését. Az elemleírások informatív szöveget jelenítenek meg, amikor a felhasználók az adott elem fölé viszik az egeret, az adott elemre fókuszálnak, vagy hosszan nyomják az adott elemet.
hy: Հուշումները տեքստային պիտակների օգնությամբ նկարագրում են կոճակի գործառույթը և միջերեսի մյուս գործողությունները։ Հուշումներում ցուցադրվում են տեքստ պարունակող տեղեկություններ, երբ օգտատերը նշորդն անց է կացնում տարրի վրայով, պահում կամ երկար սեղմում դրա վրա։
id: Tooltip memberikan label teks yang membantu menjelaskan fungsi tombol atau tindakan antarmuka pengguna lainnya. Tooltip menampilkan teks informatif saat pengguna mengarahkan kursor, memfokuskan, atau menekan lama pada suatu elemen.
it: Le descrizioni comandi forniscono etichette di testo che aiutano a spiegare la funzione di un pulsante o di un'altra azione dell'interfaccia utente. Le descrizioni comandi mostrano testo informativo quando gli utenti posizionano il puntatore sopra un elemento, impostano lo stato attivo su un elemento o premono a lungo un elemento.
ja: ツールチップでは、ボタンやその他のユーザー インターフェース アクションの機能を紹介するテキストラベルが提供されます。ユーザーが要素にカーソルを合わせたり、フォーカスを置いたり、要素を長押ししたりすると、ツールチップに情報メッセージが表示されます。
ka: მინიშნებები გაწვდიან ტექსტურ ლეიბლებს, რომლებშიც ახსნილია ღილაკის ან სამომხმარებლო ინტერფეისის სხვა მოქმედებების ფუნქცია. მინიშნებები აჩვენებს ინფორმაციის შემცველ ტექსტს მომხმარებლის მიერ ელემენტზე გადატარებისას, ფოკუსირებისას ან ხანგრძლივად დაჭერისას.
km: កំណត់​ពន្យល់​ផ្ដល់​ស្លាក​អត្ថបទ​ដែល​ជួយ​ពន្យល់​អំពី​មុខងារ​របស់​ប៊ូតុង ឬ​សកម្មភាព​នៃ​ផ្ទៃប៉ះ​ផ្សេងទៀត​។ កំណត់​ពន្យល់​បង្ហាញ​អត្ថបទ​ដែលផ្ដល់​ព័ត៌មាន​ជាប្រយោជន៍ នៅពេល​អ្នកប្រើប្រាស់​ដាក់ព្រួញ ផ្ដោត ឬ​ចុចលើ​ធាតុ​ឱ្យយូរ​។
kn: ಟೂಲ್‌ಟಿಪ್‌ಗಳು ಪಠ್ಯ ಲೇಬಲ್‌ಗಳನ್ನು ಒದಗಿಸುತ್ತವೆ ಹಾಗೂ ಇವು ಬಟನ್‌ಗಳ ಫಂಕ್ಷನ್ ಮತ್ತು ಇತರ ಬಳಕೆದಾರ ಇಂಟರ್‌ಫೇಸ್ ಕ್ರಿಯೆಗಳನ್ನು ವಿವರಿಸುತ್ತವೆ. ಬಳಕೆದಾರರು ಒಂದು ಅಂಶದ ಮೇಲೆ ಹೋವರ್ ಮಾಡಿದಾಗ, ಫೋಕಸ್ ಮಾಡಿದಾಗ, ಅಥವಾ ದೀರ್ಘಕಾಲ ಒತ್ತಿಹಿಡಿದಾಗ ಮಾಹಿತಿ ಪಠ್ಯಗಳನ್ನು ಟೂಲ್‌ಟಿಪ್‌ಗಳಲ್ಲಿ ಡಿಸ್‌ಪ್ಲೇ ಆಗುತ್ತವೆ.
ko: 도움말에는 버튼 또는 기타 사용자 인터페이스 작업의 기능을 설명하는 텍스트 라벨이 있습니다. 사용자가 요소 위로 마우스를 가져가거나, 요소를 포커스하거나 길게 누르면 도움말에서 정보를 전달하는 텍스트가 표시됩니다.
ky: Калкып чыгуучу кеңештер баскычтын же колдонуучунун интерфейсиндеги башка аракеттин функциясын түшүндүргөн тексттер. Калкып чыгуучу кеңештер колдонуучу чычканды элементтин үстүнө алып келгенде, элементти тандаганда же коё бербей басып турганда көрсөтүлүүчү маалымат камтылган текст.
lo: ຄຳແນະນຳຈະສະໜອງປ້າຍກຳກັບແບບຂໍ້ຄວາມເພື່ອຊ່ວຍອະທິບາຍຟັງຊັນຂອງປຸ່ມ ຫຼື ຄຳສັ່ງສ່ວນຕິດຕໍ່ຜູ້ໃຊ້ອື່ນໆ. ຄຳແນະນຳຈະສະແດງຂໍ້ຄວາມທີ່ເປັນຂໍ້ມູນເມື່ອຜູ້ໃຊ້ເລື່ອນໄປໃສ່, ເລືອກໃສ່ ຫຼື ກົດຄ້າງໃສ່ອົງປະກອບໃດໜຶ່ງ.
lt: Patarimuose teikiamos teksto etiketės, padedančios paaiškinti mygtuko ar kito naudotojo sąsajos veiksmo funkciją. Patarimuose pateikiama informatyvaus teksto, naudotojams užvedus pelės žymeklį virš elemento, paryškinus jį ar ilgai paspaudus.
lv: Rīka padomi ietver teksta iezīmes, kas paskaidro pogas vai citas lietotāja saskarnes darbības funkciju. Rīka padomi attēlo informatīvu tekstu, kad lietotāji virs kāda elementa virza kursoru, izceļ elementu vai to nospiež un tur.
mk: Советите за алатки даваат текстуални етикети што ја објаснуваат функцијата на копчето или на друго дејство на корисничкиот интерфејс. Советите за алатки прикажуваат информативен текст кога корисниците ќе го наместат глушецот над елемент, ќе фокусираат или долго ќе притиснат некој елемент.
ml: ബട്ടന്റെയോ മറ്റ് ഉപയോക്തൃ ഇന്റർഫേസ് നടപടിയുടെയോ ഫംഗ്ഷൻ വിവരിക്കാൻ സഹായിക്കുന്ന ടെക്സ്റ്റ് ലേബലുകൾ ടൂൾടിപ്പുകൾ നൽകുന്നു. ഉപയോക്താക്കൾ ഹോവർ ചെയ്യുമ്പോഴോ ഫോക്കസ് ചെയ്യുമ്പോഴോ ഒരു എലിമെന്റിൽ ദീർഘനേരം അമർത്തുമ്പോഴോ ടൂൾടിപ്പുകൾ, അറിവ് നൽകുന്ന ടെക്സ്റ്റ് പ്രദർശിപ്പിക്കും.
mn: Зөвлөмж нь товчлуурын функц эсвэл хэрэглэгчийн бусад харилцан үйлдлийн талаар тайлбарлахад тусалдаг текстийн шошгыг үзүүлдэг. Зөвлөмж нь хэрэглэгчид элемент дээр зөөх, сонгох эсвэл удаан дарах үед мэдээллийн текстийг үзүүлдэг.
mr: टूलटिप्स मजकूर लेबले पुरवतात जी बटणाचे कार्य किंवा इतर यूझर इंटरफेस कृतीचे स्पष्टीकरण देण्यात मदत करतात. वापरकर्ते एखाद्या घटकावर फिरवतात, त्यावर लक्ष केंद्रित करतात किंवा प्रेस करून ठेवतात तेव्हा टूलटिप्स माहितीपूर्ण मजकूर प्रदर्शित करतात.
ms: Tip alat menyediakan label teks yang membantu menjelaskan fungsi butang atau tindakan antara muka pengguna yang lain. Tip alat memaparkan teks bermaklumat apabila pengguna menuding, menumpukan atau tekan lama pada satu unsur.
my: အကြံပြုချက်ပြ ပေါ့အပ် ဝင်းဒိုးများတွင် ခလုတ်တစ်ခု၏ လုပ်ဆောင်ချက် သို့မဟုတ် သုံးသူအတွက်ကြားခံစနစ်လုပ်ဆောင်ချက် အခြားတစ်ခုကို ကူညီ၍ ရှင်းလင်းဖော်ပြပေးသော စာသားအညွှန်းများပါဝင်သည်။ အကြံပြုချက်ပြ ပေါ့အပ် ဝင်းဒိုးသည် အသုံးပြုသူက အကြောင်းအရာတစ်ခုကို အပေါ်မှနေ၍ အုပ်ခြင်း၊ အာရုံစိုက်လိုက်ခြင်း သို့မဟုတ် ကြာရှည်စွာ ဖိထားလိုက်ခြင်းတို့ ပြုလုပ်သည့်အခါ အချက်အလက်ပြည့်စုံသည့် စာသားတစ်ခုကို ဖော်ပြသည်။
nb: Verktøytips er tekstetiketter som forklarer funksjonen til en knapp eller en annen handling i brukergrensesnittet. Verktøytips viser informativ tekst når brukere holder markøren over, fokuserer på eller trykker lenge på et element.
ne: उपकरण वर्णनहरूले बटन वा प्रयोगकर्ताको इन्टरफेससम्बन्धी कार्य वर्णन गर्न मद्दत गर्ने पाठका लेबलहरू प्रदान गर्दछन्। प्रयोगकर्ताहरूले कुनै तत्त्वमाथि होभर गरेमा, त्यसमा फोकस गरेमा वा त्यसलाई केही बेरसम्म थिचेमा उपकरण वर्णनहरूले जानकारीमूलक पाठ देखाउँछन्।
pa: ਟੂਲ-ਟਿੱਪ ਲਿਖਤ ਲੇਬਲ ਮੁਹੱਈਆ ਕਰਵਾਉਂਦੇ ਹਨ ਜੋ ਬਟਨਾਂ ਦੇ ਫੰਕਸ਼ਨ ਜਾਂ ਹੋਰ ਵਰਤੋਂਕਾਰ ਇੰਟਰਫੇਸ ਕਾਰਵਾਈਆਂ ਦੀ ਵਿਆਖਿਆ ਕਰਨ ਵਿੱਚ ਮਦਦ ਕਰਦੇ ਹਨ। ਟੂਲ-ਟਿੱਪ ਉਦੋਂ ਜਾਣਕਾਰੀ ਭਰਪੂਰ ਲਿਖਤ ਦਿਖਾਉਂਦਾ ਹੈ ਜਦੋਂ ਵਰਤੋਂਕਾਰ ਕਰਸਰ ਘੁੰਮਾਉਦਾ ਹੈ, ਫੋਕਸ ਕਰਦਾ ਹੈ ਜਾਂ ਕਿਸੇ ਤੱਤ ਨੂੰ ਦਬਾਈ ਰੱਖਦਾ ਹੈ।
pl: Etykietki zawierają tekst z objaśnieniem funkcji przycisku lub działania innego elementu interfejsu. Etykietka z podpowiedzią wyświetla się, gdy użytkownik najedzie myszą na element, wybierze go lub przytrzyma.
pt: As dicas mostram etiquetas que ajudam a explicar a função de um botão ou outra ação da interface do usuário. Elas exibem textos informativos quando os usuários passam o cursor por um elemento, focam nele ou tocam nele e o mantêm pressionado.
pt_pt: As sugestões fornecem etiquetas de texto que ajudam a explicar a função de um botão ou outra ação da interface do utilizador. As sugestões apresentam texto informativo quando os utilizadores colocam o cursor do rato sobre, focam ou mantêm premido um elemento.
ro: Baloanele explicative afișează etichete cu text care explică funcția unui buton sau altă acțiune din interfața de utilizare. Baloanele explicative afișează text informativ atunci când utilizatorii plasează cursorul pe, selectează sau apasă lung un element.
ru: Подсказки помогают понять, как работают кнопки и другие элементы интерфейса. Они появляются при долгом нажатии на элемент, переходе к нему или наведении на него указателя.
si: මෙවලම් ඉඟි බොත්තමක හෝ වෙනත් පරිශීලක අතුරුමුහුණත් ක්‍රියාවක ශ්‍රිතය පැහැදිලි කිරීමට සහාය වන පෙළ ලේබල සපයයි. පරිශීලකයන් මූලාංගයක් උඩින් තබා ගන්නා විට, අවධානය යොමු කරන විට හෝ දිගු ඔබන විට මෙවලම් ඉඟි තොරතුරු විස්තර කරන පෙළ පෙන්වයි.
sk: Popisy poskytujú textové štítky, ktoré pomáhajú vysvetliť funkciu tlačidla alebo inej akcie v používateľskom rozhraní. Zobrazujú informatívny text, keď používatelia umiestnia kurzor myši na prvok, označia ho alebo ho dlho stlačia.
sq: Këshillat për veglat ofrojnë etiketa teksti që ndihmojnë për të shpjeguar funksionin e një butoni ose të një veprimi tjetër të ndërfaqes së përdoruesit. Këshillat për veglat shfaqin një tekst informues kur përdoruesit qëndrojnë pezull mbi to, kur i fokusojnë ose kur kryejnë një shtypje të gjatë mbi një element.
sr: Објашњења пружају текстуалне ознаке које објашњавају функцију дугмета или неке друге радње у корисничком интерфејсу. Објашњења приказују информативни текст када корисници прелазе курсором преко елемента, односно када се фокусирају на њега или га дуго притискају.
sr_latn: Objašnjenja pružaju tekstualne oznake koje objašnjavaju funkciju dugmeta ili neke druge radnje u korisničkom interfejsu. Objašnjenja prikazuju informativni tekst kada korisnici prelaze kursorom preko elementa, odnosno kada se fokusiraju na njega ili ga dugo pritiskaju.
sv: I beskrivningar tillhandahålls textetiketter som förklarar funktionen hos en knapp eller en annan åtgärd kopplad till användargränssnittet. I beskrivningar visas informativ text när användare håller muspekaren över, fokuserar på eller trycker länge på ett element.
te: ఉపకరణ చిట్కాలు అనేవి ఒక బటన్ లేదా ఇతర యూజర్ ఇంటర్‌ఫేస్ చర్యకు సంబంధించిన ఫంక్షన్‌ను వివరించడంలో సహాయపడగలిగే వచన లేబుళ్లను అందిస్తాయి. ఉపకరణ చిట్కాలు అనేవి యూజర్‌లు ఒక అంశంపై కర్సర్ ఉంచినప్పుడు, దృష్టి కేంద్రీకరించినప్పుడు లేదా ఎక్కువసేపు నొక్కినప్పుడు సమాచార వచనాన్ని ప్రదర్శిస్తాయి.
th: เคล็ดลับเครื่องมือมีป้ายกำกับข้อความที่ช่วยอธิบายฟังก์ชันของปุ่มหรือการดำเนินการผ่านอินเทอร์เฟซผู้ใช้อื่นๆ เคล็ดลับเครื่องมือจะแสดงข้อความที่เป็นประโยชน์เมื่อผู้ใช้วางเมาส์เหนือ โฟกัสที่ หรือกดค้างองค์ประกอบ
tr: İpuçları, bir düğmenin işlevini veya diğer kullanıcı arayüzü işlemini açıklamaya yardımcı olan metin etiketleri sağlar. İpuçları, kullanıcı fareyle bir öğenin üzerine geldiğinde veya öğeye odaklandığında ya da uzun bastığında bilgilendirici metin görüntüler.
uk: Спливаючі підказки містять текст, що допомагає пояснити функцію кнопки чи іншої дії інтерфейсу користувача. Цей текст з'являється, коли користувач утримує елемент або наводить на нього курсор.
ur: ٹول ٹپس ٹیکسٹ لیبلز فراہم کرتے ہیں جو بٹن کے فنکشن یا دوسرے صارف انٹرفیس کارروائی کی وضاحت کرنے میں مدد کرتے ہیں۔ جب صارف کسی عنصر کے اوپر کرسر گھماتے ہیں، اس پر فوکس کرتے ہیں یا لانگ پریس کرتے ہیں تب ٹول ٹپس معلوماتی متن کو ڈسپلے کرتی ہیں۔
uz: Qalqib chiquvchi maslahat oynalari tugmalar va interfeysdagi boshqa elementlarni qanday ishlashini tushunishda yordam beradi. Element bosib turilganda, kursor uning ustiga olib borilganda yoki .unga kirilganda chiqadi.
vi: Chú giải công cụ cung cấp nhãn văn bản làm rõ chức năng của nút hoặc hành động khác trong giao diện người dùng. Chú giải công cụ hiển thị văn bản cung cấp thông tin khi người dùng di chuột qua, trỏ vào hoặc nhấn và giữ một phần tử.
zh_hk: 附帶文字標籤的提示，用於說明按鈕功能或其他使用者介面的操作。提示會在使用者將滑鼠游標移至、對準或長按元素時顯示說明文字。
zu: Amathulithiphu anikeza amalebula ombhalo asiza ukuchaza ukusebenza kwenkinobho noma esinye isenzo sokusetshenziswa kubonwa. Amathulithiphu abonisa umbhalo onolwazi uma abasebenzisa bahambisa ngaphezulu, bagxila, noma bacindezela isikhathi eside ku-elementi.

# demoTooltipInstructions
source: Long press or hover to display the tooltip.
af: Druk lank of hou om die nutswenk te wys.
am: የመሣሪያ ጥቆማን ለማሳየት ረዥም ይጫኑ ወይም ያንዣብቡ።
ar_eg: اضغط مع الاستمرار على العنصر أو مرّر مؤشر الماوس عليه لعرض التلميح.
as: টুলটিপ প্ৰদর্শন কৰিবলৈ দীঘলীয়াকৈ টিপা অথবা টিপি ধৰি থকা।
az: İpucunu göstərmək üçün basıb saxlayın və ya üzərində sürüşdürün.
be: Каб убачыць падказку, навядзіце курсор на элемент або ўтрымлівайце яго націснутым.
bn: টুলটিপ দেখানোর জন্য অনেকক্ষণ প্রেস করে ধরে রাখুন বা স্ক্রিনের উপরে যান।
bs: Koristite dugi pritisak ili postavite kursor iznad elementa za prikazivanje skočnog opisa.
ca: Mantén premut o passa el cursor per sobre d'un element perquè es mostri la descripció emergent.
da: Lav et langt tryk eller hold markøren over et element for at se værktøjstippet.
es_ar: Coloca el cursor sobre un elemento o mantenlo presionado para que se muestre la información sobre la herramienta.
et: Pika vajutuse või kursori hõljutamise korral kuvatakse kohtspikker.
eu: Aholkua bistaratzeko, sakatu luze edo pasatu gainetik.
fa: برای نمایش نکته‌ابزار، فشار طولانی دهید یا نشانگر را روی آن نگه دارید.
fil: Pumindot nang matagal o mag-hover para maipakita ang tooltip.
fr_ca: Faites un appui prolongé ou passez le curseur de la souris sur l'élément pour afficher l'infobulle.
gl: Para mostrar o cadro de información, mantén premido o elemento ou pasa por enriba del
gu: ટૂલટિપ બતાવવા માટે થોડીવાર દબાવી રાખો અથવા તેના પર લઈ જાઓ.
he: יש ללחוץ לחיצה ארוכה או להעביר את העכבר מעל הפריט כדי להציג את ההסבר הקצר.
hi: टूलटिप देखने के लिए आइटम को दबाकर रखें या उस पर माउस घुमाएं.
hu: Az elemleírás megjelenítéséhez nyomja hosszan a kapcsolódó elemet, vagy vigye rá az egeret.
hy: Երկար սեղմեք կամ նշորդն անցկացրեք՝ հուշումները ցուցադրելու համար։
id: Tekan lama atau arahkan kursor untuk menampilkan tooltip.
it: Premi a lungo un elemento o posiziona sopra il puntatore per visualizzare la descrizione comando.
ja: 長押しするかカーソルを合わせると、ツールチップが表示されます。
ka: ხანგრძლივად დააჭირეთ ან გადაატარეთ მინიშნების საჩვენებლად.
km: ចុច​ឱ្យយូរ ឬ​ដាក់ព្រួញ ដើម្បី​បង្ហាញ​កំណត់​ពន្យល់​។
kn: ಟೂಲ್‌ಟಿಪ್ ಅನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲು ದೀರ್ಘಕಾಲ ಒತ್ತಿಹಿಡಿಯಿರಿ ಅಥವಾ ಹೋವರ್ ಮಾಡಿ.
ko: 도움말을 표시하려면 길게 누르거나 마우스를 가져가세요.
ky: Калкып чыгуучу кеңешти көрүү үчүн коё бербей басып туруңуз же чычканды элементтин үстүнө алып келиңиз.
lo: ກົດຄ້າງໄວ້ ຫຼື ເລື່ອນໄປໃສ່ເພື່ອສະແດງຄຳແນະນຳ.
lt: Ilgai paspauskite arba užveskite pelės žymeklį, kad būtų pateiktas patarimas.
lv: Lai parādītu rīka padomu, nospiediet elementu un turiet to vai virziet virs tā kursoru.
mk: Долго притиснете или наместете го глушецот над елемент за да се прикаже совет за алатката.
ml: ടൂൾടിപ്പ് പ്രദർശിപ്പിക്കാൻ ദീർഘനേരം അമർത്തുക അല്ലെങ്കിൽ ഹോവർ ചെയ്യുക.
mn: Зөвлөмжийг үзүүлэхийн тулд удаан дарах эсвэл зөөнө үү.
mr: टूलटिप डिस्प्ले करण्यासाठी प्रेस करून ठेवा किंवा फिरवा.
ms: Tekan lama atau tuding untuk memaparkan tip alat.
my: အကြံပြုချက်ပြ ပေါ့အပ် ဝင်းဒိုးကို ဖော်ပြရန် ကြာရှည်စွာ ဖိပါ သို့မဟုတ် အပေါ်မှနေ၍ အုပ်လိုက်ပါ။
nb: Trykk lenge på eller hold markøren over for å vise verktøytipset.
ne: उपकरण वर्णन देखाउन केही बेरसम्म थिच्नुहोस् वा होभर गर्नुहोस्।
pa: ਟੂਲ-ਟਿੱਪ ਨੂੰ ਦੇਖਣ ਲਈ ਦਬਾਈ ਰੱਖੋ ਜਾਂ ਸਕ੍ਰੀਨ ਉੱਤੇ ਕਰਸਰ ਘੁੰਮਾਓ।
pl: Aby wyświetlić etykietkę, najedź na element lub go przytrzymaj.
pt: Toque no elemento e o pressione ou passe o cursor sobre ele para exibir a dica.
pt_pt: Mantenha premido ou coloque o cursor do rato sobre a sugestão.
ro: Apăsați lung sau plasați cursorul pentru a afișa balonul explicativ.
ru: Чтобы увидеть подсказку, наведите указатель на элемент или нажмите на него и удерживайте.
si: මෙවලම් ඉඟිය පෙන්වීමට දිගු ඔබන්න නැතහොත් උඩින් තබා ගන්න.
sk: Popis zobrazíte dlhým stlačením alebo umiestnením kurzora myši.
sq: Kryej një shtypje të gjatë ose qëndrim pezull për të shfaqur këshillën për veglën.
sr: Дуго притискајте елемент или пређите курсором преко њега да би се приказало објашњење.
sr_latn: Dugo pritiskajte element ili pređite kursorom preko njega da bi se prikazalo objašnjenje.
sv: Tryck länge på eller håll muspekaren över elementet för att visa beskrivningen.
te: ఉపకరణ చిట్కాను ప్రదర్శించడానికి ఎక్కువసేపు నొక్కి ఉంచండి లేదా కర్సర్ ఉంచండి.
th: กดค้างหรือวางเมาส์เหนือองค์ประกอบเพื่อแสดงเคล็ดลับเครื่องมือ
tr: İpucunu görüntülemek için uzun basın veya fareyle üzerine gelin.
uk: Щоб підказка з'явилася, утримуйте елемент або наведіть на нього курсор.
ur: ٹول ٹپ کو ڈسپلے کرنے کے لیے لانگ پریس کریں یا اس پر کرسر گھمائیں۔
uz: Qalqib chiquvchi maslahat oynasi chiqishi uchun bosib turing yoki kursorni ustiga olib boring.
vi: Nhấn và giữ hoặc di chuột để hiển thị chú giải công cụ.
zh_hk: 長按或將滑鼠游標懸停時便會顯示提示。
zu: Cindezela isikhathi eside noma hambisa ngaphezulu ukuze ubonise ithulithiphu.

# placeChennai
source: Chennai
am: ቸናይ
ar_eg: تشيناي
as: চেন্নাই
az: Çennay
be: Чэнаі
bn: চেন্নাই
fa: چنی
gu: ચેન્નઈ
he: צ'נאי
hi: चेन्नई
hu: Csennai
hy: Չեննայ
ja: チェンナイ
ka: ჩენაი
km: ជិនណៃ
kn: ಚೆನ್ನೈ
ko: 첸나이
ky: Ченнаи
lo: ເຈນໄນ
lt: Čenajus
lv: Čennai
mk: Ченај
ml: ചെന്നൈ
mn: Ченнай
mr: चेन्नई
ne: चेन्नई
pa: ਚੇਨਈ
pl: Madras
ru: Ченнай
si: චෙන්නායි
sq: Çenai
sr: Ченај
sr_latn: Čenaj
te: చెన్నై
th: เจนไน
uk: Ченнаї
ur: چنئی
uz: Chennay
zh_hk: 欽奈
zu: E-Chennai

# demoMenuChecked
source: Checked: {value}
af: Gemerk: {value}
am: ምልክት ተደርጎበታል፦ {value}
ar_eg: القيمة التي تم وضع علامة عليها: {value}
as: এইটো পৰীক্ষা কৰা হৈছে: {value}
az: İşarələnib: {value}
be: Пазначана: {value}
bn: চেক করা হয়েছে: {value}
bs: Označeno: {value}
ca: Marcat: {value}
da: Markeret: {value}
es_ar: Marcado: {value}
et: Kontrollitud: {value}
eu: Markatuta: {value}
fa: علامت‌گذاری‌شده: {value}
fil: Nasuri: {value}
fr_ca: Élément coché : {value}
gl: Marcado: {value}
gu: ચેક કર્યું: {value}
he: הערך שסומן: {value}
hi: सही का निशान लगाकर इसे चुना गया: {value}
hu: Bejelölve: {value}
hy: Նշված է՝ {value}
id: Dicentang: {value}
it: Valore selezionato: {value}
ja: オン: {value}
ka: მონიშნულია: {value}
km: បាន​ធីក​៖ {value}
kn: ಪರಿಶೀಲಿಸಿರುವುದು: {value}
ko: 선택된 값: {value}
ky: Белгиленди: {value}
lo: ເລືອກແລ້ວ: {value}
lt: Pažymėta: {value}
lv: Pārbaudītā vērtība: {value}
mk: Штиклирано: {value}
ml: ചെക്ക് ചെയ്തു: {value}
mn: Шалгасан: {value}
mr: तपासलेले: {value}
ms: Ditandai: {value}
my: အမှန်ခြစ်ထားသည်- {value}
nb: Merket av: {value}
ne: चिन्हमार्फत चयन गरिएको: {value}
pa: ਨਿਸ਼ਾਨ ਲਗਾਇਆ: {value}
pl: Zaznaczono: {value}
pt: Marcado: {value}
pt_pt: Selecionado: {value}
ro: Bifat: {value}
ru: Отмеченное значение: {value}
si: පරීක්ෂා කළ: {value}
sk: Začiarknuté: {value}
sq: Shënuar: {value}
sr: Означено: {value}
sr_latn: Označeno: {value}
sv: Markerades: {value}
te: ఎంచుకున్నది: {value}
th: เลือกไว้: {value}
tr: İşaretlendi: {value}
uk: Вибрано: {value}
ur: چیک کردہ: {value}
uz: Belgilangan qiymat: {value}
vi: Đã kiểm tra: {value}
zh_hk: 已勾選：{value}
zu: Ihloliwe: {value}

# placeChettinad
source: Chettinad
am: የቼቲናድ
ar_eg: تشيتيناد
as: চেটিনাদ
az: Çettinad
be: Чэцінад
bn: চেট্টিনাড
bs: Chettinada
fa: چتیناد
gu: ચેટ્ટીનાડ
he: צ'טינאד
hi: चेट्टीनाड
hy: Չետինադ
ja: チェティナード
ka: ჩეტინადი
km: ចិត្តធីណាដ
kn: ಚೆಟ್ಟಿನಾಡ್
ko: 체티나드
ky: Четтинад
lo: ເຊຕິນາດ
lt: Četinadas
lv: Četinada
mk: Четинад
ml: ചെട്ടിനാട്
mn: Четтинад
mr: चेट्टीनाड
ne: चेट्टिनाड
pa: ਚੇਟੀਨਾਡ
ru: Четтинад
si: චෙට්ටිනාඩ්
sq: Çetinad
sr: Четинад
sr_latn: Četinad
te: చెట్టినాడ్
th: เชตินาถ
uk: Четтінад
ur: چیتیناد
zh_hk: 切蒂納德
zu: E-Chettinad
