Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# cardsDemoTravelDestinationDescription2
source: Silk Spinners
af: Syspinners
am: ሐር ፈታዮች
ar_eg: عمال غزل الحرير
as: ৰেচম স্পীনাৰসকল
az: İpəkəyirənlər
be: Шоўкапрадзільшчыкі
bn: রেশম তন্তুবায়
bs: Prelci svile
ca: Filadors de seda
da: Silkespindere
es_ar: Hilanderos de seda
et: Siidiketrajad
eu: Zeta-iruleak
fa: ابریشم‌تاب
fil: Mga Silk Spinner
fr_ca: Fileurs de soie
gl: Rodas de fiar seda
gu: સિલ્ક સ્પિનર
he: טוויית משי
hi: सिल्क बनाने वाले
hu: Selyemkészítők
hy: Մետաքսագործներ
id: Pemintal Sutra
it: Setaioli
ja: 絹糸紡績
ka: აბრეშუმის დამრთველები
km: សត្វរាយ​សំណាញ់​សូត្រ
kn: ಸಿಲ್ಕ್ ಸ್ಪಿನ್ನರ್ಸ್
ko: 비단 방적공
ky: Жибек жасоочулар
lo: ເຄື່ອງປັ່ນໄໝ
lt: Šilko verpėjai
lv: Zīda tinēji
mk: Предачи на свила
ml: പട്ട് നൂൽക്കുന്നവർ
mn: Торго нэхэгчид
mr: सिल्क स्पिनर
ms: Pemintal Sutera
my: ပိုးချည်ငင်သည့် ရစ်ဘီးများ
nb: Silkespinnere
ne: रेशमको सूत कात्ने कल
pa: ਰੇਸ਼ਮ ਦੇ ਕਾਰੀਗਰ
pl: Przędzarze jedwabiu
pt: Fiandeiros de seda
pt_pt: Fiandeiros de seda
ro: Țesători de mătase
ru: Прядильщики шелка
si: සේද නූල් කටින්නන්
sk: Pradenie hodvábu
sq: Prodhues mëndafshi
sr: Произвођачи свиле
sr_latn: Proizvođači svile
sv: Silkesspinnare
te: సిల్క్ స్పిన్నర్‌లు
th: เครื่องปั่นไหม
tr: İpek Üreticileri
uk: Виробники шовку
ur: ریشم سپنّرز
uz: Ipak yigiruvchilar
vi: Xa quay tơ
zh_hk: 紡絲機
zu: Amaspina esilika

# bannerDemoText
source: Your password was updated on your other device. Please sign in again.
af: Jou wagwoord is op jou ander toestel opgedateer. Meld asseblief weer aan.
am: የይለፍ ቃልዎ በሌላኛው መሣሪያዎ ላይ ተዘምኗል። እባክዎ እንደገና ይግቡ።
ar_eg: تم تعديل كلمة المرور على جهاز آخر. يُرجى تسجيل الدخول مرة أخرى.
as: আপোনাৰ পাছৱৰ্ডটো আপোনাৰ আনটো ডিভাইচত আপডে’ট কৰা হৈছে। অনুগ্ৰহ কৰি পুনৰ ছাইন ইন কৰক।
az: Parolunuz başqa cihazınızda güncəllənib. Yenidən daxil olun.
be: Ваш пароль абноўлены на іншай прыладзе. Увайдзіце яшчэ раз.
bn: অন্যান্য ডিভাইসে আপনার পাসওয়ার্ড আপডেট করা হয়েছে। আবার সাইন-ইন করুন।
bs: Vaša lozinka je ažurirana na drugom uređaju. Prijavite se ponovo.
ca: La contrasenya s'ha actualitzat al teu altre dispositiu. Torna a iniciar la sessió.
da: Din adgangskode blev opdateret på din anden enhed. Log ind igen.
es_ar: Se actualizó la contraseña en tu otro dispositivo. Vuelve a acceder a la cuenta.
et: Parooli värskendati teie muus seadmes. Logige uuesti sisse.
eu: Beste gailuan eguneratu da pasahitza. Hasi saioa berriro.
fa: گذرواژه‌تان در دستگاه دیگر به‌روزرسانی شد. لطفاً دوباره به سیستم وارد شوید.
fil: Na-update ang iyong password sa iba mo pang device. Mag-sign in ulit.
fr_ca: Votre mot de passe a été mis à jour sur votre autre appareil. Veuillez vous reconnecter.
gl: Actualizouse o teu contrasinal no teu outro dispositivo. Inicia sesión de novo.
gu: તમારા અન્ય ડિવાઇસ પર તમારો પાસવર્ડ અપડેટ કર્યો હતો. કૃપા કરીને ફરી સાઇન ઇન કરો.
he: הסיסמה שלך עודכנה במכשיר הנוסף שלך. יש להתחבר שוב.
hi: पासवर्ड आपके दूसरे डिवाइस पर अपडेट किया गया था. कृपया फिर से साइन इन करें.
hu: Jelszava frissítve lett a másik eszközén. Kérjük, jelentkezzen be újra.
hy: Ձեր գաղտնաբառը թարմացվել է ձեր մյուս սարքում։ Նորից մուտք գործեք հաշիվ։
id: Sandi Anda diperbarui di perangkat lain. Harap login lagi.
it: La tua password è stata aggiornata sull'altro dispositivo. Accedi nuovamente.
ja: お使いの他のデバイスでパスワードが更新されました。もう一度ログインしてください。
ka: თქვენი პაროლი განახლდა თქვენს სხვა მოწყობილობაზე. გთხოვთ, შეხვიდეთ ხელახლა.
km: ពាក្យសម្ងាត់​របស់អ្នក​ត្រូវបានធ្វើ​បច្ចុប្បន្នភាព​នៅលើឧបករណ៍​ផ្សេងទៀតរបស់អ្នក។ សូម​ចូល​ម្ដងទៀត​។
kn: ನಿಮ್ಮ ಇತರ ಸಾಧನದಲ್ಲಿ ನಿಮ್ಮ ಪಾಸ್‌ವರ್ಡ್ ಅನ್ನು ಅಪ್‌ಡೇಟ್‌ ಮಾಡಲಾಗಿದೆ. ಪುನಃ ಸೈನ್ ಇನ್ ಮಾಡಿ.
ko: 다른 기기에서 비밀번호가 업데이트되었습니다. 다시 로그인해 주세요.
ky: Сырсөзүңүз башка түзмөктө жаңырган. Кайра кириңиз.
lo: ລະຫັດຜ່ານຂອງທ່ານຖືກອັບເດດຢູ່ອຸປະກອນອື່ນແລ້ວ. ກະລຸນາເຂົ້າສູ່ລະບົບອີກເທື່ອໜຶ່ງ.
lt: Jūsų slaptažodis buvo atnaujintas kitame įrenginyje. Prisijunkite dar kartą.
lv: Jūsu parole tika atjaunināta citā jūsu ierīcē. Lūdzu, pierakstieties vēlreiz.
mk: Лозинката беше ажурирана на другиот уред. Најавете се повторно.
ml: നിങ്ങളുടെ പാസ്‌വേഡ് നിങ്ങളുടെ മറ്റ് ഉപകരണത്തിൽ അപ്‌ഡേറ്റ് ചെയ്‌തു. ദയവായി വീണ്ടും സൈൻ ഇൻ ചെയ്യുക.
mn: Таны нууц үгийг таны өөр төхөөрөмж дээр шинэчилсэн байна. Дахин нэвтэрнэ үү.
mr: तुमचा पासवर्ड तुमच्या इतर डिव्हाइसवर अपडेट केला गेला आहे. कृपया पुन्हा साइन इन करा.
ms: Kata laluan anda telah dikemas kini pada peranti anda yang lain. Sila log masuk sekali lagi.
my: သင်၏အခြားစက်ပေါ်တွင် စကားဝှက်ကို အပ်ဒိတ်လုပ်ထားသည်။ ကျေးဇူးပြု၍ ထပ်မံ လက်မှတ်ထိုးဝင်ပါ။
nb: Passordet ditt er oppdatert på den andre enheten din. Logg på igjen.
ne: तपाईंको अर्को डिभाइसमा तपाईंको पासवर्ड अद्यावधिक गरिएको थियो। कृपया फेरि साइन इन गर्नुहोस्।
pa: ਤੁਹਾਡਾ ਪਾਸਵਰਡ ਤੁਹਾਡੇ ਦੂਜੇ ਡੀਵਾਈਸ 'ਤੇ ਅੱਪਡੇਟ ਕੀਤਾ ਗਿਆ ਸੀ। ਕਿਰਪਾ ਕਰਕੇ ਦੁਬਾਰਾ ਸਾਈਨ-ਇਨ ਕਰੋ।
pl: Hasło zostało zaktualizowane na drugim urządzeniu. Zaloguj się ponownie.
pt: A senha foi atualizada no seu outro dispositivo. Faça login novamente.
pt_pt: A sua palavra-passe foi atualizada no seu outro dispositivo. Inicie sessão novamente.
ro: Parola a fost actualizată pe celălalt dispozitiv. Conectați-vă din nou.
ru: Пароль был изменен на другом устройстве. Повторите вход.
si: ඔබගේ මුරපදය ඔබගේ අනෙක් උපාංගයේ යාවත්කාලීන කරන ලදි. කරුණාකර නැවත පුරන්න.
sk: Vaše heslo bolo aktualizované v druhom zariadení. Prihláste sa znova.
sq: Fjalëkalimi yt është përditësuar në pajisjen tënde tjetër. Identifikohu përsëri.
sr: Лозинка је ажурирана на другом уређају. Пријавите се поново.
sr_latn: Lozinka je ažurirana na drugom uređaju. Prijavite se ponovo.
sv: Lösenordet har uppdaterats på den andra enheten. Logga in igen.
te: మీకు చెందిన మరొక పరికరంలో మీ పాస్‌వర్డ్ అప్‌డేట్ చేయబడింది. దయచేసి మళ్లీ సైన్ ఇన్ చేయండి.
th: มีการอัปเดตรหัสผ่านในอุปกรณ์เครื่องอื่น โปรดลงชื่อเข้าใช้อีกครั้ง
tr: Şifreniz diğer cihazınızda güncellendi. Lütfen tekrar oturum açın.
uk: Пароль було оновлено на іншому пристрої. Увійдіть знову.
ur: آپ کا پاس ورڈ آپ کے دوسرے آلہ پر اپ ڈیٹ کیا گیا تھا۔ براہ کرم دوبارہ سائن ان کریں۔
uz: Boshqa qurilmangizda parolingiz yangilandi. Tizimga qaytadan kiring.
vi: Mật khẩu của bạn đã được cập nhật trên thiết bị kia. Vui lòng đăng nhập lại.
zh_hk: 您的密碼已在其他裝置上更新。請再次登入。
zu: Iphasiwedi yakho ibuyekezwe kwenye yamadivayisi akho. Sicela uphinde ungene ngemvume.

# cardsDemoTravelDestinationLocation2
source: Sivaganga, Tamil Nadu
am: ሲቫጋንጋ፣ ታሚል ናዱ
ar_eg: سيفاغنغا، تاميل نادو
as: শিৱগংগা, তামিলনাডু
az: Sivaqanqa, Tamil Nadu
be: Шываганга (Тамілнад)
bn: শিবগঙ্গা, তামিলনাড়ু
fa: سیواگانگا، تامیل نادو
gu: શિવાગંગા, તમિળનાડુ
he: סיוואגאנג'ה, טמיל נאדו
hi: शिवगंगा, तमिलनाडु
hu: Sivaganga, Tamilnádu
hy: Շիվագանգա, Թամիլ Նադու
ja: シヴァガンガイ、タミルナードゥ州
ka: სივაგანგა, ტამილნადუ
km: ស៊ីវវ៉ាហ្កានហ្កា​នៅរដ្ឋ​តាមីល​ណាឌូ
kn: ಶಿವಗಂಗ, ತಮಿಳುನಾಡು
ko: 타밀 나두 시바간가
ky: Сиваганга, Тамилнад
lo: ຊິວາກັນກາ, ທະມິນນາດູ
lt: Sivaganga, Tamilnadas
lv: Sivaganga, Tamilnāda
mk: Сиваганга, Тамил Наду
ml: ശിവഗംഗ, തമിഴ്‌നാട്
mn: Тамилнаду муж, Шиваганга хот
mr: शिवगंगा, तामिळनाडू
my: ရှီဗာဂန်ဂါ၊ တမီးလ်နာဒူ
ne: शिभगङ्गा, तामिल नाडु
pa: ਸ਼ਿਵ ਗੰਗਾ, ਤਮਿਲ ਨਾਡੂ
pt_pt: Sivaganga, Tâmil Nadu
ru: Шиваганга, штат Тамилнад
si: සිවගංගා, තමිල්නාඩු
sr: Сиваганга, Тамил Наду
sv: Sivaganga i Tamil Nadu
te: శివగంగ, తమిళనాడు
th: เมือง Sivaganga รัฐทมิฬนาฑู
uk: Шиваганга (Тамілнад)
ur: سیوا گنگا، تمل ناڈو
zh_hk: 泰米爾納德邦西瓦岡格阿
zu: E-Sivaganga, Tamil Nadu

# cardsDemoTravelDestinationTitle3
source: Brihadisvara Temple
af: Brihadisvara-tempel
am: ብሪሃዲስቫራ ቤተ-መቅደስ
ar_eg: معبد بريهاديسفارا
as: বৃহদেশ্বৰ মন্দিৰ
az: Brihadisvara Məbədi
be: Храм Брахадзісвара
bn: বৃহদীশ্বর মন্দির
bs: Hram Brihadisvara
ca: Temple de Brihadisvara
da: Brihadisvaratempel
es_ar: Templo Brihadisvara
et: Brihadisvara tempel
eu: Brihadisvara tenplua
fa: معبد بریهادیسوارار
fr_ca: Temple de Brihadisvara
gl: Templo de Brihadisvara
gu: બૃહદેશ્વર મંદિર
he: מקדש בריהדשווארה
hi: बृहदेश्वर मंदिर
hu: Brihadesvara-templom
hy: Բրիհադիշվարա տաճար
id: Kuil Brihadisvara
it: Tempio di Brihadishvara
ja: ブリハディーシュヴァラ寺院
ka: ბრიჰადეშვარას ტაძარი
km: ប្រសាទ​ប្រីហាឌីស្វារ៉ា
kn: ಬೃಹದೀಶ್ವರ ದೇವಸ್ಥಾನ
ko: 브리하디스와라 사원
ky: Брахадисвара сыйынуучу жайы
lo: ວັດບໍລິຫາດີສະວາຣາ
lt: Brihadisvaros šventykla
lv: Brihadisvaras templis
mk: Храмот Брихадисвара
ml: ബൃഹദീശ്വര ക്ഷേത്രം
mn: Брихадисвара сүм
mr: बृहदेश्वर मंदिर
ms: Kuil Brihadisvara
my: ဗရီဟာဒစ်ဗာရာ ဘုရားကျောင်း
nb: Brihadisjvara-tempelet
ne: बृहदेश्वर मन्दिर
pa: ਬ੍ਰਹਿਦੀਸ਼ਵਰ ਮੰਦਰ
pl: Świątynia Brihadisvara
pt: Templo de Brihadisvara
pt_pt: Templo Brihadisvara
ro: Templul Brihadisvara
ru: Храм Брахадисвара
si: බ්‍රහඩිස්වර දේවාලය
sk: Chrám Brihadisvara Temple
sq: Tempulli Brihadisvara
sr: Храм Брихадисвара
sr_latn: Hram Brihadisvara
sv: Brihadisvaratemplet
te: బృహదీశ్వర ఆలయం
th: วัดพฤหธิศวร
tr: Brihadisvara Tapınağı
uk: Храм Брахідеешварар
ur: بریہڈیسوارا مندر
uz: Brihadisvaradagi ibodatxona
vi: Đền Brihadisvara
zh_hk: 布里哈迪希瓦拉神廟
zu: Ithempeli lase-Brihadisvara

# cardsDemoTravelDestinationDescription3
source: Temples
af: Tempels
am: ቤተ-መቅደሶች
ar_eg: المعابد
as: মন্দিৰসমূহ
az: Məbədlər
be: Храмы
bn: মন্দির
bs: Hramovi
da: Templer
es_ar: Templos
et: Templid
eu: Tenpluak
fa: معابد
fil: Mga Templo
gl: Templos
gu: મંદિરો
he: מקדשים
hi: मंदिर
hu: Szentélyek
hy: Տաճարներ
id: Kuil
it: Templi
ja: 寺院
ka: ტაძრები
km: ប្រាសាទ
kn: ದೇವಾಲಯಗಳು
ko: 사원
ky: Сыйынуучу жайлар
lo: ວັດ
lt: Šventyklos
lv: Tempļi
mk: Храмови
ml: ക്ഷേത്രങ്ങൾ
mn: Сүмүүд
mr: मंदिरे
ms: Kuil
my: ဘုရားကျောင်းများ
nb: Templer
ne: मन्दिरहरू
pa: ਮੰਦਰ
pl: Świątynie
pt: Templos
pt_pt: Templos
ro: Temple
ru: Храмы
si: දේවාල
sk: Chrámy
sq: Tempuj
sr: Храмови
sr_latn: Hramovi
sv: Tempel
te: గుళ్లు
th: วัด
tr: Tapınaklar
uk: Храми
ur: مندرات
uz: Ibodatxonalar
vi: Đền
zh_hk: 寺廟
zu: Amathempeli

# demoBannerTitle
source: Banner
af: Banier
am: ሰንደቅ
ar_eg: البانر
as: বেনাৰ
be: Банер
bn: ব্যানার
bs: Baner
ca: Bàner
et: Bänner
eu: Banda
fa: بنر
fr_ca: Bannière
gl: Báner
gu: બૅનર
he: באנר
hi: बैनर
hu: Üzenetszalag
hy: Ազդերիզ
ja: バナー
ka: ბანერი
km: ផ្ទាំងផ្សាយពាណិជ្ជកម្ម
kn: ಬ್ಯಾನರ್
ko: 배너
ky: Көрнөк-жарнак
lo: ແບນເນີ
lt: Reklamjuostė
lv: Josla
mk: Рекламен натпис
ml: ബാനർ
mn: Баннер
mr: बॅनर
ms: Sepanduk
my: နဖူးစည်း
ne: ब्यानर
pa: ਬੈਨਰ
pl: Baner
pt_pt: Faixa
ru: Баннер
si: බැනරය
sq: Banderola
sr: Банер
sr_latn: Baner
te: బ్యానర్
th: แบนเนอร์
uk: Банер
ur: بینر
vi: Biểu ngữ
zh_hk: 橫額
zu: Isibhengezo

# demoBannerSubtitle
source: Displaying a banner within a list
af: Wys 'n banier binne 'n lys
am: በአንድ ዝርዝር ውስጥ ሰንደቅን ማሳየት
ar_eg: عرض بانر داخل قائمة
as: এখন তালিকাৰ ভিতৰত এখন বেনাৰ প্ৰদৰ্শিত কৰা
az: Bannerin siyahıda göstərilməsi
be: Паказ банера ў спісе
bn: একটি তালির মধ্যে ব্যানার দেখানো হচ্ছে
bs: Prikazivanje banera na listi
ca: Es mostra un bàner en una llista
da: Viser et banner på en liste
es_ar: Mostrando un banner en una lista
et: Kuvatud on loendis olev bänner
eu: Zerrenda batean banda bat bistaratzea
fa: نمایش برنما در فهرست
fil: Nagpapakita ng banner sa isang listahan
fr_ca: Affichage d'une bannière dans une liste
gl: Visualización dun báner nunha lista
gu: સૂચિમાં બૅનર બતાવવું
he: הצגת באנר בתוך רשימה
hi: किसी सूची में बैनर दिखाना
hu: Üzenetszalag megjelenítése listában
hy: Ազդերիզի ցուցադրում ցանկում
id: Menampilkan banner dalam daftar
it: Viene visualizzato un banner in un elenco
ja: リスト内にバナーを表示します
ka: ბანერის ჩვენება სიაში
km: កំពុងបង្ហាញ​ផ្ទាំងផ្សាយពាណិជ្ជកម្ម​នៅក្នុងបញ្ជី
kn: ಪಟ್ಟಿಯಲ್ಲಿ ಬ್ಯಾನರ್‌ಗಳನ್ನು ತೋರಿಸಲಾಗುತ್ತಿದೆ
ko: 목록 안에 배너 표시됨
ky: Тизмедеги көрнөк-жарнак көрсөтүлүүдө
lo: ກຳລັງສະແດງແບນເນີພາຍໃນລາຍຊື່
lt: Pateikiama reklamjuostė sąraše
lv: Joslas rādīšana sarakstā
mk: Се прикажува рекламен натпис во список
ml: ലിസ്റ്റിനുള്ളിലെ ബാനർ പ്രദർശിപ്പിക്കുന്നു
mn: Жагсаалтын доторх баннерыг үзүүлэх
mr: सूचीमध्ये एक बॅनर प्रदर्शित करत आहे
ms: Memaparkan sepanduk dalam senarai
my: စာရင်းအတွင်း နဖူးစည်းတစ်ခု ပြသခြင်း
nb: Viser et banner i en liste
ne: कुनै सूचीअन्तर्गत ब्यानर देखाउँदै
pa: ਸੂਚੀ ਵਿੱਚ ਬੈਨਰ ਦਿਖਾਉਣਾ
pl: Wyświetlanie banera na liście
pt: Como mostrar um banner em uma lista
pt_pt: Apresentar uma faixa numa lista
ro: Afișează un banner într-o listă
ru: Показ баннера в списке
si: ලැයිස්තුවක් තුළ බැනරයක් පෙන්වීම
sk: Zobrazovanie bannera v zozname
sq: Shfaqja e një banderole brenda një liste
sr: Приказује банер у оквиру листе
sr_latn: Prikazuje baner u okviru liste
sv: Visar en banner i en lista
te: లిస్ట్‌లోని బ్యానర్‌ను ప్రదర్శిస్తోంది
th: กำลังแสดงแบนเนอร์ภายในรายการ
tr: Liste içinde banner görüntüleme
uk: Показ банера в списку
ur: فہرست کے اندر بینر ڈسپلے کرنا
uz: Banner roʻyxat ichida chiqmoqda
vi: Hiển thị một biểu ngữ trong danh sách
zh_hk: 在清單中顯示橫額
zu: Ukubonisa isibhengezo ngaphakathi kohlu
