Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoMenuAnItemWithAChecklistMenu
source: An item with a checklist menu
af: 'n Item met 'n kontrolelyskieslys
am: ንጥል ከማረጋገጫ ምናሌ ጋር
ar_eg: عنصر يفتح قائمة تحقّق
as: এখন চেকলিষ্ট মেনুৰ সৈতে এটা বস্তু
az: Yoxlama siyahısı menyusu ilə element
be: Элемент з меню з кантрольным спісам
bn: চেকলিস্ট মেনু সহ একটি আইটেম
bs: Stavka s menijem s kontrolnim listama
ca: Un element amb un menú amb llista de comprovació
da: Et element med en tjeklistemenu
es_ar: Un elemento con un menú de lista de tareas
et: Kontroll-loendi menüüga üksus
eu: Egiaztapen-zerrendaren menu bat duen aukera bat
fa: مورد با منوی بازبینه‌ای
fil: Isang item na may checklist na menu
fr_ca: Un élément avec menu de liste de contrôle
gl: Un elemento cun menú con lista de comprobación
gu: ચેકલિસ્ટ મેનૂવાળી આઇટમ
he: פריט עם תפריט של רשימת משימות
hi: चेकलिस्ट मेन्यू वाला आइटम
hu: Elem ellenőrző listás menüvel
hy: Ստուգաթերթ պարունակող ընտրացանկով տարր
id: Item dengan menu checklist
it: Un elemento con un menu con elenco di controllo
ja: チェックリスト メニュー付きの項目
ka: ერთეული საკონტროლო სიის მენიუთი
km: ធាតុ​ដែលមាន​ម៉ឺនុយ​បញ្ជី​ត្រួតពិនិត្យ
kn: ಪರಿಶೀಲನಾಪಟ್ಟಿ ಮೆನು ಹೊಂದಿರುವ ಐಟಂ
ko: 체크리스트 메뉴가 포함된 항목
ky: Тизме менюсундагы элемент
lo: ລາຍການທີ່ມີເມນູລາຍການກວດສອບ
lt: Kontrolinio sąrašo meniu elementas
lv: Vienums ar kontrolsaraksta izvēlni
mk: Ставка со мени со список за проверка
ml: ചെക്ക്‌ലിസ്റ്റ് മെനു ഉള്ള ഒരിനം
mn: Шалгах хуудасны цэстэй зүйл
mr: चेकलिस्ट मेनू असलेला एक आयटम
ms: Item dengan menu senarai semak
my: ဆောင်ရွက်ရန်စာရင်း မီနူးပါ အကြောင်းအရာ
nb: Et element med en sjekklistemeny
ne: चेकलिस्ट मेनुमा भएको वस्तु
pa: ਕਾਰਜ-ਸੂਚੀ ਮੀਨੂ ਨਾਲ ਇੱਕ ਆਈਟਮ
pl: Element z menu listy kontrolnej
pt: Um item com um menu de lista de verificação
pt_pt: Um item com um menu da lista de verificação
ro: Element cu meniu cu listă de verificare
ru: Объект, у которого есть меню с контрольным списком
si: පිරික්සුම් ලැයිස්තු මෙනුවක් සහිත අයිතමයක්
sk: Položka s ponukou kontrolného zoznamu
sq: Një artikulli me një meny me listë me zgjedhje
sr: Ставка са менијем са контролним листама
sr_latn: Stavka sa menijem sa kontrolnim listama
sv: Ett alternativ med en meny med checklista
te: చెక్‌లిస్ట్‌ మెనూ కలిగి ఉన్న అంశం
th: รายการพร้อมเมนูแบบรายการตรวจสอบ
tr: Liste menüsü olan öğe
uk: Елемент із меню у вигляді контрольного списку
ur: چیک لسٹ مینیو والا ایک آئٹم
uz: Nazoratli roʻyxatlari bor menyuli obyekt
vi: Mục có trình đơn danh sách kiểm tra
zh_hk: 設有檢查清單選單的項目
zu: Into enemenyu yohlu lokuhlola

# demoCupertinoActivityIndicatorTitle
source: Activity indicator
af: Aktiwiteitverklikker
am: የእንቅስቃሴ ጠቋሚ
ar_eg: مؤشر النشاط
as: কাৰ্যকলাপৰ সূচক
az: Fəaliyyət indikatoru
be: Індыкатар выканання
bn: অ্যাক্টিভিটি নির্দেশক
bs: Pokazatelj aktivnosti
ca: Indicador d'activitat
da: Aktivitetsindikator
es_ar: Indicador de actividad
et: Tegevuste näidik
eu: Jardueren adierazlea
fa: نشانگر فعالیت
fil: Indicator ng aktibidad
fr_ca: Indicateur d'activité
gl: Indicador de actividade
gu: પ્રવૃત્તિ સૂચક
he: אינדיקטור של פעילות
hi: गतिविधि दिखाने वाला संकेत
hu: Tevékenységjelző
hy: Գործողությունների ցուցիչ
id: Indikator aktivitas
it: Indicatore di attività
ja: アクティビティ インジケーター
ka: აქტივობის ინდიკატორი
km: សូចនាករ​សកម្មភាព
kn: ಚಟುವಟಿಕೆ ಸೂಚಕ
ko: 활동 표시기
ky: Аракет индикатору
lo: ຕົວຊີ້ບອກການເຄື່ອນໄຫວ
lt: Veiklos indikatorius
lv: Aktivitātes indikators
mk: Индикатор на активност
ml: ആക്റ്റിവിറ്റി ഇൻഡിക്കേറ്റർ
mn: Үйл ажиллагааны заалт
mr: अ‍ॅक्टिव्हिटी इंडिकेटर
ms: Penunjuk aktiviti
my: လုပ်ဆောင်ချက် အညွှန်း
nb: Aktivitetsindikator
ne: गतिविधि सूचक
pa: ਸਰਗਰਮੀ ਸੂਚਕ
pl: Wskaźnik aktywności
pt: Indicador de atividade
pt_pt: Indicador de atividade
ro: Indicator de activitate
ru: Индикатор выполнения
si: ක්‍රියාකාරකම් දර්ශකය
sk: Indikátor aktivity
sq: Treguesi i aktivitetit
sr: Индикатор активности
sr_latn: Indikator aktivnosti
sv: Aktivitetsindikator
te: యాక్టివిటీ సూచీ
th: สัญญาณบอกสถานะกิจกรรม
tr: Etkinlik göstergesi
uk: Індикатор активності
ur: سرگرمی انڈیکیٹر
uz: Faollik indikatori
vi: Chỉ báo hoạt động
zh_hk: 活動指標
zu: Isikhombi somsebenzi

# demoCupertinoActivityIndicatorSubtitle
source: iOS-style activity indicators
af: iOS-stylaktiwiteitaanwysers
am: iOS-ቅጥ እንቅስቃሴ ጠቋሚዎች
ar_eg: مؤشرات نشاط بنمط iOS
as: iOS-শৈলীৰ কাৰ্যকলাপৰ সূচকসমূহ
az: iOS üslublu fəaliyyət indikatorları
be: Індыкатары выканання ў стылі iOS
bn: iOS-স্টাইলে অ্যাক্টিভিটি নির্দেশক
bs: Pokazatelji aktivnosti u stilu iOS-a
ca: Indicador d'activitat d'estil iOS
da: Aktivitetsindikator i iOS-format
es_ar: Indicadores de actividad de estilo iOS
et: iOS-i stiilis tegevuste näidikud
eu: iOS estiloko jardueren adierazleak
fa: نشانگر فعالیت سبک iOS
fil: Mga iOS-style na indicator ng aktibidad
fr_ca: Indicateur d'activité de style iOS
gl: Indicador de actividade de tipo iOS
gu: iOS-શૈલીના પ્રવૃત્તિ સૂચકો
he: אינדיקטורים של פעילות בסגנון iOS
hi: iOS की शैली में गतिविधि दिखाने वाले इंडिकेटर
hu: iOS-stílusú tevékenységjelzők
hy: Գործողությունների՝ iOS-ի ոճով ցուցիչներ
id: Indikator aktivitas gaya iOS
it: Indicatori di attività in stile iOS
ja: iOS スタイルのアクティビティ インジケーター
ka: iOS-სტილის აქტივობის ინდიკატორი
km: សូចនាករសកម្មភាពរចនាប័ទ្ម iOS
kn: iOS-ಸ್ಟೈಲ್ ಚಟುವಟಿಕೆ ಸೂಚಕಗಳು
ko: iOS 스타일 활동 표시기
ky: iOS стилиндеги аракеттердин индикаторлору
lo: ຕົວຊີ້ບອກການເຄື່ອນໄຫວແບບ iOS
lt: „iOS“ stiliaus veiklos indikatoriai
lv: iOS stila aktivitātes indikators
mk: Индикатори на активност во iOS-стил
ml: iOS-ശെെലിയിലുള്ള ആക്റ്റിവിറ്റി ഇൻഡിക്കേറ്ററുകൾ
mn: iOS загварын үйл ажиллагааны заалт
mr: iOS शैलीतील अ‍ॅक्टिव्हिटी इंडिकेटर
ms: Penunjuk aktiviti gaya iOS
my: iOS ပုံစံ လုပ်ဆောင်ချက် အညွှန်း
nb: Aktivitetsindikatorer i iOS-stil
ne: iOS-शैलीका गतिविधि सूचकहरू
pa: iOS-ਸਟਾਈਲ ਸਰਗਰਮੀ ਸੂਚਕ
pl: Wskaźniki aktywności w stylu iOS
pt: Indicadores de atividade no estilo iOS
pt_pt: Indicadores de atividade ao estilo do iOS
ro: Indicatori de activitate în stil iOS
ru: Индикаторы выполнения в стиле iOS
si: iOS-විලාස ක්‍රියාකාරකම් දර්ශක
sk: Indikátory aktivity v štýle systému iOS
sq: Treguesit e aktivitetit në stilin e iOS
sr: Индикатори активности у iOS стилу
sr_latn: Indikatori aktivnosti u iOS stilu
sv: Aktivitetsindikatorer i iOS-stil
te: iOS-శైలి యాక్టివిటీ సూచీలు
th: สัญญาณบอกสถานะกิจกรรมแบบ iOS
tr: iOS stili işlem göstergeleri
uk: Індикатори активності в стилі iOS
ur: iOS طرز کے سرگرمی انڈیکیٹرز
uz: iOS uslubidagi faollik indikatori
vi: Chỉ báo hoạt động theo kiểu iOS
zh_hk: iOS 樣式活動指標
zu: isikhombisi somsebenzi wesitayela se-iOS

# demoCupertinoActivityIndicatorDescription
source: An iOS-style activity indicator that spins clockwise.
af: 'n iOS-stylaktiwiteitaanwyser wat kloksgewys draai.
am: በሰዓት አቅጣጫ የሚሽከረከር የiOS-ቅጥ እንቅስቃሴ ጠቋሚ
ar_eg: مؤشر نشاط بنمط iOS ويدور في اتجاه عقارب الساعة
as: এটা iOS-শৈলীৰ কাৰ্যকলাপৰ সূচক যি ঘড়ীৰ কাঁটাৰ দিশত ঘূৰে।
az: Saatın əqrəbi istiqamətinə fırlanan iOS üslublu fəaliyyət indikatoru.
be: Індыкатар выканання ў стылі iOS, які круціцца па гадзіннікавай стрэлцы.
bn: একটি iOS-স্টাইলে অ্যাক্টিভিটি নির্দেশক যেটি ঘড়ির কাঁটার দিকে ঘোরে।
bs: Pokazatelj aktivnosti u stilu iOS-a koji se okreće u smjeru kretanja kazaljke na satu.
ca: Indicador d'activitat d'estil iOS que gira en sentit horari.
da: En aktivitetsindikator i iOS-format, der drejer med uret.
es_ar: Corresponde a un indicador de actividad de estilo iOS que gira en el sentido de las manecillas del reloj.
et: iOS-i stiilis päripäeva liikuv tegevuste näidik.
eu: iOS estiloko jardueren adierazle bat, eskuinetara bira egiten duena.
fa: نشانگر فعالیت سبک iOS که ساعت‌گرد می‌چرخد.
fil: Isang iOS-style na indicator ng aktibidad na umiikot nang clockwise.
fr_ca: Un indicateur d'activité de style iOS qui tourne dans le sens des aiguilles d'une montre.
gl: Un indicador de actividade de tipo iOS que xira cara á dereita.
gu: iOS-શૈલીનું એક પ્રવૃત્તિ સૂચક જે ઘડિયાળની દિશામાં ફરે છે.
he: אינדיקטור של פעילות בסגנון iOS שמסתובב בכיוון השעון.
hi: iOS की शैली में गतिविधि दिखाने वाला इंडिकेटर जो घड़ी की दिशा में चलता है.
hu: iOS-stílusú tevékenységjelző, amely az óramutató járásával megegyezően forog.
hy: Գործողությունների՝ iOS-ի ոճով ցուցիչ, որը պտտվում է ժամացույցի սլաքի ուղղությամբ։
id: Indikator aktivitas gaya iOS yang berputar searah jarum jam.
it: Un indicatore di attività in stile iOS che ruota in senso orario.
ja: 時計回りにくるくる回る iOS スタイルのアクティビティ インジケーター。
ka: iOS-სტილის აქტივობის ინდიკატორი, რომელიც ბრუნავს საათის მიმართულებით.
km: សូចនាករសកម្មភាពរចនាប័ទ្ម iOS ដែលវិលស្របទ្រនិចនាឡិកា។
kn: ಪ್ರದಕ್ಷಿಣಾಕಾರವಾಗಿ ಸ್ಪಿನ್ ಆಗುವ iOS-ಸ್ಟೈಲ್ ಚಟುವಟಿಕೆ ಸೂಚಕ.
ko: 시계 방향으로 회전하는 iOS 스타일 활동 표시기입니다.
ky: Сааттын жебеси боюнча айланган iOS стилиндеги аракеттердин индикатору.
lo: ຕົວຊີ້ບອກການເຄື່ອນໄຫວແບບ iOS ທີ່ມຸນຕາມເຂັມໂມງ
lt: Pagal laikrodžio rodyklę besisukantis „iOS“ stiliaus veiklos indikatorius.
lv: iOS stila aktivitātes indikators, kas griežas pulksteņrādītāja kustības virzienā.
mk: Индикатор на активност во iOS-стил што се врати во насока на стрелките на часовникот.
ml: ഘടികാര ദിശയിൽ കറങ്ങുന്ന, iOS-ശെെലിയിലുള്ള ഒരു ആക്റ്റിവിറ്റി ഇൻഡിക്കേറ്ററുകൾ.
mn: Цагийн зүүний дагуу эргэдэг iOS загварын үйл ажиллагааны заалт.
mr: एक iOS शैलीतील घड्याळाच्या काट्याच्या दिशेने गोल फिरणारे अ‍ॅक्टिव्हिटी इंडिकेटर
ms: Penunjuk aktiviti gaya iOS yang berputar mengikut arah jam.
my: နာရီလက်တံအတိုင်း လည်သည့် iOS ပုံစံ လုပ်ဆောင်ချက်အညွှန်း
nb: En aktivitetsindikator i iOS-stil som snurrer med klokken.
ne: घडीको दिशामा घुम्ने iOS-शैलीको गतिविधि सूचक।
pa: iOS-ਸਟਾਈਲ ਦੀ ਸਰਗਰਮੀ ਸੂਚਕ ਜੋ ਘੜੀ ਦੇ ਦਿਸ਼ਾ ਵਿੱਚ ਘੁੰਮਦਾ ਹੈ।
pl: Wskaźnik aktywności w stylu iOS, który obraca się w prawo.
pt: Um indicador de atividade no estilo iOS que gira em sentido horário.
pt_pt: Um indicador de atividade ao estilo do iOS que gira no sentido dos ponteiros do relógio.
ro: Indicator de activitate în stil iOS care se rotește spre dreapta.
ru: Вращающийся по часовой стрелке индикатор выполнения в стиле iOS.
si: දක්ෂිණාවර්තව භ්‍රමණය වන iOS-විලාසයේ ක්‍රියාකාරකම් දර්ශකය.
sk: Indikátor aktivity v štýle systému iOS, ktorý sa otáča v smere hodinových ručičiek.
sq: Një tregues aktiviteti në stilin e iOS që rrotullohet në drejtimin orar.
sr: Индикатор активности у iOS стилу који се окреће у смеру кретања казаљке на сату
sr_latn: Indikator aktivnosti u iOS stilu koji se okreće u smeru kretanja kazaljke na satu
sv: En aktivitetsindikator i iOS-stil som snurrar medurs.
te: సవ్యదిశలో తిరిగే ఒక iOS-శైలి యాక్టివిటీ సూచీ.
th: สัญญาณบอกสถานะกิจกรรมแบบ iOS ที่หมุนตามเข็มนาฬิกา
tr: Saat yönünde dönen iOS-tarzında işlem göstergesi
uk: Індикатор активності в стилі iOS, який обертається за годинниковою стрілкою.
ur: ایک iOS طرز کے سرگرمی انڈیکیٹرز جو گھڑی وار گھومتے ہیں۔
uz: Soatga teskari aylanadigan iOS uslubidagi faollik indikatori.
vi: Chỉ báo hoạt động theo kiểu iOS quay theo chiều kim đồng hồ.
zh_hk: 順時針方向轉動的 iOS 樣式活動指標
zu: Isikhombisi somsebenzi wesitayela esiphendukela ku-clockwise.

# demoCupertinoNavigationBarTitle
source: Navigation bar
af: Navigasiebalk
am: የአሰሳ አሞሌ
ar_eg: شريط التنقل
as: নেভিগেশ্বন বাৰ
az: Naviqasiya paneli
be: Панэль навігацыі
bn: নেভিগেশন বার
bs: Navigaciona traka
ca: Barra de navegació
da: Navigationslinje
es_ar: Barra de navegación
et: Navigeerimisriba
eu: Nabigazio-barra
fa: نوار پیمایش
fr_ca: Barre de navigation
gl: Barra de navegación
gu: નૅવિગેશન બાર
he: סרגל הניווט
hi: नेविगेशन बार
hu: Navigációs sáv
hy: Նավիգացիայի գոտի
id: Menu navigasi
it: Barra di navigazione
ja: ナビゲーション バー
ka: ნავიგაციის ზოლი
km: របាររុករក
kn: ನ್ಯಾವಿಗೇಷನ್ ಬಾರ್
ko: 탐색 메뉴
ky: Чабыттоо тилкеси
lo: ແຖບການນຳທາງ
lt: Naršymo juosta
lv: Navigācijas josla
mk: Лента за навигација
ml: നാവിഗേഷൻ ബാർ
mn: Навигацын самбар
mr: नॅव्हिगेशन बार
ms: Bar navigasi
my: လမ်းညွှန်ဘား
nb: Navigasjonsrad
ne: नेभिगेसन पट्टी
pa: ਦਿਸ਼ਾ-ਨਿਰਦੇਸ਼ ਪੱਟੀ
pl: Pasek nawigacyjny
pt: Barra de navegação
pt_pt: Barra de navegação
ro: Bară de navigare
ru: Панель навигации
si: සංචලන තීරුව
sk: Navigačný panel
sq: Shiriti i navigimit
sr: Трака за навигацију
sr_latn: Traka za navigaciju
sv: Navigeringsfält
te: నావిగేషన్ బార్‌
th: แถบนำทาง
tr: Gezinme çubuğu
uk: Панель навігації
ur: نیویگیشن بار
uz: Navigatsiya paneli
vi: Thanh điều hướng
zh_hk: 導覽列
zu: Ibha yokuzula

# demoCupertinoNavigationBarSubtitle
source: iOS-style navigation bar
af: Navigasiebalk in iOS-styl
am: iOS-ቅጥ የአሰሳ ምናሌ
ar_eg: شريط تنقل بنمط iOS
as: iOS-শৈলীৰ নেভিগেশ্বন বাৰ
az: iOS üslublu naviqasiya paneli
be: Панэль навігацыі ў стылі iOS
bn: iOS-স্টাইলে নেভিগেশন বার
bs: Traka za navigaciju u stilu iOS-a
ca: Barra de navegació d'estil iOS
da: iOS-lignende navigationslinje
es_ar: Barra de navegación similar a la de iOS
et: iOS-i stiilis navigeerimisriba
eu: iOS estiloko nabigazio-barra
fa: نوار پیمایش سبک iOS
fil: iOS-style na navigation bar
fr_ca: Barre de navigation de style iOS
gl: Barra de navegación de tipo iOS
gu: iOS-શૈલીનો નૅવિગેશન બાર
he: סרגל ניווט בסגנון iOS
hi: iOS स्टाइल वाला नेविगेशन बार
hu: iOS-stílusú navigációs sáv
hy: iOS-ի ոճով նավիգացիայի գոտի
id: Menu navigasi gaya iOS
it: Barra di navigazione in stile iOS
ja: iOS スタイルのナビゲーション バー
ka: iOS-სტილის ნავიგაციის ზოლი
km: របារ​រុករក​រចនាប័ទ្ម iOS
kn: iOS-ಶೈಲಿ ನ್ಯಾವಿಗೇಶನ್‌ ಬಾರ್‌
ko: iOS 스타일 탐색 메뉴
ky: iOS стилиндеги чабыттоо тилкеси
lo: ແຖບການນຳທາງແບບ iOS
lt: „iOS“ stiliaus naršymo juosta
lv: iOS stila navigācijas josla
mk: Лента за навигација во iOS-стил
ml: iOS-സ്റ്റൈൽ നാവിഗേഷൻ ബാർ
mn: iOS загварын навигацын самбар
mr: iOS शैलीतील नेव्हिगेशन बार
ms: Bar navigasi gaya iOS
my: iOS ပုံစံ လမ်းညွှန်ဘား
nb: Navigasjonsrad i iOS-stil
ne: iOS शैलीको नेभिगेसन पट्टी
pa: iOS-ਸਟਾਈਲ ਦਿਸ਼ਾ-ਨਿਰਦੇਸ਼ ਪੱਟੀ
pl: Pasek nawigacyjny w stylu iOS
pt: Barra de navegação no estilo iOS
pt_pt: Barra de navegação ao estilo do iOS
ro: Bară de navigare în stil iOS
ru: Панель навигации в стиле iOS
si: iOS-විලාස සංචලන තීරුව
sk: Navigačný panel v štýle systému iOS
sq: Shiriti i navigimit në stilin e iOS
sr: Трака за навигацију у iOS стилу
sr_latn: Traka za navigaciju u iOS stilu
sv: Navigeringsfält i iOS-stil
te: iOS-శైలి నావిగేషన్ బార్
th: แถบนำทางแบบ iOS
tr: iOS stili gezinme çubuğu
uk: Панель навігації в стилі iOS
ur: iOS طرز کا نیویگیشن بار
uz: iOS uslubidagi navigatsiya paneli
vi: Thanh điều hướng theo kiểu iOS
zh_hk: iOS 樣式導覽列
zu: Ibha yokuzulazula yesitayela se-iOS

# demoCupertinoNavigationBarDescription
source: An iOS-styled navigation bar. The navigation bar is a toolbar that minimally consists of a page title, in the middle of the toolbar.
af: 'n Navigasiebalk in iOS-styl. Die navigasiebalk is 'n nutsbalk wat bestaan uit minstens 'n bladsytitel in die middel van die nutsbalk.
am: የiOS-ቅጥ አሰሳ ምናሌ። የአሰሳ ምናሌ በመሣሪያ አሞሌ መሃል የገጽ አርዕስትን በውስጡ ቢያንስ የያዘ የመሣሪያ አሞሌ ነው።
ar_eg: شريط تنقل بنمط iOS شريط التنقل هو شريط أدوات يتكون على الأقل من عنوان صفحة في وسط شريط الأدوات.
as: এডাল iOS-শৈলীৰ নেভিগেশ্বন বাৰ নেভিগেশ্বন বাৰৰ সৈতে এডাল টুলবাৰ য'ত টুলবাৰৰ মাজত সীমিতভাৱে এটা পৃষ্ঠাৰ শিৰোনাম অন্তর্ভুক্ত হয়।
az: iOS üslublu naviqasiya paneli. Naviqasiya paneli ortasında minimal səhifə başlığı olan alət panelidir.
be: Панэль навігацыі ў стылі iOS. Панэль навігацыі – гэта панэль інструментаў, якая ўтрымлівае як мінімум назву старонкі, размешчаную ў цэнтры такой панэлі.
bn: একটি iOS-স্টাইলে নেভিগেশন বার। নেভিগেশন বার হল এমন একটি টুলবার যাতে কমপক্ষে একটি পৃষ্ঠার শীর্ষক থাকে, এটি টুলবারের মাঝে থাকে।
bs: Traka za navigaciju u stilu iOS-a. Traka za navigaciju je alatna traka koja sadrži barem naziv stranice na sredini alatne trake.
ca: Una barra de navegació d'estil iOS. La barra de navegació és una barra d'eines que consisteix com a mínim en un títol de pàgina al mig de la barra.
da: En iOS-lignende navigationslinje. Navigationslinjen er en værktøjslinje, der som minimum består af en sidetitel, midt i værktøjslinjen.
es_ar: Corresponde a una barra de navegación similar a la de iOS. La barra de navegación es una barra de herramientas que básicamente contiene el título de una página en medio de la barra.
et: iOS-i stiilis navigeerimisriba. Navigeerimisriba on tööriistariba, mis koosneb vähemalt lehe pealkirjast ja asub tööriistariba keskel.
eu: iOS estiloko nabigazio-barra bat. Nabigazio-barra tresna-barra bat da, tresna-barraren erdian orriaren izena daukana, besterik gabe.
fa: نوار پیمایش سبک iOS نوار پیمایش، نوارابزاری است که به‌صورتی ساده حاوی عنوان صفحه در وسط نوارابزار است.
fil: Isang iOS-style na navigation bar. Ang navigation bar ay isang toolbar na sa minimum ay may pamagat ng page na nasa gitna ng toolbar.
fr_ca: Une barre de navigation de style iOS. Il s'agit d'une barre d'outils au milieu de laquelle est indiqué au minimum le titre de la page consultée.
gl: Unha barra de navegación de tipo iOS. A barra de navegación é unha barra de ferramentas que basicamente contén o título dunha páxina no medio da barra de ferramentas.
gu: iOS-શૈલીનો નૅવિગેશન બાર. નૅવિગેશન બાર એ ટૂલબાર છે, જેમાં ટૂલબારની મધ્યમાં ઓછામાં ઓછું પેજ શીર્ષક શામેલ હોય છે.
he: סרגל ניווט בסגנון iOS. סרגל הניווט הוא סרגל כלים שכולל כותרת דף מינימלית במרכז סרגל הכלים.
hi: iOS स्टाइल वाला नेविगेशन बार. नेविगेशन बार एक ऐसा टूलबार है जिसमें कम से कम एक पेज टाइटल होता है. यह टूलबार के बीच में होता है.
hu: iOS-stílusú navigációs sáv. A navigációs sáv olyan eszköztár, amely legalább az oldal címét tartalmazza az eszköztár közepén.
hy: iOS-ի ոճով նավիգացիայի գոտի։ Նավիգացիայի գոտին գտնվում է գործիքագոտու մեջտեղում և հնարավորինս փոքր տարբերակով պարունակում է էջի վերնագիրը։
id: Menu navigasi gaya iOS. Menu navigasi adalah toolbar yang minimal berisi judul halaman, di bagian tengah toolbar.
it: Una barra di navigazione in stile iOS. La barra di navigazione è una barra degli strumenti che consiste almeno nel titolo di una pagina, al centro della barra degli strumenti.
ja: iOS スタイルのナビゲーション バーです。ナビゲーション バーは、ページタイトルを最小限含むツールバーです（ページタイトルはツールバーの中央に表示されます）。
ka: iOS-სტილის ნავიგაციის ზოლი. ნავიგაციის ზოლი წარმოადგენს ხელსაწყოთა ზოლს, რომელიც შეიცავს, სულ მცირე, ხელსაწყოთა ზოლის შუაში მოთავსებულ გვერდის სათაურს.
km: របារ​រុករក​ដែលមាន​រចនាប័ទ្ម iOS​។ របារ​រុករក​គឺជា​របារ​ឧបករណ៍​ដែល​យ៉ាងហោចណាស់មាន​ចំណងជើង​ទំព័រ នៅផ្នែក​កណ្ដាលនៃ​របារ​ឧបករណ៍​។
kn: iOS-ಶೈಲಿಯ ನ್ಯಾವಿಗೇಶನ್‌ ಬಾರ್‌. ನ್ಯಾವಿಗೇಷನ್ ಬಾರ್ ಪರಿಕರಪಟ್ಟಿಯಾಗಿದ್ದು, ಕನಿಷ್ಠವಾಗಿ ಪುಟ ಶೀರ್ಷಿಕೆಯು ಪರಿಕರಪಟ್ಟಿಯ ಮಧ್ಯದಲ್ಲಿರುತ್ತದೆ.
ko: iOS 스타일의 탐색 메뉴입니다. 이 탐색 메뉴는 페이지 제목으로만 구성된 툴바입니다. 페이지 제목은 툴바 중간에 표시됩니다.
ky: iOS стилиндеги чабыттоо менюсу. Чабыттоо тилкеси – кеминде ортосунда барактын аталышы көрсөтүлгөн тилке.
lo: ແຖບການນຳທາງແບບ iOS. ແຖບການນຳທາງແມ່ນແຖບເຄື່ອງມືທີ່ຢ່າງໜ້ອຍທີ່ສຸດຈະປະກອບມີຊື່ໜ້າ, ໃນທາງກາງຂອງແຖບເຄື່ອງມື.
lt: „iOS“ stiliaus naršymo juosta. Naršymo juosta – tai įrankių juosta, kurią sudaro bent puslapio pavadinimas, pateiktas įrankių juostos centre.
lv: iOS stila navigācijas josla. Navigācijas josla ir rīkjosla, kas ietver vismaz lapas nosaukumu (rīkjoslas vidū).
mk: Лента за навигација во iOS-стил. Лентата за навигација е алатник, што содржи најмалку наслов на страницата, во средина на алатникот.
ml: iOS-ശെെലിയിലുള്ള നാവിഗേഷൻ ബാർ. കുറഞ്ഞ തോതിലുള്ള ഒരു പേജ് തലക്കെട്ട് ഉൾപ്പെടുന്ന ടൂൾബാർ ആണ് നാവിഗേഷൻ ബാർ.
mn: iOS загварын навигацын самбар. Навигацын самбар нь хамгийн багадаа хуудасны гарчгаас бүрддэг самбар бөгөөд энэ нь самбарын дунд хэсэгт байдаг.
mr: एक iOS शैलीतील नेव्हिगेशन बार. नेव्हिगेशन बार हा असा टूलबार आहे ज्यामध्ये टूलबारच्या मधोमध किमान पेजच्या शीर्षकाचा समावेश आहे.
ms: Bar navigasi bergaya iOS Bar navigasi ialah bar alat yang secara minimumnya mengandungi tajuk halaman di tengah-tengah bar alat.
my: iOS ပုံစံပြုလုပ်ထားသော လမ်းညွှန်ဘား လမ်းညွှန်ဘားဆိုသည်မှာ ကိရိယာဘားတစ်ခုဖြစ်ပြီး ၎င်း၏ အလယ်တွင် စာမျက်နှာခေါင်းစဉ် အနည်းအကျဉ်းမျှ ပါဝင်သည်။
nb: En navigasjonsrad i iOS-stil. Navigasjonsraden er en verktøyrad som minst består av en sidetittel i midten av verktøyraden.
ne: iOS शैलीको नेभिगेसन पट्टी। नेभिगेसन पट्टी एउटा उपकरणपट्टी हो जसमा कम्तिमा पनि उपकरणपट्टीको बिचमा पृष्ठको शीर्षक समावेश भएको हुन्छ।
pa: iOS-ਸਟਾਈਲ ਵਾਲੀ ਦਿਸ਼ਾ-ਨਿਰਦੇਸ਼ ਪੱਟੀ। ਦਿਸ਼ਾ-ਨਿਰਦੇਸ਼ ਪੱਟੀ ਇੱਕ ਟੂਲਬਾਰ ਹੈ ਜਿਸ ਦੇ ਮੱਧ ਵਿੱਚ ਘੱਟ ਤੋਂ ਘੱਟ ਪੰਨਾ ਸਿਰਲੇਖ ਹੁੰਦਾ ਹੈ।
pl: Pasek nawigacyjny w stylu iOS. Pasek nawigacyjny to pasek narzędzi, który zawiera co najmniej tytuł strony na środku.
pt: Uma barra de navegação no estilo iOS. A barra de navegação é uma barra de ferramentas que consiste basicamente em um título de página no meio da barra de ferramentas.
pt_pt: Uma barra de navegação ao estilo do iOS. A barra de navegação é uma barra de ferramentas que consiste, no mínimo, num título da página no meio da barra de ferramentas.
ro: Bară de navigare în stil iOS. Bara de navigare este o bară de instrumente formată cel puțin dintr-un titlu de pagină plasat în centru.
ru: Панель навигации в стиле iOS – это панель инструментов, обязательным атрибутом которой является название страницы, расположенное посередине.
si: iOS-විලාසයේ සංචලන තීරුවකි. සංචාලන තීරුව යනු මෙවලම් තීරුව මධ්‍යයේ අවම වශයෙන් පිටු මාතෘකාවකින් සමන්විත මෙවලම් තීරුවකි.
sk: Ide o navigačný panel v štýle systému iOS. Navigačný panel je panel s nástrojmi, ktorý vo svojom strede minimálne obsahuje názov stránky.
sq: Një shirit navigimi në stilin e iOS. Shiriti i navigimit është një shirit veglash që përfshin minimumi një titull të faqes, në mes të shiritit të veglave.
sr: Трака за навигацију са iOS стилом. Трака за навигацију је трака с алаткама која у најгорем случају садржи само наслов странице на средини.
sr_latn: Traka za navigaciju sa iOS stilom. Traka za navigaciju je traka s alatkama koja u najgorem slučaju sadrži samo naslov stranice na sredini.
sv: Ett navigeringsfält i iOS-stil. Navigeringsfältet är ett verktygsfält som består av åtminstone en sidrubrik, i mitten av verktygsfältet.
te: iOS-శైలి నావిగేషన్ బార్. నావిగేషన్ బార్ అనేది ఒక సరళమైన టూల్‌బార్, ఇందులో ఒక పేజీ శీర్షిక మాత్రమే నడిమధ్యలో ఉంటుంది.
th: แถบนำทางแบบ iOS แถบนำทางคือแถบเครื่องมือที่มีชื่อหน้าเว็บแสดงอย่างน้อยที่สุดตรงกลางของแถบเครื่องมือ
tr: iOS stili bir gezinme çubuğu. Gezinme çubuğu, ortasında sayfa başlığını minimum düzeyde içeren bir araç çubuğudur.
uk: Панель навігації в стилі iOS. Панель навігації – це панель інструментів, основною складовою якої є розміщена посередині назва сторінки.
ur: ایک iOS طرز کا نیویگیشن بار۔ نیویگیشن بار ایک ٹول بار ہے جو ٹول بار کے وسط میں کم سے کم ایک صفحہ کے عنوان پر مشتمل ہوتا ہے۔
uz: iOS uslubidagi navigatsiya paneli – asboblar panelining oʻrtasida sahifaning nomi minimal joylashgan panel.
vi: Một thanh điều hướng theo kiểu iOS. Thanh điều hướng là thanh công cụ có tối thiểu một tiêu đề trang ở giữa.
zh_hk: iOS 樣式的導覽列。導覽列為於中間設有頁面標題的工具列。
zu: Ibha yokuzulazula yesitayela se-iOS. Ibha yokuzulazula ibha yamathuluzi efaka ngokuncane isihloko sekhasi, ngaphakathi kwebha yamathuluzi.
