Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneFly5SemanticLabel
source: Lake-side hotel in front of mountains
af: Hotel aan die oewer van 'n meer voor berge
am: ከተራራዎች ፊት ያለ የሐይቅ ዳርቻ ሆቴል
ar_eg: فندق يطِلّ على بحيرة قُبالة سلسلة من الجبال
as: পৰ্বতৰ সন্মুখত থকা এটা হ্ৰদৰ কাষৰীয়া হোটেল
az: Dağların qarşısında göl kənarı otel
be: Гасцініца на беразе возера пад гарой
bn: পাহাড়ের সামনে লেক সাইড হোটেল
bs: Hotel pored jezera ispred planina
ca: Hotel vora un llac i davant d'unes muntanyes
da: Hotel ved søen foran bjerge
es_ar: Hotel a orillas de un lago frente a las montañas
et: Mägihotell järve kaldal
eu: Mendialdeko hotel bat, laku baten ertzean
fa: هتل ساحلی رو به کوهستان
fil: Hotel sa tabi ng lawa sa harap ng mga bundok
fr_ca: Hôtel au bord du lac face aux montagnes
gl: Hotel á beira dun lago e fronte ás montañas
gu: પર્વતોની સામે તળાવ બાજુ હોટલ
he: מלון לחוף אגם על רקע הרים
hi: पहाड़ों के सामने, झील के किनारे बना होटल
hu: Hegyek előtt, tó partján álló szálloda
hy: Լճամերձ հյուրանոց՝ լեռների ֆոնի վրա
id: Hotel tepi danau yang menghadap pegunungan
it: Hotel sul lago di fronte alle montagne
ja: 後ろに山が広がる湖畔のホテル
ka: ტბისპირა სასტუმრო მთების ფონზე
km: សណ្ឋាគារ​ជាប់មាត់បឹង​នៅពី​មុខភ្នំ
kn: ಪರ್ವತಗಳ ಮುಂದೆ ನದಿ ತೀರದಲ್ಲಿನ ಹೋಟೆಲ್
ko: 산을 배경으로 한 호숫가 호텔
ky: Тоолордун этегиндеги көлдүн жеегинде жайгашкан мейманкана
lo: ໂຮງແຮມຮິມທະເລສາບທີ່ຢູ່ໜ້າພູ
lt: Viešbutis ežero pakrantėje su kalnais
lv: Viesnīca pie kalnu ezera
mk: Хотел крај езеро пред планини
ml: മലനിരകൾക്ക് മുന്നിലുള്ള തടാകതീരത്തെ ഹോട്ടൽ
mn: Уулын урдах нуурын эргийн зочид буудал
mr: डोंगरांसमोर वसलेले तलावाशेजारचे हॉटेल
ms: Hotel tepi tasik berhadapan gunung
my: တောင်တန်းများရှေ့ရှိ ကမ်းစပ်ဟိုတယ်
nb: Hotell ved en innsjø foran fjell
ne: पहाडका नजिकमा रहेको झील छेउको होटेल
pa: ਪਹਾੜਾਂ ਸਾਹਮਣੇ ਝੀਲ ਦੇ ਕਿਨਾਰੇ ਹੋਟਲ
pl: Hotel nad jeziorem z górami w tle
pt: Hotel às margens de um lago em frente às montanhas
pt_pt: Hotel voltado para o lago em frente a montanhas
ro: Hotel pe malul unui lac, în fața munților
ru: Гостиница у озера на фоне гор
si: කඳු වැටියක ඉදිරිපස ඇති වැව ඉස්මත්තේ හෝටලය
sk: Hotel na brehu jazera s horami v pozadí
sq: Hotel buzë liqenit përballë maleve
sr: Хотел на обали језера испред планина
sr_latn: Hotel na obali jezera ispred planina
sv: Hotell vid en sjö med berg i bakgrunden
te: పర్వతాల ముందు సరస్సు పక్కన ఉన్న హోటల్
th: โรงแรมริมทะเลสาบที่อยู่หน้าภูเขา
tr: Dağların yamacında, göl kenarında otel
uk: Готель біля озера на гірському тлі
ur: پہاڑوں کے سامنے جھیل کے کنارے ہوٹل
uz: Togʻlar bilan oʻralgan soy boʻyidagi mehmonxona
vi: Khách sạn bên hồ phía trước những ngọn núi
zh_hk: 背山而建的湖邊酒店
zu: Ihhotela elikuhlangothi lwechibi ngaphambi kwezintaba

# demoSelectionControlsSubtitle
source: Checkboxes, radio buttons, and switches
af: Merkblokkies, klinkknoppies en skakelaars
am: አመልካች ሳጥኖች፣ የሬዲዮ አዝራሮች እና መቀያየሪያዎች
ar_eg: مربّعات الاختيار وأزرار الاختيار ومفاتيح التبديل
as: চেকবাকচ, ৰেডিঅ’ বুটাম আৰু ছুইচ
az: Qeyd xanaları, radio düymələri və dəyişdiricilər
be: Палі для птушак, радыёкнопкі і пераключальнікі
bn: চেকবক্স, রেডিও বোতাম এবং সুইচ
bs: Polja za potvrdu, dugmad za izbor i prekidači
ca: Caselles de selecció, botons d'opció i interruptors
da: Afkrydsningsfelter, alternativknapper og kontakter
es_ar: Casillas de verificación, interruptores y botones de selección
et: Märkeruudud, raadionupud ja lülitid
eu: Koadroak, aukera-botoiak eta etengailuak
fa: کادرهای تأیید، دکمه‌های رادیو، و کلیدها
fil: Mga checkbox, radio button, at switch
fr_ca: Cases à cocher, boutons radio et commutateurs
gl: Caixas de verificación, botóns de opción e interruptores
gu: ચેકબૉક્સ, રેડિયો બટન અને સ્વિચ
he: תיבות סימון, לחצני בחירה ומתגים
hi: चेकबॉक्स, रेडियो बटन, और स्विच
hu: Jelölőnégyzetek, választógombok és kapcsolók
hy: Նշավանդակներ, կետակոճակներ և փոխանջատիչներ
id: Kotak centang, tombol pilihan, dan tombol akses
it: Caselle di controllo, pulsanti di opzione e opzioni
ja: チェックボックス、ラジオボタン、スイッチ
ka: მოსანიშნი ველები, არჩევანის ღილაკები და გადამრთველები
km: ប្រអប់​ធីក ប៊ូតុង​មូល និង​ប៊ូតុង​បិទបើក
kn: ಚೆಕ್‌ಬಾಕ್ಸ್‌ಗಳು, ರೇಡಿಯೋ ಬಟನ್‌ಗಳು ಮತ್ತು ಸ್ವಿಚ್‌ಗಳು
ko: 체크박스, 라디오 버튼, 스위치
ky: Белгилөө кутучалары, радио баскычтар жана которуштургучтар
lo: ກ່ອງໝາຍ, ປຸ່ມຕົວເລືອກ ແລະ ປຸ່ມເປີດປິດຕ່າງໆ
lt: Žymimieji laukeliai, akutės ir jungikliai
lv: Izvēles rūtiņas, pogas un slēdži
mk: Полиња за избор, тркалезни копчиња и прекинувачи
ml: ചെക്ക്‌ ബോക്‌സുകൾ, റേഡിയോ ബട്ടണുകൾ, സ്വിച്ചുകൾ എന്നിവ
mn: Checkboxes, радио товчлуур болон сэлгүүр
mr: चेकबॉक्स, रेडिओ बटणे आणि स्विच
ms: Kotak pilihan, butang radio dan suis
my: အမှန်ခြစ်ရန် နေရာများ၊ ရေဒီယိုခလုတ်များနှင့် အဖွင့်အပိတ်ခလုတ်များ
nb: Avmerkingsbokser, alternativknapper og brytere
ne: जाँच बाकस, रेडियो बटन र स्विचहरू
pa: ਚੈੱਕ-ਬਾਕਸ, ਰੇਡੀਓ ਬਟਨ ਅਤੇ ਸਵਿੱਚ
pl: Pola wyboru, przyciski opcji i przełączniki
pt: Caixas de seleção, botões de opção e chaves
pt_pt: Caixas de verificação, botões de opção e interruptores
ro: Casete de selectare, butoane radio și comutatoare
ru: Флажки, радиокнопки и переключатели
si: තේරීම් කොටු, රේඩියෝ බොත්තම් සහ ස්විච
sk: Začiarkavacie políčka a prepínače
sq: Kutitë e zgjedhjes, butonat e radios dhe çelësat
sr: Поља за потврду, дугмад за избор и прекидачи
sr_latn: Polja za potvrdu, dugmad za izbor i prekidači
sv: Kryssrutor, alternativknappar och reglage
te: చెక్‌బాక్స్‌లు, రేడియో బటన్‌లు ఇంకా స్విచ్‌లు
th: ช่องทำเครื่องหมาย ปุ่มตัวเลือก และสวิตช์
tr: Onay kutuları, radyo düğmeleri ve anahtarlar
uk: Прапорці, радіокнопки й перемикачі
ur: چیک باکسز، ریڈیو بٹنز اور سوئچز
uz: Belgilash katakchalari, radio tugmalar va almashtirgichlar
vi: Các hộp kiểm, nút radio và công tắc
zh_hk: 選框、圓形按鈕和開關
zu: Amabhokisi okuthikha, izinkinobho zerediyo, namaswishi

# craneEat10SemanticLabel
source: Woman holding huge pastrami sandwich
af: Vrou wat 'n yslike pastramitoebroodjie vashou
am: ትልቅ ፓስትራሚ ሳንድዊች የያዘች ሴት
ar_eg: امرأة تمسك بشطيرة بسطرمة كبيرة
as: এটা বৃহৎ পাষ্ট্ৰামি ছেণ্ডৱিচ ধৰি থকা মহিলা
az: Əlində böyük basdırmalı sandviç olan qadın
be: Жанчына з вялікім сандвічам пастрамі ў руках
bn: মহিলাটি বিশাল পাস্ট্রমি স্যান্ডউইচ ধরে রয়েছে
bs: Žena drži ogromni sendvič s dimljenom govedinom
ca: Dona amb un entrepà de pastrami enorme
da: Kvinde med en kæmpe pastramisandwich
es_ar: Mujer que sostiene un gran sándwich de pastrami
et: Naine hoiab käes suurt lihavõileiba
eu: Emakume bat pastrami-sandwich bat eskuan duela
fa: زن ساندویچ بزرگ گوشت دودی را در دست گرفته است
fil: Babaeng may hawak na malaking pastrami sandwich
fr_ca: Femme tenant un gros sandwich au pastrami
gl: Muller que suxeita un gran sándwich de pastrami
gu: મોટી પાસ્ટ્રામી સેન્ડવિચ પકડીને ઉભેલી સ્ત્રી
he: אישה שמחזיקה כריך פסטרמה ענק
hi: हाथ में बड़ा पस्ट्रामी सैंडविच पकड़े महिला
hu: Óriási pastramis szendvicset tartó nő
hy: Պաստրամիով հսկայական սենդվիչ բռնած կին
id: Wanita yang memegang sandwich pastrami besar
it: Donna con un enorme pastrami sandwich in mano
ja: 巨大なパストラミ サンドイッチを持つ女性
ka: ქალს უჭირავს უზარმაზარი პასტრომის სენდვიჩი
km: ស្រ្តីកាន់​សាំងវិច​សាច់គោ​ដ៏ធំ
kn: ದೊಡ್ಡ ಪ್ಯಾಸ್ಟ್ರಾಮಿ ಸ್ಯಾಂಡ್‌ವಿಚ್ ಹಿಡಿದಿರುವ ಮಹಿಳೆ
ko: 거대한 파스트라미 샌드위치를 들고 있는 여성
ky: Бастурма менен жасалган чоң сэндвич кармаган аял
lo: ຜູ້ຍິງຖືແຊນວິດພາສທຣາມີໃຫຍ່
lt: Moteris, laikanti didelį su jautiena
lv: Sieviete tur lielu pastrami sendviču
mk: Жена држи огромен сендвич со пастрма
ml: വലിയ പേസ്‌ട്രാമി സാൻഡ്‌വിച്ച് കൈയ്യിൽ പിടിച്ച് നിൽകുന്ന സ്‌ത്രീ
mn: Асар том пастрами сэндвич барьж буй эмэгтэй
mr: भलेमोठे पास्रामी सॅंडविच धरलेली महिला
ms: Wanita memegang sandwic pastrami yang sangat besar
my: ကြီးမားသော အမဲကျပ်တိုက်အသားညှပ်ပေါင်မုန့်ကို ကိုင်ထားသောအမျိုးသမီး
nb: Kvinne som holder et enormt pastramismørbrød
ne: विशाल पास्ट्रामी स्यान्डविच बोकेकी महिला
pa: ਵੱਡੇ ਪਾਸਟ੍ਰਾਮੀ ਸੈਂਡਵਿਚ ਨੂੰ ਫੜ੍ਹ ਕੇ ਖੜ੍ਹੀ ਔਰਤ
pl: Kobieta trzymająca dużą kanapkę z pastrami
pt: Mulher segurando um sanduíche de pastrami
pt_pt: Mulher a segurar numa sanduíche de pastrami enorme
ro: Femeie care ține un sandviș imens cu pastramă
ru: Женщина, которая держит огромный сэндвич с пастромой
si: විශාල පැස්ට්‍රාමි සැන්ඩ්විච් එකක් අතැති කාන්තාව
sk: Žena s obrovským pastrami sendvičom
sq: Grua që mban një sandviç të madh me pastërma
sr: Жена држи велики сендвич са пастрмом
sr_latn: Žena drži veliki sendvič sa pastrmom
sv: Kvinna som håller en stor pastramimacka
te: పెద్ద పాస్ట్రామి శాండ్‌విచ్‌ను పట్టుకున్న మహిళ
th: ผู้หญิงถือแซนด์วิชเนื้อชิ้นใหญ่
tr: Büyük pastırmalı sandviç tutan kadın
uk: Жінка, яка тримає величезний сендвіч із пастромою
ur: پاسٹرامی سینڈوچ پکڑے ہوئے عورت
uz: Pastromali katta sendvich ushlab turgan ayol
vi: Người phụ nữ cầm chiếc bánh sandwich kẹp thịt bò hun khói siêu to
zh_hk: 拿著巨型燻牛肉三文治的女人
zu: Owesifazane ophethe isemishi enkulu ye-pastrami

# craneFly4SemanticLabel
source: Overwater bungalows
af: Hutte bo die water
am: የውሃ ላይ ባንግሎው ቤት
ar_eg: أكواخ فوق الماء
as: পানীৰ ওপৰত সজোৱা বঙলা
az: Suüstü bunqalolar
be: Бунгала над воднай паверхняй
bn: ওভার ওয়াটার বাংলো
bs: Kućice na vodi
ca: Bungalous flotants
da: Bungalows over vandet
es_ar: Cabañas sobre el agua
et: Veepeal olevad bangalod
eu: Itsasoko bungalow-ak
fa: خانه‌های ییلاقی روی آب
fil: Mga bungalow sa ibabaw ng tubig
fr_ca: Bungalows sur l'eau
gl: Cabanas flotantes
gu: પાણીની ઉપર બનાવેલો બંગલો
he: בקתות מעל המים
hi: पानी पर बने बंगले
hu: Vízen álló nyaralóházak
hy: Բունգալոներ ջրի վրա
id: Bungalo apung
it: Bungalow sull'acqua
ja: 水上バンガロー
ka: წყალზე მდგომი ბუნგალოები
km: បឹងហ្គាឡូ​លើ​ទឹក
kn: ನೀರಿನಿಂದ ಸುತ್ತುವರಿದ ಬಂಗಲೆಗಳು
ko: 수상 방갈로
ky: Суунун үстүндө жайгашкан бунгалолор
lo: ບັງກະໂລເໜືອນ້ຳ
lt: Vilos ant vandens
lv: Bungalo virs ūdens
mk: Надводни бунгалови
ml: വെള്ളത്തിന് പുറത്ത് നിർമ്മിച്ചിരിക്കുന്ന ബംഗ്ലാവുകൾ
mn: Усан дээрх бунгало
mr: पाण्यावरील तरंगते बंगले
ms: Banglo terapung
my: ရေပေါ်အိမ်လေးများ
nb: Bungalower over vann
ne: पानीमाथिका बङ्गलाहरू
pa: ਪਾਣੀ 'ਤੇ ਬਣੇ ਬੰਗਲੇ
pl: Bungalowy na wodzie
pt: Bangalô sobre a água
pt_pt: Bangalôs sobre a água
ro: Bungalouri pe malul apei
ru: Бунгало над водой
si: ජලය මත ඇති බංගලා
sk: Bungalovy nad vodou
sq: Shtëpi mbi ujë
sr: Бунгалови који се надвијају над водом
sr_latn: Bungalovi koji se nadvijaju nad vodom
sv: Bungalower på pålar i vattnet
te: ఓవర్‌వాటర్ బంగ్లాలు
th: บังกะโลที่ตั้งอยู่เหนือน้ำ
tr: Su üzerinde bungalovlar
uk: Бунгало над водою
ur: پانی کے اوپر بنگلے
uz: Suv ustidagi bir qavatli imorat
vi: Nhà gỗ một tầng trên mặt nước
zh_hk: 水上小屋
zu: Ama-bungalow angaphezu kwamanzi

# craneEat7SemanticLabel
source: Bakery entrance
af: Bakkeryingang
am: የመጋገሪያ መግቢያ
ar_eg: مَدخل مخبز
as: বেকাৰীৰ প্ৰৱেশদ্বাৰ
az: Bulka dükanının girişi
be: Уваход у пякарню
bn: বেকারির প্রবেশদ্বার
bs: Ulaz u pekaru
ca: Entrada d'una fleca
da: Indgang til bager
es_ar: Entrada de panadería
et: Pagariäri sissekäik
eu: Okindegiko sarrera
fa: ورودی نانوایی
fil: Pasukan ng bakery
fr_ca: Entrée de la boulangerie
gl: Entrada dunha panadaría
gu: બેકરીનો પ્રવેશદ્વાર
he: כניסה למאפייה
hi: बेकरी में जाने का रास्ता
hu: Pékség bejárata
hy: Փռի մուտք
id: Pintu masuk toko roti
it: Ingresso di una panetteria
ja: ベーカリーの入口
ka: საფუნთუშის შესასვლელი
km: ទ្វារចូល​ហាងនំប៉័ង
kn: ಬೇಕರಿ ಪ್ರವೇಶ
ko: 베이커리 입구
ky: Наабайканага кире бериш
lo: ທາງເຂົ້າຮ້ານເບເກີຣີ
lt: Įėjimas į kepyklą
lv: Ieeja maizes ceptuvē
mk: Влез на пекарница
ml: ബേക്കറിയുടെ പ്രവേശനകവാടം
mn: Талх нарийн боовны газрын хаалга
mr: बेकरीचे प्रवेशव्दार
ms: Pintu masuk bakeri
my: မုန့်ဖုတ်ဆိုင် ဝင်ပေါက်
nb: Bakeri-inngang
ne: बेकरी पसलको प्रवेशद्वार
pa: ਬੇਕਰੀ ਵਿੱਚ ਦਾਖਲ ਹੋਣ ਦਾ ਰਸਤਾ
pl: Wejście do piekarni
pt: Entrada da padaria
pt_pt: Entrada de padaria
ro: Intrare în brutărie
ru: Вход в пекарню
si: බේකරි ප්‍රවේශය
sk: Vstup do pekárne
sq: Hyrje pastiçerie
sr: Улаз у пекару
sr_latn: Ulaz u pekaru
sv: Ingång till bageriet
te: బేకరీ ప్రవేశ ద్వారం
th: ทางเข้าร้านเบเกอรี่
tr: Fırın girişi
uk: Вхід у пекарню
ur: بیکری کا دروازہ
uz: Nonvoyxonaga kirish qismi
vi: Lối vào tiệm bánh
zh_hk: 麵包店店門
zu: Indawo yokungena yokubhakwa kwezinkwa

# craneEat6SemanticLabel
source: Shrimp dish
af: Garnaalgereg
am: ሽሪምፕ ሳህን
ar_eg: طبق روبيان
as: মিছামাছৰ ব্যঞ্জন
az: Krevetdən hazırlanan xörək
be: Страва з крэветкамі
bn: চিংড়ি মাছের খাবার
bs: Jelo od škampi
ca: Plat de gambes
da: Ret med rejer
es_ar: Plato de camarones
et: Krevetiroog
eu: Izkira-platera
fa: خوراک میگو
fil: Putaheng may hipon
fr_ca: Plat de crevettes
gl: Prato con camaróns
gu: ઝીંગાની વાનગી
he: מנת שרימפס
hi: झींगे से बना पकवान
hu: Rákból készült étel
hy: Ծովախեցգետնից ուտեստ
id: Hidangan berbahan udang
it: Piatto di gamberi
ja: エビ料理
ka: კრევეტის კერძი
km: ម្ហូបដែល​ធ្វើពី​បង្គា
kn: ಸೀಗಡಿ ತಿನಿಸು
ko: 새우 요리
ky: Креветкадан жасалган тамак
lo: ເມນູໃສ່ກຸ້ງ
lt: Indas krevečių
lv: Garneļu ēdiens
mk: Порција ракчиња
ml: ചെമ്മീന്‍ കൊണ്ടുള്ള വിഭവം
mn: Сам хорхойтой хоол
mr: कोळंबीची डिश
ms: Masakan udang
my: ပုဇွန်ဟင်း
nb: Rekerett
ne: झिँगे माछाको परिकार
pa: ਝੀਂਗਾ ਮੱਛੀ ਪਕਵਾਨ
pl: Talerz pełen krewetek
pt: Prato de camarão
pt_pt: Prato de camarão
ro: Preparat cu creveți
ru: Блюдо с креветками
si: කූනිස්සෝ පිඟාන
sk: Pokrm z kreviet
sq: Pjatë me karkaleca deti
sr: Јело са шкампима
sr_latn: Jelo sa škampima
sv: Räkrätt
te: రొయ్యల వంటకం
th: เมนูที่ใส่กุ้ง
tr: Karides yemeği
uk: Креветки
ur: جھینگا مچھلی سے بنی ڈش
uz: Krevetkali taom
vi: Món ăn làm từ tôm
zh_hk: 鮮蝦大餐
zu: Isidlo se-Shrimp

# craneEat5SemanticLabel
source: Artsy restaurant seating area
af: Artistieke restaurant se sitgebied
am: ኪነ ጥበባዊ የምግብ ቤት መቀመጫ አካባቢ
ar_eg: منطقة الجلوس في مطعم ذي ذوق فني
as: ৰেষ্টুৰাৰ কলাসুলভ বহা ঠাই
az: İncəsənət üslublu restoranda oturma sahəsi
be: Гасцёўня моднага рэстарана
bn: আর্টসির রেস্তোঁরা বসার জায়গা
bs: Prostor za sjedenje u umjetničkom restoranu
ca: Taules d'un restaurant artístic
da: Siddepladser på en fin restaurant
es_ar: Área de descanso de restaurante artístico
et: Kunstipärane restoranisaal
eu: Jatetxe moderno bateko mahaiak
fa: محل نشستن در رستوران آرتسی
fil: Artsy na seating area ng isang restaurant
fr_ca: Salle du restaurant Artsy
gl: Sala dun restaurante artístico
gu: કલાત્મક રીતે બનાવેલા રેસ્ટોરન્ટનો બેઠક વિસ્તાર
he: אזור ישיבה במסעדה אומנותית
hi: कलात्मक रूप से बने रेस्टोरेंट में बैठने की जगह
hu: Művészi tematikájú étterem belső tere
hy: Ռեստորանի նորաձև սրահ
id: Area tempat duduk restoran yang berseni
it: Zona ristorante artistica
ja: アート風レストランの座席エリア
ka: მხატვრულად გაფორმებული რესტორნის სტუმრების დასაჯდომი სივრცე
km: កន្លែងអង្គុយ​នៅ​ភោជនីយដ្ឋាន​បែបសិល្បៈ
kn: ಕಲಾತ್ಮಕ ರೆಸ್ಟೋರೆಂಟ್‌ನ ಆಸನದ ಪ್ರದೇಶ
ko: 예술적인 레스토랑 좌석
ky: Artsy ресторанындагы эс алуу аймагы
lo: ບໍລິເວນບ່ອນນັ່ງໃນຮ້ານອາຫານທີ່ມີສິລະປະ
lt: Vieta prie stalo meniškame restorane
lv: Sēdvietas mākslinieciskā restorānā
mk: Простор за седење во ресторан со уметничка атмосфера
ml: ആർട്‌സി റെസ്‌റ്റോറന്റിലെ ഇരിപ്പിട സൗകര്യം
mn: Уран чамин рестораны суух хэсэг
mr: कलात्मक रेस्टॉरंटमधील बसण्याची जागा
ms: Kawasan tempat duduk restoran Artsy
my: အနုပညာလက်ရာမြောက်သော စားသောက်ဆိုင် တည်ခင်းဧည့်ခံရန်နေရာ
nb: Sitteområdet i en kunstnerisk restaurant
ne: आर्ट्सी भोजनालयको बस्ने ठाउँ
pa: ਕਲਾਕਾਰੀ ਰੈਸਟੋਰੈਂਟ ਵਿਚਲਾ ਬੈਠਣ ਵਾਲਾ ਖੇਤਰ
pl: Miejsca do siedzenia w artystycznej restauracji
pt: Área para se sentar em um restaurante artístico
pt_pt: Zona de lugares sentados num restaurante artístico
ro: Locuri dintr-un restaurant artistic
ru: Стильный зал ресторана
si: කලාත්මක අවන්හලක ඉඳගෙන සිටින ප්‍රදේශය
sk: Priestor na sedenie v umeleckej reštaurácii
sq: Zonë uljeje në restorant me art
sr: Део за седење у ресторану са уметничком атмосфером
sr_latn: Deo za sedenje u restoranu sa umetničkom atmosferom
sv: Sittplatser på en bohemisk restaurang
te: కళాత్మకంగా ఉన్న రెస్టారెంట్‌లో కూర్చునే ప్రదేశం
th: บริเวณที่นั่งในร้านอาหารซึ่งดูมีศิลปะ
tr: Gösterişli restoran oturma alanı
uk: Інтер'єр модного ресторану
ur: آرٹس ریسٹورنٹ میں بیٹھنے کی جگہ
uz: Ijodkorlar restoranidagi oʻtirish joyi
vi: Khu vực ghế ngồi đậm chất nghệ thuật tại nhà hàng
zh_hk: 藝術風格餐廳的用餐區
zu: Indawo yokuhlala yerestshurenti ye-Artsy

# craneEat4SemanticLabel
source: Chocolate dessert
af: Sjokoladepoeding
am: ቼኮሌት ጣፋጭ ምግብ
ar_eg: حلوى الشوكولاته
as: চকলেটৰ মিষ্টান্ন
az: Şokolad deserti
be: Шакаладны дэсерт
bn: চকোলেট ডেজার্ট
bs: Čokoladni desert
ca: Postres de xocolata
da: Dessert med chokolade
es_ar: Postre de chocolate
et: Šokolaadimagustoit
eu: Txokolatezko postrea
fa: دسر شکلاتی
fil: Panghimagas na gawa sa tsokolate
fr_ca: Dessert au chocolat
gl: Sobremesa con chocolate
gu: ચોકલેટ ડેઝર્ટ
he: קינוח משוקולד
hi: चॉकलेट से बनी मिठाई
hu: Csokoládés desszert
hy: Շոկոլադե աղանդեր
id: Makanan penutup berbahan cokelat
it: Dolce al cioccolato
ja: チョコレート デザート
ka: შოკოლადის დესერტი
km: បង្អែម​សូកូឡា
kn: ಚಾಕೊಲೇಟ್ ಡೆಸರ್ಟ್
ko: 초콜릿 디저트
ky: Шоколаддан жасалган десерт
lo: ຂອງຫວານຊັອກໂກແລັດ
lt: Šokoladinis desertas
lv: Šokolādes deserts
mk: Чоколаден десерт
ml: ചോക്ലേറ്റ് ഡിസേർട്ട്
mn: Шоколадтай амттан
mr: चॉकलेट डेझर्ट
ms: Pencuci mulut coklat
my: ချောကလက် အချိုပွဲ
nb: Sjokoladedessert
ne: चकलेट डेजर्ट
pa: ਚਾਕਲੇਟ ਸਮਾਪਨ ਪਕਵਾਨ
pl: Deser czekoladowy
pt: Sobremesa de chocolate
pt_pt: Sobremesa de chocolate
ro: Desert cu ciocolată
ru: Шоколадный десерт
si: චොකොලට් අතුරුපස
sk: Čokoládový dezert
sq: Ëmbëlsirë me çokollatë
sr: Чоколадни десерт
sr_latn: Čokoladni desert
sv: Chokladdessert
te: చాక్లెట్ డెసర్ట్
th: ของหวานที่เป็นช็อกโกแลต
tr: Çikolatalı tatlı
uk: Шоколадний десерт
ur: چاکلیٹ سے بنی مٹھائی
uz: Shokoladli desert
vi: Món tráng miệng làm từ sô-cô-la
zh_hk: 朱古力甜品
zu: Isidlo sokwehlisa soshokoledi

# craneEat3SemanticLabel
source: Korean taco
af: Koreaanse taco
am: የኮሪያ ታኮ
ar_eg: وجبة التاكو الكورية
as: কোৰিয়ান টাক’
az: Koreya takosu
be: Така па-карэйскі
bn: কোরিয়ান ট্যাকো
bs: Korejski tako
ca: Taco coreà
da: Koreansk taco
es_ar: Taco coreano
et: Korea tako
eu: Tako korear bat
fa: تاکوی کره‌ای
fr_ca: Taco coréen
gl: Taco coreano
gu: કોરિયન ટાકો
he: טאקו בסגנון קוריאני
hi: कोरियन टाको
hu: Koreai taco
hy: Կորեական տակո
id: Taco korea
it: Taco coreano
ja: 韓国風タコス
ka: კორეული ტაკო
km: តាកូ​កូរ៉េ
kn: ಕೊರಿಯನ್ ಟ್ಯಾಕೋ
ko: 한국식 타코
ky: Корей такосу
lo: ທາໂຄເກົາຫລີ
lt: Korėjietiškas tako
lv: Korejas tako
mk: Корејско тако
ml: കൊറിയൻ ടാക്കോ
mn: Солонгос тако
mr: कोरियन टाको
ms: Taco Korea
my: ကိုးရီးယား တာကို
nb: Koreansk taco
ne: कोरियाली टाको
pa: ਕੋਰੀਆਈ ਟੈਕੋ
pl: Koreańskie taco
pt: Taco coreano
pt_pt: Taco coreano
ro: Taco coreean
ru: Тако по-корейски
si: කොරියානු ටාකෝ
sk: Kórejské taco
sq: Tako koreane
sr: Корејски такос
sr_latn: Korejski takos
sv: Koreansk taco
te: కొరియన్ టాకో
th: ทาโก้แบบเกาหลี
tr: Kore takosu
uk: Корейське тако
ur: کوریائی ٹیکو
uz: Koreyscha tako
vi: Món taco của Hàn Quốc
zh_hk: 韓式玉米捲
zu: I-Korean taco

# craneFly3SemanticLabel
source: Machu Picchu citadel
af: Machu Picchu-sitadel
am: የማቹ ፒቹ ምሽግ
ar_eg: قلعة ماتشو بيتشو
as: মাচু পিচু চিটাডেল
az: Maçu Pikçu qalası
be: Цытадэль Мачу-Пікчу
bn: মাচু পিচ্চু দুর্গ
bs: Tvrđava Machu Picchu
ca: Ciutadella de Machu Picchu
es_ar: Ciudadela de Machu Picchu
et: Machu Picchu kadunud linn
eu: Machu Picchuko hiria
fa: قلعه ماچو پیچو
fil: Citadel ng Machu Picchu
fr_ca: Citadelle du Machu Picchu
gl: Cidadela de Machu Picchu
gu: માચુ પિચ્ચુનો રાજગઢ
he: המבצר במאצ'ו פיצ'ו
hi: माचू पिच्चू सिटडल
hu: A Machu Picchu fellegvára
hy: Մաչու Պիչու ամրոց
id: Benteng Machu Picchu
it: Cittadella di Machu Picchu
ja: マチュピチュの砦
ka: მაჩუ-პიქჩუს ციტადელი
km: ប្រាសាទ​នៅ​ម៉ាឈូភីឈូ
kn: ಮಾಚು ಪಿಚು ಸಿಟಾಡೆಲ್
ko: 마추픽추 시타델
ky: Мачу-Пичу цитадели
lo: ປ້ອມມາຊູປິກຊູ
lt: Maču Pikču tvirtovė
lv: Maču Pikču citadele
mk: Тврдината Мачу Пикчу
ml: മാച്ചു പിച്ചു സിറ്റാഡെൽ
mn: Мачу Пикчу хэрэм
mr: माचू पिचू बालेकिल्ला
ms: Kubu kota Machu Picchu
my: မာချူ ပီချူ ခံတပ်
nb: Machu Picchu-festningen
ne: माचू पिक्चूको गढी
pa: ਮਾਚੂ ਪਿਕਚੂ ਕਿਲ੍ਹਾ
pl: Cytadela Machu Picchu
pt: Cidadela de Machu Picchu
pt_pt: Cidadela de Machu Picchu
ro: Cetatea Machu Picchu
ru: Крепость Мачу-Пикчу
si: මාචු පිච්චු බළකොටුව
sk: Citadela Machu Picchu
sq: Qyteti i Maçu Piçut
sr: Тврђава у Мачу Пикчуу
sr_latn: Tvrđava u Maču Pikčuu
sv: Machu Picchu
te: మాచు పిచ్చు, సిటాడెల్
th: ป้อมมาชูปิกชู
tr: Machu Picchu kalesi
uk: Цитадель Мачу-Пікчу
ur: ماچو پیچو کا قلعہ
uz: Machu Pikchu qalʼasi
vi: Thành cổ Machu Picchu
zh_hk: 古城馬丘比丘
zu: I-Machu Picchu citadel

# craneEat1SemanticLabel
source: Empty bar with diner-style stools
af: Leë kroeg met padkafeetipe stoele
am: ባዶ መጠጥ ቤት ከመመገቢያ ዓይነት መቀመጫዎች ጋር
ar_eg: بار فارغ وكراسي مرتفعة للزبائن
as: ভোজনৰ সময়ত ব্যৱহৃত শৈলীৰ টুলৰ সৈতে খালী বাৰ
az: Bar oturacaqları olan boş bar
be: Пусты бар з круглымі барнымі крэсламі
bn: ডিনার স্টাইলের চেয়ারের সাথে খালি বার
bs: Prazan bar s barskim stolicama
ca: Bar buit amb tamborets d'estil americà
da: Tom bar med dinerstole
es_ar: Bar vacío con banquetas estilo cafetería
et: Tühi baar ja baaripukid
eu: Amerikar estiloko taberna bat hutsik
fa: میخانه خالی با چارپایه‌های غذاخوری
fil: Walang taong bar na may mga upuang pang-diner
fr_ca: Bar vide avec tabourets de style salle à manger
gl: Bar baleiro con tallos
gu: ડાઇનર-સ્ટાઇલ સ્ટૂલવાળો ખાલી બાર
he: בר ריק עם שרפרפים בסגנון דיינר
hi: डाइनर-स्टाइल स्टूल वाला खाली बार
hu: Üres bár vendéglőkben használatos bárszékekkel
hy: Բարձր աթոռներով դատարկ բառ
id: Bar kosong dengan bangku bergaya rumah makan
it: Locale vuoto con sgabelli in stile diner
ja: ダイナー スタイルのスツールが置かれた誰もいないバー
ka: ცარიელი ბარი სასადილოს სტილის სკამებით
km: បារគ្មាន​មនុស្ស ដែលមាន​ជើងម៉ា​សម្រាប់អង្គុយទទួលទាន​អាហារ
kn: ಡೈನರ್ ಶೈಲಿಯ ಸ್ಟೂಲ್‌ಗಳನ್ನು ಹೊಂದಿರುವ ಖಾಲಿ ಬಾರ್
ko: 다이너식 스툴이 있는 빈 술집
ky: Жеңил тамак ичүүгө арналган бийик отургучтар коюлган бош бар
lo: ບາທີ່ບໍ່ມີລູກຄ້າເຊິ່ງມີຕັ່ງນັ່ງແບບສູງແຕ່ບໍ່ມີພະນັກ
lt: Tuščias baras su aukštomis baro kėdėmis
lv: Tukšs bārs ar augstiem krēsliem
mk: Празен шанк со столици во стилот на американските ресторани
ml: ഡിന്നർ സ്‌റ്റൈൽ സ്‌റ്റൂളുകളുള്ള ആളൊഴിഞ്ഞ ബാർ
mn: Хоолны сандалтай хоосон уушийн газар
mr: डिनर स्टाइल स्टुल असलेला रिकामा बार
ms: Bar kosong dengan bangku gaya makan malam
my: ညစာစားရာတွင် အသုံးပြုသည့်ခုံပုံစံများဖြင့် လူမရှိသောအရက်ဆိုင်
nb: Tom bar med kafékrakker
ne: डाइनर शैलीका स्टूलहरू राखिएको खाली बार
pa: ਰਾਤ ਦੇ ਖਾਣੇ ਵਾਲੇ ਸਟੂਲਾਂ ਦੇ ਨਾਲ ਖਾਲੀ ਬਾਰ
pl: Pusty bar ze stołkami barowymi
pt: Balcão vazio com banquetas
pt_pt: Bar vazio com bancos ao estilo de um diner americano
ro: Bar gol cu scaune de tip bufet
ru: Пустой бар с высокими стульями
si: රාත්‍ර ආහාර ගන්නා ආකාරයේ බංකු සහිත හිස් තැබෑරුම
sk: Prázdny bar so stoličkami v bufetovom štýle
sq: Bar i zbrazur me stola në stil restoranti
sr: Празан бар са високим барским столицама
sr_latn: Prazan bar sa visokim barskim stolicama
sv: Tom bar med höga pallar i dinerstil
te: డైనర్‌లో ఉండే లాటి స్టూల్‌లతో ఖాళీ బార్
th: บาร์ที่ไม่มีลูกค้าซึ่งมีม้านั่งสูงแบบไม่มีพนัก
tr: Restoran tarzı taburelerle boş bar
uk: Безлюдний бар із високими стільцями
ur: کھانے کے اسٹولز کے ساتھ خالی بار
uz: Baland stullari bor boʻsh bar
vi: Quầy bar không người với những chiếc ghế đẩu chuyên dùng trong bar
zh_hk: 只有空櫈的酒吧無人光顧
zu: Ibha engenalutho enezitulo zesitayela sedina
