Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoOutlinedButtonDescription
source: Outlined buttons become opaque and elevate when pressed. They are often paired with raised buttons to indicate an alternative, secondary action.
af: Buitelynknoppies word ondeursigtig en verhewe wanneer hulle gedruk word. Hulle word dikwels met verhewe knoppies saamgebind om 'n alternatiewe, sekondêre handeling aan te dui.
am: የቢጋር አዝራሮች የማያሳዩ ይሆኑና በሚጫኑበት ጊዜ ከፍ ይላሉ። አማራጭን፣ ሁለተኛ እርምጃን ለመጠቆም ብዙውን ጊዜ ከፍ ካሉ አዝራሮች ጋር ይጣመራሉ።
ar_eg: تصبح الأزرار المحدَّدة الجوانب غير شفافة وترتفع عند الضغط عليها. وغالبًا ما يتم إقرانها مع الأزرار البارزة للإشارة إلى إجراء ثانوي بديل.
as: বৰ্হিৰেখাযুক্ত বুটাম টিপিলে অস্বচ্ছ আৰু উঠঙা হয়। সেইবোৰক সততে এটা বৈকল্পিক গৌণ কাৰ্য সূচাবলৈ উঠঙা বুটামৰ সৈতে পেয়াৰ কৰা হয়।
az: Haşiyəli düymələrə basdıqda qeyri-şəffaf və qabarıq olurlar. Onlar, adətən, alternativ, ikinci dərəcəli əməliyyatı göstərmək üçün qabarıq düymələrlə birləşdirilir.
be: Кнопкі з контурамі цямнеюць і падымаюцца ўгору пры націсканні. Яны часта спалучаюцца з выпуклымі кнопкамі для вызначэння альтэрнатыўнага, другаснага дзеяння.
bn: আউটলাইন করা বোতাম প্রেস করলে অস্বচ্ছ হয়ে বড় হয়ে যায়। সেটি প্রায়ই একটি বিকল্প সেকেন্ডারি অ্যাকশন নির্দেশ করতে বড় হওয়া বোতামের সাথে ব্যবহার হয়।
bs: Ocrtana dugmad postaju neprozirna i podižu se kada se pritisnu. Obično se uparuju s izdignutom dugmadi kako bi se ukazalo na alternativnu, sekundarnu radnju.
ca: Els botons perfilats es tornen opacs i s'eleven en prémer-los. Normalment estan vinculats amb botons amb relleu per indicar una acció secundaria o alternativa.
da: Konturknapper bliver uigennemsigtige og hæves, når der trykkes på dem. De kombineres ofte med hævede knapper for at angive en alternativ, sekundær handling.
es_ar: Los botones con contorno se vuelven opacos y se elevan cuando se los presiona. A menudo, se combinan con botones con relieve para indicar una acción secundaria alternativa.
et: Mitmetasandilised nupud muutuvad vajutamisel läbipaistvaks ja tõusevad ülespoole. Need seotakse sageli tõstetud nuppudega, et pakkuda alternatiivset (teisest) toimingut.
eu: Botoi ingeradadunak opaku bihurtu eta goratu egiten dira sakatzean. Botoi goratuekin batera agertu ohi dira, ekintza alternatibo edo sekundario bat dagoela adierazteko.
fa: دکمه‌های برون‌نما هنگام فشار دادن مات می‌شوند و بالا می‌آیند. این دکمه‌ها معمولاً با دکمه‌های برجسته مرتبط می‌شوند تا کنشی فرعی و جایگزین را نشان دهند.
fil: Magiging opaque at aangat ang mga button na may outline kapag pinindot. Kadalasang isinasama ang mga ito sa mga nakaangat na button para magsaad ng alternatibo at pangalawang pagkilos.
fr_ca: Les boutons avec contours deviennent opaques et s'élèvent lorsqu'on appuie sur ceux-ci. Ils sont souvent utilisés en association avec des boutons surélevés pour indiquer une autre action, secondaire.
gl: Os botóns con contorno vólvense opacos e elévanse ao premelos. Adoitan estar emparellados con botóns con relevo para indicar unha acción secundaria e alternativa.
gu: આઉટલાઇન બટન દબાવવા પર અપારદર્શી બને છે અને તે ઉપસી આવે છે. વૈકલ્પિક, ગૌણ ક્રિયા બતાવવા માટે અવારનવાર ઉપસેલા બટન સાથે તેનું જોડાણ બનાવવામાં આવે છે.
he: לחצנים מודגשים הופכים לאטומים ובולטים כשלוחצים עליהם. בדרך כלל, מבוצעת להם התאמה עם לחצנים בולטים כדי לציין פעולה חלופית משנית.
hi: आउटलाइन वाले बटन दबाने पर धुंधले हो जाते हैं और ऊपर की ओर उठ जाते हैं. इन्हें वैकल्पिक तौर पर, दूसरी कार्रवाई के रूप में अक्सर उभरे हुए बटन के साथ जोड़ा जाता है.
hu: A körülrajzolt gombok átlátszatlanok és kiemelkedők lesznek, ha megnyomják őket. Gyakran kapcsolódnak kiemelkedő gombokhoz, hogy alternatív, másodlagos műveletet jelezzenek.
hy: Ուրվագծային կոճակները սեղմելիս դառնում են անթափանց և բարձրանում են։ Դրանք հաճախ օգտագործվում են բարձրացված կոճակների հետ՝ որևէ լրացուցիչ, այլընտրանքային գործողություն ընդգծելու համար։
id: Tombol outline akan menjadi buram dan terangkat saat ditekan. Tombol tersebut sering dipasangkan dengan tombol timbul untuk menandakan tindakan kedua dan alternatif.
it: I pulsanti con contorni diventano opachi e sollevati quando vengono premuti. Sono spesso associati a pulsanti in rilievo per indicare azioni secondarie alternative.
ja: アウトライン ボタンは、押すと不透明になり、浮き上がります。通常は、浮き出しボタンと組み合わせて、代替のサブアクションを提示します。
ka: კონტურიან ღილაკებზე დაჭერისას ისინი ხდება გაუმჭვირვალე და ამოიწევა. ისინი ხშირად წყვილდება ამოწეულ ღილაკებთან ალტერნატიული, მეორეული ქმედების მისანიშნებლად.
km: ប៊ូតុង​មានបន្ទាត់ជុំវិញ​ប្រែជា​ស្រអាប់ និង​ផុសឡើង​នៅពេលចុច។ ជាញឹកញាប់ ប៊ូតុងទាំងនេះត្រូវបានដាក់ជាគូជាមួយប៊ូតុងផុសឡើង ដើម្បីរំលេចសកម្មភាពបន្ទាប់បន្សំផ្សេង។
kn: ಔಟ್‌ಲೈನ್ ಮಾಡಲಾದ ಬಟನ್‌ಗಳು ಅಪಾರದರ್ಶಕವಾಗಿರುತ್ತವೆ ಮತ್ತು ಒತ್ತಿದಾಗ ಏರಿಕೆಯಾಗುತ್ತವೆ. ಪರ್ಯಾಯ ಮತ್ತು ದ್ವಿತೀಯ ಕಾರ್ಯವನ್ನು ಸೂಚಿಸಲು ಅವುಗಳನ್ನು ಹೆಚ್ಚಾಗಿ ಉಬ್ಬುವ ಬಟನ್‌ಗಳ ಜೊತೆಗೆ ಜೋಡಿಸಲಾಗುತ್ತದೆ.
ko: 윤곽 버튼은 누르면 불투명해지면서 돌출됩니다. 돌출 버튼과 함께 사용하여 대체 작업이나 보조 작업을 나타내는 경우가 많습니다.
ky: Контурланган баскычтар басылганда алар тунук эмес болуп, көтөрүлүп калат. Алар көп учурда көтөрүлгөн баскычтар менен жупташтырылып, альтернативдүү жана кошумча аракетти билдирет.
lo: ປຸ່ມມີຂອບຈະເປັນສີທຶບ ແລະ ຍົກຂຶ້ນເມື່ອກົດໃສ່. ມັກຈະຈັບຄູ່ກັບປຸ່ມແບບຍົກຂຶ້ນເພື່ອລະບຸວ່າມີການດຳເນີນການສຳຮອງຢ່າງອື່ນ.
lt: Paspaudus kontūrinius mygtukus jie tampa neskaidrūs ir pakyla. Jie dažnai teikiami su iškiliaisiais mygtukais norint nurodyti alternatyvų, antrinį veiksmą.
lv: Konturētas pogas nospiežot kļūst necaurspīdīgas un paceļas. Tās bieži tiek lietotas kopā ar paaugstinātām pogām, lai norādītu alternatīvu, sekundāru darbību.
mk: Копчињата со контура стануваат непроѕирни и се подигнуваат кога ќе ги притиснете. Честопати се спаруваат со подигнатите копчиња за да означат алтернативно секундарно дејство.
ml: ഔട്ട്ലൈൻഡ് ബട്ടണുകൾ മങ്ങുകയും അമർത്തുമ്പോൾ ഉയരുകയും ചെയ്യും. ഒരു ഇതര, ദ്വിതീയ പ്രവർത്തനം സൂചിപ്പിക്കുന്നതിന് അവ പലപ്പോഴും ഉയർന്നിരിക്കുന്ന ബട്ടണുകളുമായി ജോടിയാക്കുന്നു.
mn: Хүрээтэй товчлуурыг дарсан үед тодорч, дээшилдэг. Нэмэлт сонголт болон хоёрдогч үйлдлийг заахын тулд тэдгээрийг ихэвчлэн өргөгдсөн товчлууртай хослуулдаг.
mr: आउटलाइन्ड बटणे दाबल्यानंतर अपारदर्शक होतात आणि वर उचचली जातात. एखादी पर्यायी, दुसरी क्रिया दाखवण्यासाठी ते सहसा उंच बटणांसोबत जोडली जातात.
ms: Butang garis kasar menjadi legap dan terangkat apabila ditekan. Butang ini sering digandingkan dengan butang timbul untuk menunjukkan tindakan sekunder alternatif.
my: ဘောင်မျဉ်းခတ်ခြင်း ခလုတ်များကို နှိပ်လိုက်သည့်အခါ ဖျော့သွားပြီး မြှင့်တက်လာသည်။ ကွဲပြားသည့် ဒုတိယလုပ်ဆောင်ချက်တစ်ခုကို ဖော်ပြရန် ၎င်းတို့ကို ခလုတ်မြင့်များနှင့် မကြာခဏ တွဲထားလေ့ရှိသည်။
nb: Knapper med omriss blir ugjennomsiktige og heves når de trykkes. De er ofte koblet til hevede knapper for å indikere en alternativ, sekundær handling.
ne: आउटलाइनयुक्त बटनहरू अपारदर्शी बन्छन् र थिच्दा माथि उठ्छन्। यिनीहरूलाई वैकल्पिक र सहायक कार्यको सङ्केत दिन प्रायः माथि उठेका बटनहरूसँग जोडा बनाइन्छ।
pa: ਖਾਕਾਬੱਧ ਬਟਨ ਦਬਾਏ ਜਾਣ 'ਤੇ ਧੁੰਦਲੇ ਹੋ ਜਾਂਦੇ ਹਨ ਅਤੇ ਉੱਪਰ ਉੱਠਦੇ ਹਨ। ਵਿਕਲਪਿਕ, ਸੈਕੰਡਰੀ ਕਾਰਵਾਈ ਦਰਸਾਉਣ ਲਈ ਉਹਨਾਂ ਨੂੰ ਅਕਸਰ ਉੱਭਰੇ ਹੋਏ ਬਟਨਾਂ ਨਾਲ ਜੋੜਾਬੱਧ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।
pl: Przyciski z konturem stają się nieprzezroczyste i podnoszą się po naciśnięciu. Często występują w parze z przyciskami podniesionymi, by wskazać działanie alternatywne.
pt: Botões circunscritos ficam opacos e elevados quando pressionados. Geralmente, são combinados com botões em relevo para indicar uma ação secundária e alternativa.
pt_pt: Os botões de contorno ficam opacos e são elevados quando premidos. Muitas vezes, são sincronizados com botões em relevo para indicar uma ação secundária alternativa.
ro: Butoanele conturate devin opace și se ridică la apăsare. Sunt de multe ori asociate cu butoane ridicate, pentru a indica o acțiune secundară alternativă.
ru: Контурные кнопки при нажатии становятся непрозрачными и поднимаются. Часто они используются вместе с приподнятыми кнопками, чтобы обозначить альтернативное, дополнительное действие.
si: වැටිසන යෙදූ බොත්තම් එබූ විට අපැහැදිලි වන අතර එසවේ. ඒවා නිතර විකල්ප, ද්විතීයික ක්‍රියාවක් දැක්වීමට එසවූ බොත්තම් සමග යුගල වේ.
sk: Tlačidlá s obrysom sa po stlačení zmenia na nepriehľadné a zvýšia sa. Často sú spárované so zvýšenými tlačidlami na označenie alternatívnej sekundárnej akcie.
sq: Butonat me kontur bëhen të patejdukshëm dhe ngrihen kur shtypen. Shpesh ata çiftohen me butonat e ngritur për të treguar një veprim alternativ dytësor.
sr: Оивичена дугмад постаје непрозирна и подиже се када се притисне. Обично се упарује заједно са издигнутом дугмади да би означила алтернативну, секундарну радњу.
sr_latn: Oivičena dugmad postaje neprozirna i podiže se kada se pritisne. Obično se uparuje zajedno sa izdignutom dugmadi da bi označila alternativnu, sekundarnu radnju.
sv: Konturknappar blir ogenomskinliga och höjs vid tryck. De visas ofta tillsammans med upphöjda knappar som pekar på en alternativ, sekundär åtgärd.
te: రూపకల్పన ఉన్న బటన్‌లు అపారదర్శకంగా మారతాయి, నొక్కినప్పుడు ప్రకాశవంతం అవుతాయి. ప్రత్యామ్నాయ, ద్వితీయ చర్యను సూచించడానికి అవి తరచుగా ముందుకు వచ్చిన బటన్‌లతో పెయిర్ చేయబడతాయి.
th: ปุ่มแบบเติมขอบจะเปลี่ยนเป็นสีทึบและยกขึ้นเมื่อกด มักจับคู่กับปุ่มแบบยกขึ้นเพื่อระบุว่ามีการดำเนินการสำรองอย่างอื่น
tr: Dış çizgili düğmeler basıldığında opak olur ve yükselir. Alternatif, ikincil işlemi belirtmek için genellikle yükseltilmiş düğmelerle eşlenirler.
uk: Кнопки з контуром стають прозорими й піднімаються, якщо їх натиснути. Зазвичай їх використовують з опуклими кнопками для позначення альтернативних і другорядних дій.
ur: آؤٹ لائن والے بٹنز کے دبائے جانے پر وہ دھندلے اور بلند ہو جاتے ہیں۔ یہ متبادل، ثانوی کاروائی کی نشاندہی کرنے کے لیے اکثر ابھرے ہوئے بٹنز کے ساتھ جوڑے جاتے ہیں۔
uz: Chegarali tugmani bosganda shaffof boʻladi va koʻtariladi. Ular odatda qavariq tugmalar bilan biriktiriladi va ikkinchi harakat, yaʼni muqobilini koʻrsatish uchun ishlatiladi.
vi: Các nút có đường viền sẽ mờ đi rồi hiện rõ lên khi nhấn. Các nút này thường xuất hiện cùng các nút lồi để biểu thị hành động phụ, thay thế.
zh_hk: 外框按鈕會在使用者按下時轉為不透明並升起。這類按鈕通常會與凸起的按鈕一同使用，用於指出次要的替代動作。
zu: Izinkinobho ezichaziwe ziba i-opaque ziphinde ziphakame uma zicindezelwa. Zivamise ukubhangqwa nezinkinobho eziphakanyisiwe ukuze zibonise esinye isenzo, sesibili.

# demoContainerTransformDemoInstructions
source: Cards, Lists & FAB
af: Kaarte, lyste en sweefhandelingknoppie
am: ካርዶች፣ ዝርዝሮች እና FAB
ar_eg: البطاقات والقوائم وأزرار الإجراءات الرئيسية (FAB)
as: কাৰ্ড, সূচী আৰু FAB
az: Kartlar, Siyahılar və FAB
be: Карткі, спісы і рухомая кнопка дзеяння
bn: কার্ড, তালিকা ও এফএবি
bs: Kartice, liste i FAB
ca: Targetes, llistes i BAF
da: Kort, lister og svævende handlingsknap
es_ar: Tarjetas, Listas y BAF
et: Kaardid, loendid ja hõljuv toimingunupp
eu: Txartelak, zerrendak eta EBG
fa: کارت‌ها، فهرست‌ها، و دکمه کنش شناور
fil: Mga Card, Listahan, at FAB
fr_ca: Cartes, listes et bouton d'action flottant
gl: Tarxetas, listas e botón de acción flotante
gu: કાર્ડ, સૂચિઓ, અને FAB
he: כרטיסים, רשימות ולחצני FAB
hi: कार्ड, सूची, और फ़्लोट करने वाला कार्रवाई बटन (एफ़एबी)
hu: Kártyák, listák és lebegő műveletgomb
hy: Քարտեր, ցանկեր և գործողության լողացող կոճակներ
id: Kartu, Daftar & FAB
it: Schede, elenchi e FAB
ja: カード、リスト、フローティング操作ボタン（FAB）
ka: ბარათები, სიები და მოქმედების მოლივლივე ღილაკი
km: កាត បញ្ជី និង FAB
kn: ಕಾರ್ಡ್‌ಗಳು, ಪಟ್ಟಿಗಳು & FAB
ko: 카드, 목록 및 FAB
ky: Кыйытмалар, тизмелер жана КАБ
lo: ບັດ, ລາຍຊື່ ແລະ FAB
lt: Kortelės, sąrašai ir SVM
lv: Kartītes, saraksti un PDP
mk: Картички, списоци и лебдечко копче за дејство
ml: കാർഡുകൾ, ലിസ്‌റ്റുകൾ, FAB
mn: Карт, Жагсаалт болон FAB
mr: कार्ड, सूची आणि FAB
ms: Kad, Senarai & FAB
my: ကတ်၊ စာရင်းနှင့် FAB များ
nb: Kort, lister og svevende handlingsknapper
ne: कार्ड, सूची र FAB
pa: ਕਾਰਡ, ਸੂਚੀਆਂ ਅਤੇ FAB
pl: Karty, listy i przyciski typu FAB
pt: Cards, listas e FAB
pt_pt: Cartões, listas de BAFs
ro: Carduri, Liste și Butonul de acțiune flotant
ru: Подсказки, списки и плавающие кнопки действия
si: කාඩ්පත්, ලැයිස්තු සහ FAB
sk: Karty, zoznamy a plávajúce tlačidlo akcie
sq: Kartat, listat dhe FAB
sr: Картице, листе и плутајуће дугме за радњу
sr_latn: Kartice, liste i plutajuće dugme za radnju
sv: Kort, listor och flytande åtgärdsknapp
te: కార్డ్‌లు, లిస్ట్‌లు & FAB
th: การ์ด รายการ และ FAB
tr: Kartlar, Listeler ve FAB
uk: Картки, списки й плаваючі командні кнопки
ur: کارڈز، فہرستیں اور FAB
uz: Bildirgilar, roʻyxatlar va suzuvchi harakat tugmalari
vi: Thẻ, danh sách và FAB
zh_hk: 資訊卡、清單和懸浮動作按鈕
zu: Amakhadi, Izinhla ne-FAB

# demoNavigationDrawerSubtitle
source: Displaying a drawer within appbar
af: Wys 'n laai binne programbalk
am: በመተግበሪያ አሞሌ ውስጥ መሳቢያ በማሳየት ላይ
ar_eg: عرض لائحة تنقّل في شريط التطبيق
as: এপ্‌বাৰৰ ভিতৰত এটা ড্ৰৱাৰ দেখুওৱা হৈছে
az: Tətbiq panelinin içində çəkməcə göstərilir
be: Паказ высоўнага меню на панэлі праграм
bn: অ্যাপ বারে একটি ড্রয়ার দেখানো হচ্ছে
bs: Prikaz panela unutar trake s aplikacijama
ca: Es mostra un tauler a la barra d'aplicacions
da: Viser en skuffe i en appbjælke
es_ar: Cómo mostrar un panel lateral dentro de la barra de la app
et: Sahtli kuvamine rakenduste ribal
eu: Panel lerrakor bat bistaratzen du aplikazio-barraren barruan
fa: کشویی در نوار برنامه نمایش می‌دهد
fil: Nagpapakita ng drawer sa appbar
fr_ca: Affichage d'un panneau dans la barre d'applications
gl: Móstrase un panel dentro dunha barra de aplicacións
gu: ઍપ બારની અંદર ડ્રોઅર બતાવે છે
he: הצגת חלונית הזזה בסרגל אפליקציה
hi: ऐप्लिकेशन बार के अंदर दिखता हुआ पैनल
hu: Fiók megjelenítése az alkalmazássávon belül
hy: Դարակի ցուցադրում հավելվածի գոտում
id: Menampilkan panel samping dalam panel aplikasi
it: Visualizzare un riquadro a scomparsa all'interno della barra delle applicazioni
ja: アプリバー内にドロワーを表示する
ka: ნაჩვენებია უჯრა აპების ზოლში
km: ការបង្ហាញថត​នៅក្នុងរបារកម្មវិធី
kn: appbar ನ ಒಳಗಡೆ ಡ್ರಾಯರ್ ಅನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡಲಾಗುತ್ತಿದೆ
ko: 앱 바 안에 창 표시
ky: Суурма колдонмонун тилкесинде көрсөтүлүүдө
lo: ການສະແດງລິ້ນຊັກພາຍໃນແຖບແອັບ
lt: Rodomas skydelis programų juostoje
lv: Atvilktnes rādīšana lietotņu joslā
mk: Се прикажува фиока во лента за апликации
ml: ആപ്പ് ബാറിനുള്ളിൽ ഒരു ഡ്രോയർ പ്രദർശിപ്പിക്കുന്നു
mn: Appbar дахь шургуулгыг харуулж байна
mr: अ‍ॅपबारमध्ये ड्रॉवर दाखवत आहे
ms: Memaparkan laci dalam bar apl
my: အက်ပ်ဘားအတွင်းရှိ အံဆွဲကို ပြသခြင်း
nb: Viser en uttrekksmeny i appraden
ne: एपबारभित्र देखिने ड्रअर
pa: ਦਰਾਜ਼ ਨੂੰ ਐਪ ਪੱਟੀ 'ਤੇ ਦਿਖਾਇਆ ਜਾ ਰਿਹਾ ਹੈ
pl: Wyświetla panel na pasku w aplikacji
pt: Exibindo uma gaveta em uma appbar
pt_pt: Apresentar uma gaveta na barra de apps
ro: Afișarea unui panou în bara de aplicații
ru: Показ выдвигающейся панели на панели приложения
si: යෙදුම් තීරුව ඇතුළත ලාච්චුවක් සංදර්ශනය කිරීම
sk: Zobrazuje sa vysúvací panel v rámci panela aplikácií
sq: Shfaqja e një sirtari brenda rreshtit të aplikacioneve
sr: Приказује фиоку на траци са апликацијама
sr_latn: Prikazuje fioku na traci sa aplikacijama
sv: Visar en panel i appfältet
te: యాప్‌బార్‌లో డ్రాయర్‌ను ప్రదర్శిస్తోంది
th: การแสดงลิ้นชักภายในแถบแอป
tr: Uygulama çubuğunda çekmece görüntüleme
uk: Показується панель навігації в додатку
ur: ایپ بار کے اندر موجود دراز کو ڈسپلے کیا جا رہا ہے
uz: Ilovalar panelida tortma panelni chiqarish
vi: Hiển thị một ngăn trong thanh ứng dụng
zh_hk: 在應用程式列中顯示導覽列
zu: Ibonisa ikhabethe ngaphakathi kwebha yohlelo lokusebenza

# replyDescription
source: An efficient, focused email app
af: 'n Doeltreffende, gefokusde e-posprogram
am: ቀልጣፋ፣ የተተኮረበት የኢሜይል መተግበሪያ
ar_eg: تطبيق بريد إلكتروني مخصّص وفعّال
as: এটা দক্ষ, দৃষ্টি নিবদ্ধ ইমেইল এপ্‌
az: Effektiv, fokuslanmış e-poçt tətbiqi
be: Эфектыўная спецыялізаваная праграма электроннай пошты
bn: একটি কার্যকরী, দক্ষ ইমেল অ্যাপ
bs: Efikasna, fokusirana aplikacija za e-poštu
ca: Una aplicació de correu electrònic centrada i eficient
da: En effektiv og smart mailapp
es_ar: Una app de correo electrónico especializada y eficiente
et: Tõhus ja pühendatud meilirakendus
eu: Posta-aplikazio eraginkor eta ardaztua
fa: برنامه ایمیلی کارآمد و تخصصی
fil: Isang mabilis at nakatuong email app
fr_ca: Une application de courriel efficace et épurée
gl: Unha aplicación de correo electrónico eficaz e sen distraccións
gu: એક અસરકારક, વિશેષ રૂપે કેન્દ્રિત ઇમેઇલ ઍપ
he: אפליקציית אימייל יעילה וממוקדת
hi: कारगर और उपयोगी ईमेल ऐप्लिकेशन
hu: Hatékony, célzott e-mail-alkalmazás
hy: Փոստային հավելված` արդյունավետ հաղորդակցման համար
id: Aplikasi email yang efisien dan fokus
it: Un'app email efficiente e mirata
ja: フォーカスが当てられる、効率性に優れたメールアプリ
ka: ელფოსტის ეფექტური, ფოკუსირებული აპი
km: កម្មវិធី​អ៊ីមែលផ្ដោត ដែលមានប្រសិទ្ធភាព
kn: ಸಮರ್ಥ, ಫೋಕಸ್ ಆಗಿರುವ ಇಮೇಲ್ ಅಪ್ಲಿಕೇಶನ್
ko: 효율적인 이메일 전용 앱
ky: Натыйжалуу жана пайдалуу электрондук почта колдонмосу
lo: ແອັບທີ່ເນັ້ນອີເມວຢ່າງມີປະສິດທິພາບ
lt: Veiksminga, kryptinga el. pašto programa
lv: Efektīva, koncentrēta e-pasta lietotne
mk: Ефикасна и насочена апликација за е-пошта
ml: കാര്യക്ഷമവും എക്‌സ്ക്ലൂസീവുമായ ഇമെയിൽ ആപ്പ്
mn: Үр өгөөжтэй, төвлөрсөн имэйлийн апп
mr: कार्यक्षम, उपयुक्त ईमेल अ‍ॅप
ms: Apl e-mel yang cekap dan fokus
my: အသုံးဝင်သည့် ဦးစားပေး အီးမေးလ်အက်ပ်
nb: En effektiv, fokusert e-post-app
ne: एउटा प्रभावकारी अनि समर्पित इमेल एप
pa: ਨਿਪੁੰਨ, ਫੋਕਸ ਕੀਤੀ ਈਮੇਲ ਐਪ
pl: Przydatna i wygodna aplikacja do poczty e-mail
pt: Um app de e-mails eficiente e focado
pt_pt: Uma app de email eficiente e dedicada
ro: O aplicație pentru e-mail eficientă și utilă
ru: Почтовое приложение для эффективного общения
si: කාර්යක්ෂම, අවධානිත ඉ-තැපැල් යෙදුමක්
sk: Efektívna vyhradená e‑mailová aplikácia
sq: Një aplikacion efikas dhe i fokusuar email-i
sr: Ефикасна, фокусирана апликација за имејл
sr_latn: Efikasna, fokusirana aplikacija za imejl
sv: En effektiv e-postapp som ger fokus
te: సమర్థత కలిగిన, ప్రత్యేకించిన ఈమెయిల్‌ యాప్
th: แอปอีเมลที่ตรงจุดและมีประสิทธิภาพ
tr: Verimli, hedef odaklı bir e-posta uygulaması
uk: Ефективний спеціалізований поштовий додаток
ur: ایک موثر، مرتکز ای میل ایپ
uz: Samarali muloqot uchun email ilovasi
vi: Ứng dụng email tập trung và hiệu quả
zh_hk: 有效率、目標更清晰的電郵應用程式
zu: Uhlelo lokusebenza le-imeyili eligxilile, nelanele
