Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTextFieldKeepItShort
source: Keep it short, this is just a demo.
af: Hou dit kort; dis net 'n demonstrasie.
am: ያሳጥሩት፣ ይህ ማሳያ ብቻ ነው።
ar_eg: يُرجى الاختصار، هذا مجرد عرض توضيحي.
as: এইটো দীঘলীয়া নকৰিব, এইটো এটা ডেম’হে।
az: Qısa edin. Bu, sadəcə nümayişdir.
be: Не пішыце многа – біяграфія павінна быць сціслай.
bn: ছোট রাখুন, এটি শুধুমাত্র একটি ডেমো।
bs: Neka bude kratko, ovo je samo demonstracija.
ca: Sigues breu, es tracta d'una demostració.
da: Vær kortfattet; det her er kun en demo.
es_ar: Sé breve, ya que esta es una demostración.
et: Ärge pikalt kirjutage, see on vaid demo.
eu: Ez luzatu; demo bat baino ez da.
fa: خلاصه‌اش کنید، این فقط یک نسخه نمایشی است.
fil: Panatilihin itong maikli, isa lang itong demo.
fr_ca: Soyez bref, il s'agit juste d'une démonstration.
gl: Sé breve, isto só é unha demostración.
gu: ટૂંકું જ બનાવો, આ માત્ર ડેમો છે.
he: הטקסט צריך להיות קצר, זו רק הדגמה.
hi: इसे संक्षिप्त रखें, यह सिर्फ़ डेमो के लिए है.
hu: Legyen rövid, ez csak egy demó.
hy: Երկար-բարակ պետք չէ գրել, սա ընդամենը տեքստի նմուշ է։
id: Jangan terlalu panjang, ini hanya demo.
it: Usa un testo breve perché è soltanto dimostrativo.
ja: 簡単にご記入ください。これはデモです。
ka: ეცადეთ მოკლე იყოს, ეს მხოლოდ დემოა.
km: សរសេរវាឱ្យខ្លី នេះគ្រាន់តែជា​ការសាកល្បងប៉ុណ្ណោះ។
kn: ಅದನ್ನು ಚಿಕ್ಕದಾಗಿರಿಸಿ, ಇದು ಕೇವಲ ಡೆಮೊ ಆಗಿದೆ.
ko: 데모이므로 간결하게 적으세요.
ky: Кыскараак жазыңыз. Бул болгону демо версия.
lo: ຂຽນສັ້ນໆເພາະນີ້ເປັນພຽງການສາທິດ.
lt: Rašykite trumpai, tai tik demonstracinė versija.
lv: Veidojiet to īsu, šī ir tikai demonstrācijas versija.
mk: Нека биде кратко, ова е само пример.
ml: ചെറുതാക്കി വയ്ക്കൂ, ഇത് കേവലം ഒരു ഡെമോ മാത്രമാണ്.
mn: Энэ нь ердөө демо тул үүнийг товч байлгаарай.
mr: ते लहान ठेवा, हा फक्त डेमो आहे.
ms: Ringkaskan, teks ini hanya demo.
my: လိုရင်းတိုရှင်းထားပါ၊ ဤသည်မှာ သရုပ်ပြချက်သာဖြစ်သည်။
nb: Hold det kort. Dette er bare en demo.
ne: कृपया धेरै लामो नलेख्नुहोस्, यो एउटा डेमो मात्र हो।
pa: ਇਸਨੂੰ ਛੋਟਾ ਰੱਖੋ, ਇਹ ਸਿਰਫ਼ ਡੈਮੋ ਹੈ।
pl: Nie rozpisuj się – to tylko wersja demonstracyjna.
pt: Seja breve. Isto é apenas uma demonstração.
pt_pt: Seja breve, é apenas uma demonstração.
ro: Folosiți un text scurt, aceasta este o demonstrație.
ru: Не пишите много, это только пример.
si: එය කෙටියෙන් සිදු කරන්න, මෙය හුදෙක් අනතුරු ආදර්ශනයකි.
sk: Napíšte stručný text. Toto je iba ukážka.
sq: Mbaje të shkurtër, është thjesht demonstrim.
sr: Нека буде кратко, ово је само демонстрација.
sr_latn: Neka bude kratko, ovo je samo demonstracija.
sv: Var kortfattad. Det här är bara en demo.
te: చిన్నదిగా చేయండి, ఇది కేవలం డెమో మాత్రమే.
th: เขียนสั้นๆ เพราะนี่เป็นเพียงการสาธิต
tr: Kısa tutun, bu sadece bir demo.
uk: Біографія має бути стислою.
ur: اسے مختصر رکھیں ، یہ صرف ایک ڈیمو ہے۔
uz: Qisqa yozing. Bu shunchaki matn namunasi.
vi: Hãy nhập nội dung thật ngắn gọn, đây chỉ là phiên bản dùng thử.
zh_hk: 保持精簡，這只是示範。
zu: Igcine iyimfushane, le idemo nje.

# starterAppGenericButton
source: BUTTON
af: KNOPPIE
am: አዝራር
ar_eg: زر
as: বুটাম
az: DÜYMƏ
be: КНОПКА
bn: বোতাম
bs: DUGME
ca: BOTÓ
da: KNAP
es_ar: BOTÓN
et: NUPP
eu: BOTOIA
fa: دکمه
fr_ca: BOUTON
gl: BOTÓN
gu: બટન
he: לחצן
hi: बटन
hu: GOMB
hy: ԿՈՃԱԿ
id: TOMBOL
it: PULSANTE
ja: ボタン
ka: ღილაკი
km: ប៊ូតុង
kn: ಬಟನ್
ko: 버튼
ky: БАСКЫЧ
lo: ປຸ່ມ
lt: MYGTUKAS
lv: POGA
mk: КОПЧЕ
ml: ബട്ടൺ
mn: ТОВЧЛУУР
mr: बटण
ms: BUTANG
my: ခလုတ်
nb: KNAPP
ne: बटन
pa: ਬਟਨ
pl: PRZYCISK
pt: BOTÃO
pt_pt: BOTÃO
ro: BUTON
ru: КНОПКА
si: බොත්තම
sk: TLAČIDLO
sq: BUTONI
sr: ДУГМЕ
sr_latn: DUGME
sv: KNAPP
te: బటన్
th: ปุ่ม
tr: DÜĞME
uk: КНОПКА
ur: بٹن
uz: TUGMA
vi: NÚT
zh_hk: 按鈕
zu: INKINOBHO

# demoTextFieldLifeStory
source: Life story
af: Lewensverhaal
am: የህይወት ታሪክ
ar_eg: قصة حياة
as: জীৱন কাহিনী
az: Həyat hekayəsi
be: Біяграфія
bn: জীবনের গল্প
bs: Životna priča
ca: Biografia
da: Livshistorie
es_ar: Historia de vida
et: Elulugu
eu: Biografia
fa: داستان زندگی
fil: Kwento ng buhay
fr_ca: Histoire de vie
gl: Biografía
gu: જીવન વૃત્તાંત
he: סיפור החיים
hi: जीवनी
hu: Élettörténet
hy: Կենսագրություն
id: Kisah hidup
it: Biografia
ja: 略歴
ka: ცხოვრებისეული ამბავი
km: រឿងរ៉ាវជីវិត
kn: ಆತ್ಮಕಥೆ
ko: 전기
ky: Өмүр баян
lo: ເລື່ອງລາວຊີວິດ
lt: Gyvenimo istorija
lv: Biogrāfija
mk: Животна приказна
ml: ജീവിത കഥ
mn: Амьдралын түүх
mr: जीवनकथा
ms: Kisah hidup
my: ဘဝဇာတ်ကြောင်း
nb: Livshistorie
ne: जीवन कथा
pa: ਜੀਵਨ ਕਹਾਣੀ
pl: Historia mojego życia
pt: Biografia
pt_pt: História da vida
ro: Povestea vieții
ru: Биография
si: ජීවිත කථාව
sk: Biografia
sq: Historia e jetës
sr: Биографија
sr_latn: Biografija
sv: Livsberättelse
te: జీవిత కథ
th: เรื่องราวชีวิต
tr: Hayat hikayesi
uk: Біографія
ur: زندگی کی کہانی
uz: Tarjimayi hol
vi: Tiểu sử
zh_hk: 生平事跡
zu: Indaba yempilo

# demoTextFieldSalary
source: Salary
af: Salaris
am: ደመወዝ
ar_eg: الراتب
as: দৰমহা
az: Maaş
be: Зарплата
bn: বেতন
bs: Plata
ca: Salari
da: Løn
es_ar: Sueldo
et: Palk
eu: Soldata
fa: حقوق
fil: Sweldo
fr_ca: Salaire
gl: Salario
gu: પગાર
he: שכר
hi: वेतन
hu: Fizetés
hy: Աշխատավարձ
id: Gaji
it: Stipendio
ja: 給与
ka: ხელფასი
km: ប្រាក់បៀវត្សរ៍
kn: ಸಂಬಳ
ko: 급여
ky: Маяна
lo: ເງິນເດືອນ
lt: Atlyginimas
lv: Alga
mk: Плата
ml: ശമ്പളം
mn: Цалин
mr: पगार
ms: Gaji
my: လစာ
nb: Lønn
ne: तलब
pa: ਤਨਖਾਹ
pl: Wynagrodzenie
pt: Salário
pt_pt: Salário
ro: Salariu
ru: Зарплата
si: වැටුප
sk: Plat
sq: Paga
sr: Плата
sr_latn: Plata
sv: Lön
te: జీతం
th: รายได้ต่อปี
uk: Заробітна плата
ur: تنخواہ
uz: Maosh
vi: Lương
zh_hk: 薪金
zu: Umholo

# demoTextFieldUSD
source: USD
am: የአሜሪካ ዶላር
ar_eg: دولار أمريكي
as: ইউএছডি
be: Долар ЗША
bn: মার্কিন ডলার
fa: دلار آمریکا
he: דולר ארה"ב (USD)
hi: अमेरिकी डॉलर
km: ដុល្លារអាមេរិក
ky: АКШ доллары
mn: Ам.доллар
ne: अमेरिकी डलर
uk: дол. США
ur: یو ایس ڈی
zh_hk: 美元

# demoTextFieldNoMoreThan
source: No more than 8 characters.
af: Nie meer as 8 karakters nie.
am: ከ8 ቁምፊዎች ያልበለጠ።
ar_eg: يجب ألا تزيد عن 8 أحرف.
as: ৮টাতকৈ অধিক বর্ণ নহয়।
az: 8 simvoldan çox olmamalıdır.
be: Не больш за 8 сімвалаў.
bn: ৮ অক্ষরের বেশি হওয়া চলবে না।
bs: Ne možete unijeti više od 8 znakova.
ca: No pot tenir més de 8 caràcters.
da: Du må højst angive otte tegn.
es_ar: Incluye hasta 8 caracteres.
et: Mitte üle 8 tähemärgi.
eu: Zortzi karaktere gehienez.
fa: بیش از ۸ نویسه مجاز نیست.
fil: Hindi dapat hihigit sa 8 character.
fr_ca: Maximum de huit caractères.
gl: Non máis de 8 caracteres.
gu: 8 અક્ષર કરતાં વધુ નહીં.
he: עד 8 תווים.
hi: आठ से ज़्यादा वर्ण नहीं होने चाहिए.
hu: Nem lehet több 8 karakternél.
hy: Առավելագույնը 8 նիշ։
id: Maksimal 8 karakter.
it: Massimo 8 caratteri.
ja: 8 文字以内で入力してください。
ka: მაქსიმუმ 8 სიმბოლო.
km: មិនឱ្យ​លើសពី 8 តួអក្សរទេ។
kn: 8 ಕ್ಕಿಂತ ಹೆಚ್ಚು ಅಕ್ಷರಗಳಿಲ್ಲ.
ko: 8자를 넘을 수 없습니다.
ky: 8 белгиден ашпашы керек.
lo: ບໍ່ເກີນ 8 ຕົວອັກສອນ.
lt: Ne daugiau nei 8 simboliai.
lv: Ne vairāk kā 8 rakstzīmes.
mk: Не повеќе од 8 знаци.
ml: 8 പ്രതീകങ്ങളിൽ കൂടരുത്.
mn: 8-с дээшгүй тэмдэгт оруулна.
mr: ८ वर्णांपेक्षा जास्त नको.
ms: Tidak melebihi 8 aksara.
my: အက္ခရာ ၈ လုံးထက် မပိုရ။
nb: Ikke mer enn 8 tegn.
ne: ८ वर्णभन्दा लामो हुनु हुँदैन।
pa: 8 ਅੱਖਰ-ਚਿੰਨ੍ਹਾਂ ਤੋਂ ਜ਼ਿਆਦਾ ਨਹੀਂ।
pl: Nie może mieć więcej niż osiem znaków.
pt: No máximo 8 caracteres
pt_pt: No máximo, 8 carateres.
ro: Nu mai mult de 8 caractere.
ru: Не более 8 символов.
si: අනුලකුණු 8කට වඩා නැත.
sk: Maximálne 8 znakov.
sq: Jo më shumë se 8 karaktere.
sr: Не више од 8 знакова.
sr_latn: Ne više od 8 znakova.
sv: Högst 8 tecken.
te: 8 అక్షరాలు మించకూడదు.
th: ไม่เกิน 8 อักขระ
tr: En fazla 8 karakter.
uk: Щонайбільше 8 символів.
ur: 8 حروف سے زیادہ نہیں۔
uz: 8 ta belgidan oshmasin.
vi: Nhiều nhất là 8 ký tự.
zh_hk: 最多 8 個字元
zu: Hhayi ngaphezu kwezinhlamvu ezingu-8.

# demoTextFieldPassword
source: Password*
af: Wagwoord*
am: የይለፍ ቃል*
ar_eg: كلمة المرور*
as: পাছৱৰ্ড*
az: Parol*
be: Пароль*
bn: পাসওয়ার্ড*
bs: Lozinka*
ca: Contrasenya*
da: Adgangskode*
es_ar: Contraseña*
et: Parool*
eu: Pasahitza*
fa: گذرواژه*
fr_ca: Mot de passe*
gl: Contrasinal*
gu: પાસવર્ડ*
he: סיסמה*
hi: पासवर्ड*
hu: Jelszó*
hy: Գաղտնաբառ*
id: Sandi*
ja: パスワード*
ka: პაროლი*
km: ពាក្យសម្ងាត់*
kn: ಪಾಸ್‌ವರ್ಡ್*
ko: 비밀번호*
ky: Сырсөз*
lo: ລະຫັດຜ່ານ*
lt: Slaptažodis*
lv: Parole*
mk: Лозинка*
ml: പാസ്‌വേഡ്*
mn: Нууц үг*
mr: पासवर्ड*
ms: Kata laluan*
my: စကားဝှက်*
nb: Passord*
ne: पासवर्ड*
pa: ਪਾਸਵਰਡ*
pl: Hasło*
pt: Senha*
pt_pt: Palavra-passe*
ro: Parolă*
ru: Пароль*
si: මුරපදය*
sk: Heslo*
sq: Fjalëkalimi*
sr: Лозинка*
sr_latn: Lozinka*
sv: Lösenord*
te: పాస్‌వర్డ్*
th: รหัสผ่าน*
tr: Şifre*
uk: Пароль*
ur: پاس ورڈ*
uz: Parol*
vi: Mật khẩu*
zh_hk: 密碼*
zu: Iphasiwedi*

# demoTextFieldRetypePassword
source: Re-type password*
af: Tik jou wagwoord weer in*
am: የይለፍ ቃል እንደገና ይተይቡ*
ar_eg: أعِد كتابة كلمة المرور*
as: পাছৱৰ্ডটো পুনৰ টাইপ কৰক*
az: Parolu yenidən yazın*
be: Увядзіце пароль яшчэ раз*
bn: পাসওয়ার্ড আবার টাইপ করুন*
bs: Ponovo unesite lozinku*
ca: Torna a escriure la contrasenya*
da: Angiv adgangskoden igen*
es_ar: Vuelve a escribir la contraseña*
et: Sisestage parool uuesti*
eu: Idatzi pasahitza berriro*
fa: گذرواژه را دوباره تایپ کنید*
fil: I-type ulit ang password*
fr_ca: Confirmez votre mot de passe*
gl: Volve escribir o contrasinal*
gu: પાસવર્ડ ફરીથી લખો*
he: יש להקליד מחדש את הסיסמה*
hi: फिर से पासवर्ड टाइप करें*
hu: Írja be újra a jelszót*
hy: Կրկին մուտքագրեք գաղտնաբառը*
id: Ketik ulang sandi*
it: Ridigita la password*
ja: パスワードを再入力*
ka: ხელახლა აკრიფეთ პაროლი*
km: វាយបញ្ចូល​ពាក្យសម្ងាត់ឡើងវិញ*
kn: ಪಾಸ್‌ವರ್ಡ್ ಅನ್ನು ಮರು ಟೈಪ್ ಮಾಡಿ*
ko: 비밀번호 확인*
ky: Сырсөздү кайра териңиз*
lo: ພິມລະຫັດຜ່ານຄືນໃໝ່*
lt: Iš naujo įveskite slaptažodį*
lv: Atkārtota paroles ierakstīšana*
mk: Повторно внесете лозинка*
ml: പാസ്‌വേഡ് വീണ്ടും ടൈപ്പ് ചെയ്യുക*
mn: Нууц үгийг дахин оруулна уу*
mr: पासवर्ड पुन्हा टाइप करा*
ms: Taip semula kata laluan*
my: စကားဝှက်ကို ပြန်ရိုက်ပါ*
nb: Skriv inn passordet på nytt*
ne: पासवर्ड पुनः टाइप गर्नुहोस्*
pa: ਪਾਸਵਰਡ ਮੁੜ-ਟਾਈਪ ਕਰੋ*
pl: Wpisz ponownie hasło*
pt: Digite a senha novamente*
pt_pt: Escreva novamente a palavra-passe*
ro: Introduceți din nou parola*
ru: Введите пароль ещё раз*
si: මුරපදය නැවත ටයිප් කරන්න*
sk: Znovu zadajte heslo*
sq: Shkruaj përsëri fjalëkalimin*
sr: Поново унесите лозинку*
sr_latn: Ponovo unesite lozinku*
sv: Ange lösenordet igen*
te: పాస్‌వర్డ్‌ను మళ్లీ టైప్ చేయండి*
th: พิมพ์รหัสผ่านอีกครั้ง*
tr: Şifreyi yeniden yazın*
uk: Введіть пароль ще раз*
ur: پاس ورڈ* دوبارہ ٹائپ کریں
uz: Parolni qayta kiriting*
vi: Nhập lại mật khẩu*
zh_hk: 再次輸入密碼*
zu: Thayipha kabusha iphasiwedi*

# demoTextFieldSubmit
source: SUBMIT
af: DIEN IN
am: አስገባ
ar_eg: إرسال
as: দাখিল কৰক
az: GÖNDƏRİN
be: АДПРАВІЦЬ
bn: জমা দিন
bs: POŠALJI
ca: ENVIA
da: SEND
es_ar: ENVIAR
et: ESITA
eu: BIDALI
fa: ارسال
fil: ISUMITE
fr_ca: SOUMETTRE
gl: ENVIAR
gu: સબમિટ કરો
he: שליחה
hi: सबमिट करें
hu: KÜLDÉS
hy: ՈՒՂԱՐԿԵԼ
id: KIRIM
it: INVIA
ja: 送信
ka: გაგზავნა
km: ដាក់​បញ្ជូន
kn: ಸಲ್ಲಿಸಿ
ko: 제출
ky: ТАПШЫРУУ
lo: ສົ່ງຂໍ້ມູນ
lt: PATEIKTI
lv: IESNIEGT
mk: ИСПРАТИ
ml: സമർപ്പിക്കുക
mn: ИЛГЭЭХ
mr: सबमिट करा
ms: SERAH
my: ပေးပို့ရန်
nb: SEND INN
ne: पेस गर्नुहोस्
pa: ਸਪੁਰਦ ਕਰੋ
pl: PRZEŚLIJ
pt: ENVIAR
pt_pt: ENVIAR
ro: TRIMITEȚI
ru: ОТПРАВИТЬ
si: ඉදිරිපත් කරන්න
sk: ODOSLAŤ
sq: DËRGO
sr: ПОШАЉИ
sr_latn: POŠALJI
sv: SKICKA
te: సమర్పించు
th: ส่ง
tr: GÖNDER
uk: НАДІСЛАТИ
ur: جمع کرائیں
uz: YUBORISH
vi: GỬI
zh_hk: 提交
zu: THUMELA

# demoBottomNavigationSubtitle
source: Bottom navigation with cross-fading views
af: Navigasie aan die onderkant met kruisverdowwingaansigte
am: የግርጌ ዳሰሳ ከተሻጋሪ የሚደበዝዙ እይታዎች ጋር
ar_eg: شريط تنقّل سفلي شبه مرئي
as: ক্ৰছ-ফে’ডিং ভিউসমূহৰ সৈতে একেবাৰে নিম্নাংশৰ নেভিগেশ্বন
az: Çarpaz solğun görünüşlü alt naviqasiya
be: Ніжняя панэль навігацыі з плаўным пераходам
bn: ক্রস-ফেডিং ভিউ সহ নিচের দিকে নেভিগেশন
bs: Donja navigacija koja se postupno prikazuje i nestaje
ca: Navegació inferior amb visualitzacions d'esvaïment encreuat
da: Navigation i bunden med tværudtoning
es_ar: Navegación inferior con vistas encadenadas
et: Allossa navigeerimine tuhmuvate kuvadega
eu: Modu gurutzatuan lausotzen diren ikuspegiak dituen beheko nabigazioa
fa: پیمایش پایانی با نماهای محوشونده از حاشیه
fil: Navigation sa ibaba na may mga cross-fading na view
fr_ca: Barre de navigation inférieure avec vues en fondu enchaîné
gl: Navegación pola parte inferior con vistas que se atenúan entre si
gu: અરસપરસ ફેડ થતા દૃશ્યો સાથે બોટમ નૅવિગેશન
he: ניווט בחלק התחתון עם תצוגות במידת שקיפות משתנה
hi: क्रॉस-फ़ेडिंग व्यू के साथ बॉटम नेविगेशन
hu: Alsó navigáció halványuló nézetekkel
hy: Նավիգացիա էկրանի ներքևի հատվածում՝ սահուն անցումով
id: Navigasi bawah dengan tampilan cross-fading
it: Navigazione inferiore con visualizzazioni a dissolvenza incrociata
ja: クロスフェーディング ビュー付きのボトム ナビゲーション
ka: ქვედა ნავიგაცია ჯვარედინად გაბუნდოვანებული ხედებით
km: ការរុករក​ខាងក្រោម​ដោយប្រើទិដ្ឋភាពរលុបឆ្នូត
kn: ಕ್ರಾಸ್-ಫೇಡಿಂಗ್ ವೀಕ್ಷಣೆಗಳನ್ನು ಹೊಂದಿರುವ ಬಾಟಮ್ ನ್ಯಾವಿಗೇಶನ್
ko: 크로스 페이딩 보기가 있는 하단 탐색 메뉴
ky: Өчүүчү көрүнүштөрү бар ылдый жактагы чабыттоо тилкеси
lo: ການນຳທາງທາງລຸ່ມທີ່ມີມຸມມອງແບບຄ່ອຍໆປາກົດ
lt: Apatinė naršymo juosta su blunkančiais rodiniais
lv: Navigācija apakšā ar vairākiem skatiem, kas kļūst neskaidri
mk: Долна навигација со напречно избледувачки прикази
ml: ക്രോസ്-ഫേഡിംഗ് കാഴ്‌ചകളുള്ള ബോട്ടം നാവിഗേഷൻ
mn: Харилцан бүдгэрэх харагдах байдалтай доод навигац
mr: क्रॉस फेडिंग दृश्यांसह तळाचे नेव्हिगेशन
ms: Navigasi bawah dengan paparan memudar silang
my: အရောင်မှိန်သွားသည့် မြင်ကွင်းများဖြင့် အောက်ခြေမီနူးပါ လမ်းညွှန်မှု
nb: Navigering nederst med overtoning
ne: क्रस फेडिङ दृश्यसहितको फेदको नेभिगेसन
pa: ਕ੍ਰਾਸ-ਫੇਡਿੰਗ ਦ੍ਰਿਸ਼ਾਂ ਨਾਲ ਹੇਠਲਾ ਨੈਵੀਗੇਸ਼ਨ
pl: Dolna nawigacja z zanikaniem
pt: Navegação da parte inferior com visualização de esmaecimento cruzado
pt_pt: Navegação inferior com vistas cruzadas
ro: Navigarea în partea de jos cu vizualizări cu suprapunere atenuată
ru: Навигация внизу экрана с плавным переходом
si: හරස් වියැකී යන දසුන් සහිත පහළ සංචාලනය
sk: Dolná navigácia s prelínajúcimi sa zobrazeniami
sq: Navigimi i poshtëm me pamje që shuhen gradualisht
sr: Доња навигација која се постепено приказује и нестаје
sr_latn: Donja navigacija koja se postepeno prikazuje i nestaje
sv: Navigering längst ned på skärmen med toning mellan vyer
te: క్రాస్-ఫేడింగ్ వీక్షణలతో కిందివైపు నావిగేషన్
th: Bottom Navigation ที่มีมุมมองแบบค่อยๆ ปรากฏ
tr: Çapraz şeffaflaşan görünümlü alt gezinme
uk: Нижня панель навігації зі зникаючими вікнами перегляду
ur: کراس فیڈنگ ملاحظات کے ساتھ نیچے میں نیویگیشن
uz: Oson ochish uchun ekran pastidagi navigatsiya
vi: Thanh điều hướng dưới cùng có chế độ xem mờ chéo
zh_hk: 交叉淡出檢視效果的底部導覽列
zu: Ukuzula kwaphansi ngokubuka kwe-cross-fading

# demoBottomSheetAddLabel
source: Add
af: Voeg by
am: አክል
ar_eg: إضافة
as: যোগ কৰক
az: Əlavə edin
be: Дадаць
bn: যোগ করুন
bs: Dodajte
ca: Afegeix
da: Tilføj
es_ar: Agregar
et: Lisa
eu: Gehitu
fa: افزودن
fil: Idagdag
fr_ca: Ajouter
gl: Engadir
gu: ઉમેરો
he: הוספה
hi: जोड़ें
hu: Hozzáadás
hy: Ավելացնել
id: Tambahkan
it: Aggiungi
ja: 追加
ka: დამატება
km: បន្ថែម
kn: ಸೇರಿಸಿ
ko: 추가
ky: Кошуу
lo: ເພີ່ມ
lt: Pridėti
lv: Pievienot
mk: Додајте
ml: ചേർക്കുക
mn: Нэмэх
mr: जोडा
ms: Tambah
my: ထည့်ရန်
nb: Legg til
ne: थप्नुहोस्
pa: ਸ਼ਾਮਲ ਕਰੋ
pl: Dodaj
pt: Adicionar
pt_pt: Adicionar
ro: Adăugați
ru: Добавить
si: එක් කරන්න
sk: Pridať
sq: Shto
sr: Додајте
sr_latn: Dodajte
sv: Lägg till
te: జోడిస్తుంది
th: เพิ่ม
tr: Ekle
uk: Додати
ur: شامل کریں
uz: Kiritish
vi: Thêm
zh_hk: 新增
zu: Engeza

# demoBottomSheetModalDescription
source: A modal bottom sheet is an alternative to a menu or a dialog and prevents the user from interacting with the rest of the app.
af: 'n Modale blad aan die onderkant van die skerm is 'n alternatief vir 'n kieslys of dialoog. Dit verhoed dat die gebruiker met die res van die program interaksie kan hê.
am: የሞዳል ግርጌ ሉህ ለአንድ ምናሌ ወይም መገናኛ ተለዋጭ ሲሆን ተጠቃሚው ከተቀረው መተግበሪያ ጋር መስተጋብር እንዳይፈጥር ይከለክላል።
ar_eg: تعتبر البطاقة السفلية المقيِّدة بديلاً لقائمة أو مربّع حوار ولا تسمح للمستخدم بالتفاعل مع المحتوى الآخر على الشاشة.
as: এখন একেবাৰে নিম্নাংশৰ ম’ডাল শ্বীট হৈছে এখন মেনু অথবা এটা ডায়ল’গৰ এক বিকল্প আৰু ই ব্যৱহাৰকাৰীজনক এপ্‌টোৰ বাকী অংশ ব্যৱহাৰ কৰাত বাধা দিয়ে।
az: Modal alt vərəq menyu və ya dialoqa alternativdir və istifadəçinin tətbiqin qalan hissələri ilə işləməsinin qarşısını alır.
be: Мадальны ніжні аркуш можна выкарыстоўваць замест меню ці дыялогавага акна. Дзякуючы яму карыстальнік можа не ўзаемадзейнічаць з астатнімі раздзеламі праграмы.
bn: 'মোডাল বটম শিট' হল মেনু অথবা ডায়ালগের একটি বিকল্প এবং এটি ব্যবহারকারীকে অ্যাপের অন্যান্য ফিচার ইন্টার‌্যাক্ট করতে বাধা দেয়।
bs: Modalna donja tabela je alternativa meniju ili dijaloškom okviru i onemogućava korisnicima interakciju s ostatkom aplikacije.
ca: Un full modal inferior és una alternativa al menú o al diàleg i evita que l'usuari interaccioni amb la resta de l'aplicació.
da: Et modalt felt i bunden er et alternativ til en menu eller dialogboks og forhindrer, at brugeren interagerer med resten af appen.
es_ar: Una hoja modal inferior es una alternativa a un menú o diálogo que impide que el usuario interactúe con el resto de la app.
et: Modaalne alumine leht on alternatiiv menüüle või dialoogile ja takistab kasutajal ülejäänud rakendusega suhelda.
eu: Menu edo leiho baten ordez erabil daiteke beheko orri modala; horren bidez, erabiltzaileak ezingo ditu erabili aplikazioaren gainerako elementuak.
fa: «برگه پایانی مودال»، جایگزینی برای منو یا کادرگفتگو است و مانع تعامل کاربر با قسمت‌های دیگر برنامه می‌شود.
fil: Ang modal na bottom sheet ay isang alternatibo sa menu o dialog at pinipigilan nito ang user na makipag-ugnayan sa iba pang bahagi ng app.
fr_ca: Une page de contenu flottante qui s'affiche dans le bas de l'écran offre une solution de rechange à un menu ou à une boîte de dialogue. Elle empêche l'utilisateur d'interagir avec le reste de l'application.
gl: Un panel de modo situado na parte inferior é unha alternativa a un menú ou cadro de diálogo e impide ao usuario interactuar co resto da aplicación.
gu: મોડલ બોટમ શીટ મેનૂ અથવા સંવાદના વિકલ્પરૂપે હોય છે અને વપરાશકર્તાને ઍપના બાકીના ભાગ સાથે ક્રિયાપ્રતિક્રિયા કરતા અટકાવે છે.
he: גיליון תחתון מודלי הוא חלופה לתפריט או לתיבת דו-שיח, והוא מונע מהמשתמש לבצע אינטראקציה עם שאר האפליקציה.
hi: मॉडल बॉटम शीट, किसी मेन्यू या डायलॉग के एक विकल्प के तौर पर इस्तेमाल की जाती है. साथ ही, इसकी वजह से उपयोगकर्ता को बाकी दूसरे ऐप्लिकेशन से इंटरैक्ट करने की ज़रूरत नहीं हाेती.
hu: A modális alsó lap a menü és a párbeszédpanel alternatívája, és segítségével megakadályozható, hogy a felhasználó az alkalmazás többi részét használja.
hy: Ներքևի մոդալ թերթը կարելի է օգտագործել ընտրացանկի կամ երկխոսության պատուհանի փոխարեն։ Այսպիսի թերթն օգտատիրոջն օգնում է ավելի արագ անցնել անհրաժեշտ բաժիններ։
id: Sheet bawah modal adalah alternatif untuk menu atau dialog dan akan mencegah pengguna berinteraksi dengan bagian lain aplikasi.
it: Un foglio inferiore modale è un'alternativa a un menu o a una finestra di dialogo e impedisce all'utente di interagire con il resto dell'app.
ja: モーダル ボトムシートとは、メニューまたはダイアログの代わりになるもので、これが表示されている場合、ユーザーはアプリの他の部分を操作できません。
ka: მოდალური ქვედა ფურცელი არის მენიუს ან დიალოგის ალტერნატივა და მომხმარებელს უზღუდავს აპის დანარჩენ ნაწილთან ინტერაქციას.
km: សន្លឹកខាងក្រោម​លក្ខណៈម៉ូដលគឺ​ជាជម្រើស​ផ្សេងក្រៅពី​ម៉ឺនុយ ឬប្រអប់ និងទប់ស្កាត់​អ្នកប្រើប្រាស់មិនឱ្យធ្វើ​អន្តរកម្មជាមួយ​កម្មវិធីដែលនៅសល់។
kn: ಮೋಡಲ್ ಬಾಟಮ್ ಶೀಟ್ ಎನ್ನುವುದು ಮೆನು ಅಥವಾ ಡೈಲಾಗ್‌ಗೆ ಬದಲಿಯಾಗಿದೆ ಮತ್ತು ಬಳಕೆದಾರರು ಉಳಿದ ಆ್ಯಪ್ ಜೊತೆಗೆ ಸಂವಹನ ಮಾಡುವುದನ್ನು ತಡೆಯುತ್ತದೆ.
ko: 모달 하단 시트는 메뉴나 대화상자의 대안으로, 사용자가 앱의 나머지 부분과 상호작용하지 못하도록 합니다.
ky: Ылдый жакта жайгашкан модалдык барак менюга же диалогго кошумча келип, колдонуучунун колдонмонун башка бөлүмдөрү менен иштешине тоскоол болот.
lo: Modal bottom sheet ເປັນທາງເລືອກທີ່ໃຊ້ແທນເມນູ ຫຼື ກ່ອງໂຕ້ຕອບ ແລະ ປ້ອງກັນບໍ່ໃຫ້ຜູ້ໃຊ້ໂຕ້ຕອບກັບສ່ວນທີ່ເຫຼືອຂອງແອັບ.
lt: Modalinis apatinio lapo mygtukas naudojamas vietoj meniu ar dialogo lango, kad naudotojui nereikėtų naudoti kitų programos langų.
lv: Modālā ekrāna apakšdaļa ir izvēlnes vai dialoglodziņa alternatīva, kuru izmantojot, lietotājam nav nepieciešams mijiedarboties ar pārējo lietotni.
mk: Модалниот долен лист е алтернатива за мени или дијалог и го спречува корисникот да комуницира со остатокот од апликацијата.
ml: മോഡൽ ബോട്ടം ഷീറ്റ് മെനുവിനോ ഡയലോഗിനോ ഉള്ള ബദലാണ്, ഇത് ബാക്കി ആപ്പുമായി ഇടപഴകുന്നതിൽ നിന്ന് ഉപയോക്താവിനെ തടയുന്നു.
mn: Зайлшгүй харилцах доод хүснэгт нь цэс эсвэл харилцах цонхны өөр хувилбар бөгөөд хэрэглэгчийг аппын бусад хэсэгтэй харилцахаас сэргийлдэг.
mr: मोडल तळाचे शीट मेनू किंवा डायलॉगचा पर्याय आहे आणि ते वापरकर्त्याला बाकीच्या अ‍ॅपशी परस्परसंवाद साधण्यापासून रोखते.
ms: Helaian bawah mod adalah sebagai alternatif kepada menu atau dialog dan menghalang pengguna daripada berinteraksi dengan apl yang lain.
my: Modal အောက်ခြေမီနူးပါ စာမျက်နှာသည် မီနူး သို့မဟုတ် ဒိုင်ယာလော့ဂ်အတွက် အစားထိုးနည်းလမ်းတစ်ခုဖြစ်ပြီး အသုံးပြုသူက အက်ပ်၏ကျန်ရှိအပိုင်းများနှင့် ပြန်လှန်တုံ့ပြန်မှုမပြုရန် ကန့်သတ်ပေးသည်။
nb: Et modalfelt nederst er et alternativ til en meny eller dialogboks og forhindrer at brukeren samhandler med resten av appen.
ne: मोडल नामक फेदको पानालाई मेनु वा संवादको विकल्पका रूपमा प्रयोग गरिन्छ र यसले प्रयोगकर्ताहरूलाई बाँकी एपसँग अन्तर्क्रिया गर्न दिँदैन।
pa: ਮਾਡਲ ਹੇਠਲੀ ਸ਼ੀਟ ਕਿਸੇ ਮੀਨੂ ਜਾਂ ਵਿੰਡੋ ਦਾ ਬਦਲ ਹੈ ਅਤੇ ਇਹ ਵਰਤੋਂਕਾਰ ਨੂੰ ਬਾਕੀ ਦੀ ਐਪ ਨਾਲ ਅੰਤਰਕਿਰਿਆ ਕਰਨ ਤੋਂ ਰੋਕਦਾ ਹੈ।
pl: Modalna plansza dolna to alternatywa dla menu lub okna. Uniemożliwia użytkownikowi interakcję z resztą aplikacji.
pt: Uma página inferior modal é uma alternativa a um menu ou uma caixa de diálogo e evita que o usuário interaja com o restante do app.
pt_pt: Uma secção inferior modal é uma alternativa a um menu ou uma caixa de diálogo e impede o utilizador de interagir com o resto da aplicação.
ro: Foaia modală din partea de jos este o alternativă la un meniu sau la o casetă de dialog și împiedică interacțiunea utilizatorului cu restul aplicației.
ru: Модальный нижний экран можно использовать вместо меню или диалогового окна. Пока такой экран открыт, пользователю недоступны другие элементы приложения.
si: මාදිලි පහළ පත්‍රයක් යනු මෙනුවකට හෝ සංවාදයකට විකල්පයක් වන අතර පරිශීලකව යෙදුමේ ඉතිරි කොටස සමග අන්තර්ක්‍රියා කීරිමෙන් වළක්වයි.
sk: Modálny dolný hárok je alternatíva k ponuke alebo dialógovému oknu. Bráni používateľovi interagovať so zvyškom aplikácie.
sq: Një fletë e poshtme modale është një alternativë ndaj menysë apo dialogut dhe parandalon që përdoruesi të bashkëveprojë me pjesën tjetër të aplikacionit.
sr: Модална доња табела је алтернатива менију или дијалогу и онемогућава интеракцију корисника са остатком апликације.
sr_latn: Modalna donja tabela je alternativa meniju ili dijalogu i onemogućava interakciju korisnika sa ostatkom aplikacije.
sv: Ett modalt ark längst ned på skärmen är ett alternativ till en meny eller dialogruta, och det förhindrar att användaren interagerar med resten av appen.
te: నమూనా దిగువున ఉండే షీట్ అన్నది మెనూ లేదా డైలాగ్‌కు ప్రత్యామ్నాయం. ఇది యాప్‌లో మిగతా వాటితో ఇంటరాక్ట్ కాకుండా యూజర్‌ను నిరోధిస్తుంది.
th: Modal Bottom Sheet เป็นทางเลือกที่ใช้แทนเมนูหรือกล่องโต้ตอบและป้องกันไม่ให้ผู้ใช้โต้ตอบกับส่วนที่เหลือของแอป
tr: Kalıcı alt sayfa, alternatif bir menü veya iletişim kutusudur ve kullanıcının uygulamanın geri kalanı ile etkileşimde bulunmasını önler.
uk: Модальна сторінка, що розгортається знизу, замінює меню або діалогове вікно й не дає користувачеві взаємодіяти з іншими частинами додатка.
ur: نیچے کی موڈل شیٹ مینیو یا ڈائیلاگ کا متبادل ہے اور صارف کو باقی ایپ کے ساتھ تعامل کرنے سے روکتی ہے۔
uz: Modal quyi ekrandan menyu yoki muloqot oynasi bilan birgalikda foydalanish mumkin. Bunday ekran ochiqligida ilovaning boshqa elementlaridan foydalanish imkonsiz.
vi: Bảng cách điệu dưới cùng là một dạng thay thế cho trình đơn hoặc hộp thoại để ngăn người dùng tương tác với phần còn lại của ứng dụng.
zh_hk: 強制回應底部工作表是選單或對話框的替代選擇，可防止使用者與應用程式其他部分互動。
zu: Ishidi eliphansi le-modal kungenye indlela kumentu noma ingxoxo futhi ivimbela umsebenzisi ekusebenzisaneni nalo lonke uhlelo lokusebenza.
