Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTextFieldOnlyAlphabeticalChars
source: Please enter only alphabetical characters.
af: Voer asseblief net alfabetkarakters in.
am: እባክዎ ፊደል-ቁጥራዊ ቁምፊዎችን ብቻ ያስገቡ።
ar_eg: يُرجى إدخال حروف أبجدية فقط.
as: অনুগ্ৰহ কৰি কেৱল বৰ্ণসমূহ দিয়ক।
az: Yalnız hərf daxil edin.
be: Уводзьце толькі літары.
bn: কেবল বর্ণানুক্রমিক অক্ষর লিখুন।
bs: Unesite samo slova abecede.
ca: Introdueix només caràcters alfabètics.
da: Angiv kun alfabetiske tegn.
es_ar: Ingresa solo caracteres alfabéticos.
et: Sisestage ainult tähestikutähti.
eu: Idatzi alfabetoko karaktereak soilik.
fa: لطفاً فقط نویسه‌های الفبایی را وارد کنید.
fil: Mga character sa alpabeto lang ang ilagay.
fr_ca: Veuillez n'entrer que des caractères alphabétiques.
gl: Introduce só caracteres alfabéticos.
gu: કૃપા કરીને માત્ર મૂળાક્ષરના અક્ષરો દાખલ કરો.
he: יש להזין רק תווים אלפביתיים.
hi: कृपया वर्णमाला वाले वर्ण ही डालें.
hu: Kérjük, csak az ábécé karaktereit használja.
hy: Օգտագործեք միայն տառեր։
id: Masukkan karakter alfabet saja.
it: Inserisci soltanto caratteri alfabetici.
ja: 使用できるのは英字のみです。
ka: გთხოვთ, შეიყვანოთ მხოლოდ ანბანური სიმბოლოები.
km: សូមបញ្ចូលតួអក្សរ​តាមលំដាប់អក្ខរក្រម​តែប៉ុណ្ណោះ។
kn: ವರ್ಣಮಾಲೆಯ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ನಮೂದಿಸಿ.
ko: 영문자만 입력해 주세요.
ky: Алфавиттеги тамгаларды гана киргизиңиз.
lo: ກະລຸນາປ້ອນຕົວອັກສອນພະຍັນຊະນະເທົ່ານັ້ນ.
lt: Įveskite tik raides.
lv: Lūdzu, ievadiet tikai alfabēta rakstzīmes.
mk: Внесете само букви.
ml: അക്ഷരങ്ങൾ മാത്രം നൽകുക.
mn: Зөвхөн цагаан толгойн үсэг оруулна уу.
mr: कृपया फक्त वर्णक्रमाने वर्ण एंटर करा.
ms: Sila masukkan aksara mengikut abjad sahaja.
my: ဗျည်းအက္ခရာများကိုသာ ထည့်ပါ။
nb: Skriv bare inn alfabetiske tegn.
ne: कृपया अक्षरहरू मात्र प्रविष्टि गर्नुहोस्।
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਿਰਫ਼ ਵਰਨਮਾਲਾ ਵਾਲੇ ਅੱਖਰ-ਚਿੰਨ੍ਹ ਦਾਖਲ ਕਰੋ।
pl: Użyj tylko znaków alfabetu.
pt: Digite apenas caracteres alfabéticos.
pt_pt: Introduza apenas carateres alfabéticos.
ro: Introduceți numai caractere alfabetice.
ru: Используйте только буквы.
si: කරුණාකර අකාරාදී අනුලකුණු පමණක් ඇතුළු කරන්න.
sk: Zadajte iba abecedné znaky.
sq: Fut vetëm karaktere alfabetikë.
sr: Уносите само абецедне знакове.
sr_latn: Unosite samo abecedne znakove.
sv: Använd endast alfabetiska tecken.
te: దయచేసి కేవలం ఆల్ఫాబెటికల్ అక్షరాలను మాత్రమే ఎంటర్ చేయండి.
th: โปรดป้อนอักขระที่เป็นตัวอักษรเท่านั้น
tr: Lütfen sadece alfabetik karakterler girin.
uk: Можна вводити лише буквенні символи.
ur: براہ کرم صرف حروف تہجی کے اعتبار سے حروف درک کریں۔
uz: Faqat alifbodagi harflarni kiriting.
vi: Vui lòng chỉ nhập chữ cái.
zh_hk: 請只輸入字母。
zu: Sicela ufake izinhlamvu ngokulandelana.

# demoTextFieldEnterUSPhoneNumber
source: (###) ###-#### - Enter a US phone number.
af: (###) ###-#### – Voer 'n Amerikaanse foonnommer in.
am: (###) ###-#### - የአሜሪካ ስልክ ቁጥር ያስገቡ።
ar_eg: (###) ###-#### - يُرجى إدخال رقم هاتف صالح في الولايات المتحدة.
as: (###) ###-#### - এটা আমেৰিকা যুক্তৰাষ্ট্ৰৰ ফ’ন নম্বৰ দিয়ক।
az: (###) ###-#### - ABŞ telefon nömrəsi daxil edin.
be: Увядзіце нумар тэлефона ў ЗША ў наступным фармаце: (###) ###-####.
bn: (###) ###-#### - একটি মার্কিন যুক্তরাষ্ট্রের ফোন নম্বর লিখুন।
bs: (###) ###-#### – unesite broj telefona u SAD-u.
ca: (###) ###-####: introdueix un número de telèfon dels EUA.
da: (###) ###-#### – angiv et amerikansk telefonnummer.
es_ar: (###) ###-#### - Ingresa un número de teléfono de EE.UU.
et: (###) ### #### – sisestage USA telefoninumber.
eu: (###) ###-#### - Idatzi AEBko telefono-zenbaki bat.
fa: (###) ###-#### - شماره‌ای مربوط به ایالات متحده وارد کنید.
fil: (###) ###-#### - Maglagay ng numero ng telepono sa US.
fr_ca: ### ###-#### : entrez un numéro de téléphone en format nord-américain.
gl: (###) ###-####: Introduce un número de teléfono dos EUA.
gu: (###) ###-#### - અમેરિકાનો ફોન નંબર દાખલ કરો.
he: (###) ###-#### - יש להזין מספר טלפון בארה"ב.
hi: (###) ###-#### - कृपया यूएस का फ़ोन नंबर डालें.
hu: (###) ###-#### – Adjon meg egy USA-beli telefonszámot.
hy: Մուտքագրեք ԱՄՆ հեռախոսահամար հետևյալ ձևաչափով՝ (###) ###-####։
id: (###) ###-#### - Masukkan nomor telepon AS.
it: (###) ###-####. Inserisci un numero di telefono degli Stati Uniti.
ja: （###）###-#### - 米国の電話番号を入力してください。
ka: (###) ###—#### — შეიყვანეთ აშშ-ს ტელეფონის ნომერი.
km: (###) ###-#### - បញ្ចូលលេខទូរសព្ទ​សហរដ្ឋអាមេរិក។
kn: (###) ###-#### - US ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ.
ko: (###) ###-#### - 미국 전화번호를 입력하세요.
ky: (###) ###-#### – АКШ телефон номерин киргизиңиз.
lo: (###) ###-#### - ໃສ່ເບີໂທສະຫະລັດ.
lt: (###) ###-#### – įveskite JAV telefono numerį.
lv: (###) ###-#### — ievadiet pareizu tālruņa numuru.
mk: (###) ###-#### - Внесете телефонски број од САД.
ml: (###) ###-#### - ഒരു US ഫോൺ നമ്പർ നൽകുക.
mn: (###) ###-#### - АНУ-ын утасны дугаар оруулна уу.
mr: (###) ###-#### - यूएस फोन नंबर एंटर करा.
ms: (###) ###-#### - Masukkan nombor telefon AS.
my: (###) ###-#### - US ဖုန်းနံပါတ်ကို ထည့်ပါ
nb: (###) ###-#### – angi et amerikansk telefonnummer.
ne: (###) ###-#### - कृपया सं. रा. अमेरिकाको फोन नम्बर प्रविष्टि गर्नुहोस्।
pa: (###) ###-#### - ਕੋਈ ਅਮਰੀਕੀ ਫ਼ੋਨ ਨੰਬਰ ਦਾਖਲ ਕਰੋ।
pl: (###) ###-#### – wpisz numer telefonu w USA.
pt: (##) ###-#### - Digite um número de telefone dos EUA.
pt_pt: (###) ###-#### – Introduza um número de telefone dos EUA.
ro: (###) ###–#### – introduceți un număr de telefon din S.U.A.
ru: Укажите номер телефона в США в следующем формате: (###) ###-####.
si: (###) ###-#### - එක්සත් ජනපද දුරකථන අංකයක් ඇතුළත් කරන්න.
sk: (###) ###-#### – Zadajte telefónne číslo v USA.
sq: (###) ###-#### - Fut një numër telefoni amerikan.
sr: (###) ###-#### – унесите број телефона у Сједињеним Америчким Државама
sr_latn: (###) ###-#### – unesite broj telefona u Sjedinjenim Američkim Državama
sv: (###) ###-#### – ange ett amerikanskt telefonnummer.
te: (###) ###-#### - US ఫోన్ నంబర్‌ను ఎంటర్ చేయండి.
th: (###) ###-#### - ป้อนหมายเลขโทรศัพท์ในสหรัฐอเมริกา
tr: (###) ###-#### - ABD'ye ait bir telefon numarası girin.
uk: (###) ###-#### – введіть номер телефону в США.
ur: (###) ###-#### - ریاستہائے متحدہ امریکہ کا فون نمبر درج کریں۔
uz: (###) ###-#### - AQSH telefon raqamini kiriting.
vi: (###) ###-#### – Nhập một số điện thoại của Hoa Kỳ.
zh_hk: (###) ###-#### - 請輸入美國的電話號碼。
zu: (###) ###-#### - Faka inombolo yefoni ye-US.

# demoTextFieldEnterPassword
source: Please enter a password.
af: Voer asseblief 'n wagwoord in.
am: እባክዎ የይለፍ ቃል ያስገቡ።
ar_eg: يرجى إدخال كلمة مرور.
as: অনুগ্ৰহ কৰি এটা পাছৱর্ড দিয়ক।
az: Parol daxil edin.
be: Увядзіце пароль.
bn: পাসওয়ার্ড লিখুন।
bs: Unesite lozinku.
ca: Introdueix una contrasenya.
da: Angiv en adgangskode.
es_ar: Ingresa una contraseña.
et: Sisestage parool.
eu: Idatzi pasahitza.
fa: گذرواژه‌ای وارد کنید.
fil: Maglagay ng password.
fr_ca: Veuillez entrer un mot de passe.
gl: Escribe un contrasinal.
gu: કૃપા કરીને પાસવર્ડ દાખલ કરો.
he: יש להזין סיסמה.
hi: कृपया पासवर्ड डालें.
hu: Írjon be egy jelszót.
hy: Մուտքագրեք գաղտնաբառը։
id: Masukkan sandi.
it: Inserisci una password.
ja: パスワードを入力してください。
ka: გთხოვთ, შეიყვანოთ პაროლი.
km: សូម​បញ្ចូល​ពាក្យ​សម្ងាត់​។
kn: ಪಾಸ್‌ವರ್ಡ್ ಅನ್ನು ನಮೂದಿಸಿ.
ko: 비밀번호를 입력하세요.
ky: Сырсөз киргизиңиз.
lo: ກະລຸນາປ້ອນລະຫັດຜ່ານ.
lt: Įveskite slaptažodį.
lv: Lūdzu, ievadiet paroli.
mk: Внесете лозинка.
ml: പാസ്‌വേഡ് നൽകുക.
mn: Нууц үгээ оруулна уу.
mr: कृपया पासवर्ड एंटर करा.
ms: Sila masukkan kata laluan.
my: စကားဝှက်ကို ထည့်ပါ။
nb: Skriv inn et passord.
ne: कृपया कुनै पासवर्ड प्रविष्टि गर्नुहोस्।
pa: ਕਿਰਪਾ ਕਰਕੇ ਕੋਈ ਪਾਸਵਰਡ ਦਾਖਲ ਕਰੋ।
pl: Wpisz hasło.
pt: Insira uma senha.
pt_pt: Introduza uma palavra-passe.
ro: Introduceți o parolă.
ru: Введите пароль.
si: කරුණාකර මුරපදයක් ඇතුළත් කරන්න.
sk: Zadajte heslo.
sq: Fut një fjalëkalim.
sr: Унесите лозинку.
sr_latn: Unesite lozinku.
sv: Ange ett lösenord.
te: దయచేసి పాస్‌వర్డ్‌ను ఎంటర్ చేయండి.
th: โปรดป้อนรหัสผ่าน
tr: Lütfen bir şifre girin.
uk: Введіть пароль.
ur: براہ کرم ایک پاس ورڈ درج کریں۔
uz: Parolni kiriting.
vi: Hãy nhập mật khẩu.
zh_hk: 請輸入密碼。
zu: Sicela ufake iphasiwedi.

# demoTextFieldPasswordsDoNotMatch
source: The passwords don't match
af: Die wagwoorde stem nie ooreen nie
am: የይለፍ ቃላቱ አይዛመዱም
ar_eg: كلمتا المرور غير متطابقتين.
as: পাছৱর্ডসমূহ মিলা নাই
az: Parollar uyğun gəlmir
be: Паролі не супадаюць
bn: পাসওয়ার্ড মিলছে না
bs: Lozinke se ne podudaraju
ca: Les contrasenyes no coincideixen
da: Adgangskoderne matcher ikke
es_ar: Las contraseñas no coinciden
et: Paroolid ei ühti
eu: Pasahitzak ez datoz bat
fa: گذرواژه مطابقت ندارد
fil: Hindi magkatugma ang mga password
fr_ca: Les mots de passe ne correspondent pas
gl: Os contrasinais non coinciden
gu: પાસવર્ડનો મેળ બેસતો નથી
he: הסיסמאות לא תואמות
hi: पासवर्ड आपके पहले दिए गए पासवर्ड से अलग है
hu: A jelszavak nem egyeznek meg
hy: Գաղտնաբառերը չեն համընկնում
id: Sandi tidak cocok
it: Le password non corrispondono
ja: パスワードが一致しません
ka: პაროლები არ ემთხვევა
km: ពាក្យសម្ងាត់​មិនត្រូវគ្នាទេ
kn: ಪಾಸ್‌ವರ್ಡ್‌ಗಳು ಹೊಂದಾಣಿಕೆಯಾಗುತ್ತಿಲ್ಲ
ko: 비밀번호가 일치하지 않습니다.
ky: Сырсөздөр дал келген жок
lo: ລະຫັດຜ່ານບໍ່ກົງກັນ
lt: Slaptažodžiai nesutampa
lv: Paroles nesakrīt
mk: Лозинките не се совпаѓаат
ml: പാസ്‌വേഡുകൾ പൊരുത്തപ്പെടുന്നില്ല
mn: Нууц үг таарахгүй байна
mr: पासवर्ड जुळत नाहीत
ms: Kata laluan tidak sepadan
my: စကားဝှက်များ မတူကြပါ
nb: Passordene er ikke like
ne: पासवर्डहरू मिलेनन्
pa: ਪਾਸਵਰਡ ਮੇਲ ਨਹੀਂ ਖਾਂਦੇ
pl: Hasła nie pasują do siebie
pt: As senhas não correspondem
pt_pt: As palavras-passe não correspondem.
ro: Parolele nu corespund
ru: Пароли не совпадают.
si: මුරපද නොගැළපේ.
sk: Heslá sa nezhodujú
sq: Fjalëkalimet nuk përputhen
sr: Лозинке се не подударају
sr_latn: Lozinke se ne podudaraju
sv: Lösenorden överensstämmer inte
te: పాస్‌వర్డ్‌లు సరిపోలలేదు
th: รหัสผ่านไม่ตรงกัน
tr: Şifreler eşleşmiyor
uk: Паролі не збігаються*
ur: پاسورڈز مماثل نہیں ہیں
uz: Parollar mos kelmadi
vi: Các mật khẩu không trùng khớp
zh_hk: 密碼不相符
zu: Amaphasiwedi awafani

# demoTextFieldWhatDoPeopleCallYou
source: What do people call you?
af: Wat noem mense jou?
am: ሰዎች እርስዎን ምን ብለው ነው የሚጠሩዎት?
ar_eg: بأي اسم يناديك الآخرون؟
as: মানুহে আপোনাক কি বুলি মাতে?
az: Adınız nədir?
be: Як вас завуць?
bn: লোকজন আপনাকে কী বলে ডাকে?
bs: Kako vas drugi zovu?
ca: Com et dius?
da: Hvad kalder andre dig?
es_ar: ¿Cómo te llaman otras personas?
et: Kuidas inimesed teid kutsuvad?
eu: Nola deitzen dizute?
fa: به چه نامی خطابتان می‌کنند؟
fil: Ano'ng tawag sa iyo ng mga tao?
fr_ca: Comment les gens vous appellent-ils?
gl: Como te chama a xente?
gu: લોકો તમને શું કહીને બોલાવે છે?
he: איך אנשים קוראים לך?
hi: लोग आपको किस नाम से बुलाते हैं?
hu: Hogyan hívhatják Önt?
hy: Ի՞նչ է ձեր անունը
id: Apa nama panggilan Anda?
it: Qual è il tuo nome?
ja: 名前を入力してください
ka: როგორ მოგმართავენ ადამიანები?
km: តើអ្នកដទៃ​ហៅអ្នកថាម៉េច?
kn: ಜನರು ನಿಮ್ಮನ್ನು ಏನೆಂದು ಕರೆಯುತ್ತಾರೆ?
ko: 이름
ky: Башкалар сизге кантип кайрылат?
lo: ຄົນອື່ນເອີ້ນທ່ານວ່າແນວໃດ?
lt: Kaip žmonės kreipiasi į jus?
lv: Kā cilvēki jūs dēvē?
mk: Како ви се обраќаат луѓето?
ml: എന്താണ് ആളുകൾ നിങ്ങളെ വിളിക്കുന്നത്?
mn: Таныг хүмүүс хэн гэж дууддаг вэ?
mr: लोक तुम्हाला काय म्हणतात?
ms: Apakah nama panggilan anda?
my: လူများက သင့်အား မည်သို့ ခေါ်ပါသလဲ။
nb: Hva kaller folk deg?
ne: मान्छेहरू तपाईंलाई के भनी बोलाउँछन्?
pa: ਲੋਕ ਤੁਹਾਨੂੰ ਕੀ ਕਹਿ ਕੇ ਬੁਲਾਉਂਦੇ ਹਨ?
pl: Jak się nazywasz?
pt: Como as pessoas chamam você?
pt_pt: Que nome lhe chamam?
ro: Cum vă spun utilizatorii?
ru: Как вас зовут?
si: පුද්ගලයන් ඔබට කථා කළේ කුමක්ද?
sk: V súvislosti s čím vám ľudia volajú?
sq: Si të quajnë?
sr: Како вас људи зову?
sr_latn: Kako vas ljudi zovu?
sv: Vad heter du?
te: అందరూ మిమ్మల్ని ఏమని పిలుస్తారు?
th: ชื่อของคุณ
tr: Size hangi adla hitap ediliyor?
uk: Як вас звати?
ur: لوگ آپ کو کیا پکارتے ہیں؟
uz: Ismingiz nima?
vi: Bạn tên là gì?
zh_hk: 如何稱呼您？
zu: Bakubiza ngokuthini abantu?

# demoTextFieldNameField
source: Name*
af: Naam*
am: ስም*
ar_eg: الاسم*
as: নাম*
az: Ad*
be: Імя*
bn: নাম*
bs: Ime i prezime*
ca: Nom*
da: Navn*
es_ar: Nombre*
et: Nimi*
eu: Izena*
fa: نام*
fil: Pangalan*
fr_ca: Nom*
gl: Nome*
gu: નામ*
he: שם*
hi: नाम*
hu: Név*
hy: Անուն*
id: Nama*
it: Nome*
ja: 名前*
ka: სახელი*
km: ឈ្មោះ*
kn: ಹೆಸರು*
ko: 이름*
ky: Аталышы*
lo: ຊື່*
lt: Vardas*
lv: Vārds*
mk: Име*
ml: പേര്*
mn: Нэр*
mr: नाव*
ms: Nama*
my: အမည်*
nb: Navn*
ne: नाम*
pa: ਨਾਮ*
pl: Nazwa*
pt: Nome*
pt_pt: Nome*
ro: Nume*
ru: Имя*
si: නම*
sk: Názov*
sq: Emri*
sr: Име*
sr_latn: Ime*
sv: Namn*
te: పేరు*
th: ชื่อ*
tr: Ad*
uk: Назва*
ur: نام*
uz: Ism*
vi: Tên*
zh_hk: 名稱*
zu: Igama*

# demoBottomSheetButtonText
source: SHOW BOTTOM SHEET
af: WYS BLAD ONDER
am: የግርጌ ሉህን አሳይ
ar_eg: عرض البطاقة السفلية
as: একেবাৰে নিম্নাংশৰ শ্বীটখন দেখুৱাওক
az: AŞAĞIDAKI VƏRƏQİ GÖSTƏRİN
be: ПАКАЗАЦЬ НІЖНІ АРКУШ
bn: বটম শিট দেখান
bs: PRIKAŽI DONJU TABELU
ca: MOSTRA EL FULL INFERIOR
da: VIS FELTET I BUNDEN
es_ar: MOSTRAR HOJA INFERIOR
et: KUVA ALUMINE LEHT
eu: ERAKUTSI BEHEKO ORRIA
fa: نشان دادن برگه پایانی
fil: IPAKITA ANG BOTTOM SHEET
fr_ca: AFFICHER LA PAGE DE CONTENU DANS LE BAS DE L'ÉCRAN
gl: MOSTRAR PANEL INFERIOR
gu: બોટમ શીટ બતાવો
he: הצגת גיליון תחתון
hi: बॉटम शीट दिखाएं
hu: ALSÓ LAP MEGJELENÍTÉSE
hy: ՑՈՒՑԱԴՐԵԼ ՆԵՐՔԵՎԻ ԹԵՐԹԸ
id: TAMPILKAN SHEET BAWAH
it: MOSTRA FOGLIO INFERIORE
ja: ボトムシートを表示
ka: ქვედა ფურცლის ჩვენება
km: បង្ហាញ​សន្លឹកខាងក្រោម
kn: ಕೆಳಭಾಗದ ಶೀಟ್ ಅನ್ನು ತೋರಿಸಿ
ko: 하단 시트 표시
ky: ЫЛДЫЙ ЖАКТАГЫ МЕНЮНУ КӨРСӨТҮҮ
lo: ສະແດງ BOTTOM SHEET
lt: RODYTI APATINIO LAPO MYGTUKĄ
lv: RĀDĪT EKRĀNA APAKŠDAĻAS IZKLĀJLAPU
mk: ПРИКАЖИ ДОЛЕН ЛИСТ
ml: ബോട്ടം ഷീറ്റ് കാണിക്കുക
mn: ДООД ХҮСНЭГТИЙГ ХАРУУЛАХ
mr: तळाचे शीट दाखवा
ms: TUNJUKKAN HELAIAN BAWAH
my: အောက်ခြေမီနူးပါ စာမျက်နှာကို ပြရန်
nb: VIS FELT NEDERST
ne: फेदको पाना देखाउनुहोस्
pa: ਹੇਠਲੀ ਸ਼ੀਟ ਦਿਖਾਓ
pl: POKAŻ PLANSZĘ DOLNĄ
pt: MOSTRAR PÁGINA INFERIOR
pt_pt: MOSTRAR SECÇÃO INFERIOR
ro: AFIȘAȚI FOAIA DIN PARTEA DE JOS
ru: ПОКАЗАТЬ НИЖНИЙ ЭКРАН
si: පහළ පත්‍රය පෙන්වන්න
sk: ZOBRAZIŤ DOLNÝ HÁROK
sq: SHFAQ FLETËN E POSHTME
sr: ПРИКАЖИ ДОЊУ ТАБЕЛУ
sr_latn: PRIKAŽI DONJU TABELU
sv: VISA ARK PÅ NEDRE DELEN AV SKÄRMEN
te: దిగువున షీట్‌ను చూపు
th: แสดง Bottom Sheet
tr: ALT SAYFAYI GÖSTER
uk: ПОКАЗАТИ СТОРІНКУ, ЩО РОЗГОРТАЄТЬСЯ ЗНИЗУ
ur: نیچے کی شیٹ دکھائیں
uz: QUYI EKRANNI CHIQARISH
vi: HIỂN THỊ BẢNG DƯỚI CÙNG
zh_hk: 顯示底部工作表
zu: BONISA ISHIDI ELIPHANSI

# demoTextFieldPhoneNumber
source: Phone number*
af: Foonnommer*
am: ስልክ ቁጥር*
ar_eg: رقم الهاتف*
as: ফ’ন নম্বৰ*
az: Telefon nömrəsi*
be: Нумар тэлефона*
bn: ফোন নম্বর*
bs: Broj telefona*
ca: Número de telèfon*
da: Telefonnummer*
es_ar: Número de teléfono*
et: Telefoninumber*
eu: Telefono-zenbakia*
fa: شماره تلفن*
fil: Numero ng telepono*
fr_ca: Numéro de téléphone*
gl: Número de teléfono*
gu: ફોન નંબર*
he: מספר טלפון*
hi: फ़ोन नंबर*
hu: Telefonszám*
hy: Հեռախոսահամար*
id: Nomor telepon*
it: Numero di telefono*
ja: 電話番号*
ka: ტელეფონის ნომერი*
km: លេខទូរសព្ទ*
kn: ಫೋನ್ ಸಂಖ್ಯೆ*
ko: 전화번호*
ky: Телефон номери*
lo: ເບີໂທລະສັບ*
lt: Telefono numeris*
lv: Tālruņa numurs*
mk: Телефонски број*
ml: ഫോൺ നമ്പർ*
mn: Утасны дугаар*
mr: फोन नंबर*
ms: Nombor telefon*
my: ဖုန်းနံပါတ်*
nb: Telefonnummer*
ne: फोन नम्बर*
pa: ਫ਼ੋਨ ਨੰਬਰ*
pl: Numer telefonu*
pt: Número de telefone*
pt_pt: Número de telefone*
ro: Număr de telefon*
ru: Номер телефона*
si: දුරකථන අංකය*
sk: Telefónne číslo*
sq: Numri i telefonit*
sr: Број телефона*
sr_latn: Broj telefona*
sv: Telefonnummer*
te: ఫోన్ నంబర్*
th: หมายเลขโทรศัพท์*
tr: Telefon numarası*
uk: Номер телефону*
ur: فون نمبر*
uz: Telefon raqami*
vi: Số điện thoại*
zh_hk: 電話號碼*
zu: Inombolo yefoni*

# demoBottomSheetTitle
source: Bottom sheet
af: Blad onder
am: የግርጌ ሉህ
ar_eg: البطاقة السفلية
as: একেবাৰে নিম্নাংশৰ শ্বীট
az: Aşağıdakı vərəq
be: Ніжні аркуш
bn: বটম শিট
bs: Donja tabela
ca: Full inferior
da: Felt i bunden
es_ar: Hoja inferior
et: Alumine leht
eu: Beheko orria
fa: برگه پایانی
fr_ca: Page de contenu en bas de l'écran
gl: Panel inferior
gu: બોટમ શીટ
he: גיליון תחתון
hi: बॉटम शीट
hu: Alsó lap
hy: Ներքևի թերթ
id: Sheet bawah
it: Foglio inferiore
ja: ボトムシート
ka: ქვედა ფურცელი
km: សន្លឹក​ខាងក្រោម
kn: ಕೆಳಭಾಗದ ಶೀಟ್
ko: 하단 시트
ky: Ылдый жактагы меню
lt: Apatinio lapo mygtukas
lv: Ekrāna apakšdaļas izklājlapa
mk: Долен лист
ml: ബോട്ടം ഷീറ്റ്
mn: Доод хүснэгт
mr: तळाचे शीट
ms: Helaian bawah
my: အောက်ခြေမီနူးပါ စာမျက်နှာ
nb: Felt nederst
ne: फेदको पाना
pa: ਹੇਠਲੀ ਸ਼ੀਟ
pl: Plansza dolna
pt: Página inferior
pt_pt: Secção inferior
ro: Foaia din partea de jos
ru: Нижний экран
si: පහළ පත්‍රය
sk: Dolný hárok
sq: Fleta e poshtme
sr: Доња табела
sr_latn: Donja tabela
sv: Ark på nedre delen av skärmen
te: దిగువున ఉన్న షీట్
tr: Alt sayfa
uk: Сторінка, що розгортається знизу
ur: نیچے کی شیٹ
uz: Quyi ekran
vi: Bảng dưới cùng
zh_hk: 底部工作表
zu: Ishidi eliphansi

# demoTextFieldEmail
source: Email
af: E-pos
am: ኢሜይል
ar_eg: رسالة إلكترونية
as: ইমেইল
az: E-poçt
be: Адрас электроннай пошты
bn: ইমেল
bs: Adresa e-pošte
ca: Adreça electrònica
da: Mail
es_ar: Correo electrónico
et: E-post
eu: Helbide elektronikoa
fa: ایمیل
fr_ca: Courriel
gl: Correo electrónico
gu: ઇમેઇલ
he: אימייל
hi: ईमेल
hu: E-mail-cím
hy: Էլ․ հասցե
it: Indirizzo email
ja: メールアドレス
ka: ელფოსტა
km: អ៊ីមែល
kn: ಇಮೇಲ್
ko: 이메일
ky: Электрондук почта
lo: ອີເມວ
lt: El. paštas
lv: E-pasta adrese
mk: Е-пошта
ml: ഇമെയിൽ
mn: Имэйл
mr: ईमेल
ms: E-mel
my: အီးမေးလ်
nb: E-postadresse
ne: इमेल
pa: ਈਮੇਲ
ru: Адрес электронной почты
si: ඉ-තැපෑල
sq: Email-i
sr: Имејл
sr_latn: Imejl
sv: E-post
te: ఈమెయిల్‌
th: อีเมล
tr: E-posta
uk: Електронна адреса
ur: ای میل
zh_hk: 電郵
zu: I-imeyili

# demoTextFieldTellUsAboutYourself
source: Tell us about yourself (e.g., write down what you do or what hobbies you have)
af: Vertel ons meer oor jouself (bv., skryf neer wat jy doen of wat jou stokperdjies is)
am: ስለራስዎ ይንገሩን (ለምሳሌ፡0 ምን እንደሚያደርጉ ወይም ምን ዝንባሌዎች እንዳለዎት)
ar_eg: أخبِرنا عن نفسك (مثلاً ما هي هواياتك المفضّلة أو ما هو مجال عملك؟)
as: আমাক আপোনাৰ বিষয়ে কওক (উদাহৰণস্বৰূপে, আপুনি কি কৰে অথবা আপোনাৰ কৰি ভাল পোৱা কামবোৰৰ বিষয়ে লিখক)
az: Özünüz barədə bildirin (məsələn, nə işlə məşğul olduğunuz və ya maraqlarınız barədə yazın)
be: Паведаміце нам пра сябе (напрыклад, напішыце, чым вы захапляецеся)
bn: আপনার সম্পর্কে আমাদের জানান (যেমন, আপনি কী করেন অথবা আপনি কী করতে পছন্দ করেন)
bs: Recite nam nešto o sebi (npr. napišite čime se bavite ili koji su vam hobiji)
ca: Explica'ns alguna cosa sobre tu (p. ex., escriu a què et dediques o quines són les teves aficions)
da: Fortæl os, hvem du er (du kan f.eks. skrive, hvad du laver, eller hvilke fritidsinteresser du har)
es_ar: Cuéntanos sobre ti (p. ej., escribe sobre lo que haces o tus pasatiempos)
et: Rääkige meile endast (nt kirjutage oma tegevustest või hobidest)
eu: Esan zerbait zuri buruz (adibidez, zertan egiten duzun lan edo zer zaletasun dituzun)
fa: درباره خودتان بگویید (مثلاً بنویسید چکار می‌کنید یا سرگرمی‌های موردعلاقه‌تان چیست)
fil: Bigyan kami ng impormasyon tungkol sa iyo (hal., isulat kung ano'ng ginagawa mo sa trabaho o ang mga libangan mo)
fr_ca: Parlez-nous de vous (par exemple, indiquez ce que vous faites ou quels sont vos loisirs)
gl: Fálanos de ti (por exemplo, escribe en que traballas ou que pasatempos tes)
gu: અમને તમારા વિશે જણાવો (દા.ત., તમે શું કરો છો તે અથવા તમારા શોખ વિશે લખો)
he: יש לספר על עצמך (לדוגמה: עליך לכתוב מה המקצוע שלך או מה התחביבים שלך)
hi: हमें अपने बारे में कुछ बताएं (जैसे कि आप क्या करते हैं या आपके क्या शौक हैं)
hu: Beszéljen magáról (pl. írja le, hogy mivel foglalkozik vagy mik a hobbijai)
hy: Պատմեք ձեր մասին (օր․՝ ինչ հոբբի ունեք)
id: Ceritakan diri Anda (misalnya, tuliskan kegiatan atau hobi Anda)
it: Parlaci di te (ad esempio, scrivi cosa fai o quali sono i tuoi hobby)
ja: 自己紹介をご記入ください（仕事、趣味など）
ka: გვიამბეთ თქვენ შესახებ (მაგ., დაწერეთ, რას საქმიანობთ ან რა ჰობი გაქვთ)
km: ប្រាប់យើង​អំពីខ្លួនអ្នក (ឧ. សរសេរអំពី​អ្វីដែលអ្នកធ្វើ ឬចំណូលចិត្តអ្វី​ដែលអ្នកមាន)
kn: ನಿಮ್ಮ ಬಗ್ಗೆ ನಮಗೆ ತಿಳಿಸಿ (ಉದಾ. ನೀವು ಏನು ಕೆಲಸವನ್ನು ಮಾಡುತ್ತಿದ್ದೀರಿ ಅಥವಾ ಯಾವ ಹವ್ಯಾಸಗಳನ್ನು ಹೊಂದಿದ್ದೀರಿ ಎಂಬುದನ್ನು ಬರೆಯಿರಿ)
ko: 자기소개(예: 직업, 취미 등)
ky: Өзүңүз жөнүндө айтып бериңиз (мис., эмне иш кыларыңызды же кандай хоббилериңиз бар экенин айтып бериңиз)
lo: ບອກພວກເຮົາກ່ຽວກັບຕົວທ່ານ (ຕົວຢ່າງ: ໃຫ້ຈົດສິ່ງທີ່ທ່ານເຮັດ ຫຼື ວຽກຍາມຫວ່າງຂອງທ່ານ)
lt: Papasakokite apie save (pvz., parašykite, ką veikiate ar kokie jūsų pomėgiai)
lv: Pastāstiet par sevi (piem., uzrakstiet, ar ko jūs nodarbojaties vai kādi ir jūsu vaļasprieki)
mk: Кажете ни нешто за вас (на пр., напишете што работите или со кое хоби се занимавате)
ml: നിങ്ങളെക്കുറിച്ച് ഞങ്ങളോട് പറയുക (ഉദാ. നിങ്ങൾ എന്താണ് ചെയ്യുന്നത്, ഹോബികൾ എന്തൊക്കെ തുടങ്ങിയവ എഴുതുക)
mn: Бидэнд өөрийнхөө талаар хэлнэ үү (ж.нь, та ямар ажил хийдэг эсвэл та ямар хоббитой талаараа бичнэ үү)
mr: आम्हाला तुमच्याबद्दल सांगा (उदा., तुम्ही काय करता आणि तुम्हाला कोणते छंद आहेत ते लिहा)
ms: Beritahu kami tentang diri anda. (misalnya, tulis perkara yang anda lakukan atau hobi anda)
my: သင့်အကြောင်း ပြောပြပါ (ဥပမာ သင့်အလုပ် သို့မဟုတ် သင့်ဝါသနာကို ချရေးပါ)
nb: Fortell oss om deg selv (f.eks. skriv ned det du gjør, eller hvilke hobbyer du har)
ne: हामीलाई आफ्नो बारेमा बताउनुहोस् (जस्तै, आफ्नो पेसा वा आफ्ना रुचिहरू लेख्नुहोस्)
pa: ਸਾਨੂੰ ਆਪਣੇ ਬਾਰੇ ਦੱਸੋ (ਜਿਵੇਂ ਤੁਸੀਂ ਕੀ ਕਰਦੇ ਹੋ ਜਾਂ ਆਪਣੀਆਂ ਆਦਤਾਂ ਬਾਰੇ ਲਿਖੋ)
pl: Opowiedz nam o sobie (np. napisz, czym się zajmujesz lub jakie masz hobby)
pt: Fale um pouco sobre você, por exemplo, escreva o que você faz ou quais são seus hobbies
pt_pt: Fale-nos sobre si (por exemplo, escreva o que faz ou fale sobre os seus passatempos)
ro: Povestiți-ne despre dvs. (de exemplu, scrieți cu ce vă ocupați sau ce pasiuni aveți)
ru: Расскажите о себе (например, какое у вас хобби)
si: ඔබ ගැන අපට පවසන්න (උදා, ඔබ කරන දේ හෝ ඔබට තිබෙන විනෝදාංශ මොනවාද යන්න ලියා ගන්න)
sk: Povedzte nám o sebe (napíšte napríklad, kde pracujete alebo aké máte záľuby)
sq: Na trego rreth vetes (p.sh. shkruaj se çfarë bën ose çfarë hobish ke)
sr: Реците нам нешто о себи (нпр. напишите чиме се бавите или које хобије имате)
sr_latn: Recite nam nešto o sebi (npr. napišite čime se bavite ili koje hobije imate)
sv: Berätta lite om dig själv (t.ex. vad du jobbar med eller vilka fritidsintressen du har)
te: మీ గురించి మాకు చెప్పండి (ఉదా., మీరు ఏమి చేస్తుంటారు, మీ అభిరుచులు ఏమిటి)
th: แนะนำตัวให้เรารู้จัก (เช่น เขียนว่าคุณทำงานอะไรหรือมีงานอดิเรกอะไรบ้าง)
tr: Bize kendinizden bahsedin (örneğin, ne iş yaptığınızı veya hobilerinizi yazın)
uk: Розкажіть про себе (наприклад, ким ви працюєте або які у вас хобі)
ur: اپنے بارے میں بتائیں (مثلاً، لکھیں کہ آپ کیا کرتے ہیں اور آپ کے مشغلے کیا ہیں)
uz: Oʻzingiz haqingizda aytib bering (masalan, nima ish qilishingiz yoki qanday hobbilaringiz borligini yozing)
vi: Giới thiệu về bản thân (ví dụ: ghi rõ nghề nghiệp hoặc sở thích của bạn)
zh_hk: 自我介紹 (例如您的職業或興趣)
zu: Sitshele ngawe (isb., bhala phansi okwenzayo noma okuthandayo onakho)
