Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# fortnightlyMenuTravel
source: Travel
af: Reis
am: ጉዞ
ar_eg: سفر
as: ভ্ৰমণ
az: Səyahət
be: Падарожжы
bn: ভ্রমণ
bs: Putovanja
ca: Viatges
da: Rejser
es_ar: Viajes
et: Reisimine
eu: Bidaiak
fa: سفر
fil: Paglalakbay
fr_ca: Voyages
gl: Viaxes
gu: મુસાફરી
he: נסיעות
hi: यात्रा
hu: Utazás
hy: Ճանապարհորդություն
id: Wisata
it: Viaggi
ja: 旅行
ka: მოგზაურობა
km: ការធ្វើ​ដំណើរ
kn: ಪ್ರಯಾಣ
ko: 여행
ky: Саякат
lo: ທ່ອງທ່ຽວ
lt: Kelionės
lv: Ceļošana
mk: Патувања
ml: യാത്ര
mn: Аялал
mr: प्रवास
ms: Pelancongan
my: ခရီးသွားခြင်း
nb: Reise
ne: यात्रा
pa: ਯਾਤਰਾ
pl: Podróże
pt: Viagens
pt_pt: Viagens
ro: Călătorii
ru: Путешествия
si: සංචාර
sk: Cestovanie
sq: Udhëtim
sr: Путовања
sr_latn: Putovanja
sv: Resor
te: ప్రయాణం
th: ท่องเที่ยว
tr: Seyahat
uk: Подорожі
ur: سفر
uz: Sayohat
vi: Du lịch
zh_hk: 旅遊
zu: Ukuvakasha

# fortnightlyMenuCulture
source: Culture
af: Kultuur
am: ባህል
ar_eg: ثقافة
as: সংস্কৃতি
az: Mədəniyyət
be: Культура
bn: সংস্কৃতি
bs: Kultura
ca: Cultura
da: Kultur
es_ar: Cultura
et: Kultuur
eu: Kultura
fa: فرهنگی
fil: Kultura
gl: Cultura
gu: સંસ્કૃતિ
he: תרבות
hi: संस्कृति
hu: Kultúra
hy: Մշակույթ
id: Budaya
it: Cultura
ja: カルチャー
ka: კულტურა
km: វប្បធម៌
kn: ಸಂಸ್ಕೃತಿ
ko: 문화
ky: Маданият
lo: ວັດທະນະທຳ
lt: Kultūra
lv: Kultūra
mk: Култура
ml: സംസ്‌കാരം
mn: Соёл
mr: संस्कृती
ms: Budaya
my: ယဉ်ကျေးမှု
nb: Kultur
ne: संस्कृति
pa: ਸੱਭਿਆਚਾਰ
pl: Kultura
pt: Cultura
pt_pt: Cultura
ro: Cultură
ru: Культура
si: සංස්කෘතිය
sk: Kultúra
sq: Kulturë
sr: Култура
sr_latn: Kultura
sv: Kultur
te: సంస్కృతి
th: วัฒนธรรม
tr: Kültür
uk: Культура
ur: ثقافت
uz: Madaniyat
vi: Văn hóa
zh_hk: 文化
zu: Isiko

# fortnightlyTrendingTechDesign
source: TechDesign
af: Tegnologieontwerp
am: የቴክ ንድፍ
ar_eg: تصميم_تكنولوجي
az: Texnoloji Dizayn
bs: Tehnološki dizajn
ca: DissenyTecnològic
eu: DiseinuTeknologikoa
fil: Disenyo ng Teknolohiya
fr_ca: Conceptionstechniques
gl: DeseñoDeTecnoloxía
id: DesainTeknologi
it: ProgettazioneTecnologica
km: បច្ចេកវិទ្យា​នៃការរចនា
ko: 기술_디자인
ky: Техникалык дизайн
lo: ອອກແບບເທັກໂນໂລຢີ
lt: Technologijų dizainas
my: နည်းပညာဒီဇိုင်း
pt: DesignDeTecnologia
ro: Design tehnologic
sk: Technologický dizajn
te: టెక్ డిజైన్
th: การออกแบบและเทคโนโลยี
uz: TexDizayn
zu: I-TechDesign

# rallyBudgetDetailAmountLeft
source: Amount Left
af: Bedrag oor
am: የቀረ መጠን
ar_eg: المبلغ المتبقي
as: বাকী থকা পৰিমাণ
az: Qalan Məbləğ
be: Астатак
bn: হাতে থাকা অর্থের পরিমাণ
bs: Preostali iznos
ca: Import restant
da: Resterende beløb
es_ar: Importe disponible
et: Järelejäänud summa
eu: Gelditzen dena
fa: مبلغ باقی‌مانده
fil: Halagang Natitira
fr_ca: Montant restant
gl: Importe restante
gu: બાકી રહેલી રકમ
he: הסכום שנותר
hi: बची हुई रकम
hu: Fennmaradó összeg
hy: Մնացած գումարը
id: Jumlah Tersisa
it: Importo rimanente
ja: 残額
ka: დარჩენილი თანხა
km: ចំនួន​ទឹកប្រាក់​ដែលនៅសល់
kn: ಉಳಿದ ಮೊತ್ತ
ko: 남은 금액
ky: Калган сумма
lo: ຈຳນວນທີ່ຍັງເຫຼືອ
lt: Likusi suma
lv: Atlikusī summa
mk: Преостанат износ
ml: ശേഷിക്കുന്ന തുക
mn: Ашиглаагүй дүн
mr: शिल्लक रक्कम
ms: Jumlah Baki
my: ကျန်ရှိသည့် ပမာဏ
nb: Gjenværende beløp
ne: बाँकी रकम
pa: ਬਾਕੀ ਰਕਮ
pl: Pozostała kwota
pt: Quantidade restante
pt_pt: Valor restante
ro: Suma rămasă
ru: Осталось
si: ඉතිරි මුදල
sk: Zostatok
sq: Shuma e mbetur
sr: Преостали износ
sr_latn: Preostali iznos
sv: Kvarstående belopp
te: మిగిలిన మొత్తం
th: จำนวนที่เหลือ
tr: Kalan Miktar
uk: Залишок
ur: بچی ہوئی رقم
uz: Qolgan summa
vi: Số tiền còn lại
zh_hk: 餘額
zu: Inani elisele

# fortnightlyHeadlineArmy
source: Reforming The Green Army From Within
af: Hervorm die groenweermag van binne af
am: አረንጓዴውን ሠራዊት ከውስጥ መለወጥ
ar_eg: إصلاح الجيش الأخضر من الداخل
as: গ্ৰীন আৰ্মিৰ আত্মসংস্কাৰ
az: Daxildən Yaşıl Ordunun Yenidənqurması
be: Зялёная армія: рэфармаванне знутры
bn: গ্রিন আর্মির আত্মা শুদ্ধিকরণ
bs: Reforma zelene armije iznutra
ca: La reforma de l'Exèrcit Verd des de dins
da: "Den grønne hær" reformeres indefra
es_ar: Reforma interna del "Ejército verde"
et: Rohelise armee reformimine seestpoolt
eu: Armada Berdea barrualdetik eraldatzea
fa: اصلاح ارتش سبز از درون
fil: Pagreporma sa Green Army Mula sa Loob
fr_ca: Réformer l'armée verte de l'intérieur
gl: Reformando o Exército Verde desde dentro
gu: પર્યાવરણની રક્ષકોના સંગાથે
he: הרפורמה ב"צבא הירוק" מתחילה מבפנים
hi: द ग्रीन आर्मी को पूरी तरह बेहतर करना
hu: A Zöld sereg belső reformja
hy: Կանաչ բանակի ներքին բարեփոխումներ
id: Reformasi Internal Green Army
it: Riformare Green Army dall'interno
ja: Green Army の内部改革
ka: მწვანე არმიის რეფორმა შიგნიდან
km: ការធ្វើ​កំណែទម្រង់​ផ្ទៃក្នុង Green Army
kn: ಹಸಿರು ಸೈನ್ಯದ ಆಂತರಿಕ ಸುಧಾರಣೆ
ko: 내부에서부터 진행되는 녹색군의 개혁
ky: Жашыл армиянын ичинен реформалоо
lo: ການປະຕິຮູບກອງທັບຂຽວຈາກພາຍໃນ
lt: Žaliosios armijos reformavimas iš vidaus
lv: Zaļās armijas reforma no iekšpuses
mk: Реформирање на зелената армија однатре
ml: ഗ്രീൻ ആർമിയെ അകത്തുനിന്നും പരിഷ്ക്കരിക്കൽ
mn: Ногоон армийг дотроос нь шинэчлэх нь
mr: ग्रीन आर्मीमधील चांगले बदल
my: အတွင်း၌ပင် အစိမ်းရောင် စစ်တပ်ကို ပြုပြင်ပြောင်းလဲခြင်း
nb: Reformering av den grønne armeen fra innsiden
ne: हरित सेनाको आन्तरिक सुधार गर्ने तरिका
pa: ਦ ਗ੍ਰੀਨ ਆਰਮੀ ਨੂੰ ਅੰਦਰੋਂ ਪੂਰੀ ਤਰ੍ਹਾਂ ਬਿਹਤਰ ਕਰਨਾ
pl: Wewnętrzna reforma Green Army
pt: Reforma interna do Exército Verde
pt_pt: Reformar o exército verde a partir do seu cerne
ro: Reformarea armatei de mediu din interior
ru: Зеленая армия: реформирование изнутри
si: ඇතුළතින් කොළ හමුදාව ප්‍රතිසංස්කරණය කරමින්
sk: Reforma Zelenej armády zvnútra
sq: Reformimi i ushtrisë së gjelbër nga brenda saj
sr: Реформисање Зелене армије изнутра
sr_latn: Reformisanje Zelene armije iznutra
sv: Green Army ombildas inifrån
te: 'ద గ్రీన్ ఆర్మీ' అంతర్గత పునరుద్ధరణ
th: การปฏิรูป Green Army จากภายใน
tr: Green Army'yi İçeriden Değiştirme
uk: Внутрішні реформи зеленої армії
ur: گرین آرمی کی درون اصلاح
uz: Yashil armiyalardagi ichki islohatlar
vi: Cải cách Green Army từ bên trong
zh_hk: 綠軍的內部改革
zu: Ukulungiswa Kwempi Eluhlaza Kusukela Ngaphakathi

# fortnightlyDescription
source: A content-focused news app
af: 'n Inhoudgefokusde nuusprogram
am: ይዘት ላይ ያተኮረ የዜና መተግበሪያ
ar_eg: تطبيق أخبار يركّز على المحتوى
as: সমলত বিশেষ গুৰুত্ব আৰোপ কৰা এটা সংবাদ এপ্‌
az: Məzmuna fokuslanmış xəbər tətbiqi
be: Праграма, прысвечаная навінам
bn: কন্টেন্ট-কেন্দ্রীক খবরের অ্যাপ
bs: Aplikacija za vijesti s fokusom na sadržaj
ca: Una aplicació de notícies centrada en el contingut
da: En nyhedsapp med fokus på indhold
es_ar: Una app enfocada en el contenido
et: Sisule keskenduv uudisterakendus
eu: Edukian oinarritutako albiste-aplikazioa
fa: برنامه خبری محتوامحور
fil: Isang app ng balita na nakatuon sa content
fr_ca: Une application centrée sur le contenu
gl: Unha aplicación de noticias centrada no contido
gu: કન્ટેન્ટ પર ફોકસ રાખતી સમાચાર ઍપ
he: אפליקציית חדשות עם מיקוד בתוכן
hi: सामग्री पर ज़्यादा ध्यान देने वाला समाचार ऐप्लिकेशन
hu: Tartalomközpontú hírszolgáltató alkalmazás
hy: Նորությունների հավելված, որում կարևորը բովանդակությունն է
id: Aplikasi berita yang fokus pada konten
it: Un'app di notizie incentrata sui contenuti
ja: コンテンツ中心のニュースアプリ
ka: ახალი ამბების კონტენტზე ორიენტირებული აპი
km: កម្មវិធី​ព័ត៌មាន​ដែលផ្ដោតលើ​ខ្លឹមសារ
kn: ವಿಷಯ ಕೇಂದ್ರಿತ ಸುದ್ದಿ ಆ್ಯಪ್
ko: 콘텐츠를 주력으로 하는 뉴스 앱
ky: Мазмунга басым жасаган жаңылыктар колдонмосу
lo: ແອັບຂ່າວທີ່ເນັ້ນເນື້ອຫາ
lt: Į turinį orientuota naujienų programa
lv: Uz saturu orientēta ziņu lietotne
mk: Апликација за вести фокусирана на содржини
ml: ഉള്ളടക്കം കേന്ദ്രീകരിച്ചുള്ള വാർത്താ ആപ്പ്
mn: Контентод төвлөрсөн мэдээний апп
mr: एका आशयावर केंद्रित असलेले बातम्यांचे ॲप
ms: Apl berita berfokuskan kandungan
my: အကြောင်းအရာ အထူးဖော်ပြထားသည့် သတင်းအက်ပ်
nb: En innholdsfokusert nyhetsapp
ne: सामग्रीमा केन्द्रित समाचार एप
pa: ਸਮੱਗਰੀ-ਕੇਂਦਰਿਤ ਖਬਰਾਂ ਐਪ
pl: Aplikacja z wiadomościami, w której liczy się treść
pt: Um app de notícias com foco em conteúdo
pt_pt: Uma app de notícias focada no conteúdo
ro: O aplicație de știri axată pe conținut
ru: Новостное приложение, в котором главное – контент
si: අන්තර්ගතයට යොමු වූ පුවත් යෙදුමකි
sk: Spravodajská aplikácia zameraná na obsah
sq: Një aplikacion lajmesh i fokusuar te përmbajtja
sr: Апликација за вести фокусирана на садржај
sr_latn: Aplikacija za vesti fokusirana na sadržaj
sv: En app med nyheter i fokus
te: కంటెంట్-ప్రధాన వార్తల యాప్
th: แอปข่าวที่มุ่งเน้นเนื้อหา
tr: İçeriğe odaklanmış haberler uygulaması
uk: Додаток новин з акцентом на контент
ur: ایک مواد فوکسڈ خبروں کی ایپ
uz: Eng muhim yangiliklar haqidagi ilova
vi: Ứng dụng tin tức dành cho những nội dung đặc sắc
zh_hk: 以內容為本的新聞應用程式
zu: Uhlelo lokusebenza lwezindaba olugxiliswe kokuqukethwe

# rallyBillDetailAmountDue
source: Amount Due
af: Bedrag verskuldig
am: መከፈል ያለበት መጠን
ar_eg: المبلغ المستحق
as: বকেয়া পৰিমাণ
az: Ödəniləcək Məbləğ
be: Сума да аплаты
bn: বকেয়া অর্থের পরিমাণ
bs: Dospjeli iznos
ca: Import pendent
da: Til betaling
es_ar: Importe a pagar
et: Tasumisele kuuluv summa
eu: Zor duzuna
fa: مبلغ قابل‌پرداخت
fil: Halagang Kailangang Bayaran
fr_ca: Montant dû
gl: Importe debido
gu: ચુકવવાની રકમ
he: הסכום לתשלום
hi: बकाया रकम
hu: Fizetendő összeg
hy: Վճարման ենթակա գումարը
id: Jumlah Terutang
it: Importo dovuto
ja: 未払い額
ka: გადასახდელი თანხა
km: ចំនួន​ទឹកប្រាក់​ដែលត្រូវបង់
kn: ಬಾಕಿ ಮೊತ್ತ
ko: 미결제 금액
ky: Төлөнүүчү сумма
lo: ຈຳນວນທີ່ຕ້ອງຈ່າຍ
lt: Mokėtina suma
lv: Maksājamā summa
mk: Износ за наплата
ml: അടയ്‌ക്കേണ്ട തുക
mn: Төлөх дүн
mr: भरायची असलेली रक्कम
ms: Jumlah Perlu Dibayar
my: ပေးရမည့် ပမာဏ
nb: Skyldig beløp
ne: तिर्नु पर्ने रकम
pa: ਬਾਕੀ ਰਕਮ
pl: Należna kwota
pt: Valor devido
pt_pt: Valor em dívida
ro: Suma datorată
ru: К оплате
si: ගෙවිය යුතු මුදල
sk: Dlžná suma
sq: Shuma për t'u paguar
sr: Износ задужења
sr_latn: Iznos zaduženja
sv: Belopp som ska betalas
te: బకాయి మొత్తం
th: จำนวนที่ครบกำหนดชำระ
tr: Ödenmesi Gereken Tutar
uk: Сума до оплати
ur: واجب الادا رقم
uz: Qarz miqdori
vi: Số tiền phải thanh toán
zh_hk: 應付金額
zu: Inani elifunekayo

# rallyBudgetDetailTotalCap
source: Total Cap
af: Totaallimiet
am: ጠቅላላ ካፒታል
ar_eg: الحد الأقصى الإجمالي
as: মুঠ খৰচৰ উচ্চসীমা
az: Cəmi Kapital
be: Верхняя мяжа
bn: খরচের ঊর্ধ্বসীমা
bs: Ukupno ograničenje
ca: Límit total
da: Samlet budgetloft
es_ar: Capital total
et: Kogulimiit
eu: Muga, guztira
fa: کل سقف بودجه
fil: Kabuuang Cap
fr_ca: Limite de budget
gl: Límite total
gu: કુલ બજેટ
he: מכסה כוללת
hi: कुल बजट
hu: Össztőke
hy: Ընդհանուր սահմանաչափ
id: Total Batasan
it: Limite totale
ja: 合計金額
ka: ჯამური კაპიტალიზაცია
km: ការប្រើ​ដើមទុន​សរុប
kn: ಒಟ್ಟು ಮಿತಿ
ko: 총한도
ky: Жалпы чек
lo: ຄວາມຈຸທັງໝົດ
lt: Didžiausia bendra suma
lv: Kopējais budžets
mk: Вкупно
ml: മൊത്തം തുകയുടെ പരിധി
mn: Нийт капитализац
mr: खर्चावरील एकूण मर्यादा
ms: Jumlah Had
my: စုစုပေါင်း ကန့်သတ်ပမာဏ
nb: Total grense
ne: कुल बजेट
pa: ਕੁੱਲ ਪ੍ਰਤਿਬੰਧ
pl: Łączny limit
pt: Valor máximo total
pt_pt: Limite total
ro: Limita totală
ru: Верхний предел
si: මුළු ප්‍රාග්ධනය
sk: Celkový limit
sq: Kufiri total
sr: Укупно ограничење
sr_latn: Ukupno ograničenje
sv: Totalt belopp för budgettaket
te: మొత్తం పెట్టుబడి సామర్థ్యం
th: จำนวนรวมสูงสุดที่กำหนด
tr: Toplam Değer
uk: Загальне обмеження
ur: کُل کیپ
uz: Budjet miqdori
vi: Tổng số tiền
zh_hk: 上限總計
zu: I-cap yesamba

# rallyBudgetDetailAmountUsed
source: Amount Used
af: Bedrag gebruik
am: ጥቅም ላይ የዋለው መጠን
ar_eg: المبلغ المستخدم
as: ব্যৱহৃত পৰিমাণ
az: İstifadə Edilən Məbləğ
be: Зрасходаваная сума
bn: যে পরিমাণ অর্থ খরচ করা হয়েছে
bs: Iskorišteni iznos
ca: Import utilitzat
da: Brugt beløb
es_ar: Importe gastado
et: Kasutatud summa
eu: Erabilitakoa
fa: مبلغ استفاده‌شده
fil: Halagang Nagamit
fr_ca: Montant utilisé
gl: Importe utilizado
gu: વપરાયેલી રકમ
he: הסכום שנוצל
hi: इस्तेमाल की गई रकम
hu: Felhasznált összeg
hy: Օգտագործված գումարը
id: Jumlah yang Digunakan
it: Importo usato
ja: 使用量
ka: დახარჯული თანხა
km: ចំនួន​ទឹកប្រាក់​ដែលបានប្រើ
kn: ಬಳಸಿದ ಮೊತ್ತ
ko: 사용 금액
ky: Сарпталган сумма
lo: ຈຳນວນທີ່ໃຊ້ໄປແລ້ວ
lt: Išnaudota suma
lv: Izmantotā summa
mk: Искористен износ
ml: ഉപയോഗിച്ച തുക
mn: Ашигласан дүн
mr: वापरलेली रक्कम
ms: Jumlah Digunakan
my: အသုံးပြုထားသည့် ပမာဏ
nb: Brukt beløp
ne: प्रयोग गरिएको रकम
pa: ਵਰਤੀ ਗਈ ਰਕਮ
pl: Wykorzystana kwota
pt: Quantidade usada
pt_pt: Valor utilizado
ro: Suma cheltuită
ru: Израсходовано
si: භාවිත කළ මුදල
sk: Minutá suma
sq: Shuma e përdorur
sr: Искоришћени износ
sr_latn: Iskorišćeni iznos
sv: Förbrukat belopp
te: ఉపయోగించిన మొత్తం
th: จำนวนที่ใช้
tr: Kullanılan Miktar
uk: Використана сума
ur: صرف کردہ رقم
uz: Ishlatilgan summa
vi: Số tiền đã dùng
zh_hk: 已用金額
zu: Inani elisetshenzisiwe

# fortnightlyTrendingHealthcareRevolution
source: HealthcareRevolution
af: Gesondheidsorgrevolusie
am: የጤና እንክብካቤ አብዮት
ar_eg: ثورة_الرعاية_الصحية
az: Səhiyyə İnqilabı
bs: Revolucija u zdravstvu
ca: RevolucióSanitària
eu: OsasunZerbitzuenIraultza
fil: Rebolusyon sa Pangangalaga sa Kalusugan
fr_ca: Révolutiondusystèmedesanté
gl: RevoluciónDaSanidade
id: RevolusiPelayananKesehatan
it: RivoluzioneSanitaria
km: បដិវត្តន៍​នៃ​ការថែទាំ​សុខភាព
ko: 건강보험_개혁
ky: Саламаттыкты сактоодогу революция
lo: ວິວັດທະນາການສຸຂະພາບ
lt: Sveikatos priežiūros perversmas
my: ကျန်းမာရေးစောင့်ရှောက်မှု ပြောင်းလဲခြင်း
pt: RevoluçãoNaSaúde
ro: Revoluția în sănătate
sk: Revolúcia v zdravotníctve
te: ఆరోగ్య పరిరక్షణలో చైతన్యం
th: การปฏิวัติสาธารณสุข
uz: Salomatlik inqiloblari
zu: I-HealthcareRevolution

# fortnightlyMenuFrontPage
source: Front Page
af: Voorblad
am: የፊት ገፅ
ar_eg: الصفحة الأمامية
as: প্ৰথম পৃষ্ঠা
az: Ön Səhifə
be: Галоўная старонка
bn: সামনের পৃষ্ঠা
bs: Naslovnica
ca: Portada
da: Forside
es_ar: Portada
et: Esileht
eu: Orri nagusia
fa: صفحه اول
fr_ca: Page couverture
gl: Portada
gu: ફ્રન્ટ પેજ
he: עמוד ראשי
hi: होम पेज
hu: Címlap
hy: Առաջին էջ
id: Halaman Depan
it: Prima pagina
ja: トップページ
ka: პირველი გვერდი
km: ទំព័រ​មុខ
kn: ಮುಂದಿನ ಪುಟ
ko: 메인 페이지
ky: Башкы бет
lo: ໜ້າຫຼັກ
lt: Pradinis puslapis
lv: Sākumlapa
mk: Насловна страница
ml: മുൻ പേജ്
mn: Нүүр хуудас
mr: मुख्य पेज
ms: Halaman Depan
my: ရှေ့စာမျက်နှာ
nb: Forside
ne: आवरण पृष्ठ
pa: ਅਗਲਾ ਪੰਨਾ
pl: Pierwsza strona
pt: Primeira página
pt_pt: Primeira página
ro: Prima pagină
ru: Главная страница
si: මුල් පිටුව
sk: Titulná strana
sq: Faqja kryesore
sr: Насловна страница
sr_latn: Naslovna stranica
sv: Startsida
te: మొదటి పేజీ
th: หน้าแรก
tr: Ön Sayfa
uk: Перша сторінка
ur: فرنٹ صفحہ
uz: Bosh sahifa
vi: Trang đầu
zh_hk: 頭版
zu: Ikhasi langaphambili

# fortnightlyMenuWorld
source: World
af: Wêreld
am: ዓለም
ar_eg: العالم
as: বিশ্ব
az: Dünya
be: Свет
bn: বিশ্ব
bs: Svijet
ca: Internacional
da: Verden
es_ar: Internacional
et: Maailm
eu: Mundua
fa: جهان
fil: Mundo
fr_ca: Monde
gl: Internacional
gu: વિશ્વ
he: עולם
hi: दुनिया
hu: Világ
hy: Աշխարհ
id: Dunia
it: Dal mondo
ja: 世界
ka: მსოფლიო
km: ពិភពលោក
kn: ಜಗತ್ತು
ko: 세계
ky: Дүйнө
lo: ໂລກ
lt: Pasaulis
lv: Pasaules ziņas
mk: Свет
ml: ലോകം
mn: Дэлхий
mr: विश्व
ms: Dunia
my: ကမ္ဘာ
nb: Verden
ne: विश्व
pa: ਦੁਨੀਆ
pl: Świat
pt: Mundo
pt_pt: Mundo
ro: În lume
ru: Весь мир
si: ලෝකය
sk: Svet
sq: Bota
sr: Свет
sr_latn: Svet
sv: Världen
te: ప్రపంచం
th: ต่างประเทศ
tr: Dünya
uk: Світ
ur: دنیا
uz: Dunyo
vi: Thế giới
zh_hk: 國際
zu: Umhlaba

# rallyBillDetailAmountPaid
source: Amount Paid
af: Bedrag betaal
am: የተከፈለው መጠን
ar_eg: المبلغ المدفوع
as: পৰিশোধ কৰা পৰিমাণ
az: Ödənilən Məbləğ
be: Заплачаная сума
bn: পেমেন্টের পরিমাণ
bs: Plaćeni iznos
ca: Import pagat
da: Betalt beløb
es_ar: Importe pagado
et: Makstud summa
eu: Ordaindutakoa
fa: مبلغ پرداخت‌شده
fil: Halagang Ibinayad
fr_ca: Montant payé
gl: Importe pagado
gu: ચુકવેલી રકમ
he: הסכום ששולם
hi: चुकाई गई रकम
hu: Kifizetett összeg
hy: Վճարված գումարը
id: Jumlah yang Dibayarkan
it: Importo pagato
ja: 支払い額
ka: გადახდილი თანხა
km: ចំនួន​ទឹកប្រាក់​ដែលបានបង់
kn: ಪಾವತಿಸಲಾದ ಮೊತ್ತ
ko: 결제 금액
ky: Төлөнгөн сумма
lo: ຈຳນວນທີ່ຈ່າຍແລ້ວ
lt: Sumokėta suma
lv: Samaksātā summa
mk: Платен износ
ml: അടച്ച തുക
mn: Төлсөн дүн
mr: भरलेली रक्कम
ms: Jumlah Dibayar
my: ငွေပေးချေသည့် ပမာဏ
nb: Betalt beløp
ne: भुक्तानी गरिएको रकम
pa: ਭੁਗਤਾਨ ਕੀਤੀ ਰਕਮ
pl: Zapłacona kwota
pt: Valor pago
pt_pt: Valor pago
ro: Suma plătită
ru: Оплачено
si: ගෙවූ මුදල
sk: Zaplatená suma
sq: Shuma e paguar
sr: Плаћени износ
sr_latn: Plaćeni iznos
sv: Betalat belopp
te: చెల్లించిన మొత్తం
th: จำนวนที่ชำระ
tr: Ödenen Tutar
uk: Сплачена сума
ur: ادا کردہ رقم
uz: Toʻlangan summa
vi: Số tiền đã thanh toán
zh_hk: 已付金額
zu: Inani elikhokhiwe

# fortnightlyMenuPolitics
source: Politics
af: Politiek
am: ፖለቲካ
ar_eg: سياسة
as: ৰাজনীতি
az: Siyasət
be: Палітыка
bn: রাজনীতি
bs: Politika
ca: Política
da: Politik
es_ar: Política
et: Poliitika
eu: Politika
fa: سیاسی
fil: Pulitika
fr_ca: Politique
gl: Política
gu: રાજકારણ
he: פוליטיקה
hi: राजनीति
hu: Politika
hy: Քաղաքականություն
id: Politik
it: Politica
ja: 政治
ka: პოლიტიკა
km: នយោបាយ
kn: ರಾಜಕೀಯ
ko: 정치
ky: Саясат
lo: ການເມືອງ
lt: Politika
lv: Politika
mk: Политика
ml: രാഷ്‌ട്രീയം
mn: Улс төр
mr: राजकारण
ms: Politik
my: နိုင်ငံရေး
nb: Politikk
ne: राजनीति
pa: ਰਾਜਨੀਤੀ
pl: Polityka
pt: Política
pt_pt: Política
ro: Politică
ru: Политика
si: දේශපාලනය
sk: Politika
sq: Politikë
sr: Политика
sr_latn: Politika
sv: Politik
te: రాజకీయాలు
th: การเมือง
tr: Siyaset
uk: Політика
ur: سیاست
uz: Siyosat
vi: Chính trị
zh_hk: 政治
zu: Ipolotiki

# fortnightlyHeadlineBees
source: Farmland Bees In Short Supply
af: Terkort aan landboubye
am: የእርሻ መሬት ንቦች እጥረት አለ
ar_eg: نقص نحل الأراضي الزراعية
as: পৰাগ-সংযোগত সহায়ক মৌ-মাখি দুষ্প্ৰাপ্য হ’বলৈ ধৰিছে
az: Çiçəkləmə dövrünün arılara təsiri
be: Дэфіцыт пчол у сельскай гаспадарцы
bn: চাষের কাজে মৌমাছির জোগান কম
bs: Domaće pčele deficitarne
ca: Escassetat d’abelles de camp
da: Landbruget mangler bier
es_ar: Escasez de abejas obreras
et: Mesilasi on põllumaadel vähe
eu: Soroetako erleak desagertzen ari dira
fa: زنبورهای پرورشی با کمبود مواد غذایی روبرو هستند
fil: Kaunti na Lang ang Mga Pambukid na Bubuyog
fr_ca: Les abeilles désertent les terres agricoles
gl: As abellas das terras de cultivo están en perigo de extinción
gu: ક્યાં છે મધમાખીઓ!
he: דבורים חסרות בחוות
hi: पॉलिनेशन में मदद करने वाली मधुमक्खियों की गिरती संख्या
hu: Kevés a méh a gazdaságokban
hy: Գյուղատնտեսության մեջ մեղուների պակաս է գրանցվել
id: Rendahnya Pasokan Lebah Pertanian
it: Le api scarseggiano
ja: 農場のハチが不足
ka: ფერმებში ფუტკრების დეფიციტია
km: ឃ្មុំ​កសិដ្ឋាន​កំពុង​ខ្វះខាត​លម្អងផ្កា
kn: ಜೇನುಕೃಷಿಗೆ ಜೇನುನೊಣಗಳ ಕೊರತೆ
ko: 사라져가는 농지의 꿀벌
ky: Чарбалык аарылар дефицитте болууда
lo: ເຜິ້ງໃນຟາມກຳລັງຂາດຕະຫຼາດ
lt: Bičių ūkiams trūksta išteklių
lv: Saimniecībās trūkst bišu
mk: Недостаток на пчели за фармите
ml: ഫാംലാൻഡ് തേനീച്ചകൾ കിട്ടാനില്ല
mn: Богино хангамжийн фермийн зөгийнүүд
mr: शेतीसाठी उपयुक्त असणाऱ्या मधमाश्यांच्या संख्येमध्ये घट
my: ယာတောပြားများ‌ လျော့နည်းလာခြင်း
nb: Mangel på bier til jordbruket
ne: खेतमा पालेका मौरीहरूको अभाव
pa: ਮੱਖੀ ਪਾਲਣ ਵਿੱਚ ਗਿਰਾਵਟ
pl: Coraz mniej pszczół na polach uprawnych
pt: Escassez do fornecimento das abelhas de cultivo
pt_pt: Abelhas em número reduzido nas terras de cultivo
ro: Numărul albinelor este în scădere
ru: Дефицит пчел в сельском хозяйстве
si: ගොවිපළ ඉඩම් මී මැස්සන් හිඟයි
sk: Nedostatok poľnohospodárskych včiel
sq: Bletët braktisin tokat bujqësore
sr: Недостају пчеле за фарме
sr_latn: Nedostaju pčele za farme
sv: Bina försvinner från jordbruksmarker
te: పరాగసంపర్కంలో పాల్గొనే తేనెటీగల కొరత
th: ขาดแคลนผึ้งเลี้ยง
tr: Çiftlik Arılarında Azalma
uk: Нестача бджіл у сільському господарстві
ur: فارم لینڈ مکھیوں کی سپلائی میں کمی
uz: Fermalardagi arilar taʼminoti yetishmayapti
vi: Thiếu hụt nguồn cung ong nuôi
zh_hk: 蜂場蜜蜂短缺
zu: Izinyosi Zendawo Yefamu Zinokunikezwa Okumfushane

# fortnightlyHeadlineGasoline
source: The Future of Gasoline
af: Die toekoms van petrol
am: የናፍጣ የወደፊት ዕጣ ፈንታ
ar_eg: مستقبل البنزين
as: পেট্ৰলৰ ভৱিষ্যত
az: Yanacağın gələcəyi
be: Будучае бензіну
bn: গ্যাসোলিনের ভবিষ্যৎ
bs: Budućnost benzina
ca: El futur de la gasolina
da: Benzinens fremtid
es_ar: El futuro del combustible
et: Bensiini tulevik
eu: Gasolinaren etorkizuna
fa: آینده بنزین
fil: Ang Hinaharap ng Gasolina
fr_ca: L'avenir de l'essence
gl: O futuro da gasolina
gu: પેટ્રોલનું ભવિતવ્ય
he: עתיד הדלק
hi: गैसोलीन का भविष्य
hu: A benzin jövője
hy: Բենզինի ապագան
id: Nasib Bensin di Masa Depan
it: Il futuro della benzina
ja: ガソリンの未来
ka: ბენზინის მომავალი
km: អនាគត​នៃ​ប្រេងសាំង
kn: ಗ್ಯಾಸೋಲಿನ್‌ನ ಭವಿಷ್ಯ
ko: 휘발유의 미래
ky: Газдын келечеги
lo: ອະນາຄົດຂອງນ້ຳມັນເຊື້ອໄຟ
lt: Benzino ateitis
lv: Benzīna nākotne
mk: Иднината на бензинот
ml: പെട്രോളിന്റെ ഭാവി
mn: Бензиний ирээдүй
mr: गॅसोलीनचे भविष्य
my: ဓာတ်ဆီ၏ အနာဂတ်
nb: Fremtiden for bensin
ne: ग्यासोलिनको भविष्य
pa: ਤੇਲ ਦਾ ਭਵਿੱਖ
pl: Przyszłość benzyny
pt: O futuro da gasolina
pt_pt: O futuro da gasolina
ro: Viitorul benzinei
ru: Будущее бензина
si: ගැසොලින්වල අනාගතය
sk: Budúcnosť benzínu
sq: E ardhmja e benzinës
sr: Будућност бензина
sr_latn: Budućnost benzina
sv: Bensinens framtid
te: గ్యాసోలీన్ భవిష్యత్తు
th: อนาคตของน้ำมันเชื้อเพลิง
tr: Benzinin Geleceği
uk: Майбутнє бензину
ur: پٹرول کا مستقبل
uz: Benzin kelajagi
vi: Tương lai của xăng dầu
zh_hk: 汽油的未來
zu: Ikusasa Lephethiloli

# fortnightlyTrendingGreenArmy
source: GreenArmy
af: Groenweermag
am: አረንጓዴ ሰራዊት
ar_eg: الجيش_الأخضر
az: Yaşıl Ordu
bs: Zelena armija
ca: ExèrcitVerd
eu: ArmadaBerdea
fr_ca: Arméeverte
gl: ExércitoVerde
ko: 녹색군
ky: Жашыл армия
lo: ກອງທັບຂຽວ
lt: Žalioji armija
my: အစိမ်းရောင်စစ်တပ်
pt: ExércitoVerde
ro: Armata de mediu
sk: Zelená armáda
te: హరిత దళం
uz: Yashil beretlar
zu: I-GreenArmy

# fortnightlyHeadlineFeminists
source: Feminists Take On Partisanship
af: Feministe takel partydigheid
am: የሴት መብት ተሟጋቾች ወገንተኝነት ላይ ያላቸው አቋም
ar_eg: مدافعون عن حقوق المرأة يجابهون التحزب
as: পক্ষপাত সম্পৰ্কে নাৰীবাদীসকলৰ দৃষ্টিভংগী
az: Feministlər partiya tərəfinə keçməsi
be: Феміністкі здабываюць сабе палітычную падтрымку
bn: পক্ষপাতিত্বের বিরোধিতায় সরব নারাবাদীরা
bs: Feministkinje protiv stranačkog svrstavanja
ca: El feminisme pren partit
da: Feminister gør op med partilinjen
es_ar: Feministas toman partido
et: Feministid astuvad partisanluse vastu
eu: Feministak alderdi baten alde jarri dira
fa: فمینیست‌ها طرفداری سیاسی را به مبارزه طلبیدند
fil: Kinakaharap ng Mga Peminista ang Pagkiling
fr_ca: Les féministes contre la partisanerie
gl: O feminismo únese á causa
gu: છેડાઈ ગયો જંગ નારીવાદીઓ અને પક્ષપાતીઓ વચ્ચે
he: פמיניזם ותמיכה במפלגות
hi: भेदभाव पर नारीवादियों का नज़रिया
hu: A feministák pártot választanak
hy: Ֆեմինիստները պարտիզանական պատերազմի են պատրաստվում
id: Keberpihakan Kaum Feminis
it: Punto di vista delle femministe sulla partigianeria
ja: フェミニストが党派に分断
ka: ფემინისტები პარტიზანობას იწყებენ
km: អ្នកគាំទ្រ​សមភាពយេនឌ័រ​ប្រយុទ្ធប្រឆាំងនឹងការប្រកាន់​បក្ខពួក
kn: ಪೂರ್ವಾಗ್ರಹವನ್ನು ವಿರೋಧಿಸುವ ಗಂಭೀರ ಸ್ತ್ರೀವಾದಿಗಳು
ko: 페미니스트, 당을 결성하다
ky: Феминисттер партизандык согуш жүргүзүүдө
lo: ຄວາມເຫັນແມ່ຍິງຕໍ່ການແບ່ງແຍກ
lt: Feministai lieka šališki
lv: Feministes kļūst par partizānēm
mk: Феминистките напаѓаат во политиката
ml: കക്ഷിപക്ഷപാതത്തെക്കുറിച്ച് ഫെമിനിസ്റ്റുകളുടെ അഭിപ്രായം
mn: Феминистүүд хүчээ авч байна
mr: पक्षपाताविरूद्ध महिलांचा दृष्टिकोन
my: အမျိုးသမီးဝါဒီများသည် ပူးပေါင်းဆောင်ရွက်ကြခြင်း
nb: Feministers mening om partiskhet
ne: नारीवादीहरू पक्षपातका विरुद्धमा सङ्घर्ष गर्दैछन्
pa: ਪੱਖਪਾਤ 'ਤੇ ਨਾਰੀਵਾਦੀਆਂ ਦਾ ਨਜ਼ਰੀਆ
pl: Feministki a stronniczość
pt: Feministas lidam com o partidarismo
pt_pt: Feministas assumem o partidarismo
ro: Feministele devin partizane
ru: Феминистки выходят на путь партизанской войны
si: කාන්තාවාදීන් පැත්ත ගනී
sk: Feministky sa vrhli na partizánstvo
sq: Feministët kundër kampeve partiake
sr: Феминисткиње се баве политиком
sr_latn: Feministkinje se bave politikom
sv: Feminister tar upp kampen mot partipolitiken
te: వివక్షపై ఫెమినిస్ట్‌ల వైఖరి
th: เกิดการแบ่งพวกในหมู่นักสิทธิสตรี
tr: Partizanlıkta Feministler Öne Çıkıyor
uk: Партійність феміністок
ur: حقوق نسواں کی بے جا حمایت
uz: Feministlar partizanlikka oʻtmoqda
vi: Chủ nghĩa nữ quyền thách thức các đảng chính trị
zh_hk: 當女權主義遇上政黨
zu: Ama-Ferminist Athatha i-Partisanship
