Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoMenuContextMenuItemThree
source: Context menu item three
af: Kontekskieslysitem drie
am: የዓውድ ምናሌ ንጥል ሦስት
ar_eg: ثالث عنصر في قائمة السياقات
as: প্ৰসংগ মেনুৰ তৃতীয় বস্তু
az: Üçüncü kontekst menyusu elementi
be: Трэці пункт кантэкстнага меню
bn: সংশ্লিষ্ট মেনুর তৃতীয় আইটেম
bs: Treća stavka kontekstnog menija
ca: Element de menú contextual tres
da: Genvejsmenupunkt tre
es_ar: Tercer elemento del menú contextual
et: Kontekstimenüü üksus 3
eu: Laster-menuko hirugarren aukera
fa: گزینه سه منوی بافتی
fil: Pangatlong item sa menu ng konteksto
fr_ca: Option de menu contextuel trois
gl: Elemento do menú contextual tres
gu: સંદર્ભ મેનૂમાં ત્રીજી આઇટમ
he: אפשרות שלישית בתפריט הקשר
hi: संदर्भ मेन्यू का तीसरा आइटम
hu: Helyi menü harmadik eleme
hy: Տեղային ընտրացանկի տարր 2
id: Item menu konteks tiga
it: Voce tre del menu contestuale
ja: コンテキスト メニュー項目 3
ka: კონტექსტური მენიუს მესამე ერთეული
km: ធាតុ​ទីបី​ក្នុង​ម៉ឺនុយ​បរិបទ
kn: ಸಂದರ್ಭ ಮೆನುವಿನ ಮೂರನೇ ಐಟಂ
ko: 컨텍스트 메뉴 항목 3
ky: Контексттик менюдагы үчүнчү элемент
lo: ລາຍການເມນູບໍລິບົດສາມ
lt: Trečias kontekstinio meniu elementas
lv: Kontekstizvēlnes trešais vienums
mk: Трета ставка на контекстуално мени
ml: സന്ദർഭ മെനു ഇനം മൂന്ന്
mn: Хадам сэдэв цэсийн гуравдугаар зүйл
mr: कॉंटेक्स्ट मेनू आयटम तीन
ms: Item menu konteks ketiga
my: အကြောင်းအရာမီနူး နံပါတ်သုံး
nb: Element tre i kontekstuell meny
ne: सन्दर्भ मेनुको तेस्रो वस्तु
pa: ਸੰਦਰਭੀ ਮੀਨੂ ਵਿਚਲੀ ਤੀਜੀ ਆਈਟਮ
pl: Trzecia pozycja menu kontekstowego
pt: Item três do menu de contexto
pt_pt: Terceiro item de menu de contexto
ro: Elementul de meniu contextual trei
ru: Третий пункт контекстного меню
si: සන්දර්භ මෙනු අයිතමය තුන
sk: Tretia položka kontextovej ponuky
sq: Artikulli i tretë i menysë kontekstuale
sr: Трећа ставка контекстуалног менија
sr_latn: Treća stavka kontekstualnog menija
sv: Snabbmeny – alternativ tre
te: మూడవ సందర్భోచిత మెనూ అంశం
th: รายการในเมนูตามบริบทที่ 3
tr: İçerik menüsü öğesi üç
uk: Третій пункт контекстного меню
ur: سیاق و سباق کے مینیو والا تیسرا آئٹم
uz: Kontekst menyusining uchinchi bandi
vi: Mục thứ ba trong trình đơn ngữ cảnh
zh_hk: 第三個內容選單項目
zu: Into yesithathu yokuqukethwe kwemenyu

# demoCupertinoSwitchSubtitle
source: iOS-style switch
af: Skakelaar in iOS-styl
am: iOS-ቅጥ ማብሪያ/ማጥፊያ
ar_eg: مفتاح تبديل بنمط iOS
as: iOS-শৈলীৰ ছুইচ্ছ
az: iOS üslublu dəyişdirici
be: Пераключальнік у стылі iOS
bn: iOS-স্টাইল স্যুইচ
bs: Prekidač u stilu iOS-a
ca: Interruptor d'estil iOS
da: Kontakt i iOS-format
es_ar: Interruptor de estilo iOS
et: iOS-i stiilis lüliti
eu: iOS estiloko etengailua
fa: کلید سبک iOS
fil: iOS-style na switch
fr_ca: Commutateur de style iOS
gl: Interruptor de tipo iOS
gu: iOS-શૈલીનું સ્વિચ
he: מתג בסגנון iOS
hi: iOS की शैली वाला स्विच
hu: iOS-stílusú kapcsoló
hy: iOS-ի ոճով փոխանջատիչ
id: Tombol akses gaya iOS
it: Interruttore in stile iOS
ja: iOS スタイルのスイッチ
ka: iOS-სტილის გადამრთველი
km: ប៊ូតុង​បិទបើក​ដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಸ್ಟೈಲ್ ಸ್ವಿಚ್
ko: iOS 스타일 스위치
ky: iOS стилиндеги өзгөчө которгуч
lo: ປຸ່ມກົດແບບ iOS
lt: „iOS“ stiliaus jungiklis
lv: iOS stila slēdzis
mk: Прекинувач во iOS-стил
ml: iOS-സ്‌റ്റൈലിലുള്ള സ്വിച്ച്
mn: iOS загварын сэлгүүр
mr: iOS-शैली स्विच
ms: Suis gaya iOS
my: iOS ပုံစံ ခလုတ်
nb: Bryter i iOS-stil
ne: iOS-शैलीको स्विच
pa: iOS-ਸਟਾਈਲ ਸਵਿੱਚ
pl: Przełącznik w stylu iOS
pt: Chave no estilo iOS
pt_pt: Interruptor ao estilo do iOS
ro: Comutator în stil iOS
ru: Переключатель в стиле iOS
si: iOS-විලාස ස්විචය
sk: Prepínač v štýle systému iOS
sq: Çelësi i stilit të iOS
sr: Прекидач у iOS стилу
sr_latn: Prekidač u iOS stilu
sv: Reglage i iOS-stil
te: iOS-శైలి స్విచ్
th: สวิตช์แบบ iOS
tr: iOS tarzında anahtar
uk: Перемикач у стилі iOS
ur: iOS طرز کا سوئچ
uz: iOS uslubidagi kalit
vi: Nút chuyển theo kiểu iOS
zh_hk: iOS 樣式開關
zu: iswishi yesitayela se-iOS

# demoSnackbarsText
source: This is a snackbar.
af: Dit is 'n teksbalk.
am: ይህ ቁርስ ቤት ነው።
ar_eg: هذا "شريط إعلام منبثق".
as: এইডাল এডাল স্নেকবাৰ।
az: Bu, snekpaneldir.
be: Гэта ўсплывальная панэль.
bn: এটি একটি স্ন্যাকবার।
bs: Ovo je kratko obavještenje.
ca: Això és una barra de notificacions.
da: Dette er en handlingsbekræftelse.
es_ar: Esta es una barra de notificaciones.
et: See on teaberiba.
eu: Hona hemen snackbar bat.
fa: این نوار توضیحات است.
fil: Ito ay isang snackbar.
fr_ca: Voici un casse-croûte.
gl: Esta é unha barra de notificacións.
gu: આ સ્નૅકબાર છે.
he: זהו סרגל אינטראקטיבי.
hi: यह स्नैकबार है.
hu: Ez egy információs sáv.
hy: Սա ծանուցումների տող է։
id: Ini adalah snackbar.
it: Questo è uno snackbar.
ja: これがスナックバーです。
ka: ეს არის სნეკ-ზოლი.
km: នេះគឺជា​របារសារខ្លីៗ។
kn: ಇದು ಸ್ನ್ಯಾಕ್‌ಬಾರ್ ಆಗಿದೆ.
ko: 스낵바입니다.
ky: Бул маалымат тактасы.
lo: ນີ້ແມ່ນແຖບສະແດງຂໍ້ຄວາມ.
lt: Tai yra laikina juosta.
lv: Šī ir paziņojumu josla.
mk: Ова е снекбар-порака.
ml: ഇതൊരു സ്‌നാക്‌ബാറാണ്.
mn: Энэ бол snackbar.
mr: हा एक स्नॅकबार आहे.
ms: Ini ialah Bar Snek.
my: ဤသည်မှ မုန့်ဘားဖြစ်သည်။
nb: Dette er en snackbar.
ne: यो स्न्याकबार हो।
pa: ਇਹ ਸਨੈਕਬਾਰ ਹੈ
pl: To jest pasek powiadomień.
pt: Isto é um snackbar.
pt_pt: Isto é uma barra de comentários.
ro: Aceasta este o bară de notificare.
ru: Это снэк-панель.
si: මෙය ස්නැක්බාර් එකකි.
sk: Toto je oznámenie.
sq: Ky është një shiriti njoftimesh.
sr: Ово је трака за обавештења.
sr_latn: Ovo je traka za obaveštenja.
sv: Det här är ett meddelandefält.
te: ఇది ఒక స్నాక్‌బార్.
th: นี่คือแถบแสดงข้อความ
tr: Bu bir snackbar.
uk: Це панель підказок.
ur: یہ ایک اسنیک بار ہے۔
uz: Bu – snekbar.
vi: Đây là thanh thông báo nhanh.
zh_hk: 這是資訊列。
zu: Lena i-snackbar.

# demoCupertinoSliderSubtitle
source: iOS-style slider
af: Glyer in iOS-styl
am: የiOS-ቅጥ ተንሸራታች
ar_eg: شريط تمرير بنمط iOS
as: iOS-শৈলীৰ শ্লাইডাৰ
az: iOS üslublu slayder
be: Паўзунок у стылі iOS
bn: iOS-স্টাইল স্লাইডার
bs: Klizač u stilu iOS-a
ca: Control lliscant d'estil iOS
da: Skyder i iOS-format
es_ar: Control deslizante de estilo iOS
et: iOS-i stiilis liugur
eu: iOS estiloko graduatzailea
fa: لغزنده سبک iOS
fil: iOS-style na slider
fr_ca: Curseur de style iOS
gl: Control desprazable de tipo iOS
gu: iOS-શૈલીનું સ્લાઇડર
he: מחוון בסגנון iOS
hi: iOS की शैली वाला स्लाइडर
hu: iOS-stílusú csúszka
hy: iOS-ի ոճով սահիչ
id: Penggeser gaya iOS
it: Cursore in stile iOS
ja: iOS スタイルのスライダー
ka: iOS-სტილის სლაიდერი
km: របាររំកិល​ដែលមាន​រចនាប័ទ្ម iOS
kn: iOS-ಸ್ಟೈಲ್ ಸ್ಲೈಡರ್
ko: iOS 스타일 슬라이더
ky: iOS стилиндеги сыдырма
lo: ແຖບເລື່ອນແບບ iOS
lt: „iOS“ stiliaus šliaužiklis
lv: iOS stila slīdnis
mk: Лизгач во iOS-стил
ml: iOS-സ്‌റ്റൈലിലുള്ള സ്ലൈഡർ
mn: iOS загварын слайдер
mr: iOS-शैली स्लायडर
ms: Peluncur gaya iOS
my: iOS ပုံစံ ရွှေ့တုံး
nb: Glidebryter i iOS-stil
ne: iOS-शैलीको स्लाइडर
pa: iOS-ਸਟਾਈਲ ਸਲਾਈਡਰ
pl: Suwak w stylu iOS
pt: Controle deslizante no estilo iOS
pt_pt: Controlo de deslize ao estilo do iOS
ro: Glisor în stil iOS
ru: Ползунок в стиле iOS
si: iOS-විලාස ස්ලයිඩරය
sk: Posúvač v štýle systému iOS
sq: Rrëshqitësi i stilit të iOS
sr: Клизач у iOS стилу
sr_latn: Klizač u iOS stilu
sv: Skjutreglage i iOS-stil
te: iOS-శైలి స్లయిడర్
th: แถบเลื่อนแบบ iOS
tr: iOS tarzında kaydırma çubuğu
uk: Повзунок у стилі iOS
ur: iOS طرز کے سلائیڈر
uz: iOS uslubidagi slayder
vi: Thanh trượt theo kiểu iOS
zh_hk: iOS 樣式滑桿
zu: isilayida sesitayela se-iOS

# demoCupertinoSliderDescription
source: A slider can be used to select from either a continuous or a discrete set of values.
af: 'n Glyer kan gebruik word om uit óf 'n aaneenlopende óf 'n diskrete stel waardes te kies.
am: ተንሸራታች ተጠቅመው ወይም ቀጣይነት ካለው ወይም ከውሱን የእሴቶች ስብስብ አንዱን መምረጥ ይቻላል።
ar_eg: يمكن استخدام شريط تمرير للاختيار من مجموعة قيم متصلة أو مجموعة قيم منفصلة.
as: অবিৰত অথবা বিৰত মানসমূহৰ এটা ছেটৰ পৰা বাছনি কৰিবলৈ এটা শ্লাইডাৰ ব্যৱহাৰ কৰিব পৰা যায়।
az: Ardıcıl və ya ayrı dəyərlər arasından seçim etmək üçün slayder istifadə edilə bilər.
be: Паўзунок можна выкарыстоўваць для выбару як з непарыўнага, так і з дыскрэтнага мноства значэнняў.
bn: নিরবিচ্ছিন্ন বা পৃথক মানের ভ্যালু থেকে বেছে নেওয়ার জন্য স্লাইডার ব্যবহার করা যেতে পারে।
bs: Klizač možete koristiti za odabir kontinuiranog ili diskretnog skupa vrijednosti.
ca: Pots utilitzar el control lliscant per fer seleccions en conjunts de valors tant discrets com continus.
da: En skyder kan bruges til at vælge enten et permanent eller individuelt værdisæt.
es_ar: Un control deslizante se puede utilizar para seleccionar contenido de un conjunto de valores continuos o discretos.
et: Liugurit saab kasutada nii pidevate kui ka diskreetsete väärtuste valimiseks.
eu: Balio sorta jarraitu edo zehatz batetik hautatzeko balio du graduatzaileak.
fa: از لغزنده می‌توان برای انتخاب مجموعه‌ای از مقادیر پیوسته یا گسسته استفاده کرد.
fil: Puwedeng gumamit ng slider para pumili sa tuloy-tuloy o discrete na hanay ng mga value.
fr_ca: Vous pouvez utiliser un curseur pour sélectionner un ensemble de valeurs discrètes ou continues.
gl: Os controis desprazables poden usarse para un conxunto de valores continuo ou descontinuo.
gu: સ્લાઇડરનો ઉપયોગ સતત અથવા અલગ મૂલ્યોના સેટમાંથી પસંદ કરવા માટે કરી શકાય છે.
he: ניתן להשתמש במחוון כדי לבחור מתוך קבוצת ערכים רציפים או בדידים.
hi: स्लाइडर का इस्तेमाल संख्याओं के सेट में से किसी भी संख्या या किसी तय संख्या को चुनने के लिए किया जा सकता है.
hu: A csúszkával folyamatos vagy diszkrét értékkészletből lehet választani.
hy: Սահիչի միջոցով նշված միջակայքում կարելի է որոշակի արժեք ընտրել։
id: Penggeser dapat digunakan untuk memilih kumpulan nilai berkelanjutan atau yang berlainan.
it: Un cursore può essere utilizzato per selezionare valori da un insieme continuo o discreto.
ja: スライダーでは、連続する値の集合または不連続な値の集合から値を選択できます。
ka: სლაიდერის გამოყენება შესაძლებელია მნიშვნელობათა უწყვეტი ან დისკრეტული სიმრავლიდან ასარჩევად.
km: របាររំកិល​អាច​ត្រូវបានប្រើ​ដើម្បី​ជ្រើសរើសពី​សំណុំ​តម្លៃ​ជាក់លាក់ ឬ​មិនជាក់លាក់។
kn: ನಿರಂತರ ಅಥವಾ ಪ್ರತ್ಯೇಕ ಮೌಲ್ಯಗಳ ಗುಂಪಿನಿಂದ ಆಯ್ಕೆಮಾಡಲು ಸ್ಲೈಡರ್ ಅನ್ನು ಬಳಸಬಹುದು.
ko: 슬라이더는 연속적이거나 분리된 값의 세트 중에 선택하는 데 사용됩니다.
ky: Сыдырманы үзгүлтүксүз же дискреттик маанилерди тандоо үчүн колдонууга болот.
lo: ແຖບເລື່ອນສາມາດໃຊ້ເພື່ອເລືອກຈາກຊຸດຄ່າຕໍ່ເນື່ອງ ຫຼື ບໍ່ຕໍ່ເນື່ອງໄດ້
lt: Šliaužikliu galima pasirinkti tęstinių arba konkrečių verčių rinkinius.
lv: Izmantojot slīdni, var atlasīt vērtību no nepārtraukta diapazona vai atsevišķu vērtību kopas.
mk: Лизгачот може да се користи за избор од континуиран или дискретен збир на вредности.
ml: തുടർച്ചയായ അല്ലെങ്കിൽ ഇടവിട്ടുള്ള മൂല്യങ്ങളുടെ ഗണത്തിൽ നിന്ന് മൂല്യങ്ങൾ തിരഞ്ഞെടുക്കാൻ സ്ലൈഡർ ഉപയോഗിക്കാം.
mn: Утгын тасралтгүй эсвэл салангид олонлогийн аль нэгээс сонгохын тулд слайдерыг ашиглах боломжтой.
mr: स्लायडरचा वापर सलग किंवा भिन्न मूल्यांच्या संचामधून निवडण्यासाठी केला जाऊ शकतो.
ms: Peluncur boleh digunakan untuk memilih daripada set nilai berterusan atau diskret.
my: ဆက်တိုက် သို့မဟုတ် သီးခြားတန်ဖိုး အုပ်စုတစ်ခုတစ်ခုခုမှနေ၍ ရွေးချယ်ရန် ရွှေ့တုံးကို အသုံးပြုနိုင်သည်။
nb: En glidebryter kan brukes til å velge fra enten et kontinuerlig eller atskilt sett med verdier.
ne: स्लाइडर या त मानहरूको निरन्तर वा पृथक सेटबाट चयन गर्न प्रयोग गर्न सकिन्छ।
pa: ਸਲਾਈਡਰ ਦੀ ਵਰਤੋਂ ਜਾਂ ਤਾਂ ਮੁੱਲਾਂ ਦੇ ਨਿਰੰਤਰ ਜਾਂ ਵੱਖਰੇ ਸੈੱਟ ਵਿੱਚੋਂ ਚੋਣ ਕਰਨ ਲਈ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ।
pl: Suwak umożliwia wybieranie wartości z ciągłego zakresu lub określonego zestawu.
pt: Um controle deslizante que pode ser usado para selecionar dentre um conjunto de valores contínuos ou pontuais.
pt_pt: É possível utilizar um controlo de deslize para selecionar a partir de um conjunto de valores contínuo ou discreto.
ro: Glisorul poate fi folosit pentru a selecta dintr-un set de valori continue sau distincte.
ru: Ползунок можно использовать для выбора определенного значения в указанном диапазоне.
si: ස්ලයිඩරයක් එක්කෝ අඛණ්ඩ හෝ වෙන් වූ අගයන් කට්ටලයක් හෝ වෙතින් තේරීමට භාවිත කළ හැකිය.
sk: Posúvačom je možné vyberať hodnoty zo súvislej aj nesúvislej skupiny.
sq: Një rrëshqitës mund të përdoret për të zgjedhur nga një grup i vazhdueshëm ose jo i vazhdueshëm vlerash.
sr: Клизач може да се користи да бисте изабрали непрекидан или дискретан скуп вредности.
sr_latn: Klizač može da se koristi da biste izabrali neprekidan ili diskretan skup vrednosti.
sv: Ett skjutreglage kan användas till att välja från en uppsättning kontinuerliga eller diskreta värden.
te: స్లయిడర్‌ను విలువల అవిచ్ఛిన్న లేదా విలక్షణ సెట్ నుండి ఏదొక దానిని ఎంచుకోవడానికి ఉపయోగించవచ్చు.
th: แถบเลื่อนอาจใช้ในการเลือกชุดค่าที่ต่อเนื่องหรือไม่ต่อเนื่อง
tr: Kaydırma çubukları sürekli veya aralıklı değerler içinden seçim yapmak için kullanılır.
uk: Повзунок можна використовувати для вибору з безперервного або дискретного набору значень.
ur: ایک سلائیڈر مسلسل یا علیحدہ اقدار کے سیٹ سے منتخب کرنے کے ليے استعمال کیا جا سکتا ہے۔
uz: Slayder uzluksiz yoki diskret qiymatlarni tanlashda ishlatiladi.
vi: Bạn có thể dùng thanh trượt để chọn trong một tập hợp các giá trị liên tục hoặc rời rạc.
zh_hk: 滑桿可以用來選擇連續或間續數值。
zu: Isilayida singasetshenziswa ukuze kukhethwe isethi yamanani aqhubekayo noma okuzikhethela.

# demoCupertinoSliderContinuous
source: Continuous: {value}
af: Aaneenlopend: {value}
am: ቀጣይነት ያለው፦ {value}
ar_eg: متصل القيم: {value}
as: অবিৰত: {value}
az: Ardıcıl: {value}
be: Непарыўны: {value}
bn: নিরবিচ্ছিন্ন: {value}
bs: Kontinuirano: {value}
ca: Continu: {value}
da: Permanent: {value}
es_ar: Continuo: {value}
et: Pidev: {value}
eu: Jarraitua: {value}
fa: پیوسته: {value}
fil: Tuloy-tuloy: {value}
fr_ca: Continues : {value}
gl: Continuo: {value}
gu: સતત: {value}
he: רציף: {value}
hi: कोई भी संख्या: {value}
hu: Folyamatos: {value}
hy: Շարունակական՝ {value}
id: Berkelanjutan: {value}
it: Continuo: {value}
ja: 連続: {value}
ka: უწყვეტი: {value}
km: មិនជាក់លាក់៖ {value}
kn: ನಿರಂತರ: {value}
ko: 연속: {value}
ky: Үзгүлтүксүз: {value}
lo: ຕໍ່ເນື່ອງ: {value}
lt: Tęstinės: {value}
lv: Nepārtraukts: {value}
mk: Континуиран: {value}
ml: തുടർച്ചയായത്: {value}
mn: Тасралтгүй: {value}
mr: सतत: {value}
ms: Berterusan: {value}
my: ဆက်တိုက်- {value}
nb: Kontinuerlig: {value}
ne: निरन्तर: {value}
pa: ਲਗਾਤਾਰ: {value}
pl: Giągła: {value}
pt: Contínuo: {value}
pt_pt: Contínuo: {value}
ro: Continuă: {value}
ru: Непрерывный ползунок: {value}
si: අඛණ්ඩ: {value}
sk: Súvislá: {value}
sq: I vazhdueshëm: {value}
sr: Непрекидно: {value}
sr_latn: Neprekidno: {value}
sv: Kontinuerlig: {value}
te: అవిచ్ఛిన్న: {value}
th: ต่อเนื่อง: {value}
tr: Sürekli: {value}
uk: Безперервний: {value}
ur: مسلسل: {value}
uz: Uzluksiz: {value}
vi: Liên tục: {value}
zh_hk: 連續：{value}
zu: Okuqhubekayo: {value}

# demoCupertinoSliderDiscrete
source: Discrete: {value}
af: Diskreet: {value}
am: ውሱን፦ {value}
ar_eg: منفصل القيم: {value}
as: বিৰত: {value}
az: Ayrı: {value}
be: Дыскрэтны: {value}
bn: পৃথক মান: {value}
bs: Diskretno: {value}
ca: Discret: {value}
da: Individuelt: {value}
es_ar: Discreto: {value}
et: Diskreetne: {value}
eu: Zehatza: {value}
fa: گسسته: {value}
fr_ca: Discrètes : {value}
gl: Descontinuo: {value}
gu: અલગ: {value}
he: בדיד: {value}
hi: कोई तय संख्या: {value}
hu: Diszkrét: {value}
hy: Դիսկրետ՝ {value}
id: Berlainan: {value}
it: Discreto: {value}
ja: 不連続: {value}
ka: დისკრეტული: {value}
km: ជាក់លាក់៖ {value}
kn: ಪ್ರತ್ಯೇಕ: {value}
ko: 분리: {value}
ky: Дискреттик: {value}
lo: ບໍ່ຕໍ່ເນື່ອງ: {value}
lt: Konkrečios: {value}
lv: Atsevišķas vērtības: {value}
mk: Дискретен: {value}
ml: ഇടവിട്ടുള്ളത്: {value}
mn: Салангид: {value}
mr: भिन्न: {value}
ms: Diskret: {value}
my: သီးခြား- {value}
nb: Atskilt: {value}
ne: पृथक: {value}
pa: ਵੱਖਰੀ: {value}
pl: Określona: {value}
pt: Pontual: {value}
pt_pt: Discreto: {value}
ro: Distinctă: {value}
ru: Дискретный ползунок: {value}
si: වෙන් වූ: {value}
sk: Nesúvislá: {value}
sq: Jo i vazhdueshëm: {value}
sr: Дискретно: {value}
sr_latn: Diskretno: {value}
sv: Diskret: {value}
te: విలక్షణ: {value}
th: ไม่ต่อเนื่อง: {value}
tr: Aralıklı: {value}
uk: Дискретний: {value}
ur: علیحدہ: {value}
uz: Diskret: {value}
vi: Rời rạc: {value}
zh_hk: 間續：{value}
zu: Ukuzikhethela: {value}

# demoSnackbarsAction
source: You pressed the snackbar action.
af: Jy het die teksbalkhandeling gedruk.
am: እርስዎ የቅሩስ ቤት ድርጊቱን ተጭነዋል።
ar_eg: لقد ضغطت على إجراء في "شريط الإعلام المنبثق".
as: আপুনি স্নেকবাৰ কার্যটো টিপিছে।
az: Snekpanel əməliyyatına toxunmusunuz.
be: Вы націснулі дзеянне на ўсплывальнай панэлі.
bn: আপনি স্ন্যাকবার অ্যাকশন প্রেস করেছেন।
bs: Pritisnuli ste radnju za kratko obavještenje.
ca: Has premut l'acció de la barra de notificacions.
da: Du trykkede på handlingsbekræftelsen.
es_ar: Presionaste la acción de la barra de notificaciones.
et: Vajutasite teaberiba toimingut.
eu: Snackbar-aren ekintza sakatu duzu.
fa: دکمه کنش روی نوار توضیحات را فشار دادید.
fil: Pinindot mo ang pagkilos ng snackbar.
fr_ca: Vous avez sélectionné l'action d'un casse-croûte.
gl: Premiches a acción da barra de notificacións.
gu: તમે સ્નૅકબાર ઍક્શન દબાવ્યું.
he: לחצת על פעולה בסרגל האינטראקטיבי.
hi: आपने स्नैकबार वाली कार्रवाई चुनी है.
hu: Megnyomta az információs sávról elvégezhető művelet gombját.
hy: Դուք սեղմեցիք ծանուցումների տողի կոճակին։
id: Anda menekan tindakan snackbar.
it: Hai premuto l'azione dello snackbar.
ja: スナックバーのアクションを押しました。
ka: თქვენ დააჭირეთ სნეკ-ზოლის მოქმედებას.
km: អ្នកបានចុច​សកម្មភាពរបស់​របារសារខ្លីៗ។
kn: ನೀವು ಸ್ನ್ಯಾಕ್‌ಬಾರ್ ಆ್ಯಕ್ಷನ್ ಅನ್ನು ಒತ್ತಿರುವಿರಿ.
ko: 스낵바 작업을 눌렀습니다.
ky: Маалымат тактасындагы аракетти бастыңыз.
lo: ທ່ານກົດຄຳສັ່ງແຖບສະແດງຂໍ້ຄວາມແລ້ວ.
lt: Paspaudėte laikinos juostos veiksmo mygtuką.
lv: Jūs nospiedāt paziņojumu joslas darbības pogu.
mk: Го притиснавте копчето за дејство на снекбар-пораката.
ml: നിങ്ങൾ സ്‌നാക്‌ബാർ പ്രവർത്തനം അമർത്തിയിരിക്കുന്നു.
mn: Та snackbar-н үйлдлийг дарлаа.
mr: तुम्ही स्नॅकबार ॲक्शन दाबले आहे.
ms: Anda menekan tindakan bar snek.
my: သင်သည် မုန့်ဘားလုပ်ဆောင်ချက်ကို နှိပ်လိုက်သည်။
nb: Du har trykket på snackbarhandlingen.
ne: तपाईंले स्न्याकबारको एक्सन थिच्नुभयो।
pa: ਤੁਸੀਂ ਸਨੈਕਬਾਰ ਕਾਰਵਾਈ ਨੂੰ ਦਬਾਇਆ ਹੈ।
pl: Wybrano działanie paska powiadomień.
pt: Você pressionou a ação de snackbar.
pt_pt: Premiu a ação da barra de comentários.
ro: Ați apăsat pe acțiunea din bara de notificare.
ru: Вы нажали кнопку на снэк-панели.
si: ඔබ ස්නැක්බාර් ක්‍රියාව ඔබා ඇත.
sk: Stlačili ste tlačidlo akcie oznámenia.
sq: Shtype veprimin e shiritit të njoftimeve.
sr: Притиснули сте радњу траке за обавештења.
sr_latn: Pritisnuli ste radnju trake za obaveštenja.
sv: Du tryckte på åtgärden för meddelandefält.
te: మీరు స్నాక్‌బార్ చర్యను నొక్కారు.
th: คุณกดการทำงานของแถบแสดงข้อความ
tr: Snackbar işlemine bastınız.
uk: Ви натиснули кнопку на панелі підказок.
ur: آپ نے اسنیک بار ایکشن دبایا۔
uz: Snekbar amalini bosdingiz.
vi: Bạn đã nhấn vào một hành động trên thanh thông báo nhanh.
zh_hk: 您已按下資訊列動作。
zu: Ucindezele isenzo se-snackbar.

source: Back to Gallery
af: Terug na galery
am: ወደ ማዕከለ-ስዕላት ተመለስ
ar_eg: الرجوع إلى "معرض الصور"
as: গেলাৰীলৈ উভতি যাওক
az: Qalereyaya geri qayıdın
be: Вярнуцца ў галерэю
bn: গ্যালারিতে ফিরুন
bs: Nazad u Gallery
ca: Torna a la galeria
da: Tilbage til galleriet
es_ar: Volver a la Galería
et: Tagasi galeriisse
eu: Itzuli galeriara
fa: بازگشت به گالری
fil: Bumalik sa Gallery
fr_ca: Retour à la galerie
gl: Volver á galería
gu: ગૅલેરી પર પાછા જાઓ
he: חזרה לגלריה
hi: Gallery पर वापस जाएं
hu: Vissza a Galériához
hy: Վերադառնալ ցուցասրահ
id: Kembali ke Galeri
it: Torna alla galleria
ja: ギャラリーに戻る
ka: გალერეაში დაბრუნება
km: ត្រឡប់​ទៅ Gallery
kn: ಗ್ಯಾಲರಿಗೆ ಹಿಂದಿರುಗಿ
ko: 갤러리로 돌아가기
ky: Галереяга кайтуу
lo: ກັບໄປຄັງຮູບ
lt: Atgal į galeriją
lv: Atpakaļ uz galeriju
mk: Назад во галеријата
ml: ഗാലറിയിലേക്ക് മടങ്ങുക
mn: Галерей руу буцах
mr: गॅलरी मध्ये परत जा
ms: Kembali ke Gallery
my: ပြခန်းသို့ ပြန်သွားရန်
nb: Tilbake til galleriet
ne: Gallery मा फर्कनुहोस्
pa: Gallery ਵਿੱਚ ਵਾਪਸ ਜਾਓ
pl: Powrót do Galerii
pt: Voltar à galeria
pt_pt: Voltar à galeria
ro: Înapoi la Galerie
ru: Назад на главную
si: ගැලරිය වෙත ආපසු යන්න
sk: Späť do služby Gallery
sq: Kthehu te "Galeria"
sr: Назад у галерију
sr_latn: Nazad u galeriju
sv: Tillbaka till galleriet
te: గ్యాలరీకి తిరిగి వెళ్లు
th: กลับไปที่แกลเลอรี
tr: Galeriye dön
uk: Назад до Галереї
ur: گیلری پر واپس جائیں
uz: Galereyaga qaytish
vi: Quay lại Thư viện
zh_hk: 返回圖片庫
zu: Buyela kwigalari

# demoCupertinoTabBarTitle
source: Tab bar
af: Oortjiebalk
am: የትር አሞሌ
ar_eg: شريط علامات التبويب
as: টেব বাৰ
az: Tab paneli
be: Панэль укладак
bn: ট্যাব বার
bs: Traka tabulatora
ca: Barra de pestanyes
da: Fanelinje
es_ar: Barra de pestañas
et: Vaheleheriba
eu: Fitxa-barra
fa: نوار برگه
fr_ca: Barre d'onglets
gl: Barra de pestanas
gu: ટૅબ બાર
he: שורת כרטיסיות
hi: टैब बार
hu: Fülsáv
hy: Ներդիրների գոտի
id: Bilah tab
it: Barra delle schede
ja: タブバー
ka: ჩანართების ზოლი
km: របារ​ផ្ទាំង
kn: ಟ್ಯಾಬ್ ಪಟ್ಟಿ
ko: 탭바
ky: Өтмөк тилкеси
lo: ແຖບ
lt: Skirtukų juosta
lv: Ciļņu josla
mk: Лента со картички
ml: ടാബ് ബാർ
mn: Табын самбар
mr: टॅब बार
ms: Bar tab
my: တဘ်ဘား
nb: Fanerad
ne: ट्याब पट्टि
pa: ਟੈਬ ਪੱਟੀ
pl: Pasek kart
pt: Barra de guias
pt_pt: Barra de separadores
ro: Bară cu file
ru: Панель вкладок
si: ටැබ තීරුව
sk: Panel kariet
sq: Shiriti i skedës
sr: Трака са картицама
sr_latn: Traka sa karticama
sv: Flikfält
te: ట్యాబ్ బార్
th: แถบแท็บ
tr: Sekme çubuğu
uk: Панель вкладок
ur: ٹیب بار
uz: Varaqlar paneli
vi: Thanh thẻ
zh_hk: 標籤列
zu: Ibha yethebhu
