Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# settingsTextDirection
source: Text direction
af: Teksrigting
am: የጽሑፍ አቅጣጫ
ar_eg: اتجاه النص
as: পাঠৰ দিশ
az: Mətn istiqaməti
be: Напрамак тэксту
bn: টেক্সটের মাধ্যমে দিকনির্দেশ
bs: Smjer unosa teksta
ca: Direcció del text
da: Tekstretning
es_ar: Dirección del texto
et: Teksti suund
eu: Testuaren noranzkoa
fa: جهت نوشتار
fil: Direksyon ng text
fr_ca: Orientation du texte
gl: Dirección do texto
gu: ટેક્સ્ટની દિશા
he: כיוון טקסט
hi: टेक्स्ट की दिशा
hu: Szövegirány
hy: Տեքստի ուղղությունը
id: Arah teks
it: Direzione testo
ja: テキストの向き
ka: ტექსტის მიმართულება
km: ទិស​អត្ថបទ
kn: ಪಠ್ಯದ ನಿರ್ದೇಶನ
ko: 텍스트 방향
ky: Тексттин багыты
lo: ທິດທາງຂໍ້ຄວາມ
lt: Teksto kryptis
lv: Teksta virziens
mk: Насока на текстот
ml: ടെക്‌സ്‌റ്റ് ദിശ
mn: Текстийн чиглэл
mr: मजकूर दिशा
ms: Arah teks
my: စာသားဦးတည်ရာ
nb: Tekstretning
ne: पाठको दिशा
pa: ਲਿਖਤ ਦਿਸ਼ਾ
pl: Kierunek tekstu
pt: Orientação do texto
pt_pt: Direção do texto
ro: Direcția textului
ru: Направление текста
si: පෙළ දිශාව
sk: Smer textu
sq: Drejtimi i tekstit
sr: Смер текста
sr_latn: Smer teksta
sv: Textriktning
te: వచన దిశ
th: ทิศทางข้อความ
tr: Metin yönü
uk: Напрямок тексту
ur: متن کی ڈائریکشن
uz: Matn yoʻnalishi
vi: Hướng chữ
zh_hk: 文字方向
zu: Isiqondisindlela sombhalo

# settingsLocale
source: Locale
am: የአካባቢ
ar_eg: اللغة
as: ল’কেল
az: Lokal göstərici
be: Рэгіянальныя налады
bn: লোকেল
bs: Jezik/zemlja
ca: Configuració regional
da: Landestandard
es_ar: Configuración regional
et: Lokaat
eu: Lurraldeko ezarpenak
fa: محلی
fil: Wika
fr_ca: Paramètres régionaux
gl: Configuración rexional
gu: લોકેલ
he: לוקאל
hi: स्थान-भाषा
hu: Nyelv- és országkód
hy: Տարածաշրջանային կարգավորումներ
id: Lokal
it: Impostazioni internazionali
ja: 言語 / 地域
ka: ლოკალი
km: ភាសា
kn: ಸ್ಥಳೀಯ
ko: 언어
ky: Тил параметри
lo: ພາສາ
lt: Lokalė
lv: Lokalizācija
mk: Локален стандард
ml: പ്രാദേശിക ഭാഷ
mn: Хэл болон улсын код
mr: लोकॅल
ms: Tempat peristiwa
my: ဘာသာစကားနှင့် နိုင်ငံအသုံးအနှုန်း
nb: Lokalitet
ne: स्थानिक भाषा
pa: ਲੋਕੇਲ
pl: Region
pt: Localidade
pt_pt: Local
ro: Cod local
ru: Региональные настройки
si: පෙදෙසිය
sk: Miestne nastavenie
sq: Gjuha e përdorimit
sr: Локалитет
sr_latn: Lokalitet
sv: Språkkod
te: లొకేల్
th: ภาษา
tr: Yerel ayar
uk: Мовний код
ur: زبان
uz: Hududiy sozlamalar
vi: Ngôn ngữ
zh_hk: 語言代碼
zu: Isifunda

# settingsPlatformMechanics
source: Platform mechanics
af: Platformmeganika
am: የመሣሪያ ስርዓት ሜካኒክ አሰራር
ar_eg: آليات الأنظمة الأساسية
as: প্লেটফ’ৰ্ম মেকানিকসমূহ
az: Platforma mexanikası
be: Механізм платформы
bn: প্ল্যাটফর্ম মেকানিক্স
bs: Mehanika platforme
ca: Mecànica de la plataforma
da: Platformmekanik
es_ar: Mecánica de la plataforma
et: Platvormi mehaanika
eu: Plataformaren mekanika
fa: مکانیک پلتفورم
fil: Mechanics ng platform
fr_ca: Mécanique des plateformes
gl: Mecánica da plataforma
gu: પ્લૅટફૉર્મ મેકૅનિક્સ
he: מכניקה של פלטפורמה
hi: प्लैटफ़ॉर्म मैकेनिक
hu: Platformmechanika
hy: Հարթակ
id: Mekanik platform
it: Struttura piattaforma
ja: プラットフォームのメカニクス
ka: პლატფორმის მექანიკა
km: មេកានិច​ប្រព័ន្ធ
kn: ಪ್ಲ್ಯಾಟ್‌ಫಾರ್ಮ್ ಮೆಕ್ಯಾನಿಕ್ಸ್
ko: 플랫폼 메커니즘
ky: Платформанын механикасы
lo: ໂຄງສ້າງຂອງແພລດຟອມ
lt: Platformos mechanika
lv: Platformas mehānika
mk: Механика на платформа
ml: പ്ലാറ്റ്‌ഫോം മെക്കാനിക്‌സ്
mn: Платформын механик
mr: प्लॅटफॉर्म यांत्रिकी
ms: Mekanik platform
my: စနစ် ယန္တရားများ
nb: Plattformsfunksjoner
ne: प्लेटफर्मको यान्त्रिकी
pa: ਪਲੇਟਫਾਰਮ ਮਕੈਨਿਕ
pl: Mechanika platformy
pt: Mecânica da plataforma
pt_pt: Mecânica da plataforma
ro: Mecanica platformei
ru: Платформа
si: වේදිකා උපක්‍රම
sk: Mechanika platformy
sq: Mekanika e platformës
sr: Механика платформе
sr_latn: Mehanika platforme
sv: Plattformsmekanik
te: ప్లాట్‌ఫామ్ మెకానిక్స్
th: กลไกการทำงานของแพลตฟอร์ม
tr: Platform mekaniği
uk: Механіка платформи
ur: پلیٹ فارم میکانیات
uz: Platforma
vi: Cơ chế nền tảng
zh_hk: 平台運作方式
zu: I-Platform mechanics

# settingsDarkTheme
source: Dark
af: Donker
am: ጨለማ
ar_eg: داكن
as: গাঢ়
az: Tünd
be: Цёмная
bn: গাঢ়
bs: Tamna
ca: Fosc
da: Mørkt
es_ar: Oscuro
et: Tume
eu: Iluna
fa: تیره
fil: Madilim
fr_ca: Sombre
gl: Escuro
gu: ઘેરી
he: כהה
hi: गहरे रंग की थीम
hu: Sötét
hy: Մուգ
id: Gelap
it: Scuro
ja: ダーク
ka: მუქი
km: ងងឹត
kn: ಡಾರ್ಕ್
ko: 어둡게
ky: Караңгы
lo: ມືດ
lt: Tamsioji tema
lv: Tumšs
mk: Темна
ml: ഇരുണ്ട
mn: Бараан
mr: गडद
ms: Gelap
my: အမှောင်
nb: Mørkt
ne: अँध्यारो
pa: ਗੂੜ੍ਹਾ
pl: Ciemny
pt: Escuro
pt_pt: Escuro
ro: Întunecată
ru: Тёмная
si: අඳුරු
sk: Tmavý
sq: E errët
sr: Тамна
sr_latn: Tamna
sv: Mörkt
te: ముదురు రంగు
th: สีเข้ม
tr: Koyu
uk: Темна
ur: گہری
uz: Tungi
vi: Tối
zh_hk: 深色
zu: Kumnyama

# settingsSlowMotion
source: Slow motion
af: Stadige aksie
am: የዝግታ እንቅስቃሴ
ar_eg: التصوير البطيء
as: মন্থৰ গতি
az: Aşağı sürətli
be: Запаволены рух
bn: স্লো মোশন
bs: Usporeni snimak
ca: Càmera lenta
es_ar: Cámara lenta
et: Aegluubis
eu: Kamera geldoa
fa: حرکت آهسته
fr_ca: Ralenti
gl: Cámara lenta
gu: સ્લો મોશન
he: הילוך איטי
hi: स्लो मोशन
hu: Lassított felvétel
hy: Դանդաղեցում
id: Gerak lambat
ja: スロー モーション
ka: შენელებული მოძრაობა
km: ចលនា​យឺត
kn: ಸ್ಲೋ ಮೋಷನ್
ko: 슬로 모션
ky: Жай кыймыл
lo: ສະໂລໂມຊັນ
lt: Sulėtintas
lv: Palēnināta kustība
mk: Бавно движење
ml: സ്ലോ മോഷൻ
mn: Удаашруулсан
mr: स्लो मोशन
ms: Gerak perlahan
my: အနှေးပြကွက်
nb: Sakte film
ne: ढिलो गति
pa: ਧੀਮੀ ਰਫ਼ਤਾਰ
pl: Zwolnione tempo
pt: Câmera lenta
pt_pt: Câmara lenta
ru: Замедленная анимация
si: මන්දගාමී චලනය
sk: Spomalenie
sq: Lëvizje e ngadaltë
sr: Успорени снимак
sr_latn: Usporeni snimak
te: నెమ్మది చలనం
tr: Ağır çekim
uk: Уповільнення
ur: سلو موشن
uz: Sekinlashuv
vi: Chuyển động chậm
zh_hk: 慢動作
zu: Islowu moshini

# settingsAbout
source: About Flutter Gallery
af: Meer oor Flutter Gallery
am: ስለ ፍላተር ማዕከለ ስዕላት
ar_eg: لمحة عن معرض Flutter
as: Flutter Galleryৰ বিষয়ে
az: Flutter Qalereya haqqında
be: Пра Flutter Gallery
bn: ফ্লাটার গ্যালারি সম্পর্কে
bs: O usluzi Flutter Gallery
ca: Sobre Flutter Gallery
da: Om Flutter Gallery
es_ar: Acerca de Flutter Gallery
et: Teave Flutteri galerii kohta
eu: Flutter Gallery-ri buruz
fa: درباره گالری فلاتر
fil: Tungkol sa Gallery ng Flutter
fr_ca: À propos de la galerie Flutter
gl: Acerca da Flutter Gallery
gu: Flutter Gallery વિશે
he: מידע על Flutter Gallery
hi: Flutter Gallery के बारे में जानकारी
hu: A Flutter galériáról
hy: Flutter Gallery-ի մասին
id: Tentang Flutter Gallery
it: Informazioni su Flutter Gallery
ja: Flutter ギャラリーについて
ka: Flutter Gallery-ს შესახებ
km: អំពី Flutter Gallery
kn: ಫ್ಲಟರ್ ಗ್ಯಾಲರಿ ಕುರಿತು
ko: Flutter Gallery 정보
ky: Flutter галереясы жөнүндө маалымат
lo: ກ່ຽວກັບ Flutter Gallery
lt: Apie „Flutter“ galeriją
lv: Par galeriju “Flutter”
mk: За Flutter Gallery
ml: ഫ്ലട്ടർ ഗ്യാലറിയെ കുറിച്ച്
mn: Flutter Gallery-н тухай
mr: Flutter Gallery बद्दल
ms: Perihal Galeri Flutter
my: Flutter Gallery အကြောင်း
nb: Om Flutter Gallery
ne: Flutter Gallery का बारेमा
pa: Flutter Gallery ਬਾਰੇ
pl: Flutter Gallery – informacje
pt: Sobre a Flutter Gallery
pt_pt: Acerca da galeria do Flutter
ro: Despre galeria Flutter
ru: О Flutter Gallery
si: Flutter Gallery ගැන
sk: Flutter Gallery
sq: Rreth galerisë së Flutter
sr: О услузи Flutter Gallery
sr_latn: O usluzi Flutter Gallery
sv: Om Flutter Gallery
te: 'Flutter Gallery' పరిచయం
th: เกี่ยวกับ Flutter Gallery
tr: Flutter Gallery hakkında
uk: Про Flutter Gallery
ur: چاپلوسی والی Gallery کے بارے میں
uz: Flutter Gallery haqida
vi: Giới thiệu về Flutter Gallery
zh_hk: 關於 Flutter Gallery
zu: Mayelana ne-Flutter Gallery

# settingsFeedback
source: Send feedback
af: Stuur terugvoer
am: ግብረመልስ ላክ
ar_eg: إرسال التعليقات
as: মতামত পঠিয়াওক
az: Rəy göndərin
be: Адправіць водгук
bn: মতামত জানান
bs: Pošalji povratne informacije
ca: Envia suggeriments
es_ar: Envía comentarios
et: Tagasiside saatmine
eu: Bidali oharrak
fa: ارسال بازخورد
fil: Magpadala ng feedback
fr_ca: Envoyer des commentaires
gl: Enviar comentarios
gu: પ્રતિસાદ મોકલો
he: שליחת משוב
hi: सुझाव भेजें
hu: Visszajelzés küldése
hy: Կարծիք հայտնել
id: Kirimkan masukan
it: Invia feedback
ja: フィードバックを送信
ka: გამოხმაურების გაგზავნა
km: ផ្ញើមតិកែលម្អ
kn: ಪ್ರತಿಕ್ರಿಯೆ ಕಳುಹಿಸಿ
ko: 의견 보내기
ky: Пикир билдирүү
lo: ສົ່ງຄຳຕິຊົມ
lt: Siųsti atsiliepimą
lv: Sūtīt atsauksmes
mk: Испратете повратни информации
ml: ഫീഡ്ബാക്ക് അയയ്ക്കുക
mn: Санал хүсэлт илгээх
mr: फीडबॅक पाठवा
ms: Hantar maklum balas
my: အကြံပြုချက် ပို့ခြင်း
nb: Send tilbakemelding
ne: प्रतिक्रिया पठाउनुहोस्
pa: ਵਿਚਾਰ ਭੇਜੋ
pl: Prześlij opinię
pt: Enviar feedback
pt_pt: Enviar feedback
ro: Trimiteți feedback
ru: Отправить отзыв
si: ප්‍රතිපෝෂණ යවන්න
sk: Odoslať spätnú väzbu
sq: Dërgo koment
sr: Пошаљи повратне информације
sr_latn: Pošalji povratne informacije
sv: Skicka feedback
te: ఫీడ్‌బ్యాక్ పంపండి
th: ส่งความคิดเห็น
tr: Geri bildirim gönder
uk: Надіслати відгук
ur: تاثرات بھیجیں
uz: Fikr-mulohaza yuborish
vi: Gửi ý kiến phản hồi
zh_hk: 傳送意見
zu: Thumela impendulo

# settingsAttribution
source: Designed by TOASTER in London
af: Ontwerp deur TOASTER in Londen
am: ለንደን ውስጥ በTOASTER የተነደፈ
ar_eg: من تصميم TOASTER في لندن
as: লণ্ডনত TOASTERএ ডিজাইন কৰা
az: Londonda TOASTER tərəfindən hazırlanmışdır
be: Дызайн: TOASTER, Лондан
bn: লন্ডনে TOASTER দ্বারা ডিজাইন করা হয়েছে
bs: Dizajnirala agencija TOASTER iz Londona
ca: Dissenyat per TOASTER a Londres
da: Designet af TOASTER i London
es_ar: Diseño de TOASTER (Londres)
et: Londonis kujundanud TOASTER
eu: Londreseko TOASTER enpresak diseinatua
fa: طراحی توسط تُستر لندن
fil: Idinisenyo ng TOASTER sa London
fr_ca: Créé par TOASTER à Londres
gl: Deseñado por TOASTER en Londres
gu: લંડનમાં TOASTER દ્વારા ડિઝાઇન કરાયેલ
he: בעיצוב של TOASTER בלונדון
hi: लंदन के TOASTER ने डिज़ाइन किया है
hu: Tervezte: TOASTER, London
hy: Դիզայնը՝ TOASTER (Լոնդոն)
id: Didesain oleh TOASTER di London
it: Design di TOASTER di Londra
ja: デザイン: TOASTER（ロンドン）
ka: შექმნილია TOASTER-ის მიერ ლონდონში
km: រចនាដោយ TOASTER នៅក្នុង​ទីក្រុងឡុងដ៍
kn: ಲಂಡನ್‌ನಲ್ಲಿರುವ TOASTER ವಿನ್ಯಾಸಗೊಳಿಸಿದೆ
ky: Лондондогу TOASTER тарабынан жасалгаланды
lo: ອອກແບບໂດຍ TOASTER ໃນລອນດອນ
lt: Sukūrė TOASTER, Londonas
lv: Radīja uzņēmums TOASTER Londonā
mk: Дизајн на TOASTER во Лондон
ml: ലണ്ടനിലെ TOASTER രൂപകൽപ്പന ചെയ്തത്
mn: Лондон дахь TOASTER зохион бүтээсэн
mr: लंडनच्या TOASTER यांनी डिझाइन केलेले
ms: Direka bentuk oleh TOASTER di London
nb: Designet av TOASTER i London
ne: TOASTER द्वारा लन्डनमा डिजाइन गरिएको
pa: ਲੰਡਨ ਵਿੱਚ TOASTER ਵੱਲੋਂ ਡਿਜ਼ਾਈਨ ਕੀਤਾ ਗਿਆ
pl: Zaprojektowane przez TOASTER w Londynie
pt: Criado pela TOASTER em Londres
pt_pt: Criado por TOASTER em Londres
ro: Conceput de TOASTER în Londra
ru: Дизайн: TOASTER, Лондон
si: ලන්ඩනයේ TOASTER විසින් නිර්මාණය කරන ලදි
sk: Navrhol TOASTER v Londýne
sq: Projektuar nga TOASTER në Londër
sr: Дизајнирала агенција TOASTER из Лондона
sr_latn: Dizajnirala agencija TOASTER iz Londona
sv: Designad av TOASTER i London
te: లండన్‌లోని TOASTER ద్వారా డిజైన్ చేయబడింది
th: ออกแบบโดย TOASTER ในลอนดอน
tr: Londra'da TOASTER tarafından tasarlandı
uk: Створено TOASTER (Лондон)
ur: لندن میں ٹوسٹر کے ذریعے ڈیزائن کیا گیا
uz: Dizayn: TOASTER, London
vi: Thiết kế của TOASTER tại London
zh_hk: 由倫敦的 TOASTER 設計
zu: Kudizayinwe ngu-TOASTER e-London

# demoButtonTitle
source: Buttons
af: Knoppies
am: አዝራሮች
ar_eg: الأزرار
as: বুটামসমূহ
az: Düymələr
be: Кнопкі
bn: বোতাম
bs: Dugmad
ca: Botons
da: Knapper
es_ar: Botones
et: Nupud
eu: Botoiak
fa: دکمه‌ها
fil: Mga Button
fr_ca: Boutons
gl: Botóns
gu: બટન
he: לחצנים
hi: बटन
hu: Gombok
hy: Կոճակներ
id: Tombol
it: Pulsanti
ja: ボタン
ka: ღილაკები
km: ប៊ូតុង
kn: ಬಟನ್‌ಗಳು
ko: 버튼
ky: Баскычтар
lo: ປຸ່ມ
lt: Mygtukai
lv: Pogas
mk: Копчиња
ml: ബട്ടണുകൾ
mn: Товчлуур
mr: बटणे
ms: Butang
my: ခလုတ်များ
nb: Knapper
ne: बटनहरू
pa: ਬਟਨ
pl: Przyciski
pt: Botões
pt_pt: Botões
ro: Butoane
ru: Кнопки
si: බොත්තම්
sk: Tlačidlá
sq: Butonat
sr: Дугмад
sr_latn: Dugmad
sv: Knappar
te: బటన్‌లు
th: ปุ่ม
tr: Düğmeler
uk: Кнопки
ur: بٹنز
uz: Tugmalar
vi: Nút
zh_hk: 按鈕
zu: Izinkinobho

# demoButtonSubtitle
source: Text, elevated, outlined, and more
af: Teks, verhewe, buitelyn en meer
am: ጽሁፍ፣ ከፍ ያለ፣ ባለቢጋር፣ እና ተጨማሪ
ar_eg: أزرار نصية أو بارزة أو محدَّدة الجوانب، والمزيد
as: পাঠ, উঠঙা, বৰ্হিৰেখাযুক্ত আৰু অধিক
az: Mətn, qabarıq, haşiyəli və daha çoxu
be: Тэкставыя, прыпаднятыя, з контурамі і іншыя
bn: টেক্সট, উন্নত, আউটলাইনের সুবিধা এবং আরও অনেক কিছু
bs: Tekst, izdignut, ocrtan i još mnogo toga
ca: De text, amb relleu, perfilat i més
da: Tekst, hævet, kontur og meget mere
es_ar: Plano, con relieve, con contorno y más
et: Teksti-, tõstetud ja mitmetasandilised nupud ning muu
eu: Lauak, goratuak, ingeradadunak eta gehiago
fa: نوشتار، برجسته، برون‌نما، و موارد دیگر
fil: Text, nakaangat, may outline, at higit pa
fr_ca: Bouton plat, bouton surélevé, bouton avec contours, etc.
gl: Texto, elevacións, contornos e moito máis
gu: ટેક્સ્ટ, ઉપર ચડાવેલું, આઉટલાઇન, અને ઘણું બધું
he: טקסט, בולט, מודגש ועוד
hi: टेक्स्ट, उभरे हुए, आउटलाइन वाले, और ज़्यादा बटन
hu: Szöveg, kiemelkedő, körülrajzolt és egyebek
hy: Տեքստային, բարձրացված, ուրվագծային և այլ
id: Teks, timbul, outline, dan banyak lagi
it: Di testo, sollevati, con contorni e molto altro
ja: テキスト、浮き上がり、アウトラインなど
ka: ტექსტის, ამოწეული, კონტურიანი და სხვა
km: អត្ថបទ ផុសឡើង មានបន្ទាត់ជុំវិញ និងអ្វីៗជាច្រើនទៀត
kn: ಪಠ್ಯ, ಎತ್ತರಿಸಿದ, ವಿವರಿಸಿರುವ, ಮತ್ತು ಇನ್ನಷ್ಟು
ko: 텍스트 버튼, 돌출 버튼, 윤곽 버튼 등
ky: Текст, көтөрүлгөн, контурланган жана башкалар
lo: ຂໍ້ຄວາມ, ຍົກຂຶ້ນ, ມີຂອບ ແລະ ອື່ນໆ
lt: Tekstiniai, iškilieji, kontūriniai ir kt.
lv: Teksta pogas, paaugstinātas, konturētas un citādas pogas
mk: За текст, подигнато, со контура и сл.
ml: ടെക്‌സ്‌റ്റ് ബട്ടൺ, എലവേറ്റഡ് ബട്ടൺ, ഔട്ട്ലൈൻഡ് ബട്ടൺ തുടങ്ങിയവ
mn: Текст, товгор, хүрээтэй болон бусад
mr: मजकूर, एलेव्हेटेड, आउटलाइन्ड आणि अधिक
ms: Teks, terangkat, bergaris dan banyak lagi
my: စာသား၊ စာလုံးဆင့်ခြင်း၊ ဘောင်မျဉ်းခတ်ခြင်း စသည်
nb: Tekst, fremhevet, med omriss med mer
ne: टेक्स्ट, माथि उठेको, आउटलाइनयुक्त र अन्य बटनहरू
pa: ਲਿਖਤ ਵਾਲੇ, ਉੱਭਰੇ ਹੋਏ, ਖਾਕਾਬੱਧ ਅਤੇ ਹੋਰ
pl: Przycisk tekstowy, podniesiony, z konturem itp.
pt: Texto, elevado, circunscrito e muito mais
pt_pt: Texto, elevado, de contorno e muito mais
ro: Text, în relief, conturate și altele
ru: Текстовые, приподнятые, контурные и другие
si: පෙළ, එසවූ, වැටිසන යෙදූ සහ තවත්
sk: Textové, zvýšené, s obrysom a ďalšie
sq: Tekst, i ngritur, me kontur etj.
sr: Дугме за текст, издигнуто и оивичено дугме и друго
sr_latn: Dugme za tekst, izdignuto i oivičeno dugme i drugo
sv: Text, upphöjd, kontur med mera
te: టెక్స్ట్, ముందుకు ఉన్న, రూపకల్పన ఉన్న బటన్‌లు, ఇంకా మరెన్నో
th: ข้อความ ยกขึ้น เติมขอบ และอื่นๆ
tr: Metin, yükseltilmiş, dış çizgili ve daha fazlası
uk: Кнопки з контуром, опуклі, текстові тощо
ur: ٹیکسٹ، ابھرا ہوا، آؤٹ لائن کردہ اور بہت کچھ
uz: Matnli, koʻtarilgan, chegarali va boshqalar
vi: Nút văn bản, nút lồi, nút có đường viền và nhiều nút khác
zh_hk: 文字按鈕、凸起的按鈕、外框按鈕等
zu: Umbhalo, okuphakanyisiwe, okuchaziwe, nokuningi

# demoToggleButtonTitle
source: Toggle Buttons
af: Wisselknoppies
am: መቀያየሪያ አዝራሮች
ar_eg: أزرار التبديل
as: ট’গলৰ বুটামসমূহ
az: Dəyişdirici Düymələr
be: Кнопкі пераключэння
bn: টগল বোতাম
bs: Dugmad za uključivanje/isključivanje
ca: Botons de commutació
da: Til/fra-knapper
es_ar: Botones de activación
et: Lülitusnupp
eu: Etengailuak
fa: دکمه‌های تغییر وضعیت
fil: Mga Toggle Button
fr_ca: Boutons Activer/désactiver
gl: Botóns de activación/desactivación
gu: ટૉગલ બટન
he: לחצני החלפת מצב
hi: टॉगल बटन
hu: Váltógombok
hy: Փոխարկման կոճակներ
id: Tombol
it: Pulsanti di attivazione/disattivazione
ja: 切り替えボタン
ka: გადართვის ღილაკები
km: ប៊ូតុងបិទ/បើក
kn: ಟಾಗಲ್ ಬಟನ್‌ಗಳು
ko: 전환 버튼
ky: Күйгүзүү/өчүрүү баскычтары
lo: ປຸ່ມເປີດ/ປິດ
lt: Perjungimo mygtukai
lv: Pārslēgšanas pogas
mk: Копчиња за префрлање
ml: ടോഗിൾ ബട്ടണുകൾ
mn: Асаах товч
mr: टॉगल बटणे
ms: Butang Togol
my: အဖွင့်အပိတ်ခလုတ်များ
nb: Av/på-knapper
ne: टगल गर्ने बटन
pa: ਟੌਗਲ ਬਟਨ
pl: Przyciski przełączania
pt: Botões ativar
pt_pt: Botões ativar/desativar
ro: Butoane de comutare
ru: Переключатели
si: ටොගල බොත්තම්
sk: Prepínače
sq: Butonat e ndërrimit
sr: Дугмад за укључивање/искључивање
sr_latn: Dugmad za uključivanje/isključivanje
sv: På/av-knappar
te: టోగుల్ బటన్‌లు
th: ปุ่มเปิด-ปิด
tr: Açma/Kapatma Düğmeleri
uk: Перемикачі
ur: ٹوگل بٹنز
uz: Belgilash/olib tashlash tugmalari
vi: Nút chuyển đổi
zh_hk: 切換按鈕
zu: Izinkinobho zokuguqula

# colorsTeal
source: TEAL
af: BLOUGROEN
am: ደማቅ አረንጓዴ-ሰማያዊ
ar_eg: أزرق مخضرّ
as: গাঢ় সেউজ-নীলা
az: FİRUZƏYİ
be: СІНЕ-ЗЯЛЁНЫ
bn: সবজে নীল
bs: TIRKIZNA
ca: VERD BLAVÓS
da: GRØNBLÅ
es_ar: VERDE AZULADO
et: SINAKASROHELINE
eu: ANILA
fa: سبز دودی
fr_ca: BLEU SARCELLE
gl: TURQUESA
gu: મોરપીચ્છ
he: כחול-ירקרק
hi: नीला-हरा
hu: PÁVAKÉK
hy: ՓԻՐՈՒԶԱԳՈՒՅՆ
id: HIJAU KEBIRUAN
it: VERDE ACQUA
ja: ティール
ka: ზურმუხტისფერი
km: បៃតងចាស់
kn: ಟೀಲ್ ಬಣ್ಣ
ko: 청록색
ky: КӨГҮШ ЖАШЫЛ
lo: ສີຟ້າອົມຂຽວ
lt: TAMSIAI ŽYDRA
lv: ZILGANZAĻA
mk: ТИРКИЗНА
ml: ടീൽ
mn: УСАН ЦЭНХЭР
mr: हिरवट निळा
ms: HIJAU KEBIRUAN
my: စိမ်းပြာရောင်
nb: BLÅGRØNN
ne: निलोमिश्रित हरियो रङ्ग
pa: ਟੀਲ
pl: MORSKI
pt: AZUL-PETRÓLEO
pt_pt: AZUL ESVERDEADO
ro: TURCOAZ
ru: БИРЮЗОВЫЙ
si: තද හරිත නීල
sk: MODROZELENÁ
sq: GURKALI
sr: ТИРКИЗНА
sr_latn: TIRKIZNA
sv: BLÅGRÖN
te: నీలి ఆకుపచ్చ రంగు
th: น้ำเงินอมเขียว
tr: TURKUAZ
uk: БІРЮЗОВИЙ
ur: نیلگوں سبز
uz: MOVIY
vi: MÀU MÒNG KÉT
zh_hk: 藍綠色
zu: I-TEAL

# demoFloatingButtonTitle
source: Floating Action Button
af: Swewende handelingknoppie
am: የተንሳፋፊ እርምጃ አዝራር
ar_eg: زر الإجراء العائم
as: ওপঙি থকা কার্যৰ বুটাম
az: Üzən Əməliyyat Düyməsi
be: Рухомая кнопка дзеяння
bn: ভাসমান অ্যাকশন বোতাম
bs: Plutajuće dugme za radnju
ca: Botó d'acció flotant
da: Svævende handlingsknap
es_ar: Botón de acción flotante
et: Hõljuv toimingunupp
eu: Ekintza-botoi gainerakorra
fa: دکمه عمل شناور
fil: Floating na Action Button
fr_ca: Bouton d'action flottant
gl: Botón de acción flotante
gu: ફ્લોટિંગ ઍક્શન બટન
he: לחצן פעולה צף
hi: फ़्लोट करने वाला कार्रवाई बटन
hu: Lebegő műveletgomb
hy: Գործողության լողացող կոճակ
id: Tombol Tindakan Mengambang
it: Pulsante di azione sovrapposto (FAB, Floating Action Button)
ja: フローティング アクションボタン
ka: მოქმედების მოლივლივე ღილაკი
km: ប៊ូតុងសកម្មភាពអណែ្តត
kn: ಫ್ಲೋಟಿಂಗ್ ಆ್ಯಕ್ಷನ್ ಬಟನ್
ko: 플로팅 작업 버튼
ky: Калкыма аракеттер баскычы
lo: ປຸ່ມຄຳສັ່ງແບບລອຍ
lt: Slankusis veiksmo mygtukas
lv: Peldoša darbības poga
mk: Лебдечко копче за дејство
ml: ഫ്ലോട്ടിംഗ് പ്രവർത്തന ബട്ടൺ
mn: Үйлдлийн хөвөгч товчлуур
mr: फ्लोटिंग ॲक्शन बटण
ms: Butang Tindakan Terapung
my: လွင့်မျောနေသည့် လုပ်ဆောင်ချက်ခလုတ်
nb: Svevende handlingsknapp
ne: तैरिनेसम्बन्धी कार्य बटन
pa: ਫਲੋਟਿੰਗ ਕਾਰਵਾਈ ਬਟਨ
pl: Pływający przycisk polecenia
pt: Botão de ação flutuante
pt_pt: Botão de ação flutuante
ro: Buton de acțiune flotant
ru: Плавающая командная кнопка
si: පාවෙන ක්‍රියා බොත්තම
sk: Plávajúce tlačidlo akcie
sq: Butoni pluskues i veprimit
sr: Плутајуће дугме за радњу
sr_latn: Plutajuće dugme za radnju
sv: Flytande åtgärdsknapp
te: తేలియాడే చర్య బటన్
th: ปุ่มการทำงานแบบลอย
tr: Kayan İşlem Düğmesi
uk: Плаваюча командна кнопка
ur: فلوٹنگ کارروائی بٹن
uz: Erkin harakatlanuvchi amal tugmasi
vi: Nút hành động nổi
zh_hk: 懸浮動作按鈕
zu: Inkinobho yesenzo entantayo
