Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoGridListsSubtitle
source: Row and column layout
af: Ry- en kolomuitleg
am: የረድፍ እና የዓምድ አቀማመጥ
ar_eg: تنسيق الصفوف والأعمدة
as: শাৰী আৰু স্তম্ভৰ লেইআউট
az: Sıra və sütun düzəni
be: Макет радкоў і слупкоў
bn: সারি এবং কলামের লেআউট
bs: Raspored redova i kolona
ca: Disseny de fila i columna
da: Række- og kolonnelayout
es_ar: Diseño de filas y columnas
et: Ridade ja veergudega paigutus
eu: Errenkaden eta zutabeen diseinua
fa: طرح‌بندی ردیفی و ستونی
fil: Layout ng row at column
fr_ca: Disposition en lignes et en colonnes
gl: Deseño de columnas e filas
gu: પંક્તિ અને કૉલમ લેઆઉટ
he: פריסת שורות ועמודות
hi: पंक्ति और कॉलम का लेआउट
hu: Soros és oszlopos elrendezés
hy: Տողերի և սյունակների դասավորությունը
id: Tata letak baris dan kolom
it: Layout righe e colonne
ja: 行と列のレイアウト
ka: მწკრივებისა და სვეტების განლაგება
km: ប្លង់​ជួរដេក និង​ជួរឈរ
kn: ಸಾಲು ಮತ್ತು ಕಾಲಮ್ ಲೇಔಟ್
ko: 행 및 열 레이아웃
ky: Катар менен тилкенин калыбы
lo: ໂຄງຮ່າງແຖວ ແລະ ຖັນ
lt: Eilučių ir stulpelių išdėstymas
lv: Rindu un kolonnu izkārtojums
mk: Распоред на редови и колони
ml: വരിയുടെയും കോളത്തിന്റെയും ലേഔട്ട്
mn: Мөр болон баганын байршил
mr: पंक्ती आणि स्तंभाचा लेआउट
ms: Reka letak baris dan lajur
my: အတန်းနှင့် ကော်လံ အနေအထား
nb: Oppsett for rader og kolonner
ne: पङ्क्ति र स्तम्भको लेआउट
pa: ਕਤਾਰ ਅਤੇ ਕਾਲਮ ਖਾਕਾ
pl: Układ wierszy i kolumn
pt: Layout de linhas e colunas
pt_pt: Esquema de linhas e colunas.
ro: Aspectul rândurilor și al coloanelor
ru: Макет строк и столбцов
si: පේළී සහ තීරු පිරිසැලසුම
sk: Rozloženie riadkov a stĺpcov
sq: Struktura e rreshtit dhe kolonës
sr: Изглед са редовима и колонама
sr_latn: Izgled sa redovima i kolonama
sv: Layout på rader och kolumner
te: అడ్డు వరుసలు మరియు నిలువు వరుసల లేఅవుట్
th: เลย์เอาต์แบบแถวและคอลัมน์
tr: Satır ve sütun düzeni
uk: Макет рядків і стовпців
ur: قطار اور کالم کا لے آؤٹ
uz: Qator va ustunlar maketi
vi: Bố cục hàng và cột
zh_hk: 列和欄的版面配置
zu: Isakhiwo somugqa nesekholomu

# demoGridListsDescription
source: Grid Lists are best suited for presenting homogeneous data, typically images. Each item in a grid list is called a tile.
af: Roosterlyste is die geskikste vir die aanbieding van gelyksoortige data, tipies prente. Elke item op 'n roosterlys word 'n teël genoem.
am: ፍርግርግ ዝርዝሮች ተመሳሳይነት ያለውን ውሂብ በተለይ ደግሞ ምስሎች ለማቅረብ በጣም የተሻሉ አማራጮች ናቸው። በፍርግርግ ዝርዝር ውስጥ ያለው እያንዳንዱ ንጥል ስድር ይባላል።
ar_eg: الاستخدام المثالي لقوائم الشبكات هو لعرض البيانات المتجانسة التي عادة ما تكون صورًا. كل عنصر في الشبكة يُسمَى مربّع.
as: গ্ৰিডৰ সূচীসমূহ প্ৰতিচ্ছবিসমূহৰ দৰে একেধৰণৰ ডেটা উপস্থাপন কৰিবলৈ সকলোতকৈ বেছি উপযুক্ত। এখন গ্ৰিডৰ সূচীৰ প্ৰতিটো বস্তুক এখন টাইল বুলি কোৱা হয়।
az: Tor Siyahılar şəkillər kimi homogen datanın təqdimatı üçün tam uyğundur. Tor siyahıdakı hər element plitə adlanır.
be: Таблічныя спісы лепш за ўсё падыходзяць для паказу аднатыпных даных, напрыклад відарысаў. Усе элементы, уключаныя ў такія спісы, называюцца пліткамі.
bn: গ্রিডের তালিকা একই ধরনের ডেটা, সাধারণত ছবি, দেখানোর জন্য সবচেয়ে বেশি ব্যবহার করা হয়। গ্রিড তালিকায় থাকা প্রতিটি আইটেমকে একটি টাইল বলা হয়।
bs: Mrežaste liste su najpogodnije za prikaz homogenih podataka, obično slika. Svaka stavka na mrežastoj listi se naziva polje.
ca: Les llistes amb quadrícula són les més adequades per presentar dades homogènies, normalment imatges. Cada element d'una llista amb quadrícula s'anomena "mosaic".
da: Gitterlister egner sig bedst til at præsentere homogene data, typisk billeder. Hvert element i en gitterliste kaldes et felt.
es_ar: Las listas de cuadrícula funcionan mejor para mostrar datos homogéneos, como imágenes. Cada elemento de una lista de cuadrícula se llama mosaico.
et: Ruudustikloendid sobivad kõige paremini homogeensete andmete (nt piltide) esitamiseks. Iga ruudustikloendis olevat üksust nimetatakse paaniks.
eu: Sareta itxurako zerrendak oso egokiak dira datu homogeneoak aurkezteko, batez ere irudiak. Sareta itxurako zerrendetan, lauza esaten zaio elementu bakoitzari.
fa: «فهرست‌های جدولی» برای ارائه داده‌های همگن (معمولاً تصاویر) بسیار مناسب هستند. هر مورد در فهرست جدولی، کاشی نامیده می‌شود.
fil: Pinakaangkop na gamitin ang mga Grid na Listahan para magpakita ng magkakatulad na data, kadalasan mga larawan. Tinatawag na tile ang bawat item na nasa grid na listahan.
fr_ca: Les listes sous forme de grille sont particulièrement adaptées à la présentation de données homogènes, telles que des images. Chaque élément d'une liste sous forme de grille est appelé une tuile.
gl: As listas con grade son as máis adecuadas para presentar datos homoxéneos, normalmente imaxes. Os elementos das listas con grade chámanse mosaicos.
gu: એક જ પ્રકારનો ડેટા ખાસ કરીને છબીઓ પ્રસ્તુત કરવા માટે ગ્રિડ સૂચિઓ શ્રેષ્ઠપણે અનુકૂળ છે. ગ્રિડ સૂચિમાંની દરેક આઇટમને ટાઇલ કહેવામાં આવે છે.
he: רשימות רשתות הכי מתאימות להצגת נתונים הומוגניים, בדרך כלל אלה תמונות. כל פריט ברשימת רשתות נקרא אריח.
hi: ग्रिड सूचियां, एक जैसा डेटा पेश करने का सबसे सही विकल्प हैं. जैसे कि इमेज दिखाने के लिए. ग्रिड सूची में मौजूद हर आइटम को टाइल कहा जाता है.
hu: A rácsos listák homogén adatok (általában képek) megjelenítésére a legalkalmasabbak. A rácsos lista egyes elemeit csempéknek nevezzük.
hy: Ցանցաձև ցանկերը հարմարեցված են միատեսակ տվյալների (սովորաբար պատկերների) ցուցադրման համար։ Ցանցաձև ցանկի տարրերը կոչվում են սալիկներ։
id: Daftar Petak sangat cocok untuk menyajikan data homogen, biasanya berupa gambar. Setiap item dalam daftar petak disebut kotak.
it: Gli elenchi in formato griglia sono più adatti per presentare dati omogenei, generalmente le immagini. Ogni elemento in un elenco in formato griglia è chiamato riquadro.
ja: グリッドリストは、同種のデータ（一般的には画像）を表す場合に最適です。グリッドリスト内の各項目をタイルと言います。
ka: ცხრილის სახის სიები საუკეთესოა ერთგვაროვანი მონაცემების, ჩვეულებრივ სურათების, პრეზენტირებისთვის. თითოეულ ერთეულს ცხრილის სახის სიაში ეწოდება მოზაიკა.
km: បញ្ជី​ក្រឡា​មានភាព​ស័ក្តិសម​បំផុត​សម្រាប់​បង្ហាញ​ទិន្នន័យ​ដែលមាន​លក្ខណៈ​ដូចៗគ្នា ដោយ​ជាធម្មតា​គឺជា​រូបភាព​។ គេ​ហៅ​ធាតុ​នីមួយៗ​នៅក្នុង​បញ្ជី​ក្រឡា​ថា​ប្រអប់។
kn: ಏಕರೂಪದ ಡೇಟಾವನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲು, ಸಾಮಾನ್ಯವಾಗಿ ಚಿತ್ರಗಳನ್ನು ಗ್ರಿಡ್ ಪಟ್ಟಿಗಳು ಹೆಚ್ಚು ಸೂಕ್ತವಾಗಿರುತ್ತವೆ. ಗ್ರಿಡ್ ಪಟ್ಟಿಯಲ್ಲಿರುವ ಪ್ರತಿಯೊಂದು ಐಟಂ ಅನ್ನು ಟೈಲ್ ಎಂದು ಕರೆಯಲಾಗುತ್ತದೆ.
ko: 바둑판식 목록은 일반적으로 이미지처럼 같은 종류의 데이터를 표시하는 데 가장 적합합니다. 바둑판식 목록에 있는 각 항목을 타일이라고 합니다.
ky: Торчо тизмелери бир түрдүү маалыматты, адатта сүрөттөрдү көрсөтүү үчүн ыңгайлуу. Ар бир торчодогу нерсе "мозаика" деп аталат.
lo: ລາຍຊື່ຕາຕະລາງແມ່ນດີທີ່ສຸດສຳລັບການນຳສະເໜີຂໍ້ມູນທີ່ມີຄຸນລັກສະນະຄ້າຍກັນ, ໂດຍທົ່ວໄປແມ່ນຮູບພາບຕ່າງໆ. ແຕ່ລະລາຍການໃນລາຍຊື່ຕາຕະລາງແມ່ນເອີ້ນວ່າແຜ່ນ.
lt: Tinklelio sąrašai tinkamiausi norint rodyti vienos rūšies duomenis, įprastai vaizdus. Kiekvienas tinklelio sąrašo elementas vadinamas išklotinės elementu.
lv: Režģa saraksti ir piemērotāki homogēnu datu (parasti — attēlu) parādīšanai. Režģa saraksta vienumus dēvē par elementiem.
mk: „Списоците на табела“ се најпогодни за прикажување хомогени податоци, најчесто слики. Секој елемент во списокот на табелата се вика плочка.
ml: ഒരേ സ്വഭാവമുള്ള ഡാറ്റ (സാധാരണ ചിത്രങ്ങൾ) ദൃശ്യമാക്കുന്നതിന് ഏറ്റവും അനുയോജ്യമാണ് Grid ലിസ്റ്റുകൾ. GRid ലിസ്റ്റിലെ ഓരോ ഇനത്തെയും ടൈൽ എന്ന് വിളിക്കുന്നു.
mn: Торон жагсаалт нь ихэвчлэн зураг зэрэг жигд тархацтай өгөгдлийг үзүүлэхэд хамгийн тохиромжтой. Торон жагсаалтын зүйл бүрийг дөрвөлж гэж нэрлэдэг.
mr: एकसारखा डेटा खासकरून इमेज सादर करण्यासाठी ग्रिड सूची अधिक योग्य आहेत. ग्रिड सूचीमधील प्रत्येक आयटमला टाइल म्हणतात.
ms: Senarai Grid adalah paling sesuai untuk pembentangan data homogen, biasanya imej. Setiap item dalam senarai grid dipanggil jubin.
my: ဇယားကွက်စာရင်းများသည် ယေဘုယျအားဖြင့် ပုံကဲ့သို့ မျိုးတူသော ဒေတာများကို ဖော်ပြရန်အတွက် အသင့်လျော်ဆုံးဖြစ်သည်။ ဇယားကွက်စာရင်းအတွင်းရှိ အရာကို အကွက်ဟုခေါ်သည်။
nb: Rutenettlister er best egnet til å presentere homogene data, vanligvis bilder. Hvert element i en rutenettliste kalles en rute.
ne: ग्रिड सूचीहरू सामान्यतया फोटो जस्ता समरूप डेटा देखाउन सबैभन्दा अनुकूल हुन्छन्। ग्रिड सूचीका हरेक वस्तुलाई टाइल भनिन्छ।
pa: ਗ੍ਰਿਡ ਸੂਚੀਆਂ ਸਮਰੂਪੀ ਡਾਟੇ ਨੂੰ ਪੇਸ਼ ਕਰਨ ਲਈ ਸਭ ਤੋਂ ਅਨੁਕੂਲ ਹਨ, ਖਾਸ ਕਰਕੇ ਚਿੱਤਰ। ਗ੍ਰਿਡ ਸੂਚੀ ਵਿੱਚ ਹਰ ਆਈਟਮ ਨੂੰ ਟਾਇਲ ਕਿਹਾ ਜਾਂਦਾ ਹੈ।
pl: Listy w postaci siatki najlepiej nadają się do prezentowania danych jednorodnych. Typowym przykładem są obrazy. Poszczególne elementy listy w postaci siatki nazywane są kafelkami.
pt: Listas de grade são melhores para apresentar dados homogêneos, como imagens. Cada item em uma lista de grade é chamado de bloco.
pt_pt: As Listas de grelhas são mais adequadas para apresentar dados homogéneos, normalmente, imagens. Cada item numa lista de grelhas é denominado mosaico.
ro: Listele grilă sunt ideale pentru prezentarea datelor omogene, de obicei, a imaginilor. Fiecare element al unei liste grilă se numește secțiune.
ru: Табличные списки больше всего подходят для показа однотипных данных, например изображений. Объекты, включенные в такие списки, называются элементами.
si: සාමාන්‍යයෙන් රූප, සමජාතීය දත්ත ඉදිරිපත් කිරීම සඳහා ජාලක ලැයිස්තු වඩාත් සුදුසු වේ. ජාලක ලැයිස්තුවක ඇති එක් එක් අයිතමය ටයිලයක් ලෙස හැඳින්වේ.
sk: Mriežkové zoznamy sú najvhodnejšie na prezentáciu homogénnych dát, zvyčajne obrázkov. Jednotlivé položky v mriežkovom zozname sa nazývajú dlaždice.
sq: Listat në formë rrjete janë më të përshtatshme për paraqitjen e të dhënave homogjene, zakonisht të imazheve. Çdo artikull në një listë në formë rrjete quhet një pllakëz.
sr: Листе у облику координатних мрежа су најбоље за приказивање хомогених података, најчешће слика. Свака ставка на листи у облику координатне мреже се зове плочица.
sr_latn: Liste u obliku koordinatnih mreža su najbolje za prikazivanje homogenih podataka, najčešće slika. Svaka stavka na listi u obliku koordinatne mreže se zove pločica.
sv: Rutnätslistor lämpar sig bäst för att presentera data av liknande typ, exempelvis bilder. Varje objekt i en rutnätslista kallas för en ruta.
te: చిత్రాల లాగా, ఒకే రకంగా ఉండే డేటాను ప్రదర్శించడానికి గ్రిడ్ లిస్ట్‌లు అత్యుత్తమంగా సహాయపడతాయి. గ్రిడ్ లిస్ట్‌లోని ప్రతి అంశం ఒక టైల్‌గా పిలువబడుతుంది.
th: ลิสต์แบบตารางกริดเหมาะสมที่สุดสำหรับการนำเสนอข้อมูลที่มีลักษณะเหมือนกันซึ่งมักจะเป็นรูปภาพ โดยแต่ละรายการในลิสต์แบบตารางกริดเรียกว่าการ์ด
tr: Tablo Listeler, genellikle resimler gibi benzer türdeki verileri sunmanın en uygun yöntemidir. Tablodaki her öğeye kutu denir.
uk: Списки-сітки найкраще підходять для представлення однотипних даних, зокрема зображень. Елементи в такому списку називається плитками.
ur: ایک جیسا ڈیٹا، عموماً تصاویر پیش کرنے کے لیے گرڈ لسٹ سب سے زیادہ مناسب ہیں۔ گرڈ کی فہرست میں موجود ہر آئٹم کو ٹائل کہا جاتا ہے۔
uz: Jadval shaklidagi roʻyxatlar bir turdagi maʼlumotlarni koʻrsatish uchun juda qulay. Masalan, rasmlarni. Bunday roʻyxatga kiritilgan obyektlar elementlar deyiladi.
vi: Danh sách dạng lưới là hình thức phù hợp nhất để trình bày dữ liệu có tính chất đồng nhất, cụ thể là hình ảnh. Mỗi mục trong danh sách dạng lưới được gọi là một ô.
zh_hk: 格狀清單最適合用於展示同類資料，通常為圖片。格狀清單中的每個項目稱為圖塊。
zu: Uhlu lwegridi lufaneleke kahle kakhulu ekuphrezenteni idatha enhlobonye, ngokuvamile izithombe. Into ngayinye ekuhlu lwegridi ibizwa ngokuthi ithayili.

# demoGridListsImageOnlyTitle
source: Image only
af: Net prent
am: ምስል ብቻ
ar_eg: صورة فقط
as: কেৱল প্ৰতিচ্ছবি
az: Yalnız şəkil
be: Толькі відарыс
bn: শুধুমাত্র ছবি
bs: Samo slika
ca: Només imatge
da: Kun billeder
es_ar: Solo imagen
et: Ainult pilt
eu: Irudia soilik
fa: فقط تصویر
fil: Larawan lang
fr_ca: Images seulement
gl: Só imaxes
gu: માત્ર છબી
he: תמונה בלבד
hi: सिर्फ़ इमेज के लिए
hu: Csak kép
hy: Միայն պատկերներ
id: Hanya gambar
it: Solo immagine
ja: 画像のみ
ka: მხოლოდ სურათები
km: រូបភាព​តែប៉ុណ្ណោះ
kn: ಚಿತ್ರ ಮಾತ್ರ
ko: 이미지만
ky: Сүрөт гана
lo: ຮູບພາບເທົ່ານັ້ນ
lt: Tik vaizdas
lv: Tikai attēli
mk: Само слика
ml: ചിത്രം മാത്രം
mn: Зөвхөн зураг
mr: फक्त इमेज
ms: Imej sahaja
my: ပုံသီးသန့်
nb: Bare bilder
ne: छवि मात्र
pa: ਸਿਰਫ਼ ਚਿੱਤਰ
pl: Tylko obraz
pt: Somente imagens
pt_pt: Apenas imagem
ro: Numai imagine
ru: Только изображение
si: රූපය පමණී
sk: Iba obrázky
sq: Vetëm imazhe
sr: Само слике
sr_latn: Samo slike
sv: Endast bild
te: చిత్రం మాత్రమే
th: รูปภาพเท่านั้น
tr: Yalnızca resim
uk: Лише зображення
ur: صرف تصویر
uz: Faqat rasm
vi: Chỉ hình ảnh
zh_hk: 只限圖片
zu: Isithombe kuphela

# demoGridListsHeaderTitle
source: With header
af: Met opskrif
am: ከአርዕስት ጋር
ar_eg: تحتوي على رأس
as: হেডাৰৰ সৈতে
az: Yuxarı sərlövhə ilə
be: З верхнім калонтытулам
bn: হেডার সহ
bs: Sa zaglavljem
ca: Amb capçalera
da: Med sidehoved
es_ar: Con encabezado
et: Päisega
eu: Goiburuarekin
fa: با عنوان
fil: May header
fr_ca: Avec en-tête
gl: Con título
gu: હેડર સાથે
he: עם כותרת
hi: हेडर के साथ
hu: Fejléccel
hy: Էջագլխով
id: Dengan header
it: Con intestazione
ja: ヘッダーあり
ka: ზედა კოლონტიტულით
km: មាន​ក្បាលទំព័រ
kn: ಶಿರೋಲೇಖದೊಂದಿಗೆ
ko: 머리글 포함
ky: Жогорку колонтитул менен
lo: ພ້ອມກັບສ່ວນຫົວ
lt: Su antrašte
lv: Ar galveni
mk: Со заглавие
ml: തലക്കെട്ടിനൊപ്പം
mn: Толгой хэсэгтэй
mr: हेडरसह
ms: Dengan pengepala
my: ခေါင်းစီးနှင့်တကွ
nb: Med overskrift
ne: हेडरसहित
pa: ਸਿਰਲੇਖ ਨਾਲ
pl: Z nagłówkiem
pt: Com cabeçalho
pt_pt: Com cabeçalho
ro: Cu antet
ru: С верхним колонтитулом
si: ශීර්ෂකය සමග
sk: S hlavičkou
sq: Me kokën e faqes
sr: Са заглављем
sr_latn: Sa zaglavljem
sv: Med sidhuvud
te: హెడర్‌తో
th: พร้อมส่วนหัว
tr: Üst bilgisi olan
uk: З верхнім колонтитулом
ur: ہیڈر کے ساتھ
uz: Sarlavha bilan
vi: Có phần đầu trang
zh_hk: 設有頁首
zu: Nesihloko

# demoGridListsFooterTitle
source: With footer
af: Met voetskrif
am: ከግርጌ ማስታወሻ ጋር
ar_eg: تحتوي على تذييل
as: ফুটাৰৰ সৈতে
az: Aşağı sərlövhə ilə
be: З ніжнім калонтытулам
bn: ফুটার সহ
bs: S podnožjem
ca: Amb peu de pàgina
da: Med sidefod
es_ar: Con pie de página
et: Jalusega
eu: Oinarekin
fa: با پانویس
fil: May footer
fr_ca: Avec pied de page
gl: Con pé de páxina
gu: ફૂટર સાથે
he: עם כותרת תחתונה
hi: फ़ुटर के साथ
hu: Lábléccel
hy: Էջատակով
id: Dengan footer
it: Con piè di pagina
ja: フッターあり
ka: ქვედა კოლონტიტულით
km: មាន​ជើងទំព័រ
kn: ಅಡಿಟಿಪ್ಪಣಿಯೊಂದಿಗೆ
ko: 바닥글 포함
ky: Төмөнкү колонтитул менен
lo: ພ້ອມກັບສ່ວນທ້າຍ
lt: Su porašte
lv: Ar kājeni
mk: Со подножје
ml: അടിക്കുറിപ്പിനൊപ്പം
mn: Хөл хэсэгтэй
mr: फूटरसह
ms: Dengan pengaki
my: အောက်ခြေမှတ်စုနှင့်တကွ
nb: Med bunntekst
ne: फुटरसहित
pa: ਪਦਲੇਖ ਨਾਲ
pl: Ze stopką
pt: Com rodapé
pt_pt: Com rodapé
ro: Cu subsol
ru: С нижним колонтитулом
si: පාදකය සමග
sk: S pätou
sq: Me fundin e faqes
sr: Са подножјем
sr_latn: Sa podnožjem
sv: Med sidfot
te: ఫుటర్‌తో
th: พร้อมส่วนท้าย
tr: Alt bilgisi olan
uk: З нижнім колонтитулом
ur: فوٹر کے ساتھ
uz: Quyi sarlavha bilan
vi: Có phần chân trang
zh_hk: 設有頁尾
zu: Nonyaweni

# demoSlidersTitle
source: Sliders
af: Glyers
am: ተንሸራታቾች
ar_eg: شرائط التمرير
as: শ্লাইডাৰসমূহ
az: Slayderlər
be: Паўзункі
bn: স্লাইডার
bs: Klizači
ca: Controls lliscants
da: Skydere
es_ar: Controles deslizantes
et: Liugurid
eu: Graduatzaileak
fa: لغزنده
fil: Mga Slider
fr_ca: Curseurs
gl: Controis desprazables
gu: સ્લાઇડર
he: מחוונים
hi: स्लाइडर
hu: Csúszkák
hy: Սահիչներ
id: Penggeser
it: Cursori
ja: スライダー
ka: სლაიდერები
km: របាររំកិល
kn: ಸ್ಲೈಡರ್‌ಗಳು
ko: 슬라이더
ky: Сыдырмалар
lo: ຕົວເລື່ອນ
lt: Šliaužikliai
lv: Slīdņi
mk: Лизгачи
ml: സ്ലൈഡറുകൾ
mn: Слайдер
mr: स्लायडर
ms: Peluncur
my: ရွှေ့တုံးများ
nb: Glidebrytere
ne: स्लाइडरहरू
pa: ਸਲਾਈਡਰ
pl: Suwaki
pt: Controles deslizantes
pt_pt: Controlos de deslize
ro: Glisoare
ru: Ползунки
si: ස්ලයිඩර්
sk: Posúvače
sq: Rrëshqitësit
sr: Клизачи
sr_latn: Klizači
sv: Skjutreglage
te: స్లయిడర్‌లు
th: แถบเลื่อน
tr: Kaydırma Çubukları
uk: Повзунки
ur: سلائیڈرز
uz: Slayderlar
vi: Thanh trượt
zh_hk: 滑桿
zu: Izilayidi

# demoSlidersSubtitle
source: Widgets for selecting a value by swiping
af: Legstukke om 'n waarde te kies deur te swiep
am: በጣት ጠረግ በማድረግ እሴት ለመምረጥ የሚሆኑ ምግብሮች
ar_eg: أدوات لاختيار قيمة عن طريق التمرير السريع
as: ছোৱাইপ কৰি কোনো মান বাছনি কৰিবৰ বাবে ৱিজেটসমূহ
az: Sürüşdürərək dəyər seçmək üçün vidcetlər
be: Віджэты для выбару значэння гартаннем
bn: কোনও একটি মান সোয়াইপ করে বেছে নেওয়ার উইজেট
bs: Vidžeti za odabir vrijednosti prevlačenjem
ca: Widgets per seleccionar un valor fent lliscar el dit
da: Widgets til valg af en værdi ved at stryge
es_ar: Widgets para seleccionar un valor mediante el gesto de deslizar
et: Vidinad, millega valida väärtus pühkides
eu: Hatza pasatuta balio bat hautatzeko balio duten widgetak
fa: ابزارک‌هایی برای انتخاب مقدار با تند کشیدن صفحه
fil: Mga widget para sa pagpili ng value sa pamamagitan ng pag-swipe
fr_ca: Widgets permettant de sélectionner une valeur en glissant le doigt
gl: Widgets para seleccionar un valor ao pasar o dedo
gu: સ્વાઇપ કરીને મૂલ્ય પસંદ કરવા માટેના વિજેટ
he: ווידג'טים לבחירת ערך על ידי החלקה
hi: स्वाइप करके मान चुनने के विजेट
hu: Modulok, amelyek csúsztatásával kiválaszthatja a kívánt értéket
hy: Որոշակի արժեք ընտրելու համար օգտատերը պետք է մատն էկրանի վրայով սահեցնի
id: Widget untuk memilih nilai dengan menggeser
it: Widget per la selezione di un valore tramite scorrimento
ja: スワイプで値を選択するためのウィジェット
ka: ვიჯეტები მნიშვნელობის გადაფურცვლით ასარჩევად
km: ធាតុ​ក្រាហ្វិកសម្រាប់ជ្រើសរើស​តម្លៃដោយការអូស
kn: ಸ್ವೈಪ್ ಮಾಡುವ ಮೂಲಕ ಮೌಲ್ಯವನ್ನು ಆಯ್ಕೆಮಾಡುವುದಕ್ಕಾಗಿ ವಿಜೆಟ್‌ಗಳು
ko: 스와이프하여 값을 선택하는 위젯
ky: Экранды сүрүп, маанини тандоо виджеттери
lo: ວິດເຈັດສຳລັບການເລືອກຄ່າໂດຍການປັດ
lt: Vertės pasirinkimo perbraukiant valdikliai
lv: Logrīki vērtības atlasīšanai velkot
mk: Виџети за избор на вредност со повлекување
ml: സ്വെെപ്പ് ചെയ്ത് മൂല്യം തിരഞ്ഞെടുക്കുന്നതിനുള്ള വിജറ്റുകൾ
mn: Шудрах замаар утга сонгоход зориулсан жижиг хэрэгсэл
mr: स्वाइप करून एखादे मूल्य निवडण्यासाठी विजेट
ms: Widget untuk memilih nilai dengan meleret
my: ပွတ်ဆွဲခြင်းဖြင့် တန်ဖိုးတစ်ခုကို ရွေးချယ်ရန် ဝိဂျက်များ
nb: Moduler for å velge en verdi ved å sveipe
ne: स्वाइप गरेर मान चयन गर्ने विजेटहरू
pa: ਸਵਾਈਪ ਕਰਕੇ ਮੁੱਲ ਦੀ ਚੋਣ ਕਰਨ ਲਈ ਵਿਜੇਟ
pl: Widżety pozwalające wybrać wartość poprzez przesuwanie
pt: Widgets para selecionar um valor deslizando
pt_pt: Widgets para selecionar um valor ao deslizar rapidamente.
ro: Widgeturi pentru selectarea unei valori prin glisare
ru: Чтобы выбрать определенное значение, пользователю нужно провести пальцем по экрану
si: ස්වයිප් කිරීමෙන් අගයක් තේරීම සඳහා විජට්
sk: Miniaplikácie na výber hodnoty potiahnutím
sq: Miniaplikacione për zgjedhjen e një vlere me rrëshqitje
sr: Виџети за бирање вредности превлачењем прстом
sr_latn: Vidžeti za biranje vrednosti prevlačenjem prstom
sv: Widgetar för att välja ett värde genom att svepa
te: స్వైప్ చేయడం ద్వారా విలువను ఎంచుకోవడానికి విడ్జెట్‌లు
th: วิดเจ็ตสำหรับเลือกค่าด้วยการเลื่อน
tr: Kaydırarak bir değer seçmeyi sağlayan widget
uk: Віджети для вибору значення проведенням пальця
ur: سوائپ کر کے قدر منتخب کرنے کے لیے ویجیٹس
uz: Qiymat svayplash orqali tanlanadigan vidjetlar
vi: Tiện ích để chọn giá trị bằng cách vuốt
zh_hk: 滑動來選擇值的小工具
zu: Amawijethi wokukhetha ivelu ngokuswayipha
