Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoSelectionControlsSwitchDescription
source: On/off switches toggle the state of a single settings option. The option that the switch controls, as well as the state it's in, should be made clear from the corresponding inline label.
af: Aan/af-skakelaars wissel die staat van ’n enkele instellingsopsie. Die opsie wat die skakelaar beheer, asook die staat waarin dit is, moet uit die ooreenstemmende inlynetiket duidelik wees.
am: የማብሪያ/ማጥፊያ መቀያየሪያዎች የነጠላ ቅንብሮች አማራጭ ሁኔታን ይቀያይራሉ። መቀያየሪያው የሚቆጣጠረውን አማራጭና እንዲሁም ያለበትን ሁኔታ ከተጓዳኙ የውስጠ-መስመር መሰየሚያው ግልፅ መሆን አለበት።
ar_eg: تؤدي مفاتيح التشغيل/الإيقاف إلى تبديل حالة خيار واحد في الإعدادات. ويجب توضيح الخيار الذي يتحكّم فيه المفتاح وكذلك حالته، وذلك من خلال التسمية المضمَّنة المتاحة.
as: এটা একক ছেটিঙৰ বিকল্পৰ স্থিতি অন/অফ ছুইচসমূহে ট’গল কৰে। ছুইচটোৱে নিয়ন্ত্ৰণ কৰা বিকল্পটো তথা সেইটো কি স্থিতিত আছে সেয়া আনুষংগিক ইনলাইন লেবেলটোৱে স্পষ্ট কৰা উচিত।
az: Aktiv/deaktiv etmə dəyişdiriciləri bir ayarlar seçiminin vəziyyətini dəyişir. Dəyişdirici vasitəsilə idarə edilən seçim və onun olduğu vəziyyət müvafiq daxili nişandan aydın olmalıdır.
be: Пераключальнікі мяняюць стан аднаго параметра налад з уключанага на выключаны і наадварот. Параметр, якім кіруе пераключальнік, а таксама яго стан павінны адлюстроўвацца ў адпаведнай убудаванай метцы.
bn: চালু/বন্ধ করার সুইচ একটি সিঙ্গেল সেটিংসের বিকল্পের স্ট্যাটাস পরিবর্তন করে। যে বিকল্প স্যুইচ নিয়ন্ত্রণ করে এবং সেই সাথে এটির মধ্যে থাকা স্ট্যাটাস সম্পর্কিত ইনলাইন লেবেল থেকে মুছে ফেলা উচিত।
bs: Prekidači za uključivanje/isključivanje mijenjaju stanje jedne opcije postavki. Opcija koju kontrolira prekidač, kao i status te opcije, trebaju biti jasno naglašeni u odgovarajućoj direktnoj oznaci.
ca: Els interruptors commuten l'estat d'una única opció de configuració. L'etiqueta inserida corresponent ha de descriure l'opció que controla l'interruptor i l'estat en què es troba.
da: Til/fra-kontakter skifter en indstillings status. Den indstilling, som kontakten styrer, og dens status, bør tydeliggøres i den tilsvarende indlejrede etiket.
es_ar: Los interruptores de activado/desactivado cambian el estado de un único parámetro de configuración. La opción que controla el interruptor, como también el estado en que se encuentra, debería resultar evidente desde la etiqueta intercalada correspondiente.
et: Sees-/väljas-lülititega saab reguleerida konkreetse seade olekut. Valik, mida lülitiga juhitakse, ja ka selle olek, tuleb vastava tekstisisese sildiga sõnaselgelt ära märkida.
eu: Aktibatu eta desaktibatzeko etengailuek ezarpen-aukera bakar baten egoera aldatzen dute. Etiketa txertatuek argi adierazi behar dute etengailuak zein aukera kontrolatzen duen eta hura zein egoeratan dagoen.
fa: کلید روشن/ خاموش وضعیت یک گزینه تنظیمات را تغییر می‌دهد. گزینه‌ای که این کلید کنترل می‌کند و وضعیتی که در آن است باید ازطریق برچسب به‌خط مربوطه معلوم شود.
fil: Tina-toggle ng mga on/off na switch ang status ng isang opsyon sa mga setting. Dapat malinaw na nakasaad sa inline na label ang opsyong kinokontrol ng switch, pati na rin ang kasalukuyang status nito.
fr_ca: Les commutateurs permettent de basculer l'état d'un réglage unique. L'option que le commutateur détermine ainsi que l'état dans lequel il se trouve doivent être clairement indiqués sur l'étiquette correspondante.
gl: Os interruptores de activación e desactivación controlan o estado dunha soa opción de configuración. A etiqueta inserida do interruptor correspondente debería indicar de forma clara a opción que controla e o estado no que se atopa.
gu: ચાલુ/બંધ સ્વિચ સિંગલ સેટિંગ વિકલ્પની સ્થિતિને ટૉગલ કરે છે. સ્વિચ દ્વારા નિયંત્રિત વિકલ્પ તેમજ તેની સ્થિતિ, સંબંધિત ઇનલાઇન લેબલથી સ્પષ્ટ થવી જોઈએ.
he: מתגי הפעלה וכיבוי מחליפים את המצב של אפשרות הגדרות אחת. האפשרות שהמתג שולט בה, וגם המצב שבו הוא נמצא, אמורים להיות ברורים מהתווית המוטבעת המתאימה.
hi: चालू/बंद करने के स्विच को टॉगल करके, सेटिंग के किसी विकल्प की स्थिति बदली जा सकती है. स्विच की मदद से कंट्रोल किए जा रहे विकल्प और उसकी स्थिति, दोनों की पूरी जानकारी एक इनलाइन लेबल में दी जानी चाहिए.
hu: A be- és kikapcsolásra szolgáló gomb egyetlen beállítás állapotát módosítja. Annak a beállításnak, amelyet a kapcsoló vezérel, valamint annak, hogy éppen be- vagy kikapcsolt állapotban van-e a kapcsoló, egyértelműnek kell lennie a megfelelő szövegközi címkéből.
hy: Փոխանջատիչի միջոցով կարելի է միացնել կամ անջատել առանձին կարգավորումներ։ Կարգավորման անվանումը և կարգավիճակը պետք է պարզ երևան փոխանջատիչի կողքին։
id: Tombol akses on/off mengalihkan status opsi setelan tunggal. Opsi yang dikontrol tombol akses, serta statusnya, harus dijelaskan dari label inline yang sesuai.
it: Le opzioni on/off consentono di attivare/disattivare lo stato di una singola opzione di impostazioni. La funzione e lo stato corrente dell'opzione devono essere chiariti dall'etichetta incorporata corrispondente.
ja: オンとオフのスイッチでは、1 つの設定の状態を切り替えることができます。スイッチでコントロールする設定とその状態は、対応するインライン ラベルと明確に区別する必要があります。
ka: ჩართვა/გამორთვა გადართავს პარამეტრების ცალკეულ ვარიანტებს. ვარიანტი, რომელსაც გადამრთველი მართავს, ასევე მდგომარეობა, რომელშიც ის იმყოფება, ნათელი უნდა იყოს შესაბამისი ჩართული ლეიბლიდან.
km: ប៊ូតុង​បិទបើក​សម្រាប់​បិទ/បើក​ស្ថានភាព​ជម្រើស​នៃការកំណត់​តែមួយ។ ជម្រើសដែល​ប៊ូតុង​បិទបើក​គ្រប់គ្រង ក៏ដូចជា​ស្ថានភាព​ដែលវាស្ថិតនៅ គួរតែ​កំណត់​ឱ្យបាន​ច្បាស់លាស់ពី​ស្លាក​ក្នុងជួរ​ដែលពាក់ព័ន្ធ។
kn: ಆನ್/ಆಫ್ ಸ್ವಿಚ್‌ಗಳು ಒಂದೇ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ಆಯ್ಕೆಯ ಸ್ಥಿತಿಯನ್ನು ಬದಲಾಯಿಸುತ್ತವೆ. ಸ್ವಿಚ್ ನಿಯಂತ್ರಿಸುವ ಆಯ್ಕೆಯನ್ನು ಮತ್ತು ಅದರೊಳಗಿನ ಸ್ಥಿತಿಯನ್ನು ಅನುಗುಣವಾದ ಇನ್‌ಲೈನ್‌ ಲೇಬಲ್‌ ಬಳಸಿ ತೆಗೆದುಹಾಕಬೇಕು.
ko: 사용/사용 중지 스위치로 설정 옵션 하나의 상태를 전환합니다. 스위치로 제어하는 옵션 및 옵션의 상태는 해당하는 인라인 라벨에 명확하게 나타나야 합니다.
ky: Которгучтардын жардамы менен колдонуучу өзүнчө параметрди күйгүзүп жана өчүрө алат. Которгучтун жанында параметрдин аталышы жана абалы ачык көрсөтүлүшү керек.
lo: ປຸ່ມເປີດ/ປິດທີ່ຈະສະຫຼັບຕົວເລືອກການຕັ້ງຄ່າໃດໜຶ່ງ. ຕົວເລືອກທີ່ສະຫຼັບການຄວບຄຸມ, ຮວມທັງສະຖານະທີ່ມັນເປັນຢູ່, ຄວນເຮັດໃຫ້ຈະແຈ້ງຈາກປ້າຍກຳກັບໃນແຖວທີ່ສອດຄ່ອງກັນ.
lt: Įjungimo ir išjungimo jungikliais galima keisti kiekvienos nustatymų parinkties būseną. Jungiklio valdoma parinktis ir nustatyta būsena turi būti aiškios be įterptos etiketės.
lv: Izmantojot ieslēgšanas/izslēgšanas slēdzi, var mainīt vienas iestatījumu opcijas statusu. Atbilstošajā iekļautajā iezīmē ir jābūt skaidri norādītam, kuru opciju var pārslēgt, izmantojot slēdzi, un kāds statuss tai ir pašlaik.
mk: Прекинувачите за вклучување/исклучување ја менуваат состојбата на опција со една поставка. Опцијата што прекинувачот ја контролира, како и нејзината состојба, треба да е јасно одредена со соодветна етикета.
ml: ഓൺ/ഓഫ് സ്വിച്ചുകൾ ഒരു ക്രമീകരണ ഓപ്ഷന്റെ നിലയിൽ മാറ്റം വരുത്തുന്നു. സ്വിച്ച് നിയന്ത്രിക്കുന്ന ഓപ്ഷ‌നും അതിന്റെ നിലയും അനുബന്ധ ഇൻലൈൻ ലേബലിൽ നിന്ന് വ്യക്തമായിരിക്കണം.
mn: Асаах/унтраах сэлгүүр нь дан тохиргооны сонголтын төлөвийг асаана/унтраана. Сэлгэх хяналтын сонголт болон үүний байгаа төлөвийг харгалзах мөрийн шошгоос тодорхой болгох шаардлагатай.
mr: स्विच सुरू/बंद करणे हे सिंगल सेटिंग्ज पर्यायाची स्थिती टॉगल करते. स्विच नियंत्रित करतो तो पर्याय, तसेच त्यामध्ये त्याची स्थिती ही संबंधित इनलाइन लेबलनुसार स्पष्ट करावी.
ms: Suis hidup/mati menogol keadaan pilihan tetapan tunggal. Pilihan yang dikawal oleh suis, serta keadaan pilihan itu, hendaklah jelas daripada label sebaris yang sepadan.
my: အဖွင့်/အပိတ်ခလုတ်များသည် ဆက်တင်တစ်ခုတည်း ရွေးချယ်မှု၏ အခြေအနေကို ပြောင်းပေးသည်။ ခလုတ်က ထိန်းချုပ်သည့် ရွေးချယ်မှု၊ ၎င်းရောက်ရှိနေသည့် အခြေအနေကို သက်ဆိုင်ရာ အင်လိုင်းအညွှန်းတွင် ရှင်းရှင်းလင်းလင်း ထားရှိသင့်သည်။
nb: Av/på-brytere slår tilstanden til ett enkelt alternativ i innstillingene av/på. Alternativet for at bryterkontrollene, samt tilstanden de er i, skal være tydelig basert på den samsvarende innebygde etiketten.
ne: अन/अफ गर्ने स्विचहरूले सेटिङका एकल विकल्पको स्थिति टगल गर्दछन्। स्विचले नियन्त्रण गर्ने विकल्प र उक्त विकल्पको स्थितिसम्बन्धी जानकारी सम्बन्धित इनलाइन लेबलमा स्पष्ट रूपमा दिइनु पर्छ।
pa: ਸਵਿੱਚਾਂ ਨੂੰ ਚਾਲੂ/ਬੰਦ ਕਰਨ 'ਤੇ ਇਹ ਇਕਹਿਰੀ ਸੈਟਿੰਗਾਂ ਵਿਕਲਪ ਦੀ ਸਥਿਤੀ ਵਿਚਾਲੇ ਟੌਗਲ ਕਰਦੇ ਹਨ। ਉਹ ਵਿਕਲਪ ਜਿਸਨੂੰ ਸਵਿੱਚ ਕੰਟਰੋਲ ਕਰਦਾ ਹੈ, ਅਤੇ ਨਾਲ ਉਹ ਸਥਿਤੀ ਜਿਸ ਵਿੱਚ ਇਹ ਹੈ, ਉਸਨੂੰ ਸੰਬੰਧਿਤ ਇਨਲਾਈਨ ਲੇਬਲ ਨਾਲ ਕਲੀਅਰ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ।
pl: Przełączniki służą do włączania i wyłączania opcji w ustawieniach. Opcja związana z przełącznikiem oraz jej stan powinny być w jasny sposób opisane za pomocą etykiety tekstowej.
pt: A chave ativar/desativar alterna o estado de uma única opção das configurações. A opção controlada por ela e o estado em que ela está precisam ficar claros no marcador inline correspondente.
pt_pt: Os interruptores ativar/desativar alteram o estado de uma única opção de definições. A opção que o interruptor controla e o estado em que se encontra devem estar evidenciados na etiqueta inline correspondente.
ro: Comutatoarele activat / dezactivat schimbă starea unei opțiuni pentru setări. Opțiunea controlată de comutator și starea acesteia trebuie să fie indicate clar de eticheta inline corespunzătoare.
ru: С помощью переключателя пользователь может включать и отключать отдельный параметр. Рядом с переключателем должно быть ясно указано название и состояние параметра.
si: ක්‍රියාත්මක කිරීමේ/ක්‍රියාවිරහිත කිරීමේ ස්විච තනි සැකසීම් විකල්පයක තත්ත්වය ටොගල කරයි. ස්විච පාලන මෙන්ම, එය තිබෙන තත්ත්වය විකල්පය අනුරූප පේළිගත ලේබලයෙන් පැහැදිලි කළ යුතුය.
sk: Prepínače na zapnutie alebo vypnutie stavu jednej možnosti nastavení. Príslušná možnosť, ktorú prepínač ovláda, ako aj stav, v ktorom sa nachádza, by mali jasne vyplývať zo zodpovedajúceho vloženého štítka.
sq: Çelësat e ndezjes/fikjes aktivizojnë/çaktivizojnë gjendjen e një opsioni të vetëm cilësimesh. Opsioni që kontrollon çelësi, si edhe gjendja në të cilën është, duhet të bëhet e qartë nga etiketa korresponduese brenda faqes.
sr: Прекидачи за укључивање/искључивање мењају статус појединачних опција подешавања. На основу одговарајуће ознаке у тексту корисницима треба да буде јасно коју опцију прекидач контролише и који је њен статус.
sr_latn: Prekidači za uključivanje/isključivanje menjaju status pojedinačnih opcija podešavanja. Na osnovu odgovarajuće oznake u tekstu korisnicima treba da bude jasno koju opciju prekidač kontroliše i koji je njen status.
sv: På/av-reglage som används för att aktivera eller inaktivera en inställning. Det alternativ som reglaget styr samt det aktuella läget ska framgå av motsvarande infogade etikett.
te: సెట్టింగ్‌లలో ఒకే ఆప్షన్ ఉండే స్థితిని ఆన్/ఆఫ్ స్విచ్‌లు అనేవి టోగుల్ చేసి ఉంచుతాయి. స్విచ్ నియంత్రించే ఎంపికనూ, అలాగే అది ఏ స్థితిలో ఉందనే అంశాన్ని, దానికి సంబంధించిన ఇన్‌లైన్ లేబుల్‌లో స్పష్టంగా చూపించాలి.
th: สวิตช์เปิด/ปิดสลับสถานะของตัวเลือกการตั้งค่า 1 รายการ ตัวเลือกที่สวิตช์ควบคุมและสถานะของตัวเลือกควรแตกต่างอย่างชัดเจนจากป้ายกำกับในบรรทัดที่เกี่ยวข้อง
tr: Açık/kapalı anahtarları, tek bir ayarlar seçeneğinin durumunu açar veya kapatır. Anahtarın kontrol ettiği seçeneğin yanı sıra seçeneğin bulunduğu durum, karşılık gelen satır içi etikette açıkça belirtilmelidir.
uk: Перемикачі "Увімкнути/вимкнути" вмикають або вимикають окремі налаштування. Налаштування, яким керує перемикач, і його стан має бути чітко описано в тексті мітки.
ur: آن/آف سوئچز ترتیبات کے واحد اختیار کو ٹوگل کرتے ہیں۔ اختیار جسے سوئچ کنٹرول کرتا ہے اور ساتھ ہی اس میں موجود حالت متعلقہ ان لائن لیبل سے واضح کیا جانا چاہیے۔
uz: Almashtirgich tugmasi yordamida foydalanuvchilar biror sozlamani yoqishi yoki faolsizlantirishi mumkin. Almashtirgich yonida doim sozlama nomi va holati chiqadi.
vi: Nút chuyển bật/tắt chuyển đổi trạng thái của một tuỳ chọn cài đặt. Tuỳ chọn mà bảng điều khiển nút chuyển, cũng như trạng thái của tuỳ chọn đó, phải thể hiện rõ ràng bằng nhãn nội tuyến tương ứng.
zh_hk: 使用開關可切換個別設定選項的狀態。開關控制的選項及其狀態應以相應的內嵌標籤清晰標示。
zu: Amaswishi okuvula/ukuvala aguqula isimo senketho eyodwa yamasethingi. Inketho elawulwa iswishi kanye nesimo ekuyo, kumele kwenziwe kube sobala kusukela kulebula engaphakathi komugqa ehambisanayo.

# craneFly0SemanticLabel
source: Chalet in a snowy landscape with evergreen trees
af: Chalet in 'n sneeulandskap met immergroen bome
am: ሁሌ ለምለም ዛፎች ባሉት በረዷሟ መሬት ላይ ያለ ሻሌት ቤት
ar_eg: شاليه في مساحة طبيعية من الثلوج وبها أشجار دائمة الخضرة
as: চিৰসেউজ উদ্ভিদৰ এক বৰফাবৃত প্ৰাকৃতিক দৃশ্যৰ সৈতে শ্ব্যালেই
az: Həmişəyaşıl ağaclar olan qarlı yerdə ağacdan ev
be: Заснежаны краявід з сельскім домікам і вечназялёнымі дрэвамі
bn: চিরসবুজ গাছ সহ একটি তুষারময় আড়াআড়ি কুটীর
bs: Planinska kućica u snježnom krajoliku sa zimzelenim drvećem
ca: Xalet en un paisatge nevat amb arbres de fulla perenne
da: Hytte i et snelandskab med stedsegrønne træer
es_ar: Chalé en un paisaje nevado con árboles de hoja perenne
et: Mägimajake lumisel maastikul koos igihaljaste puudega
eu: Txalet bat zuhaitz hostoiraunkorreko paisaia elurtuan
fa: کلبه‌ای در منظره برفی با درختان همیشه‌سبز
fil: Chalet sa isang maniyebeng tanawing may mga evergreen na puno
fr_ca: Chalet dans un paysage enneigé et entouré de conifères
gl: Chalé nunha paisaxe nevada con árbores de folla perenne
gu: સદાબહાર ઝાડવાળા બર્ફીલા લૅન્ડસ્કેપમાં ચેલેટ
he: בקתה בנוף מושלג עם עצים ירוקי-עד
hi: सदाबहार पेड़ों के बीच बर्फ़ीले लैंडस्केप में बना शैले
hu: Faház havas tájon, örökzöld fák között
hy: Շալե՝ փշատերև ծառերով ձյունե լանդշաֆտի ֆոնի վրա
id: Chalet di lanskap bersalju dengan pepohonan hijau
it: Chalet in un paesaggio innevato con alberi sempreverdi
ja: 常緑樹の雪景色の中にあるシャレー
ka: შალე თოვლიან ლანდშაფტზე მარადმწვანე ხეებით
km: ផ្ទះឈើ​នៅលើភ្នំ​ដែលស្ថិត​នៅក្នុង​ទេសភាព​មានព្រិលធ្លាក់​ជាមួយនឹង​ដើមឈើ​ដែលមាន​ស្លឹក​ពេញមួយឆ្នាំ
kn: ನಿತ್ಯಹರಿದ್ವರ್ಣ ಮರಗಳು ಮತ್ತು ಹಿಮದ ಮೇಲ್ಮೈ ಅಲ್ಲಿರುವ ಚಾಲೆಟ್
ko: 상록수가 있는 설경 속 샬레
ky: Карга жамынган жашыл дарактардын арасындагы шале
lo: ກະຕູບຫຼັງນ້ອຍຢູ່ກາງທິວທັດທີ່ມີຫິມະ ແລະ ຕົ້ນໄມ້ຂຽວ
lt: Trobelė sniegynuose su visžaliais medžiais
lv: Kotedža sniegotā ainavā ar mūžzaļiem kokiem
mk: Вила во снежен пејзаж со зимзелени дрва
ml: മഞ്ഞ് പെയ്യുന്ന നിത്യഹരിത മരങ്ങളുള്ള പ്രദേശത്തെ ഉല്ലാസ കേന്ദ്രം
mn: Мөнх ногоон модтой, цастай байгаль дахь модон байшин
mr: सदाहरित झाडे असलेल्या बर्फाळ प्रदेशातील शॅले
ms: Chalet dalam lanskap bersalji dengan pokok malar hijau
my: အမြဲစိမ်းသစ်ပင်များဖြင့် နှင်းကျသော ရှုခင်းတစ်ခုရှိ တောင်ပေါ်သစ်သားအိမ်
nb: Fjellhytte i snølandskap med grantrær
ne: सदाबहार रूखहरू भएको र साथै हिउँ परेको ल्यान्डस्केपमा सानो कुटी
pa: ਸਦਾਬਹਾਰ ਦਰੱਖਤਾਂ ਨਾਲ ਬਰਫ਼ੀਲੇ ਲੈਂਡਸਕੇਪ ਵਿੱਚ ਲੱਕੜ ਦਾ ਘਰ
pl: Zimowa chatka wśród zielonych drzew
pt: Chalé em uma paisagem com neve e árvores perenes
pt_pt: Chalé numa paisagem com árvores de folha perene e neve
ro: Castel într-un peisaj de iarnă, cu conifere
ru: Шале на фоне заснеженного пейзажа с хвойными деревьями
si: සදාහරිත ගස් සහිත මීදුම සහිත භූමිභාගයක ඇති පැල
sk: Chata v zasneženej krajine s ihličnatými stromami
sq: Shtëpi alpine në një peizazh me borë me pemë të gjelbëruara
sr: Планинска колиба у снежном пејзажу са зимзеленим дрвећем
sr_latn: Planinska koliba u snežnom pejzažu sa zimzelenim drvećem
sv: Fjällstuga i ett snötäckt landskap med granar
te: సతత హరిత వృక్షాలు, మంచుతో కూడిన ల్యాండ్‌స్కేప్‌లో చాలెట్
th: กระท่อมหลังเล็กท่ามกลางทิวทัศน์ที่มีหิมะและต้นไม้เขียวชอุ่ม
tr: Yaprak dökmeyen ağaçların bulunduğu karla kaplı bir arazideki şale
uk: Шале на сніжному тлі в оточенні хвойних дерев
ur: سدا بہار پہاڑوں کے بیچ برفیلے لینڈ اسکیپ میں چالیٹ
uz: Qishloqdagi qorli yam-yashil daraxtlar bagʻridagi uy
vi: Căn nhà gỗ trong khung cảnh đầy tuyết với cây thường xanh xung quanh
zh_hk: 雪地中的小木屋和長青樹
zu: I-chalet yokwakheka kwezwe eneqhwa enezihlahla ezihlala ziluhlaza

# craneFly1SemanticLabel
source: Tent in a field
af: Tent in 'n veld
am: በአንድ ሜዳ ላይ ድንኳን
ar_eg: خيمة في حقل
as: পথাৰত থকা তম্বু
az: Sahədə çadır
be: Палатка ў полі
bn: ফিল্ডে টেন্ট
bs: Šator u polju
ca: Tenda de campanya al camp
da: Telt på en mark
es_ar: Tienda en un campo
et: Telk väljal
eu: Denda bat zelai batean
fa: چادری در مزرعه
fil: Tent sa isang parang
fr_ca: Tente dans un champ
gl: Tenda de campaña nun campo
gu: ફીલ્ડમાં તંબુ
he: אוהל בשדה
hi: मैदान में टेंट
hu: Sátor egy mezőn
hy: Վրան դաշտում
id: Tenda di lapangan
it: Tenda in un campo
ja: 野に張られたテント
ka: კარავი ველზე
km: តង់​នៅវាល
kn: ಮೈದಾನದಲ್ಲಿ ಹಾಕಿರುವ ಟೆಂಟ್
ko: 들판의 텐트
ky: Талаадагы чатыр
lo: ເຕັ້ນພັກແຮມໃນທົ່ງ
lt: Palapinė lauke
lv: Telts laukā
mk: Шатор на поле
ml: ഫീൽഡിലെ ടെന്റ്
mn: Талбай дээрх майхан
mr: माळरानावरचा टेंट
ms: Khemah di padang
my: လယ်ကွင်းတစ်ခုရှိတဲ
nb: Telt i en mark
ne: मैदानमा लगाइएको टेन्ट
pa: ਕਿਸੇ ਮੈਦਾਨ ਵਿੱਚ ਟੈਂਟ
pl: Namiot w polu
pt: Barraca em um campo
pt_pt: Tenda num campo
ro: Cort pe un câmp
ru: Палатка в поле
si: පිට්ටනියක ඇති කුඩාරම
sk: Stan na poli
sq: Tendë në fushë
sr: Шатор у пољу
sr_latn: Šator u polju
sv: Tält på ett fält
te: మైదానంలో గుడారం
th: เต็นท์ในทุ่ง
tr: Bir arazideki çadır
uk: Намет у полі
ur: میدان میں ٹینٹ
uz: Daladagi chodir
vi: Chiếc lều giữa cánh đồng
zh_hk: 田野中的帳篷
zu: Itende kunkambu

# craneFly2SemanticLabel
source: Prayer flags in front of snowy mountain
af: Gebedsvlae voor 'n sneeubedekte berg
am: ከበረዷማ ተራራ ፊት ያሉ የጸሎት ባንዲራዎች
ar_eg: رايات صلاة أمام جبل ثلجي
as: বৰফেৰে আৱৰা পৰ্বতৰ সন্মুখত প্ৰাৰ্থনাৰ পতাকা
az: Qarlı dağın qarşısında dua bayraqları
be: Малітвеныя флажкі на фоне заснежанай гары
bn: বরফের পাহাড়ের সামনে প্রার্থনার পতাকা
bs: Molitvene zastave ispred snijegom prekrivene planine
ca: Banderes de pregària amb una muntanya nevada en segon pla
da: Bedeflag foran snebeklædt bjerg
es_ar: Banderas de plegaria frente a una montaña nevada
et: Palvelipud ja lumine mägi
eu: Tibetar banderatxoak mendi elurtuen parean
fa: پرچم‌های دعا درمقابل کوهستان برفی
fil: Mga prayer flag sa harap ng maniyebeng bundok
fr_ca: Drapeaux de prières devant une montagne enneigée
gl: Bandeiras de pregaria fronte a unha montaña nevada
gu: બર્ફીલા પર્વતની આગળ પ્રાર્થના માટે લગાવેલા ધ્વજ
he: דגלי תפילה טיבטיים על רקע הר מושלג
hi: बर्फ़ीले पहाड़ के सामने लगे प्रार्थना के लिए इस्तेमाल होने वाले झंडे
hu: Imazászlók egy havas hegy előtt
hy: Աղոթքի դրոշներ՝ ձյունապատ լեռների ֆոնի վրա
id: Bendera doa menghadap gunung bersalju
it: Bandiere di preghiera di fronte a una montagna innevata
ja: 後ろに雪山が広がる祈祷旗
ka: სალოცავი ალმები თოვლიანი მთის ფონზე
km: ទង់ដែលមាន​សរសេរការបន់ស្រន់​នៅពីមុខ​ភ្នំដែល​មានព្រិលធ្លាក់
kn: ಹಿಮ ಪರ್ವತಗಳ ಮುಂದಿನ ಪ್ರಾರ್ಥನೆ ಧ್ವಜಗಳು
ko: 눈이 내린 산 앞에 있는 티베트 기도 깃발
ky: Кар жамынган тоонун алдындагы сыйынуу желектери
lo: ທຸງມົນຕາໜ້າພູທີ່ປົກຄຸມດ້ວຍຫິມະ
lt: Maldos vėliavėlės apsnigto kalno fone
lv: Lūgšanu karodziņi uz sniegota kalna fona
mk: Молитвени знамиња пред снежна планина
ml: മഞ്ഞ് പെയ്യുന്ന മലനിരകൾക്ക് മുന്നിലെ പ്രാർഥനാ ഫ്ലാഗുകൾ
mn: Цастай уулын урдах залбирлын тугууд
mr: बर्फाळ डोंगरासमोरील प्रेअर फ्लॅग
ms: Bendera doa di hadapan gunung bersalji
my: နှင်းတောင်ရှေ့ရှိ ဆုတောင်းအလံများ
nb: Bønneflagg foran et snødekket fjell
ne: हिउँ परेको पहाडको अघिल्तिर प्रार्थनाका लागि गाडिएका झण्डाहरू
pa: ਬਰਫ਼ੀਲੇ ਪਹਾੜਾਂ ਅੱਗੇ ਪ੍ਰਾਰਥਨਾ ਦੇ ਝੰਡੇ
pl: Flagi modlitewne na tle zaśnieżonej góry
pt: Bandeiras de oração em frente a montanhas com neve
pt_pt: Bandeiras de oração em frente a uma montanha com neve
ro: Steaguri de rugăciune în fața unui munte înzăpezit
ru: Молитвенные флаги на фоне заснеженной горы
si: හිම කන්දක ඉදිරිපස ඇති යාච්ඤා කොඩි
sk: Modlitebné vlajky so zasneženou horou v pozadí
sq: Flamuj lutjesh përpara një mali me borë
sr: Молитвене заставице испред снегом прекривене планине
sr_latn: Molitvene zastavice ispred snegom prekrivene planine
sv: Böneflaggor framför snötäckt berg
te: మంచు పర్వతం ముందు ప్రార్థనా పతాకాలు
th: ธงมนตราหน้าภูเขาที่ปกคลุมด้วยหิมะ
tr: Karlı dağ önünde dua bayrakları
uk: Молитовні прапори на тлі сніжних гір
ur: برفیلے پہاڑ کے سامنے دعا کے جھنڈے
uz: Qorli togʻ bagʻridagi ibodat bayroqlari
vi: Những lá cờ cầu nguyện phía trước ngọn núi đầy tuyết
zh_hk: 雪山前的經幡
zu: Amafulegi omthandazo angaphambi kwentaba eneqhwa

# craneFly6SemanticLabel
source: Aerial view of Palacio de Bellas Artes
af: Lugaansig van Palacio de Bellas Artes
am: የፓላሲዮ ደ ቤያ አርቴስ የአየር ላይ እይታ
ar_eg: عرض "قصر الفنون الجميلة" من الجوّ
as: পালাচিও ড্য বেলাছ আৰ্টেছৰ আকাশী দৃশ্য
az: İncəsənət Sarayının yuxarıdan görünüşü
be: Від зверху на Палац вытанчаных мастацтваў
bn: প্যালাসিও দে বেলারাস আর্টেসের এরিয়াল ভিউ
bs: Pogled iz zraka na Palacio de Bellas Artes
ca: Vista aèria del Palau de Belles Arts
da: Palacio de Bellas Artes set fra luften
es_ar: Vista aérea del Palacio de Bellas Artes
et: Aerofoto Palacio de Bellas Artesist
eu: Arte Ederren jauregiaren aireko ikuspegia
fa: نمای هوایی کاخ هنرهای زیبا
fil: Tanawin mula sa himpapawid ng Palacio de Bellas Artes
fr_ca: Vue aérienne du Palais des beaux-arts de Mexico
gl: Vista aérea do Palacio de Belas Artes
gu: પેલેસિઓ ડી બેલાસ આર્ટસનું ઉપરથી દેખાતું દૃશ્ય
he: נוף ממבט אווירי של ארמון האומנויות היפות
hi: पैलासियो दे बेलास आर्तिस की ऊपर से ली गई इमेज
hu: Légi felvétel a Szépművészeti Palotáról
hy: Օդից տեսարան դեպի Գեղարվեստի պալատ
id: Pemandangan udara Palacio de Bellas Artes
it: Veduta aerea del Palacio de Bellas Artes
ja: ペジャス アルテス宮殿の空撮映像
ka: ნატიფი ხელოვნების სასახლის ზედხედი
km: ទិដ្ឋភាពនៃ Palacio de Bellas Artes ពីលើ​អាកាស
kn: Palacio de Bellas Artes ನ ವೈಮಾನಿಕ ನೋಟ
ko: 팔라시꾸 공연장 항공 사진
ky: Көркөм өнөр сарайынын бийиктиктен көрүнүшү
lo: ພາບຖ່າຍທາງອາກາດຂອງພະລາດຊະວັງ Palacio de Bellas Artes
lt: Meksiko vaizduojamojo meno rūmų vaizdas iš viršaus
lv: Skats no putna lidojuma uz Dekoratīvās mākslas pili
mk: Поглед одозгора на Палатата на ликовни уметности
ml: പലാസിയോ ഡീ ബെല്ലാസ് അർട്ടെസിന്റെ ആകാശ കാഴ്‌ച
mn: Palacio de Bellas Artes-н агаараас харагдах байдал
mr: पलासिओ दे बेयास आर्तेसचे विहंगम दृश्य
ms: Pemandangan udara Palacio de Bellas Artes
my: Palacio de Bellas Artes ၏ အပေါ်မှမြင်ကွင်း
nb: Flyfoto av Palacio de Bellas Artes
ne: Palacio de Bellas Artes को हवाई दृश्य
pa: ਪਲੈਸੀਓ ਦੇ ਬੇਲਾਸ ਆਰਤੇਸ ਦਾ ਹਵਾਈ ਦ੍ਰਿਸ਼
pl: Palacio de Bellas Artes z lotu ptaka
pt: Vista aérea do Palácio de Bellas Artes
pt_pt: Vista aérea do Palacio de Bellas Artes
ro: Imagine aeriană cu Palacio de Bellas Artes
ru: Вид с воздуха на Дворец изящных искусств
si: Palacio de Bellas Artes හි ගුවන් දසුන
sk: Letecký pohľad na palác Palacio de Bellas Artes
sq: Pamje nga ajri e Palacio de Bellas Artes
sr: Поглед на Палату лепих уметности из ваздуха
sr_latn: Pogled na Palatu lepih umetnosti iz vazduha
sv: Flygbild av Palacio de Bellas Artes
te: ఆకాశంలో నుంచి కనిపించే 'పలాసియో డి బెల్లాస్ ఆర్టెస్'
th: มุมมองทางอากาศของพระราชวัง Bellas Artes
tr: Güzel Sanatlar Sarayı'nın havadan görünüşü
uk: Загальний вигляд Палацу образотворчих мистецтв
ur: پلاسیو دا بلاس آرٹس کے محل کا فضائی نظارہ
uz: Nafis saʼnat saroyining osmondan koʻrinishi
vi: Quang cảnh Palacio de Bellas Artes nhìn từ trên không
zh_hk: 俯瞰墨西哥藝術宮
zu: Ukubuka okuphezulu kwe-Palacio de Bellas Artes
