Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# chipTurnOnLights
source: Turn on lights
af: Skakel ligte aan
am: መብራቶቹን አብራ
ar_eg: تشغيل الأضواء
as: লাইটসমূহ অন কৰক
az: İşıqları yandırın
be: Уключыць святло
bn: লাইট চালু করুন
bs: Uključivanje svjetla
ca: Encén els llums
da: Tænd lyset
es_ar: Encender luces
et: Lülita tuled sisse
eu: Piztu argiak
fa: روشن کردن چراغ‌ها
fil: I-on ang mga ilaw
fr_ca: Allumer les lumières
gl: Activar luces
gu: લાઇટ ચાલુ કરો
he: הדלקת התאורה
hi: लाइट चालू करें
hu: Világítás bekapcsolása
hy: Միացնել լույսերը
id: Nyalakan lampu
it: Accendi le luci
ja: ライトをオンにする
ka: შუქის ჩართვა
km: បើក​ភ្លើង
kn: ಲೈಟ್‌ಗಳನ್ನು ಆನ್ ಮಾಡಿ
ko: 조명 켜기
ky: Жарыкты күйгүзүү
lo: ເປີດໄຟ
lt: Įjungti šviesą
lv: Ieslēgt apgaismojumu
mk: Вклучете ги светлата
ml: ലൈറ്റുകൾ ഓണാക്കുക
mn: Гэрэл асаах
mr: लाइट सुरू करा
ms: Hidupkan lampu
my: မီးဖွင့်ရန်
nb: Slå på lyset
ne: बत्तीहरू बाल्नुहोस्
pa: ਲਾਈਟਾਂ ਚਾਲੂ ਕਰੋ
pl: Włącz światła
pt: Acender as luzes
pt_pt: Acender as luzes
ro: Porniți luminile
ru: Включить индикаторы
si: ආලෝකය ක්‍රියාත්මක කරන්න
sk: Zapnúť svetlá
sq: Ndiz dritat
sr: Укључи светла
sr_latn: Uključi svetla
sv: Tänd lamporna
te: లైట్‌లను ఆన్ చేయండి
th: เปิดไฟ
tr: Işıkları aç
uk: Увімкнути світло
ur: لائٹس آن کریں
uz: Chiroqlarni yoqish
vi: Bật đèn
zh_hk: 開燈
zu: Vala amalambu

# chipSmall
source: Small
af: Klein
am: ትንሽ
ar_eg: صغير
as: সৰু
az: Kiçik
be: Малы
bn: ছোট
bs: Malo
ca: Petita
da: Lille
es_ar: Pequeño
et: Väike
eu: Txikia
fa: کوچک
fil: Maliit
fr_ca: Petit
gl: Pequeno
gu: નાનું
he: קטן
hi: छोटा
hu: Kicsi
hy: Փոքր
id: Kecil
it: Piccole
ja: 小
ka: პატარა
km: តូច
kn: ಸಣ್ಣದು
ko: 작게
ky: Кичине
lo: ນ້ອຍ
lt: Mažas
lv: S izmērs
mk: Мал
ml: ചെറുത്
mn: Жижиг
mr: लहान
ms: Kecil
my: သေး
nb: Liten
ne: सानो
pa: ਛੋਟਾ
pl: Małe
pt: Pequeno
pt_pt: Pequeno
ro: Mic
ru: Маленький
si: කුඩා
sk: Malé
sq: I vogël
sr: Мала
sr_latn: Mala
sv: Liten
te: చిన్నది
th: ขนาดเล็ก
tr: Küçük
uk: Малий
ur: چھوٹا
uz: Kichik
vi: Nhỏ
zh_hk: 小
zu: Okuncane

# chipMedium
source: Medium
af: Middelgroot
am: መካከለኛ
ar_eg: متوسط
as: মধ্যমীয়া
az: Orta
be: Сярэдні
bn: মাজারি
bs: Srednje
ca: Mitjana
da: Mellem
es_ar: Mediano
et: Keskmine
eu: Ertaina
fa: متوسط
fil: Katamtaman
fr_ca: Moyen
gl: Mediano
gu: મધ્યમ
he: בינוני
hi: मध्यम
hu: Közepes
hy: Միջին
id: Sedang
it: Medie
ja: 中
ka: საშუალო
km: មធ្យម
kn: ಮಧ್ಯಮ
ko: 보통
ky: Орточо
lo: ປານກາງ
lt: Vidutinis
lv: M izmērs
mk: Среден
ml: ഇടത്തരം
mn: Дундaж
mr: मध्यम
ms: Sederhana
my: အလယ်အလတ်
nb: Middels
ne: मध्यम
pa: ਦਰਮਿਆਨਾ
pl: Średnie
pt: Médio
pt_pt: Médio
ro: Mediu
ru: Средний
si: මධ්‍යම
sk: Stredné
sq: Mesatar
sr: Средња
sr_latn: Srednja
sv: Medel
te: మధ్యస్థం
th: ขนาดกลาง
tr: Orta
uk: Середній
ur: متوسط
uz: Oʻrtacha
vi: Trung bình
zh_hk: 中
zu: Maphakathi

# chipLarge
source: Large
af: Groot
am: ትልቅ
ar_eg: كبير
as: ডাঙৰ
az: Böyük
be: Вялікі
bn: বড়
bs: Veliko
ca: Gran
da: Stor
es_ar: Grande
et: Suur
eu: Handia
fa: بزرگ
fil: Malaki
fr_ca: Grand
gl: Grande
gu: મોટું
he: גדול
hi: बड़ा
hu: Nagy
hy: Մեծ
id: Besar
it: Grandi
ja: 大
ka: დიდი
km: ធំ
kn: ದೊಡ್ಡದು
ko: 크게
ky: Чоң
lo: ໃຫຍ່
lt: Didelis
lv: L izmērs
mk: Голем
ml: വലുത്
mn: Том
mr: मोठे
ms: Besar
my: ကြီး
nb: Stor
ne: ठुलो
pa: ਵੱਡਾ
pl: Duże
pt: Grande
pt_pt: Grande
ro: Mare
ru: Большой
si: විශාල
sk: Veľké
sq: I madh
sr: Велика
sr_latn: Velika
sv: Stor
te: పెద్దది
th: ขนาดใหญ่
tr: Büyük
uk: Великий
ur: بڑا
uz: Katta
vi: Lớn
zh_hk: 大
zu: Okukhulu

# chipElevator
source: Elevator
af: Hysbak
am: ሊፍት
ar_eg: مصعَد
as: এলিভে'টৰ
az: Lift
be: Ліфт
bn: লিফ্ট
bs: Lift
ca: Ascensor
es_ar: Ascensor
et: Lift
eu: Igogailua
fa: آسانسور
fr_ca: Ascenseur
gl: Ascensor
gu: એલિવેટર
he: מעלית
hi: एलिवेटर
hu: Lift
hy: Վերելակ
it: Ascensore
ja: エレベーター
ka: ლიფტი
km: ជណ្ដើរ​យន្ត
kn: ಎಲಿವೇಟರ್
ko: 엘리베이터
ky: Лифт
lo: ລິບ
lt: Liftas
lv: Lifts
mk: Лифт
ml: എലിവേറ്റർ
mn: Цахилгаан шат
mr: लिफ्ट
ms: Lif
my: စက်လှေကား
nb: Heis
ne: लिफ्ट
pa: ਲਿਫ਼ਟ
pl: Winda
pt: Elevador
pt_pt: Elevador
ro: Lift
ru: Лифт
si: විදුලි සෝපානය
sk: Výťah
sq: Ashensor
sr: Лифт
sr_latn: Lift
sv: Hiss
te: ఎలివేటర్
th: ลิฟต์
tr: Asansör
uk: Ліфт
ur: مستول
uz: Lift
vi: Thang máy
zh_hk: 電梯
zu: Ilifthi

# chipWasher
source: Washer
af: Wasmasjien
am: ማጠቢያ ማሽን
ar_eg: غسّالة
as: ৱাশ্বাৰ
az: Paltaryuyan
be: Пральная машына
bn: ওয়াশিং মেশিন
bs: Veš mašina
ca: Rentadora
da: Vaskemaskine
es_ar: Lavadora
et: Pesumasin
eu: Garbigailua
fa: دستگاه شوینده
fr_ca: Laveuse
gl: Lavadora
gu: વૉશર
he: מכונת כביסה
hi: वॉशिंग मशीन
hu: Mosógép
hy: Լվացքի մեքենա
id: Mesin cuci
it: Lavatrice
ja: 洗濯機
ka: სარეცხი მანქანა
km: ម៉ាស៊ីន​បោកគក់
kn: ವಾಷರ್
ko: 세탁기
ky: Жуугуч
lo: ຈັກຊັກເຄື່ອງ
lt: Skalbyklė
lv: Veļas mazgājamā mašīna
mk: Машина за перење алишта
ml: വാഷർ
mn: Угаалгын машин
mr: वॉशर
ms: Mesin basuh
my: အဝတ်လျှော်စက်
nb: Vaskemaskin
ne: लुगा धुने मेसिन
pa: ਕੱਪੜੇ ਧੋਣ ਵਾਲੀ ਮਸ਼ੀਨ
pl: Pralka
pt: Máquina de lavar roupas
pt_pt: Máquina de lavar
ro: Mașină de spălat
ru: Стиральная машина
si: රෙදි සෝදන යන්ත්‍රය
sk: Práčka
sq: Lavatriçe
sr: Машина за прање веша
sr_latn: Mašina za pranje veša
sv: Tvättmaskin
te: వాషర్
th: เครื่องซักผ้า
tr: Çamaşır makinesi
uk: Пральна машина
ur: کپڑے دھونے والی مشین
uz: Kir yuvish mashinasi
vi: Máy giặt
zh_hk: 洗衣機
zu: Kokuwasha

# chipFireplace
source: Fireplace
af: Kaggel
am: የእሳት ቦታ
ar_eg: موقد
as: জুহাল আছে
az: Buxarı
be: Камін
bn: ফায়ারপ্লেস
bs: Kamin
ca: Llar de foc
da: Pejs
es_ar: Chimenea
et: Kamin
eu: Tximinia
fa: شومینه
fr_ca: Foyer
gl: Cheminea
gu: ફાયરપ્લેસ
he: קמין
hi: फ़ायरप्लेस
hu: Kandalló
hy: Բուխարի
id: Perapian
it: Caminetto
ja: 暖炉
ka: ბუხარი
km: ជើងក្រាន​កម្ដៅ​បន្ទប់
kn: ಫೈರ್‌ಪ್ಲೇಸ್
ko: 벽난로
ky: Камин
lo: ເຕົາຜິງໄຟ
lt: Židinys
lv: Kamīns
mk: Камин
ml: നെരിപ്പോട്
mn: Ил зуух
mr: फायरप्लेस
ms: Pendiang
my: မီးလင်းဖို
nb: Peis
ne: चुल्हो
pa: ਚੁੱਲ੍ਹਾ
pl: Kominek
pt: Lareira
pt_pt: Lareira
ro: Șemineu
ru: Камин
si: ගිනි උඳුන
sk: Krb
sq: Oxhak
sr: Камин
sr_latn: Kamin
sv: Eldstad
te: పొయ్యి
th: เตาผิง
tr: Şömine
uk: Камін
ur: آتش دان
uz: Kamin
vi: Lò sưởi
zh_hk: 壁爐
zu: Iziko

# chipBiking
source: Biking
af: Fietsry
am: ቢስክሌት መንዳት
ar_eg: ركوب الدراجة
as: বাইকিং
az: Velosiped
be: Язда на веласіпедзе
bn: সাইকেল চালানো
bs: Vožnja bicikla
ca: Ciclisme
da: Cykling
es_ar: Bicicletas
et: Jalgrattasõit
eu: Bizikletan
fa: دوچرخه‌سواری
fil: Pagbibisikleta
fr_ca: Vélo
gl: En bici
gu: બાઇકિંગ
he: רכיבת אופניים
hi: बाइकिंग
hu: Kerékpározás
hy: Հեծանվավարություն
id: Bersepeda
it: Ciclismo
ja: 自転車
ka: ველოსიპედით სეირნობა
km: ការ​ជិះ​កង់
kn: ಬೈಕಿಂಗ್
ko: 자전거 타기
ky: Велосипед тебүү
lo: ຖີບລົດ
lt: Važinėjimas dviračiu
lv: Riteņbraukšana
mk: Возење велосипед
ml: ബൈക്കിംഗ്
mn: Дугуй унах
mr: सायकल चालवणे
ms: Berbasikal
my: စက်ဘီးစီးခြင်း
nb: Sykling
ne: बाइक कुदाउने
pa: ਬਾਈਕਿੰਗ
pl: Jazda na rowerze
pt: Bicicleta
pt_pt: Ciclismo
ro: Ciclism
ru: Велосипед
si: බයිසිකල් පැදීම
sk: Cyklistika
sq: Me biçikletë
sr: Вожња бицикла
sr_latn: Vožnja bicikla
sv: Cykling
te: బైకింగ్
th: ขี่จักรยาน
tr: Bisiklet
uk: Велоспорт
ur: بائیکنگ
uz: Velosipedda
vi: Đạp xe
zh_hk: 踏單車
zu: Ukuhamba ngamabhayisikili

# craneFormDiners
source: Diners
af: Eetplekke
am: መመገቢያዎች
ar_eg: مطاعم صغيرة
as: নৈশ আহাৰ
az: Restoranlar
be: Закусачныя
bn: ডাইনার্স
bs: Mali restorani
ca: Comensals
da: Spisende
es_ar: Restaurantes
et: Sööklad
eu: Mahaikideak
fa: غذاخوری‌ها
fil: Mga Diner
fr_ca: Personnes
gl: Restaurantes
gu: ડાઇનર
he: דיינרים
hi: रेस्टोरेंट
hu: Falatozók
hy: Խորտկարաններ
id: Makan Malam
it: Clienti
ja: 食堂数
ka: სასასდილოები
km: អ្នក​ទទួលទាន​អាហារ​ពេលល្ងាច
kn: ಡೈನರ್ಸ್
ko: 식당
ky: Коноктор
lo: ຮ້ານອາຫານ
lt: Užkandinės
lv: Ēstuves
mk: Ресторани во американски стил
ml: ഡൈനറുകൾ
mn: Зоог барих хүний тоо
mr: खाण्याचे प्रकार
ms: Kedai makan
my: စားသောက်ဆိုင်များ
nb: Restaurantgjester
ne: घुम्ती होटेलहरू
pa: ਖਾਣ-ਪੀਣ
pl: Stołówki
pt: Lanchonetes
pt_pt: Pessoas
ro: Clienți
ru: Закусочные
si: ආහාර ගන්නන්
sk: Reštaurácie
sq: Restorante
sr: Експрес ресторани
sr_latn: Ekspres restorani
sv: Gäster
te: డైనర్స్
th: ร้านอาหาร
tr: Lokanta sayısı
uk: Закусочні
ur: ڈائنرز
uz: Tamaddixonalar
vi: Số thực khách
zh_hk: 用餐人數
zu: I-Diners

# rallyAlertsMessageUnassignedTransactions
source: {count, plural, =1{Increase your potential tax deduction! Assign categories to 1 unassigned transaction.}other{Increase your potential tax deduction! Assign categories to {count} unassigned transactions.}}
af: {count,plural,=1{Verhoog jou potensiële belastingaftrekking! Wys kategorieë toe aan 1 ontoegewysde transaksie.}other{Verhoog jou potensiële belastingaftrekking! Wys kategorieë toe aan {count} ontoegewysde transaksies.}}
am: {count,plural,=1{የእርስዎን ሊቀነስ የሚችል ግብር ይጨምሩ! ወደ 1 ያልተመደበ ግብይት ምድቦችን ይመድቡ።}other{የእርስዎን ሊቀነስ የሚችል ግብር ይጨምሩ! ወደ {count} ያልተመደቡ ግብይቶች ምድቦችን ይመድቡ።}}
ar_eg: {count,plural,=1{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على معاملة واحدة لم يتم ضبطها.}zero{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على {count} معاملة لم يتم ضبطها.}two{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على معاملتين ({count}) لم يتم ضبطهما.}few{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على {count} معاملات لم يتم ضبطها.}many{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على {count} معاملة لم يتم ضبطها.}other{يمكنك زيادة خصم الضرائب المحتملة. ضبط الفئات على {count} معاملة لم يتم ضبطها.}}
as: {count,plural,=1{আপোনাৰ সম্ভাব্য কৰ কটাৰ পৰিমাণ বৃদ্ধি কৰক! ১ টা আবণ্টন নকৰা লেনদেনত শিতানসমূহ আবণ্টন কৰক।}other{আপোনাৰ সম্ভাব্য কৰ কটাৰ পৰিমাণ বৃদ্ধি কৰক! {count} টা আবণ্টন নকৰা লেনদেনত শিতানসমূহ আবণ্টন কৰক।}}
az: {count,plural,=1{Potensial vergi ödənişini artırın! 1 təyin edilməmiş əməliyyata kateqoriya təyin edin.}other{Potensial vergi ödənişini artırın! {count} təyin edilməmiş əməliyyata kateqoriya təyin edin.}}
be: {count,plural,=1{Павялічце свой патэнцыяльны падатковы вылік! Прызначце катэгорыі для 1 непрызначанай трансакцыі.}few{Павялічце свой патэнцыяльны падатковы вылік! Прызначце катэгорыі для {count} непрызначаных трансакцый.}many{Павялічце свой патэнцыяльны падатковы вылік! Прызначце катэгорыі для {count} непрызначаных трансакцый.}other{Павялічце свой патэнцыяльны падатковы вылік! Прызначце катэгорыі для {count} непрызначаных трансакцый.}}
bn: {count,plural,=1{আপনার ট্যাক্সের সম্ভাব্য ছাড় বাড়ান! ১টি অ্যাসাইন না করা ট্রানজ্যাকশনে বিভাগ অ্যাসাইন করুন।}other{আপনার ট্যাক্সের সম্ভাব্য ছাড় বাড়ান! {count}টি অ্যাসাইন না করা ট্রানজ্যাকশনে বিভাগ অ্যাসাইন করুন।}}
bs: {count,plural,=1{Povećajte potencijalne porezne olakšice! Dodijelite kategorije za 1 nedodijeljenu transakciju.}few{Povećajte potencijalne porezne olakšice! Dodijelite kategorije za {count} nedodijeljene transakcije.}other{Povećajte potencijalne porezne olakšice! Dodijelite kategorije za {count} nedodijeljenih transakcija.}}
ca: {count,plural,=1{Augmenta la teva possible deducció fiscal. Assigna categories a 1 transacció sense assignar.}other{Augmenta la teva possible deducció fiscal. Assigna categories a {count} transaccions sense assignar.}}
da: {count,plural,=1{Hæv dit potentielle skattefradrag. Tildel kategorier til 1 transaktion, som ingen har.}other{Hæv dit potentielle skattefradrag. Tildel kategorier til {count} transaktioner, som ingen har.}}
es_ar: {count,plural,=1{Aumenta tu potencial de deducción de impuestos. Asigna categorías a 1 transacción sin asignar.}other{Aumenta tu potencial de deducción de impuestos. Asigna categorías a {count} transacciones sin asignar.}}
et: {count,plural,=1{Suurendage oma potentsiaalset maksuvabastust! Määrake kategooriad 1 määramata tehingule.}other{Suurendage oma potentsiaalset maksuvabastust! Määrake kategooriad {count} määramata tehingule.}}
eu: {count,plural,=1{Zerga-kenkari potentzial handiagoa! Esleitu kategoriak esleitu gabeko transakzio bati.}other{Zerga-kenkari potentzial handiagoa! Esleitu kategoriak esleitu gabeko {count} transakziori.}}
fa: {count,plural,=1{کاهش مالیات احتمالی را افزایش دهید! دسته‌ها را به ۱ تراکنش اختصاص‌داده‌نشده اختصاص دهید.}other{کاهش مالیات احتمالی را افزایش دهید! دسته‌ها را به {count} تراکنش اختصاص‌داده‌نشده اختصاص دهید.}}
fil: {count,plural,=1{Lakihan ang puwedeng mabawas sa iyong buwis! Magtalaga ng mga kategorya sa 1 transaksyong hindi nakatalaga.}other{Lakihan ang puwedeng mabawas sa iyong buwis! Magtalaga ng mga kategorya sa {count} na transaksyong hindi nakatalaga.}}
fr_ca: {count,plural,=1{Augmentez vos déductions fiscales potentielles! Attribuez des catégories à 1 transaction non attribuée.}other{Augmentez vos déductions fiscales potentielles! Attribuez des catégories à {count} transactions non attribuées.}}
gl: {count,plural,=1{Aumenta a túa posible dedución de impostos. Escolle categorías para 1 transacción sen asignar.}other{Aumenta a túa posible dedución de impostos. Escolle categorías para {count} transaccións sen asignar.}}
gu: {count,plural,=1{તમારો સંભવિત કર કપાત વધારો! ન સોંપાયેલ 1 વ્યવહાર માટે કૅટેગરી સોંપો.}other{તમારો સંભવિત કર કપાત વધારો! ન સોંપાયેલ {count} વ્યવહાર માટે કૅટેગરી સોંપો.}}
he: {count,plural,=1{רוצה להגדיל את ההנחה הפוטנציאלית שלך במס? יש להקצות קטגוריות לעסקה אחת שלא הוקצתה.}two{רוצה להגדיל את ההנחה הפוטנציאלית שלך במס? יש להקצות קטגוריות ל-{count} עסקאות שלא הוקצו.}other{רוצה להגדיל את ההנחה הפוטנציאלית שלך במס? יש להקצות קטגוריות ל-{count} עסקאות שלא הוקצו.}}
hi: {count,plural,=1{अपने टैक्स में संभावित छूट को बढ़ाएं! असाइन नहीं किए गए 1 लेन-देन के लिए श्रेणियां असाइन करें.}other{अपने टैक्स में संभावित छूट को बढ़ाएं! असाइन नहीं किए गए {count} लेन-देन के लिए श्रेणियां असाइन करें.}}
hu: {count,plural,=1{Növelje a lehetséges adókedvezményt! Rendeljen kategóriát 1 hozzárendelés nélküli tranzakcióhoz.}other{Növelje a lehetséges adókedvezményt! Rendeljen kategóriákat {count} hozzárendelés nélküli tranzakcióhoz.}}
hy: {count,plural,=1{Ավելացրեք հարկային հնարավոր նվազեցման գումարը։ Նշանակեք կատեգորիաներ 1 չբաշխված գործարքի համար։}other{Ավելացրեք հարկային հնարավոր նվազեցման գումարը։ Նշանակեք կատեգորիաներ {count} չբաշխված գործարքի համար։}}
id: {count,plural,=1{Tingkatkan potensi potongan pajak Anda. Tetapkan kategori untuk 1 transaksi yang belum ditetapkan.}other{Tingkatkan potensi potongan pajak Anda. Tetapkan kategori untuk {count} transaksi yang belum ditetapkan.}}
it: {count,plural,=1{Aumenta la tua potenziale detrazione fiscale. Assegna categorie a 1 transazione non assegnata.}other{Aumenta la tua potenziale detrazione fiscale. Assegna categorie a {count} transazioni non assegnate.}}
ja: {count,plural,=1{税額控除を受けられる可能性を高めましょう。1 件の未割り当ての取引にカテゴリを割り当ててください。}other{税額控除を受けられる可能性を高めましょう。{count} 件の未割り当ての取引にカテゴリを割り当ててください。}}
ka: {count,plural,=1{გაზარდეთ თქვენი პოტენციური საგადასახადო გამოქვითვა! მიანიჭეთ კატეგორია 1 მიუმაგრებელ ტრანსაქციას.}other{გაზარდეთ თქვენი პოტენციური საგადასახადო გამოქვითვა! მიანიჭეთ კატეგორია {count} მიუმაგრებელ ტრანსაქციას.}}
km: {count,plural,=1{បង្កើន​ការកាត់ពន្ធ​របស់អ្នក​ដែលអាច​មាន! កំណត់​ប្រភេទ​ទៅ​ប្រតិបត្តិការ 1 ដែលមិនបានកំណត់។}other{បង្កើន​ការកាត់ពន្ធ​របស់អ្នក​ដែលអាច​មាន! កំណត់​ប្រភេទ​ទៅ​ប្រតិបត្តិការ {count} ដែលមិនបានកំណត់។}}
kn: {count,plural,=1{ನಿಮ್ಮ ಸಂಭವನೀಯ ತೆರಿಗೆ ಕಡಿತಗಳನ್ನು ಹೆಚ್ಚಿಸಿ! 1 ನಿಯೋಜಿಸದ ವಹಿವಾಟಿಗೆ ವರ್ಗವನ್ನು ನಿಯೋಜಿಸಿ.}other{ನಿಮ್ಮ ಸಂಭವನೀಯ ತೆರಿಗೆ ಕಡಿತಗಳನ್ನು ಹೆಚ್ಚಿಸಿ! {count} ನಿಯೋಜಿಸದ ವಹಿವಾಟುಗಳಿಗೆ ವರ್ಗಗಳನ್ನು ನಿಯೋಜಿಸಿ.}}
ko: {count,plural,=1{세금 공제 가능액을 늘릴 수 있습니다. 1개의 미할당 거래에 카테고리를 지정하세요.}other{세금 공제 가능액을 늘릴 수 있습니다. {count}개의 미할당 거래에 카테고리를 지정하세요.}}
ky: {count,plural,=1{Мүмкүн болгон салыктын өлчөмүн чоңойтуңуз! Белгиленбеген 1 транзакциянын категориясын белгилеңиз.}other{Мүмкүн болгон салыктын өлчөмүн чоңойтуңуз! Белгиленбеген {count} транзакциянын категориясын белгилеңиз.}}
lo: {count,plural,=1{ເພີ່ມການຫຼຸດພາສີທີ່ເປັນໄປໄດ້ຂອງທ່ານ! ມອບໝາຍໝວດໝູ່ໃຫ້ 1 ທຸລະກຳທີ່ຍັງບໍ່ໄດ້ຮັບມອບໝາຍເທື່ອ.}other{ເພີ່ມການຫຼຸດພາສີທີ່ເປັນໄປໄດ້ຂອງທ່ານ! ມອບໝາຍໝວດໝູ່ໃຫ້ {count} ທຸລະກຳທີ່ຍັງບໍ່ໄດ້ຮັບມອບໝາຍເທື່ອ.}}
lt: {count,plural,=1{Gaukite didesnę mokesčių lengvatą! Priskirkite kategorijas 1 nepriskirtai operacijai.}few{Gaukite didesnę mokesčių lengvatą! Priskirkite kategorijas {count} nepriskirtoms operacijoms.}many{Gaukite didesnę mokesčių lengvatą! Priskirkite kategorijas {count} nepriskirtos operacijos.}other{Gaukite didesnę mokesčių lengvatą! Priskirkite kategorijas {count} nepriskirtų operacijų.}}
lv: {count,plural,=1{Palieliniet nodokļu atmaksas iespējas! Pievienojiet kategorijas 1 darījumam, kuram vēl nav pievienota kategorija.}zero{Palieliniet nodokļu atmaksas iespējas! Pievienojiet kategorijas {count} darījumiem, kuriem vēl nav pievienotas kategorijas.}other{Palieliniet nodokļu atmaksas iespējas! Pievienojiet kategorijas {count} darījumiem, kuriem vēl nav pievienotas kategorijas.}}
mk: {count,plural,=1{Зголемете го потенцијалното одбивање данок! Назначете категории на 1 неназначена трансакција.}other{Зголемете го потенцијалното одбивање данок! Назначете категории на {count} неназначени трансакции.}}
ml: {count,plural,=1{നികുതിയായി നിങ്ങളിൽ നിന്നും പിടിക്കാൻ സാധ്യതയുള്ള തുക കുറയ്ക്കൂ! വിഭാഗങ്ങൾ നിശ്ചയിച്ചിട്ടില്ലാത്ത ഒരു ഇടപാടിന് വിഭാഗങ്ങൾ നൽകുക.}other{നികുതിയായി നിങ്ങളിൽ നിന്നും പിടിക്കാൻ സാധ്യതയുള്ള തുക കുറയ്ക്കൂ! വിഭാഗങ്ങൾ നിശ്ചയിച്ചിട്ടില്ലാത്ത {count} ഇടപാടുകൾക്ക് വിഭാഗങ്ങൾ നൽകുക.}}
mn: {count,plural,=1{Татварын боломжит суутгалаа нэмэгдүүлээрэй! 1 оноогоогүй гүйлгээнд ангилал оноогоорой.}other{Татварын боломжит суутгалаа нэмэгдүүлээрэй! {count} оноогоогүй гүйлгээнд ангилал оноогоорой.}}
mr: {count,plural,=1{तुमची संभाव्य कर कपात वाढवा! एका असाइन न केलेल्या व्यवहाराला वर्गवाऱ्या असाइन करा.}other{तुमची संभाव्य कर कपात वाढवा! {count} असाइन न केलेल्या व्यवहारांना वर्गवाऱ्या असाइन करा.}}
ms: {count,plural,=1{Tingkatkan potongan cukai berpotensi anda! Tetapkan kategori kepada 1 transaksi yang tidak ditentukan.}other{Tingkatkan potongan cukai berpotensi anda! Tetapkan kategori kepada {count} transaksi yang tidak ditentukan.}}
my: {count,plural,=1{သင်၏အခွန်နုတ်ယူနိုင်ခြေကို တိုးမြှင့်ပါ။ မသတ်မှတ်ရသေးသော အရောင်းအဝယ် ၁ ခုတွင် အမျိုးအစားများ သတ်မှတ်ပါ။}other{သင်၏အခွန်နုတ်ယူနိုင်ခြေကို တိုးမြှင့်ပါ။ မသတ်မှတ်ရသေးသော အရောင်းအဝယ် {count} ခုတွင် အမျိုးအစားများ သတ်မှတ်ပါ။}}
nb: {count,plural,=1{Øk det potensielle avgiftsfradraget ditt. Tildel kategorier til én transaksjon som ikke er tildelt.}other{Øk det potensielle avgiftsfradraget ditt. Tildel kategorier til {count} transaksjoner som ikke er tildelt.}}
ne: {count,plural,=1{आफ्नो सम्भावित कर कटौती बढाउनुहोस्! कोटीहरूलाई निर्दिष्ट नगरिएको १ कारोबारमा निर्दिष्ट गर्नुहोस्।}other{आफ्नो सम्भावित कर कटौती बढाउनुहोस्! कोटीहरूलाई निर्दिष्ट नगरिएका {count} कारोबारमा निर्दिष्ट गर्नुहोस्।}}
pa: {count,plural,=1{ਆਪਣੀ ਸੰਭਾਵੀ ਟੈਕਸ ਕਟੌਤੀ ਵਿੱਚ ਵਾਧਾ ਕਰੋ! 1 ਗੈਰ-ਜ਼ਿੰਮੇ ਵਾਲੇ ਲੈਣ-ਦੇਣ 'ਤੇ ਸ਼੍ਰੇਣੀਆਂ ਨੂੰ ਜ਼ਿੰਮੇ ਲਾਓ।}other{ਆਪਣੀ ਸੰਭਾਵੀ ਟੈਕਸ ਕਟੌਤੀ ਵਿੱਚ ਵਾਧਾ ਕਰੋ! {count} ਗੈਰ-ਜ਼ਿੰਮੇ ਵਾਲੇ ਲੈਣ-ਦੇਣ 'ਤੇ ਸ਼੍ਰੇਣੀਆਂ ਨੂੰ ਜ਼ਿੰਮੇ ਲਾਓ।}}
pl: {count,plural,=1{Możesz zwiększyć potencjalną kwotę możliwą do odliczenia od podatku. Przydziel kategorie do 1 nieprzypisanej transakcji.}few{Możesz zwiększyć potencjalną kwotę możliwą do odliczenia od podatku. Przydziel kategorie do {count} nieprzypisanych transakcji.}many{Możesz zwiększyć potencjalną kwotę możliwą do odliczenia od podatku. Przydziel kategorie do {count} nieprzypisanych transakcji.}other{Możesz zwiększyć potencjalną kwotę możliwą do odliczenia od podatku. Przydziel kategorie do {count} nieprzypisanej transakcji.}}
pt: {count,plural,=1{Aumente seu potencial de dedução de taxas. Defina categorias para 1 transação não atribuída.}other{Aumente seu potencial de dedução de taxas. Defina categorias para {count} transações não atribuídas.}}
pt_pt: {count,plural,=1{Aumente a sua dedução fiscal potencial. Atribua categorias a 1 transação não atribuída.}other{Aumente a sua dedução fiscal potencial. Atribua categorias a {count} transações não atribuídas.}}
ro: {count,plural,=1{Creșteți-vă potențiala deducere fiscală! Atribuiți categorii unei tranzacții neatribuite.}few{Creșteți-vă potențiala deducere fiscală! Atribuiți categorii pentru {count} tranzacții neatribuite.}other{Creșteți-vă potențiala deducere fiscală! Atribuiți categorii pentru {count} de tranzacții neatribuite.}}
ru: {count,plural,=1{Увеличьте сумму возможного налогового вычета, назначив категорию для одной нераспределенной транзакции.}few{Увеличьте сумму возможного налогового вычета, назначив категории для {count} нераспределенных транзакций.}many{Увеличьте сумму возможного налогового вычета, назначив категории для {count} нераспределенных транзакций.}other{Увеличьте сумму возможного налогового вычета, назначив категории для {count} нераспределенной транзакции.}}
si: {count,plural,=1{ඔබේ විය හැකි බදු අඩු කිරීම වැඩි කරන්න! නොපවරන ලද ගනුදෙනු 1කට වර්ගීකරණ පවරන්න.}other{ඔබේ විය හැකි බදු අඩු කිරීම වැඩි කරන්න! නොපවරන ලද ගනුදෙනු {count}කට වර්ගීකරණ පවරන්න.}}
sk: {count,plural,=1{Zvýšte svoj potenciálny odpočet dane. Prideľte kategórie 1 nepridelenej transakcii.}few{Zvýšte svoj potenciálny odpočet dane. Prideľte kategórie {count} neprideleným transakciám.}many{Zvýšte svoj potenciálny odpočet dane. Assign categories to {count} unassigned transactions.}other{Zvýšte svoj potenciálny odpočet dane. Prideľte kategórie {count} neprideleným transakciám.}}
sq: {count,plural,=1{Rrit nivelin e mundshëm të zbritjes nga taksat! Cakto kategoritë për 1 transaksion të pacaktuar.}other{Rrit nivelin e mundshëm të zbritjes nga taksat! Cakto kategoritë për {count} transaksione të pacaktuara.}}
sr: {count,plural,=1{Повећајте могући одбитак пореза! Доделите категорије 1 недодељеној трансакцији.}few{Повећајте могући одбитак пореза! Доделите категорије за {count} недодељене трансакције.}other{Повећајте могући одбитак пореза! Доделите категорије за {count} недодељених трансакција.}}
sr_latn: {count,plural,=1{Povećajte mogući odbitak poreza! Dodelite kategorije 1 nedodeljenoj transakciji.}few{Povećajte mogući odbitak poreza! Dodelite kategorije za {count} nedodeljene transakcije.}other{Povećajte mogući odbitak poreza! Dodelite kategorije za {count} nedodeljenih transakcija.}}
sv: {count,plural,=1{Öka ditt potentiella skatteavdrag! Tilldela kategorier till 1 ej tilldelad transaktion.}other{Öka ditt potentiella skatteavdrag! Tilldela kategorier till {count} ej tilldelade transaktioner.}}
te: {count,plural,=1{అవకాశం ఉన్న మీ పన్ను మినహాయింపును పెంచుకోండి! కేటాయించని 1 లావాదేవీకి కేటగిరీలను కేటాయించండి.}other{అవకాశం ఉన్న మీ పన్ను మినహాయింపును పెంచుకోండి! కేటాయించని {count} లావాదేవీలకు కేటగిరీలను కేటాయించండి.}}
th: {count,plural,=1{เพิ่มโอกาสในการลดหย่อนภาษีของคุณ กำหนดหมวดหมู่ให้แก่ธุรกรรมที่ยังไม่มีหมวดหมู่ 1 รายการ}other{เพิ่มโอกาสในการลดหย่อนภาษีของคุณ กำหนดหมวดหมู่ให้แก่ธุรกรรมที่ยังไม่มีหมวดหมู่ {count} รายการ}}
tr: {count,plural,=1{Olası vergi iadenizi artırın. 1 atanmamış işleme kategoriler atayın.}other{Olası vergi iadenizi artırın. {count} atanmamış işleme kategoriler atayın.}}
uk: {count,plural,=1{Збільште можливу податкову пільгу! Призначте категорії 1 трансакції.}few{Збільште можливу податкову пільгу! Призначте категорії {count} трансакціям.}many{Збільште можливу податкову пільгу! Призначте категорії {count} трансакціям.}other{Збільште можливу податкову пільгу! Призначте категорії {count} трансакції.}}
ur: {count,plural,=1{اپنے امکانی ٹیکس کٹوتی کو بڑھائیں! زمرے کو 1 غیر تفویض کردہ ٹرانزیکشن میں تفویض کریں۔}other{اپنے امکانی ٹیکس کٹوتی کو بڑھائیں! زمرے کو {count} غیر تفویض کردہ ٹرانزیکشنز میں تفویض کریں۔}}
uz: {count,plural,=1{Soliq imtiyozlaringizni oshiring! Noaniq 1 ta tranzaksiyani turkumlang.}other{Soliq imtiyozlaringizni oshiring! Noaniq {count} ta tranzaksiyani turkumlang.}}
vi: {count,plural,=1{Tăng khoản khấu trừ thuế bạn có thể được hưởng! Gán danh mục cho 1 giao dịch chưa chỉ định.}other{Tăng khoản khấu trừ thuế bạn có thể được hưởng! Gán danh mục cho {count} giao dịch chưa chỉ định.}}
zh_hk: {count,plural,=1{增加您可能獲得的稅務減免！為 1 個未指定的交易指定類別。}other{增加您可能獲得的稅務減免！為 {count} 個未指定的交易指定類別。}}
zu: {count,plural,=1{Khuphula amandla akho okudonselwa intela! Nikeza izigaba kumsebenzi ongu-1 ongenasigaba.}other{Khuphula amandla akho okudonselwa intela! Nikeza izigaba kumisebenzi enganikeziwe engu-{count}.}}
