Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneFlyStops
source: {numberOfStops, plural, =0{Nonstop} =1{1 stop} other{{numberOfStops} stops}}
af: {numberOfStops,plural,=0{Stopvry}=1{1 stop}other{{numberOfStops} stoppe}}
am: {numberOfStops,plural,=0{ያለማቋረጥ}=1{1 ማቆሚያ}other{{numberOfStops} ማቆሚያዎች}}
ar_eg: {numberOfStops,plural,=0{بدون توقف}=1{محطة واحدة}two{محطتان ({numberOfStops})}few{{numberOfStops}‏ محطات}many{{numberOfStops}‏ محطة}other{{numberOfStops}‏ محطة}}
as: {numberOfStops,plural,=0{কোনো আস্থান নাই}=1{১ টা আস্থান}other{{numberOfStops} টা আস্থান}}
az: {numberOfStops,plural,=0{Birbaşa}=1{1 dayanacaq}other{{numberOfStops} dayanacaq}}
be: {numberOfStops,plural,=0{Без перасадак}=1{1 перасадка}few{{numberOfStops} перасадкі}many{{numberOfStops} перасадак}other{{numberOfStops} перасадкі}}
bn: {numberOfStops,plural,=0{ননস্টপ}=1{১টি স্টপ}other{{numberOfStops}টি স্টপ}}
bs: {numberOfStops,plural,=0{Bez presjedanja}=1{1 presjedanje}few{{numberOfStops} presjedanja}other{{numberOfStops} presjedanja}}
ca: {numberOfStops,plural,=0{Sense escales}=1{1 escala}other{{numberOfStops} escales}}
da: {numberOfStops,plural,=0{Direkte}=1{1 mellemlanding}other{{numberOfStops} mellemlandinger}}
es_ar: {numberOfStops,plural,=0{Directo}=1{1 escala}other{{numberOfStops} escalas}}
et: {numberOfStops,plural,=0{Otselend}=1{1 ümberistumine}other{{numberOfStops} ümberistumist}}
eu: {numberOfStops,plural,=0{Geldialdirik gabekoa}=1{1 geldialdi}other{{numberOfStops} geldialdi}}
fa: {numberOfStops,plural,=0{بی‌وقفه}=1{۱ توقف}other{{numberOfStops} توقف}}
fil: {numberOfStops,plural,=0{Nonstop}=1{1 stop}other{{numberOfStops} na stop}}
fr_ca: {numberOfStops,plural,=0{Direct}=1{1 escale}other{{numberOfStops} escales}}
gl: {numberOfStops,plural,=0{Directo}=1{1 escala}other{{numberOfStops} escalas}}
gu: {numberOfStops,plural,=0{નૉનસ્ટોપ}=1{1 સ્ટૉપ}other{{numberOfStops} સ્ટૉપ}}
he: {numberOfStops,plural,=0{ישירה}=1{עצירת ביניים אחת}two{{numberOfStops} עצירות}other{{numberOfStops} עצירות}}
hi: {numberOfStops,plural,=0{नॉनस्टॉप}=1{1 स्टॉप}other{{numberOfStops} स्टॉप}}
hu: {numberOfStops,plural,=0{Közvetlen járat}=1{1 megálló}other{{numberOfStops} megálló}}
hy: {numberOfStops,plural,=0{Առանց կանգառի}=1{1 կանգառ}other{{numberOfStops} կանգառ}}
id: {numberOfStops,plural,=0{Nonstop}=1{1 transit}other{{numberOfStops} transit}}
it: {numberOfStops,plural,=0{Diretto}=1{1 scalo}other{{numberOfStops} scali}}
ja: {numberOfStops,plural,=0{直行便}=1{乗継: 1 回}other{乗継: {numberOfStops} 回}}
ka: {numberOfStops,plural,=0{პირდაპირი}=1{1 გადაჯდომა}other{{numberOfStops} გადაჯდომა}}
km: {numberOfStops,plural,=0{មិន​ឈប់}=1{ការឈប់ 1 លើក}other{ការឈប់ {numberOfStops} លើក}}
kn: {numberOfStops,plural,=0{ತಡೆರಹಿತ}=1{1 ನಿಲುಗಡೆ}other{{numberOfStops} ನಿಲುಗಡೆಗಳು}}
ko: {numberOfStops,plural,=0{직항}=1{경유 1회}other{경유 {numberOfStops}회}}
ky: {numberOfStops,plural,=0{Үзгүлтүксүз}=1{1 жолу токтойт}other{{numberOfStops} жолу токтойт}}
lo: {numberOfStops,plural,=0{ບໍ່ຈອດ}=1{1 ຈຸດຈອດ}other{{numberOfStops} ຈຸດຈອດ}}
lt: {numberOfStops,plural,=0{Tiesioginis}=1{1 sustojimas}few{{numberOfStops} sustojimai}many{{numberOfStops} sustojimo}other{{numberOfStops} sustojimų}}
lv: {numberOfStops,plural,=0{Tiešais lidojums}=1{1 pārsēšanās}other{{numberOfStops} pārsēšanās}}
mk: {numberOfStops,plural,=0{Директен}=1{1 застанување}other{{numberOfStops} застанувања}}
ml: {numberOfStops,plural,=0{സ്റ്റോപ്പില്ലാത്തവ}=1{ഒരു സ്റ്റോപ്പ്}other{{numberOfStops} സ്റ്റോപ്പുകൾ}}
mn: {numberOfStops,plural,=0{Шууд}=1{1 зогсолт}other{{numberOfStops} зогсолт}}
mr: {numberOfStops,plural,=0{नॉनस्टॉप}=1{एक थांबा}other{{numberOfStops} थांबे}}
ms: {numberOfStops,plural,=0{Penerbangan terus}=1{1 persinggahan}other{{numberOfStops} persinggahan}}
my: {numberOfStops,plural,=0{မရပ်မနား}=1{ခရီးစဉ်အတွင်း ၁ နေရာ ရပ်နားမှု}other{ခရီးစဉ်အတွင်း {numberOfStops} နေရာ ရပ်နားမှု}}
nb: {numberOfStops,plural,=0{Direkte}=1{1 stopp}other{{numberOfStops} stopp}}
ne: {numberOfStops,plural,=0{ननस्टप}=1{१ बिसौनी}other{{numberOfStops} बिसौनी}}
pa: {numberOfStops,plural,=0{ਨਾਨ-ਸਟਾਪ}=1{1 ਸਟਾਪ}other{{numberOfStops} ਸਟਾਪ}}
pl: {numberOfStops,plural,=0{Bez przesiadek}=1{1 przesiadka}few{{numberOfStops} przesiadki}many{{numberOfStops} przesiadek}other{{numberOfStops} przesiadki}}
pt: {numberOfStops,plural,=0{Sem escalas}=1{1 escala}other{{numberOfStops} escalas}}
pt_pt: {numberOfStops,plural,=0{Voo direto}=1{1 paragem}other{{numberOfStops} paragens}}
ro: {numberOfStops,plural,=0{Fără escală}=1{O escală}few{{numberOfStops} escale}other{{numberOfStops} de escale}}
ru: {numberOfStops,plural,=0{Без пересадок}=1{1 пересадка}few{{numberOfStops} пересадки}many{{numberOfStops} пересадок}other{{numberOfStops} пересадки}}
si: {numberOfStops,plural,=0{අඛණ්ඩ}=1{නැවතුම් 1}other{නැවතුම් {numberOfStops}ක්}}
sk: {numberOfStops,plural,=0{Priamy let}=1{1 medzipristátie}few{{numberOfStops} medzipristátia}many{{numberOfStops} stops}other{{numberOfStops} medzipristátí}}
sq: {numberOfStops,plural,=0{Pa ndalesa}=1{1 ndalesë}other{{numberOfStops} ndalesa}}
sr: {numberOfStops,plural,=0{Директан}=1{1 заустављање}few{{numberOfStops} заустављања}other{{numberOfStops} заустављања}}
sr_latn: {numberOfStops,plural,=0{Direktan}=1{1 zaustavljanje}few{{numberOfStops} zaustavljanja}other{{numberOfStops} zaustavljanja}}
sv: {numberOfStops,plural,=0{Direktflyg}=1{1 mellanlandning}other{{numberOfStops} mellanlandningar}}
te: {numberOfStops,plural,=0{నాన్‌స్టాప్}=1{1 స్టాప్}other{{numberOfStops} స్టాప్‌లు}}
th: {numberOfStops,plural,=0{บินตรง}=1{1 จุดพัก}other{{numberOfStops} จุดพัก}}
tr: {numberOfStops,plural,=0{Aktarmasız}=1{1 aktarma}other{{numberOfStops} aktarma}}
uk: {numberOfStops,plural,=0{Прямий рейс}=1{1 зупинка}few{{numberOfStops} зупинки}many{{numberOfStops} зупинок}other{{numberOfStops} зупинки}}
ur: {numberOfStops,plural,=0{نان اسٹاپ}=1{1 اسٹاپ}other{{numberOfStops} اسٹاپس}}
uz: {numberOfStops,plural,=0{Uzluksiz}=1{1 ta almashinuv}other{{numberOfStops} ta almashinuv}}
vi: {numberOfStops,plural,=0{Bay thẳng}=1{1 điểm dừng}other{{numberOfStops} điểm dừng}}
zh_hk: {numberOfStops,plural,=0{直航}=1{1 個中轉站}other{{numberOfStops} 個中轉站}}
zu: {numberOfStops,plural,=0{Ukungami}=1{1 isitobhi}other{{numberOfStops} izitobhi}}

# craneSleepProperties
source: {totalProperties, plural, =0{No Available Properties} =1{1 Available Properties} other{{totalProperties} Available Properties}}
af: {totalProperties,plural,=0{Geen beskikbare eiendomme nie}=1{1 beskikbare eiendom}other{{totalProperties} beskikbare eiendomme}}
am: {totalProperties,plural,=0{ምንም የሚገኙ ንብረቶች የሉም}=1{1 የሚገኙ ንብረቶች}other{{totalProperties} የሚገኙ ንብረቶች}}
ar_eg: {totalProperties,plural,=0{ليس هناك مواقع متاحة.}=1{هناك موقع واحد متاح.}two{هناك موقعان ({totalProperties}) متاحان.}few{هناك {totalProperties} مواقع متاحة.}many{هناك {totalProperties} موقعًا متاحًا.}other{هناك {totalProperties} موقع متاح.}}
as: {totalProperties,plural,=0{কোনো উপলব্ধ সম্পত্তি নাই}=1{১ টা উপলব্ধ সম্পত্তি}other{{totalProperties} টা উপলব্ধ সম্পত্তি}}
az: {totalProperties,plural,=0{Əlçatan obyekt yoxdur}=1{1 əlçatan obyekt}other{{totalProperties} əlçatan obyekt}}
be: {totalProperties,plural,=0{Няма даступных месцаў для пражывання}=1{Даступна 1 месца для пражывання}few{Даступна {totalProperties} месцы для пражывання}many{Даступна {totalProperties} месцаў для пражывання}other{Даступна {totalProperties} месца для пражывання}}
bn: {totalProperties,plural,=0{কোনও প্রপার্টি ভাড়া পাওয়া যাবে না}=1{১টি প্রপার্টি ভাড়া পাওয়া যাবে}other{{totalProperties}টি প্রপার্টি ভাড়া পাওয়া যাবে}}
bs: {totalProperties,plural,=0{Nema dostupnih smještaja}=1{1 dostupan smještaj}few{{totalProperties} dostupna smještaja}other{{totalProperties} dostupnih smještaja}}
ca: {totalProperties,plural,=0{Cap propietat disponible}=1{1 propietat disponible}other{{totalProperties} propietats disponibles}}
da: {totalProperties,plural,=0{Ingen ledige ejendomme}=1{1 ledig ejendom}other{{totalProperties} ledige ejendomme}}
es_ar: {totalProperties,plural,=0{No hay propiedades disponibles}=1{1 propiedad disponible}other{{totalProperties} propiedades disponibles}}
et: {totalProperties,plural,=0{Saadaolevaid rendipindu ei ole}=1{1 saadaolev rendipind}other{{totalProperties} saadaolevat rendipinda}}
eu: {totalProperties,plural,=0{Ez dauka jabetzarik erabilgarri}=1{1 jabetza erabilgarri}other{{totalProperties} jabetza erabilgarri}}
fa: {totalProperties,plural,=0{ملکی در دسترس نیست}=1{۱ ملک در دسترس است}other{{totalProperties} ملک در دسترس است}}
fil: {totalProperties,plural,=0{Walang Available na Property}=1{1 Available na Property}other{{totalProperties} na Available na Property}}
fr_ca: {totalProperties,plural,=0{Aucune propriété n'est disponible}=1{1 propriété est disponible}other{{totalProperties} propriétés sont disponibles}}
gl: {totalProperties,plural,=0{Non hai propiedades dispoñibles}=1{1 propiedade dispoñible}other{{totalProperties} propiedades dispoñibles}}
gu: {totalProperties,plural,=0{કોઈ પ્રોપર્ટી ઉપલબ્ધ નથી}=1{1 પ્રોપર્ટી ઉપલબ્ધ છે}other{{totalProperties} પ્રોપર્ટી ઉપલબ્ધ છે}}
he: {totalProperties,plural,=0{אין נכסים זמינים}=1{נכס אחד זמין}two{{totalProperties} נכסים זמינים}other{{totalProperties} נכסים זמינים}}
hi: {totalProperties,plural,=0{किराये पर लेने के लिए जगह उपलब्ध नहीं है}=1{किराये पर लेने के लिए एक जगह उपलब्ध है}other{किराये पर लेने के लिए {totalProperties} जगह उपलब्ध हैं}}
hu: {totalProperties,plural,=0{Nincs rendelkezésre álló ingatlan}=1{1 rendelkezésre álló ingatlan van}other{{totalProperties} rendelkezésre álló ingatlan van}}
hy: {totalProperties,plural,=0{Հասանելի հյուրանոցներ չկան}=1{1 հասանելի հյուրանոց}other{{totalProperties} հասանելի հյուրանոց}}
id: {totalProperties,plural,=0{Tidak Ada Properti yang Tersedia}=1{1 Properti Tersedia}other{{totalProperties} Properti Tersedia}}
it: {totalProperties,plural,=0{Nessuna proprietà disponibile}=1{1 proprietà disponibile}other{{totalProperties} proprietà disponibili}}
ja: {totalProperties,plural,=0{短期賃貸物件なし}=1{1 件の短期賃貸物件}other{{totalProperties} 件の短期賃貸物件}}
ka: {totalProperties,plural,=0{ხელმისაწვდომი საკუთრება არ არის}=1{1 ხელმისაწვდომი საკუთრება}other{{totalProperties} ხელმისაწვდომი საკუთრება}}
km: {totalProperties,plural,=0{មិនមាន​អចលនទ្រព្យ​ដែលអាចជួល​បានទេ}=1{មាន​អចលនទ្រព្យ 1 ដែលអាចជួល​បាន}other{មាន​អចលនទ្រព្យ​ {totalProperties} ដែលអាចជួល​បាន}}
kn: {totalProperties,plural,=0{ಲಭ್ಯವಿರುವ ಸ್ವತ್ತುಗಳಿಲ್ಲ}=1{1 ಲಭ್ಯವಿರುವ ಸ್ವತ್ತುಗಳಿದೆ}other{{totalProperties} ಲಭ್ಯವಿರುವ ಸ್ವತ್ತುಗಳಿವೆ}}
ko: {totalProperties,plural,=0{이용 가능한 숙박업체 없음}=1{이용 가능한 숙박업체 1개}other{이용 가능한 숙박업체 {totalProperties}개}}
ky: {totalProperties,plural,=0{Жеткиликтүү жайлар жок}=1{1 жеткиликтүү жай бар}other{{totalProperties} жеткиликтүү жай бар}}
lo: {totalProperties,plural,=0{ບໍ່ມີຕົວເລືອກບ່ອນພັກ}=1{ມີ 1 ຕົວເລືອກບ່ອນພັກ}other{ມີ {totalProperties} ຕົວເລືອກບ່ອນພັກ}}
lt: {totalProperties,plural,=0{Nėra pasiekiamų nuosavybių}=1{1 pasiekiama nuosavybė}few{{totalProperties} pasiekiamos nuosavybės}many{{totalProperties} pasiekiamos nuosavybės}other{{totalProperties} pasiekiamų nuosavybių}}
lv: {totalProperties,plural,=0{Nav pieejamu īpašumu}=1{1 pieejams īpašums}other{{totalProperties} pieejami īpašumi}}
mk: {totalProperties,plural,=0{Нема достапни сместувања}=1{1 достапно сместување}other{{totalProperties} достапни сместувања}}
ml: {totalProperties,plural,=0{പ്രോപ്പർട്ടികളൊന്നും ലഭ്യമല്ല}=1{1 പ്രോപ്പർട്ടികൾ ലഭ്യമാണ്}other{{totalProperties} പ്രോപ്പർട്ടികൾ ലഭ്യമാണ്}}
mn: {totalProperties,plural,=0{Боломжтой үл хөдлөх хөрөнгө алга}=1{1 боломжтой үл хөдлөх хөрөнгө байна}other{{totalProperties} боломжтой үл хөдлөх хөрөнгө байна}}
mr: {totalProperties,plural,=0{कोणतीही प्रॉपर्टी उपलब्ध नाही}=1{एक प्रॉपर्टी उपलब्ध आहे}other{{totalProperties} प्रॉपर्टी उपलब्ध आहेत}}
ms: {totalProperties,plural,=0{Tiada Hartanah Tersedia}=1{1 Hartanah Tersedia}other{{totalProperties} Hartanah Tersedia}}
my: {totalProperties,plural,=0{မည်သည့်အိမ်မျှ မရနိုင်ပါ}=1{ရနိုင်သောအိမ် ၁ လုံး}other{ရနိုင်သောအိမ် {totalProperties} လုံး}}
nb: {totalProperties,plural,=0{Ingen tilgjengelige eiendommer}=1{1 tilgjengelig eiendom}other{{totalProperties} tilgjengelige eiendommer}}
ne: {totalProperties,plural,=0{कुनै पनि उपलब्ध आवास छैन}=1{ उपलब्ध १ आवास}other{उपलब्ध {totalProperties} आवास}}
pa: {totalProperties,plural,=0{ਕੋਈ ਸੰਪਤੀ ਉਪਲਬਧ ਨਹੀ ਹੈ}=1{1 ਮੌਜੂਦ ਸੰਪਤੀ}other{{totalProperties} ਉਪਲਬਧ ਸੰਪਤੀਆਂ}}
pl: {totalProperties,plural,=0{Brak dostępnych miejsc zakwaterowania}=1{1 dostępne miejsce zakwaterowania}few{{totalProperties} dostępne miejsca zakwaterowania}many{{totalProperties} dostępnych miejsc zakwaterowania}other{{totalProperties} dostępnego miejsca zakwaterowania}}
pt: {totalProperties,plural,=0{Nenhuma propriedade disponível}=1{1 propriedade disponível}other{{totalProperties} propriedades disponíveis}}
pt_pt: {totalProperties,plural,=0{Sem propriedades disponíveis}=1{1 propriedade disponível}other{{totalProperties} propriedades disponíveis}}
ro: {totalProperties,plural,=0{Nicio proprietate disponibilă}=1{O proprietate disponibilă}few{{totalProperties} proprietăți disponibile}other{{totalProperties} de proprietăți disponibile}}
ru: {totalProperties,plural,=0{Нет доступных вариантов жилья}=1{Доступен 1 вариант жилья}few{Доступно {totalProperties} варианта жилья}many{Доступно {totalProperties} вариантов жилья}other{Доступно {totalProperties} варианта жилья}}
si: {totalProperties,plural,=0{ලබා ගත හැකි කුලී නිවාස නැත}=1{ලබා ගත හැකි කුලී නිවාස 1}other{ලබා ගත හැකි කුලී නිවාස {totalProperties}}}
sk: {totalProperties,plural,=0{Žiadne dostupné objekty}=1{1 dostupný objekt}few{{totalProperties} dostupné objekty}many{{totalProperties} Available Properties}other{{totalProperties} dostupných objektov}}
sq: {totalProperties,plural,=0{Nuk ka prona të disponueshme}=1{1 pronë e disponueshme}other{{totalProperties} prona të disponueshme}}
sr: {totalProperties,plural,=0{Нема доступних објеката}=1{1 доступан објекат}few{{totalProperties} доступна објекта}other{{totalProperties} доступних објеката}}
sr_latn: {totalProperties,plural,=0{Nema dostupnih objekata}=1{1 dostupan objekat}few{{totalProperties} dostupna objekta}other{{totalProperties} dostupnih objekata}}
sv: {totalProperties,plural,=0{Inga tillgängliga boenden}=1{1 tillgängligt boende}other{{totalProperties} tillgängliga boenden}}
te: {totalProperties,plural,=0{ప్రాపర్టీలు ఏవీ అందుబాటులో లేవు}=1{1 ప్రాపర్టీలు అందుబాటులో ఉన్నాయి}other{{totalProperties} ప్రాపర్టీలు అందుబాటులో ఉన్నాయి}}
th: {totalProperties,plural,=0{ไม่มีตัวเลือกที่พัก}=1{มีตัวเลือกที่พัก 1 แห่ง}other{มีตัวเลือกที่พัก {totalProperties} แห่ง}}
tr: {totalProperties,plural,=0{Müsait Mülk Yok}=1{Kullanılabilir 1 Özellik}other{Kullanılabilir {totalProperties} Özellik}}
uk: {totalProperties,plural,=0{Немає доступних готелів або помешкань}=1{1 доступний готель або помешкання}few{{totalProperties} доступні готелі або помешкання}many{{totalProperties} доступних готелів або помешкань}other{{totalProperties} доступного готелю або помешкання}}
ur: {totalProperties,plural,=0{کوئی دستیاب پراپرٹیز نہیں}=1{1 دستیاب پراپرٹیز}other{{totalProperties} دستیاب پراپرٹیز ہیں}}
uz: {totalProperties,plural,=0{Mavjud uy-joylar topilmadi}=1{1 ta uy-joy mavjud}other{{totalProperties} ta uy-joy mavjud}}
vi: {totalProperties,plural,=0{Không có khách sạn nào}=1{Có 1 khách sạn}other{Có {totalProperties} khách sạn}}
zh_hk: {totalProperties,plural,=0{沒有住宿}=1{1 個可短租的住宿}other{{totalProperties} 個可短租的住宿}}
zu: {totalProperties,plural,=0{Azikho izici ezitholakalayo}=1{1 isici esitholakalayo}other{{totalProperties} Izici ezitholakalayo}}

# craneEatRestaurants
source: {totalRestaurants, plural, =0{No Restaurants} =1{1 Restaurant} other{{totalRestaurants} Restaurants}}
af: {totalRestaurants,plural,=0{Geen restaurante nie}=1{1 restaurant}other{{totalRestaurants} restaurante}}
am: {totalRestaurants,plural,=0{ምግብ ቤቶች የሉም}=1{1 ምግብ ቤት}other{{totalRestaurants} ምግብ ቤቶች}}
ar_eg: {totalRestaurants,plural,=0{ما مِن مطاعم.}=1{مطعم واحد}two{مطعمان ({totalRestaurants})}few{{totalRestaurants} مطاعم}many{{totalRestaurants} مطعمًا}other{{totalRestaurants} مطعم}}
as: {totalRestaurants,plural,=0{কোনো ৰেষ্টুৰেণ্ট নাই}=1{১ খন ৰেষ্টুৰেণ্ট}other{{totalRestaurants} খন ৰেষ্টুৰেণ্ট}}
az: {totalRestaurants,plural,=0{Restoran yoxdur}=1{1 restoran}other{{totalRestaurants} restoran}}
be: {totalRestaurants,plural,=0{Няма рэстаранаў}=1{1 рэстаран}few{{totalRestaurants} рэстараны}many{{totalRestaurants} рэстаранаў}other{{totalRestaurants} рэстарана}}
bn: {totalRestaurants,plural,=0{রেস্তোরাঁ নেই}=1{১টি রেস্তোঁরা}other{{totalRestaurants}টি রেস্তোঁরা}}
bs: {totalRestaurants,plural,=0{Nema restorana}=1{1 restoran}few{{totalRestaurants} restorana}other{{totalRestaurants} restorana}}
ca: {totalRestaurants,plural,=0{Cap restaurant}=1{1 restaurant}other{{totalRestaurants} restaurants}}
da: {totalRestaurants,plural,=0{Ingen restauranter}=1{1 restaurant}other{{totalRestaurants} restauranter}}
es_ar: {totalRestaurants,plural,=0{No hay restaurantes}=1{1 restaurante}other{{totalRestaurants} restaurantes}}
et: {totalRestaurants,plural,=0{Restorane pole}=1{1 restoran}other{{totalRestaurants} restorani}}
eu: {totalRestaurants,plural,=0{Ez dauka jatetxerik}=1{1 jatetxe}other{{totalRestaurants} jatetxe}}
fa: {totalRestaurants,plural,=0{رستورانی وجود ندارد}=1{۱ رستوران}other{{totalRestaurants} رستوران}}
fil: {totalRestaurants,plural,=0{Walang Restaurant}=1{1 Restaurant}other{{totalRestaurants} na Restaurant}}
fr_ca: {totalRestaurants,plural,=0{Aucun restaurant}=1{1 restaurant}other{{totalRestaurants} restaurants}}
gl: {totalRestaurants,plural,=0{Non hai restaurantes}=1{1 restaurante}other{{totalRestaurants} restaurantes}}
gu: {totalRestaurants,plural,=0{કોઈ રેસ્ટોરન્ટ નથી}=1{1 રેસ્ટોરન્ટ}other{{totalRestaurants} રેસ્ટોરન્ટ}}
he: {totalRestaurants,plural,=0{אין מסעדות}=1{מסעדה אחת}two{{totalRestaurants} מסעדות}other{{totalRestaurants} מסעדות}}
hi: {totalRestaurants,plural,=0{कोई रेस्टोरेंट नहीं है}=1{1 रेस्टोरेंट}other{{totalRestaurants} रेस्टोरेंट}}
hu: {totalRestaurants,plural,=0{Nincs étterem}=1{1 étterem}other{{totalRestaurants} étterem}}
hy: {totalRestaurants,plural,=0{Ռեստորաններ չկան}=1{1 ռեստորան}other{{totalRestaurants} ռեստորան}}
id: {totalRestaurants,plural,=0{Tidak Ada Restoran}=1{1 Restoran}other{{totalRestaurants} Restoran}}
it: {totalRestaurants,plural,=0{Nessun ristorante}=1{1 ristorante}other{{totalRestaurants} ristoranti}}
ja: {totalRestaurants,plural,=0{レストランなし}=1{1 件のレストラン}other{{totalRestaurants} 件のレストラン}}
ka: {totalRestaurants,plural,=0{რესტორნები არ არის}=1{1 რესტორანი}other{{totalRestaurants} რესტორნები}}
km: {totalRestaurants,plural,=0{មិនមាន​ភោជនីយដ្ឋាន​ទេ}=1{ភោជនីយដ្ឋាន 1}other{ភោជនីយដ្ឋាន {totalRestaurants}}}
kn: {totalRestaurants,plural,=0{ರೆಸ್ಟೋರೆಂಟ್‌ಗಳಿಲ್ಲ}=1{1 ರೆಸ್ಟೋರೆಂಟ್}other{{totalRestaurants} ರೆಸ್ಟೋರೆಂಟ್‌ಗಳು}}
ko: {totalRestaurants,plural,=0{음식점 없음}=1{음식점 1개}other{음식점 {totalRestaurants}개}}
ky: {totalRestaurants,plural,=0{Ресторандар жок}=1{1 ресторан}other{{totalRestaurants} ресторан}}
lo: {totalRestaurants,plural,=0{ບໍ່ມີຮ້ານອາຫານ}=1{ຮ້ານອາຫານ 1 ຮ້ານ}other{ຮ້ານອາຫານ {totalRestaurants} ຮ້ານ}}
lt: {totalRestaurants,plural,=0{Restoranų nėra}=1{1 restoranas}few{{totalRestaurants} restoranai}many{{totalRestaurants} restorano}other{{totalRestaurants} restoranų}}
lv: {totalRestaurants,plural,=0{Nav restorānu}=1{1 restorāns}other{{totalRestaurants} restorāni}}
mk: {totalRestaurants,plural,=0{Нема ресторани}=1{1 ресторан}other{{totalRestaurants} ресторани}}
ml: {totalRestaurants,plural,=0{റെസ്‌റ്റോറന്റുകളൊന്നുമില്ല}=1{ഒരു റെസ്‌റ്റോറന്റ്}other{{totalRestaurants} റെസ്റ്റോറന്റുകൾ}}
mn: {totalRestaurants,plural,=0{Ресторан алга}=1{1 ресторан}other{{totalRestaurants} ресторан}}
mr: {totalRestaurants,plural,=0{रेस्टॉरंट नाही}=1{एक रेस्टॉरंट}other{{totalRestaurants} रेस्टॉरंट}}
ms: {totalRestaurants,plural,=0{Tiada Restoran}=1{1 Restoran}other{{totalRestaurants} Restoran}}
my: {totalRestaurants,plural,=0{မည်သည့်စားသောက်ဆိုင်မျှ မရှိပါ}=1{စားသောက်ဆိုင် ၁ ဆိုင်}other{စားသောက်ဆိုင် {totalRestaurants} ဆိုင်}}
nb: {totalRestaurants,plural,=0{Ingen restauranter}=1{1 restaurant}other{{totalRestaurants} restauranter}}
ne: {totalRestaurants,plural,=0{कुनै पनि भोजनालय छैन}=1{१ भोजनालय}other{{totalRestaurants} भोजनालय}}
pa: {totalRestaurants,plural,=0{ਕੋਈ ਰੈਸਟੋਰੈਂਟ ਨਹੀਂ}=1{1 ਰੈਸਟੋਰੈਂਟ}other{{totalRestaurants} ਰੈਸਟੋਰੈਂਟ}}
pl: {totalRestaurants,plural,=0{Brak restauracji}=1{1 restauracja}few{{totalRestaurants} restauracje}many{{totalRestaurants} restauracji}other{{totalRestaurants} restauracji}}
pt: {totalRestaurants,plural,=0{Nenhum restaurante}=1{1 restaurante}other{{totalRestaurants} restaurantes}}
pt_pt: {totalRestaurants,plural,=0{Sem restaurantes}=1{1 restaurante}other{{totalRestaurants} restaurantes}}
ro: {totalRestaurants,plural,=0{Niciun restaurant}=1{Un restaurant}few{{totalRestaurants} restaurante}other{{totalRestaurants} de restaurante}}
ru: {totalRestaurants,plural,=0{Нет ресторанов}=1{1 ресторан}few{{totalRestaurants} ресторана}many{{totalRestaurants} ресторанов}other{{totalRestaurants} ресторана}}
si: {totalRestaurants,plural,=0{අවන්හල් නැත}=1{අවන්හල් 1}other{අවන්හල් {totalRestaurants}}}
sk: {totalRestaurants,plural,=0{Žiadne reštaurácie}=1{1 reštaurácia}few{{totalRestaurants} reštaurácie}many{{totalRestaurants} Restaurants}other{{totalRestaurants} reštaurácií}}
sq: {totalRestaurants,plural,=0{Asnjë restorant}=1{1 restorant}other{{totalRestaurants} restorante}}
sr: {totalRestaurants,plural,=0{Нема ресторана}=1{1 ресторан}few{{totalRestaurants} ресторана}other{{totalRestaurants} ресторана}}
sr_latn: {totalRestaurants,plural,=0{Nema restorana}=1{1 restoran}few{{totalRestaurants} restorana}other{{totalRestaurants} restorana}}
sv: {totalRestaurants,plural,=0{Inga restauranger}=1{1 restaurang}other{{totalRestaurants} restauranger}}
te: {totalRestaurants,plural,=0{రెస్టారెంట్‌లు లేవు}=1{1 రెస్టారెంట్}other{{totalRestaurants} రెస్టారెంట్‌లు}}
th: {totalRestaurants,plural,=0{ไม่มีร้านอาหาร}=1{มีร้านอาหาร 1 แห่ง}other{มีร้านอาหาร {totalRestaurants} แห่ง}}
tr: {totalRestaurants,plural,=0{Restoran Yok}=1{1 Restoran}other{{totalRestaurants} Restoran}}
uk: {totalRestaurants,plural,=0{Немає ресторанів}=1{1 ресторан}few{{totalRestaurants} ресторани}many{{totalRestaurants} ресторанів}other{{totalRestaurants} ресторану}}
ur: {totalRestaurants,plural,=0{کوئی ریسٹورنٹس نہیں ہے}=1{1 ریستورینٹ}other{{totalRestaurants} ریسٹورینٹس}}
uz: {totalRestaurants,plural,=0{Restoran topilmadi}=1{1 ta restoran}other{{totalRestaurants} ta restoran}}
vi: {totalRestaurants,plural,=0{Không có nhà hàng nào}=1{1 nhà hàng}other{{totalRestaurants} nhà hàng}}
zh_hk: {totalRestaurants,plural,=0{沒有餐廳}=1{1 間餐廳}other{{totalRestaurants} 間餐廳}}
zu: {totalRestaurants,plural,=0{Awekho amarestshurenti}=1{1 irestshurenti}other{{totalRestaurants} Amarestshurenti}}
