Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoTwoLineListsTitle
source: Two Lines
af: Twee reëls
am: ሁለት መስመሮች
ar_eg: سطران
as: দুটা শাৰী
az: İki sətir
be: Два радкі
bn: প্রতি সারিতে দু'টি লাইন
bs: Dva reda
ca: Dues línies
da: To linjer
es_ar: Dos líneas
et: Kaks rida
eu: Bi lerro
fa: دو خط
fil: Dalawang Linya
fr_ca: Deux lignes
gl: Dúas liñas
gu: બે લાઇન
he: שתי שורות
hi: दो लाइन
hu: Kétsoros
hy: Երկու գիծ
id: Dua Baris
it: Due righe
ja: 2 行
ka: ორი ხაზი
km: ពីរជួរ
kn: ಎರಡು ಸಾಲುಗಳು
ko: 두 줄
ky: Эки сап
lo: ສອງແຖວ
lt: Dvi eilutės
lv: Divas rindiņas
mk: Две линии
ml: രണ്ട് ലെെനുകൾ
mn: Хоёр шугам
mr: दोन ओळी
ms: Dua Baris
my: နှစ်ကြောင်း
nb: To linjer
ne: दुई पङ्क्ति
pa: ਦੋ ਲਾਈਨਾਂ
pl: Dwa wiersze
pt: Duas linhas
pt_pt: Duas linhas
ro: Două rânduri
ru: Две строки
si: පේළි දෙකයි
sk: Dva riadky
sq: Dy rreshta
sr: Два реда
sr_latn: Dva reda
sv: Två rader
te: రెండు పంక్తులు
th: สองบรรทัด
tr: İki Satır
uk: Два рядки
ur: دو لائنز
uz: Ikki qator
vi: 2 dòng
zh_hk: 雙行
zu: Imigqa emibili

# demoListsSecondary
source: Secondary text
af: Sekondêre teks
am: ሁለተኛ ጽሁፍ
ar_eg: نص ثانوي
as: গৌণ পাঠ
az: İkinci dərəcəli mətn
be: Другасны тэкст
bn: গৌণ টেক্সট
bs: Sekundarni tekst
ca: Text secundari
da: Sekundær tekst
es_ar: Texto secundario
et: Teisene tekst
eu: Bigarren lerroko testua
fa: متن ثانویه
fil: Pangalawang text
fr_ca: Texte secondaire
gl: Texto secundario
gu: ગૌણ ટેક્સ્ટ
he: טקסט משני
hi: सूची की दूसरी लाइन वाला टेक्स्ट
hu: Másodlagos szöveg
hy: Երկրորդական տեքստ
id: Teks sekunder
it: Testo secondario
ja: サブテキスト
ka: მეორადი ტექსტი
km: អក្សរនៅ​ជួរទីពីរ
kn: ದ್ವಿತೀಯ ಹಂತದ ಪಠ್ಯ
ko: 보조 텍스트
ky: Кошумча текст
lo: ຂໍ້ຄວາມສຳຮອງ
lt: Antrinis tekstas
lv: Sekundārais teksts
mk: Секундарен текст
ml: രണ്ടാം ടെക്സ്റ്റ്
mn: Хоёр дахь мөрний текст
mr: दुय्यम मजकूर
ms: Teks peringkat kedua
my: ဒုတိယစာသား
nb: Sekundær tekst
ne: माध्यमिक पाठ
pa: ਸੈਕੰਡਰੀ ਲਿਖਤ
pl: Tekst dodatkowy
pt: Texto secundário
pt_pt: Texto secundário
ro: Text secundar
ru: Дополнительный текст
si: ද්විතියික පෙළ
sk: Sekundárny text
sq: Teksti dytësor
sr: Секундарни текст
sr_latn: Sekundarni tekst
sv: Sekundär text
te: ద్వితీయ వచనం
th: ข้อความรอง
tr: İkincil metin
uk: Другорядний текст
ur: ثانوی متن
uz: Quyi matn
vi: Văn bản thứ cấp
zh_hk: 次行文字
zu: Umbhalo wesibili

# demoSelectionControlsTitle
source: Selection controls
af: Seleksiekontroles
am: የምርጫ መቆጣጠሪያዎች
ar_eg: عناصر التحكّم في الاختيار
as: বাছনি নিয়ন্ত্ৰণসমূহ
az: Seçim idarə elementləri
be: Элементы кіравання выбарам
bn: বেছে নেওয়ার বিষয়ে নিয়ন্ত্রণ
bs: Kontrole odabira
ca: Controls de selecció
da: Kontrolelementer til markering
es_ar: Controles de selección
et: Valiku juhtelemendid
eu: Hautapena kontrolatzeko aukerak
fa: کنترل‌های انتخاب
fil: Mga kontrol sa pagpili
fr_ca: Commandes de sélection
gl: Controis de selección
gu: પસંદગીના નિયંત્રણો
he: בקרות לבחירה
hi: चुनने के नियंत्रण
hu: Kiválasztásvezérlők
hy: Ընտրության կառավարման տարրեր
id: Kontrol pilihan
it: Comandi di selezione
ja: 選択コントロール
ka: არჩევის მართვის საშუალებები
km: ការគ្រប់គ្រង​ការជ្រើសរើស
kn: ಆಯ್ಕೆ ನಿಯಂತ್ರಣಗಳು
ko: 선택 컨트롤
ky: Тандоону башкаруу каражаттары
lo: ການຄວບຄຸມການເລືອກ
lt: Pasirinkimo valdikliai
lv: Atlasīšanas vadīklas
mk: Контроли за избор
ml: തിരഞ്ഞെടുക്കൽ നിയന്ത്രണങ്ങൾ
mn: Хяналтын сонголт
mr: निवडीची नियंत्रणे
ms: Kawalan pilihan
my: ရွေးချယ်မှု ထိန်းချုပ်ချက်များ
nb: Valgkontroller
ne: चयनसम्बन्धी नियन्त्रणहरू
pa: ਚੋਣ ਸੰਬੰਧੀ ਕੰਟਰੋਲ
pl: Elementy wyboru
pt: Controles de seleção
pt_pt: Controlos de seleção
ro: Comenzi de selectare
ru: Элементы управления выбором
si: තේරීම් පාලන
sk: Ovládacie prvky výberu
sq: Kontrollet e përzgjedhjes
sr: Контроле избора
sr_latn: Kontrole izbora
sv: Urvalskontroller
te: ఎంపిక నియంత్రణలు
th: การควบคุมการเลือก
tr: Seçim kontrolleri
uk: Елементи керування вибором
ur: انتخاب کے کنٹرولز
uz: Tanlov boshqaruvi
vi: Các chức năng điều khiển lựa chọn
zh_hk: 選項控制項
zu: Izilawuli zokukhethwa

# craneFly7SemanticLabel
source: Mount Rushmore
af: Rushmoreberg
am: ራሽሞር ተራራ
ar_eg: جبل راشمور
as: মাউণ্ট ৰুশ্বম’ৰ
az: Raşmor dağı
be: Гара Рашмар
bn: মাউন্ট রাশমোর
bs: Planina Rushmore
ca: Mont Rushmore
es_ar: Monte Rushmore
et: Rushmore'i mägi
eu: Rushmore mendia
fa: کوه راشمور
fr_ca: Mont Rushmore
gl: Monte Rushmore
gu: માઉન્ટ રુશ્મોર
he: הר ראשמור
hi: माउंट रशमोर
hu: Rushmore-hegy
hy: Ռաշմոր լեռ
id: Gunung Rushmore
it: Monte Rushmore
ja: ラシュモア山
ka: მთა რაშმორი
km: ភ្នំ​រ៉ាស្សម៉រ
kn: ಮೌಂಟ್ ರಷ್‌ಮೋರ್
ko: 러시모어산
ky: Рашмор тоосу
lo: ພູຣັຊມໍ
lt: Rašmoro kalnas
lv: Rašmora kalns
mk: Маунт Рашмор
ml: മൗണ്ട് റഷ്മോർ
mn: Рашмор уул
mr: माउंट रशमोअर
ms: Gunung Rushmore
my: ရက်ရှ်မောတောင်
ne: माउन्ट रसमोर
pa: ਮਾਊਂਟ ਰਸ਼ਮੋਰ
pt: Monte Rushmore
pt_pt: Monte Rushmore
ro: Muntele Rushmore
ru: Гора Рашмор
si: රෂ්මෝ කඳුවැටිය
sq: Mali Rushmore
sr: Маунт Рашмор
sr_latn: Maunt Rašmor
te: మౌంట్ రష్‌మోర్
th: ภูเขารัชมอร์
tr: Rushmore Dağı
uk: Гора Рашмор
ur: ماؤنٹ رشمور
uz: Rashmor togʻi
vi: Núi Rushmore
zh_hk: 拉什莫爾山
zu: I-Mount Rushmore

# demoSelectionControlsCheckboxTitle
source: Checkbox
af: Merkblokkie
am: አመልካች ሳጥን
ar_eg: مربع اختيار
as: চেকবাকচ
az: Qeyd xanası
be: Поле для птушкі
bn: চেকবক্স
bs: Polje za potvrdu
ca: Casella de selecció
da: Afkrydsningsfelt
es_ar: Casilla de verificación
et: Märkeruut
eu: Koadroa
fa: چارگوش انتخاب
fr_ca: Case à cocher
gl: Caixa de verificación
gu: ચેકબૉક્સ
he: תיבת סימון
hi: चेकबॉक्स
hu: Jelölőnégyzet
hy: Նշավանդակ
id: Kotak centang
it: Casella di controllo
ja: チェックボックス
ka: მოსანიშნი ველი
km: ប្រអប់​ធីក
kn: ಚೆಕ್‌ಬಾಕ್ಸ್
ko: 체크박스
ky: Белгилөө кутучасы
lo: ກ່ອງໝາຍ
lt: Žymimasis laukelis
lv: Izvēles rūtiņa
mk: Поле за избор
ml: ചെക്ക് ബോക്‌സ്
mr: चेकबॉक्स
ms: Kotak pilihan
my: အမှတ်ခြစ်ရန် နေရာ
nb: Avmerkingsboks
ne: जाँच बाकस
pa: ਚੈੱਕ-ਬਾਕਸ
pl: Pole wyboru
pt: Caixa de seleção
pt_pt: Caixa de verificação
ro: Casetă de selectare
ru: Флажок
si: තේරීම් කොටුව
sk: Začiarkavacie políčko
sq: Kutia e zgjedhjes
sr: Поље за потврду
sr_latn: Polje za potvrdu
sv: Kryssruta
te: చెక్‌బాక్స్
th: ช่องทำเครื่องหมาย
tr: Onay Kutusu
uk: Прапорець
ur: چیک باکس
uz: Belgilash katakchasi
vi: Hộp kiểm
zh_hk: 選框
zu: Ibhokisi lokuthikha

# craneSleep3SemanticLabel
source: Man leaning on an antique blue car
af: Man wat teen 'n antieke blou motor leun
am: አንድ አንጋፋ ሰማያዊ መኪናን ተደግፎ የቆመ ሰው
ar_eg: رجل متّكِئ على سيارة زرقاء عتيقة
as: এখন পুৰণি নীলা গাড়ীত হালি থকা মানুহ
az: Qədim mavi avtomobilə söykənən kişi
be: Мужчына, які абапіраецца на антыкварны сіні аўтамабіль
bn: একজন পুরনো নীল গাড়িতে ঝুঁকে দেখছে
bs: Muškarac naslonjen na starinski plavi automobil
ca: Home recolzat en un cotxe blau antic
da: Mand, der læner sig op ad en blå retro bil
es_ar: Hombre reclinado sobre un auto azul antiguo
et: Mees nõjatub vanaaegsele sinisele autole
eu: Gizon bat antzinako auto urdin baten aurrean makurtuta
fa: مرد تکیه‌داده به ماشین آبی عتیقه
fil: Lalaking nakasandal sa isang antique na asul na sasakyan
fr_ca: Homme s'appuyant sur une voiture bleue ancienne
gl: Home apoiado nun coche azul antigo
gu: પ્રાચીન વાદળી કારને ટેકો આપીને ઉભેલો માણસ
he: אדם שנשען על מכונית כחולה עתיקה
hi: नीले रंग की विटेंज कार से टेक लगाकर खड़ा व्यक्ति
hu: Régi kék autóra támaszkodó férfi
hy: Կապույտ ռետրո մեքենայի վրա հենված տղամարդ
id: Pria yang bersandar pada mobil antik warna biru
it: Uomo appoggiato a un'auto blu antica
ja: 青いクラシック カーに寄りかかる男性
ka: მამაკაცი ეყრდნობა ძველებურ ლურჯ მანქანას
km: បុរសផ្អែកលើ​រថយន្ត​ស៊េរីចាស់​ពណ៌ខៀវ
kn: ಹಳೆಯ ನೀಲಿ ಕಾರಿಗೆ ವಾಲಿ ನಿಂತಿರುವ ಮನುಷ್ಯ
ko: 파란색 앤티크 자동차에 기대 있는 남자
ky: Антиквардык көк унаага таянган киши
lo: ຜູ້ຊາຍຢືນພິງລົດບູຮານສີຟ້າ
lt: Žmogus, palinkęs prie senovinio mėlyno automobilio
lv: Vīrietis atspiedies pret senu, zilu automašīnu
mk: Маж се потпира на старински син автомобил
ml: നീല നിറത്തിലുള്ള പുരാതന കാറിൽ ചാരിയിരിക്കുന്ന മനുഷ്യൻ
mn: Хуучны цэнхэр өнгийн машин налж буй эр
mr: जुन्या काळातील एका निळ्या कारला टेकून उभा असलेला माणूस
ms: Lelaki bersandar pada kereta biru antik
my: ရှေးဟောင်းကားပြာဘေး မှီနေသည့်လူ
nb: Mann som lener seg på en blå veteranbil
ne: पुरानो मोडलको निलो कारमा अढेस लागेको मान्छे
pa: ਪੁਰਾਣੀ ਨੀਲੀ ਕਾਰ 'ਤੇ ਢੋਅ ਲਗਾ ਕੇ ਖੜ੍ਹਾ ਆਦਮੀ
pl: Mężczyzna opierający się o zabytkowy niebieski samochód
pt: Homem apoiado sobre um carro azul antigo
pt_pt: Homem encostado a um automóvel azul antigo
ro: Bărbat care se sprijină de o mașină albastră veche
ru: Мужчина, который опирается на синий ретроавтомобиль
si: කෞතුක වටිනාකමක් ඇති නිල් පැහැති මෝටර් රථයකට හේත්තු වී සිටින මිනිසා
sk: Muž opierajúci sa o starodávne modré auto
sq: Burrë i mbështetur te një makinë antike blu
sr: Човек се наслања на стари плави аутомобил
sr_latn: Čovek se naslanja na stari plavi automobil
sv: Man som lutar sig mot en blå veteranbil
te: పురాతన నీలి రంగు కారుపై వాలి నిలుచున్న మనిషి
th: ผู้ชายพิงรถโบราณสีน้ำเงิน
tr: Mavi antika bir arabaya dayanan adam
uk: Чоловік, який спирається на раритетний синій автомобіль
ur: نیلے رنگ کی کار سے ٹیک لگار کر کھڑا آدمی
uz: Eski koʻk avtomobilga suyanib turgan odam
vi: Người đàn ông tựa vào chiếc xe ô tô cổ màu xanh dương
zh_hk: 靠著藍色古董車的男人
zu: Indoda encike kumoto endala eluhlaza okwesibhakabhaka

# demoSelectionControlsRadioTitle
source: Radio
am: ሬዲዮ
ar_eg: زر اختيار
as: ৰেডিঅ’
be: Радыё
bn: রেডিও
bs: Dugme za izbor
ca: Opció
da: Alternativknap
es_ar: Selección
et: Raadio
eu: Aukera-botoia
fa: رادیو
gl: Botón de opción
gu: રેડિયો
he: לחצני בחירה
hi: रेडियो
hu: Választógomb
hy: Ռադիո
it: Pulsante di opzione
ja: ラジオ
ka: რადიო
km: ប៊ូតុង​មូល
kn: ರೇಡಿಯೋ
ko: 라디오
ky: Радио
lo: ປຸ່ມຕົວເລືອກ
lt: Akutė
lv: Poga
mk: Тркалезно копче
ml: റേഡിയോ
mn: Радио
mr: रेडिओ
my: ရေဒီယို
ne: रेडियो
pa: ਰੇਡੀਓ
pl: Przycisk opcji
pt: Opções
pt_pt: Opção
ru: Радиокнопка
si: රේඩියෝ
sk: Prepínač
sr: Дугме за избор
sr_latn: Dugme za izbor
sv: Alternativknapp
te: రేడియో
th: ปุ่มตัวเลือก
tr: Radyo düğmesi
uk: Радіокнопка
ur: ریڈیو
uz: Radiotugma
vi: Nút radio
zh_hk: 圓形按鈕
zu: Irediyo

# demoSelectionControlsRadioDescription
source: Radio buttons allow the user to select one option from a set. Use radio buttons for exclusive selection if you think that the user needs to see all available options side-by-side.
af: Klinkknoppies maak dit vir die gebruiker moontlik om een opsie uit 'n stel te kies. Gebruik klinkknoppies vir 'n uitsluitende keuse as jy dink dat die gebruiker alle beskikbare opsies langs mekaar moet sien.
am: የሬዲዮ ዝራሮች ተጠቃሚው ከአንድ ስብስብ ውስጥ አንድ አማራጭ እንዲፈጥር ያስችለዋል። ተጠቃሚው ሁሉንም የሚገኙ አማራጮች ጎን ለጎን ማየት አለበት ብለው የሚያስቡ ከሆነ የሬዲዮ አዝራሮችን የሚመለከተውን ብቻ ለመምረጥ ይጠቀሙባቸው።
ar_eg: تسمح أزرار الاختيار للقارئ بتحديد خيار واحد من مجموعة من الخيارات. يمكنك استخدام أزرار الاختيار لتحديد اختيارات حصرية إذا كنت تعتقد أنه يجب أن تظهر للمستخدم كل الخيارات المتاحة جنبًا إلى جنب.
as: ৰেডিঅ’ বুটামসমূহে এটা ছেটৰ পৰা এটা বিকল্প বাছনি কৰিবলৈ ব্যৱহাৰকাৰীক অনুমতি দিয়ে। যদি আপুনি ভাবে যে ব্যৱহাৰকাৰীয়ে উপলব্ধ সকলো বিকল্প এটাৰ কাষত অন্য এটাকৈ দেখা প্ৰয়োজন তেনে ক্ষেত্ৰত কেৱল এটা বাছনি কৰিবলৈ ৰেডিঅ’ বুটামসমূহ ব্যৱহাৰ কৰক।
az: Radio düymələri istifadəçiyə dəstdən bir seçim etmək imkanı verir. İstifadəçinin bütün əlçatan seçimləri yan-yana görməli olduğunu düşünsəniz, eksklüziv seçim üçün radio düymələrindən istifadə edin.
be: Радыёкнопкі дазваляюць карыстальніку выбраць з набору адзін варыянт. Выкарыстоўвайце іх для выбару ў асаблівых сітуацыях, каб карыстальнікі маглі бачыць усе даступныя варыянты.
bn: রেডিও বোতাম সেট থেকে ব্যবহারকারীকে একটি বিকল্প বেছে নিতে দেয়। একচেটিয়া নির্বাচনের জন্য রেডিও বোতামগুলি ব্যবহার করুন যদি আপনি মনে করেন যে ব্যবহারকারীর পাশাপাশি সমস্ত উপলভ্য বিকল্পগুলি দেখতে হবে।
bs: Dugmad za izbor omogućava korisniku da odabere jednu opciju iz seta. Koristite dugmad za izbor za ekskluzivni odabir ako smatrate da korisnik treba vidjeti sve dostupne opcije jednu pored druge.
ca: Els botons d'opció permeten que l'usuari seleccioni una opció d'un conjunt. Fes-los servir si vols que l'usuari pugui veure totes les opcions disponibles, però només en pugui triar una.
da: Alternativknapper giver brugeren mulighed for at vælge en valgmulighed fra et sæt. Brug alternativknapper til eksklusivt valg, hvis du mener, at brugeren har brug for at se alle tilgængelige valgmuligheder side om side.
es_ar: Los botones de selección permiten al usuario seleccionar una opción de un conjunto. Usa los botones de selección para una selección exclusiva si crees que el usuario necesita ver todas las opciones disponibles una al lado de la otra.
et: Raadionupud võimaldavad kasutajal teha komplektis ühe valiku. Kasutage raadionuppe eksklusiivse valiku pakkumiseks, kui arvate, et kasutaja peab nägema kõiki saadaolevaid valikuid kõrvuti.
eu: Aukera-botoiei esker, multzo bateko aukera bakarra hauta dezakete erabiltzaileek. Erabili aukera-botoiak erabiltzaileei aukera guztiak ondoz ondo erakutsi nahi badizkiezu, ondoren haietako bat hauta dezaten.
fa: دکمه رادیو به کاربر اجازه می‌دهد یک گزینه‌ از یک مجموعه را انتخاب کند. اگر فکر می‌کنید کاربر نیاز دارد همه گزینه‌های دردسترس را پهلو‌به‌پهلو ببیند، از دکمه رادیو برای انتخاب منحصربه‌فرد استفاده کنید.
fil: Nagbibigay-daan sa user ang mga radio button na pumili ng isang opsyon sa isang hanay. Gamitin ang mga radio button para sa paisa-isang pagpili kung sa tingin mo ay dapat magkakatabing makita ng user ang lahat ng available na opsyon.
fr_ca: Boutons radio qui permettent à l'utilisateur de sélectionner une option à partir d'un ensemble. Utilisez les boutons radio pour offrir une sélection exclusive, si vous croyez que l'utilisateur a besoin de voir toutes les options proposées côte à côte.
gl: Os botóns de opción permiten que os usuarios seleccionen unha opción dun conxunto. Utilízaos se queres que os usuarios escollan unha única opción, pero á vez queres mostrarlles todas as opcións dispoñibles.
gu: રેડિયો બટન વપરાશકર્તાને સેટમાંથી એક વિકલ્પ પસંદ કરવાની મંજૂરી આપે છે. જો તમને લાગે કે વપરાશકર્તાને એક પછી એક ઉપલબ્ધ બધા વિકલ્પો જોવાની જરૂર છે, તો વિશિષ્ટ પસંદગી માટે રેડિયો બટનનો ઉપયોગ કરો.
he: לחצני בחירה מאפשרים למשתמש לבחור אפשרות אחת מתוך מבחר אפשרויות. יש להשתמש בלחצני בחירה לצורך בחירה בלעדית אם לדעתך המשתמש צריך לראות את כל האפשרויות הזמינות זו לצד זו.
hi: रेडियो बटन, उपयोगकर्ता को किसी सेट में से एक विकल्प चुनने की सुविधा देता है. अगर आपको लगता है कि उपयोगकर्ता सभी विकल्पों को एक साथ देखना चाहते हैं, तो खास विकल्पों को चुनने के लिए रेडियो बटन का इस्तेमाल करें.
hu: A választógombok lehetővé teszik, hogy a felhasználó kiválassza a csoportban lévő valamelyik lehetőséget. A választógombok használata kizárólagos kiválasztást eredményez, amelyet akkor érdemes használnia, ha úgy gondolja, hogy a felhasználónak egyszerre kell látnia az összes választható lehetőséget.
hy: Կետակոճակների միջոցով օգտատերը կարող է ընտրել մեկ կարգավորում ցանկից։ Օգտագործեք կետակոճակները, եթե կարծում եք, որ օգտատիրոջն անհրաժեշտ է տեսնել բոլոր հասանելի կարգավորումներն իրար կողքի։
id: Tombol pilihan memungkinkan pengguna memilih salah satu opsi dari kumpulan. Gunakan tombol pilihan untuk pilihan eksklusif jika Anda merasa bahwa pengguna perlu melihat semua opsi yang tersedia secara berdampingan.
it: I pulsanti di opzione consentono all'utente di selezionare un'opzione da un gruppo di opzioni. Usa i pulsanti di opzione per la selezione esclusiva se ritieni che l'utente debba vedere tutte le opzioni disponibili affiancate.
ja: ラジオボタンでは、ユーザーが選択肢のセットから 1 つ選択できます。すべての選択肢を並べて、その中からユーザーが 1 つだけ選べるようにする場合は、ラジオボタンを使用します。
ka: არჩევანის ღილაკები მომხმარებელს საშუალებას აძლევს, აირჩიოს ერთი ვარიანტი ნაკრებიდან. ისარგებლეთ არჩევანის ღილაკებით გამომრიცხავი არჩევისთვის, თუ ფიქრობთ, რომ მომხმარებელს ყველა ხელმისაწვდომი ვარიანტის გვერდიგვერდ ნახვა სჭირდება.
km: ប៊ូតុងមូល​អនុញ្ញាតឱ្យ​អ្នកប្រើប្រាស់​ជ្រើសរើស​ជម្រើសមួយ​ពី​បណ្ដុំមួយ។ ប្រើ​ប៊ូតុងមូល​សម្រាប់​ការជ្រើសរើស​ផ្ដាច់មុខ ប្រសិនបើ​អ្នកគិតថា​អ្នកប្រើប្រាស់​ត្រូវការមើល​ជម្រើស​ដែលមាន​ទាំងអស់​ទន្ទឹមគ្នា។
kn: ಒಂದು ಸೆಟ್‌ನಿಂದ ಒಂದು ಆಯ್ಕೆಯನ್ನು ಆರಿಸಲು ರೇಡಿಯೋ ಬಟನ್‌ಗಳು ಬಳಕೆದಾರರನ್ನು ಅನುಮತಿಸುತ್ತವೆ. ಲಭ್ಯವಿರುವ ಎಲ್ಲಾ ಆಯ್ಕೆಗಳನ್ನು ಬಳಕೆದಾರರು ಅಕ್ಕಪಕ್ಕದಲ್ಲಿ ನೋಡಬೇಕು ಎಂದು ನೀವು ಭಾವಿಸಿದರೆ ವಿಶೇಷ ಆಯ್ಕೆಗಳಿಗಾಗಿ ರೇಡಿಯೊ ಬಟನ್‌ಗಳನ್ನು ಬಳಸಿ.
ko: 라디오 버튼을 사용하면 세트에서 한 가지 옵션을 선택할 수 있습니다. 사용자에게 선택 가능한 모든 옵션을 나란히 표시해야 한다고 판단된다면 라디오 버튼을 사용하여 한 가지만 선택할 수 있도록 하세요.
ky: Радио баскычтар колдонуучуга топтомдогу бир параметрди тандоо үчүн керек. Эгер колдонуучу бардык жеткиликтүү параметрлерди катары менен көрсүн десеңиз, радио баскычтарды колдонуңуз.
lo: ປຸ່ມຕົວເລືອກທີ່ເຮັດໃຫ້ຜູ້ໃຊ້ສາມາດເລືອກຕົວເລືອກຈາກຊຸດໃດໜຶ່ງໄດ້. ໃຊ້ປຸ່ມຕົວເລືອກສຳລັບການເລືອກສະເພາະຫາກທ່ານຄິດວ່າຜູ້ໃຊ້ຕ້ອງການເບິ່ງຕົວເລືອກທັງໝົດທີ່ມີຂ້າງໆກັນ.
lt: Naudotojas akutėmis gali pasirinkti vieną parinktį iš rinkinio. Naudokite akutes išskirtiniams pasirinkimams, jei manote, kad naudotojui reikia peržiūrėti visas galimas parinktis kartu.
lv: Izmantojot pogas, lietotājs var atlasīt vienu opciju grupā. Izmantojiet pogas vienas opcijas atlasei, ja uzskatāt, ka lietotājam ir jāredz visas pieejamās opcijas līdzās.
mk: Тркалезните копчиња му овозможуваат на корисникот да избере една опција од збир опции. Користете ги за исклучителен избор доколку мислите дека корисникот треба да ги види сите достапни опции една до друга.
ml: ഒരു സെറ്റിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കാൻ റേഡിയോ ബട്ടണുകൾ ഉപയോക്താവിനെ അനുവദിക്കുന്നു. ഉപയോക്താവിന് ലഭ്യമായ എല്ലാ ഓപ്ഷനുകളും വശങ്ങളിലായി കാണണമെന്ന് നിങ്ങൾ കരുതുന്നുവെങ്കിൽ, എക്‌സ്‌ക്ലൂ‌സീവ് തിരഞ്ഞെടുക്കലിനായി റേഡിയോ ബട്ടണുകൾ ഉപയോഗിക്കുക.
mn: Радио товчлуур нь хэрэглэгчид багцаас нэг сонголт сонгохийг зөвшөөрдөг. Хэрэв та хэрэглэгч бүх боломжит сонголтыг зэрэгцүүлэн харах шаардлагатай гэж бодож байвал онцгой сонголтод зориулсан радио товчлуурыг ашиглана уу.
mr: रेडिओ बटणे वापरकर्त्याला संचामधून एक पर्याय निवडण्याची अनुमती देतात. वापरकर्त्याला त्याचवेळी सर्व उपलब्ध पर्याय पाहायचे आहेत असे तुम्हाला वाटत असल्यास, विशेष निवडीसाठी रेडिओ बटणे वापरा.
ms: Butang radio membenarkan pengguna memilih satu pilihan daripada satu set. Gunakan butang radio untuk pemilihan eksklusif jika anda berpendapat bahawa pengguna perlu melihat semua pilihan yang tersedia secara bersebelahan.
my: ရေဒီယိုခလုတ်များသည် အုပ်စုတစ်ခုမှ ရွေးချယ်စရာများအနက် တစ်ခုကို ရွေးခွင့်ပေးသည်။ အသုံးပြုသူသည် ရွေးချယ်မှုများကို ဘေးချင်းကပ်ကြည့်ရန် လိုအပ်သည်ဟု ယူဆပါက အထူးသီးသန့်ရွေးချယ်မှုအတွက် ရေဒီယိုခလုတ်ကို အသုံးပြုပါ။
nb: Brukere kan bruke alternativknapper til å velge ett alternativ fra et sett. Bruk alternativknapper til eksklusive valg hvis du mener at brukeren må se alle tilgjengelige alternativer ved siden av hverandre.
ne: रेडियो बटनहरूले प्रयोगकर्तालाई सेटबाट एउटा विकल्प चयन गर्न अनुमति दिन्छन्। तपाईंलाई प्रयोगकर्ताले उपलब्ध सबै विकल्पहरू सँगसँगै हेर्नु पर्छ भन्ने लाग्छ भने विशेष रूपमा चयन गर्न रेडियो बटनहरूको प्रयोग गर्नुहोस्।
pa: ਰੇਡੀਓ ਬਟਨ ਕਿਸੇ ਸੈੱਟ ਵਿੱਚੋਂ ਵਰਤੋਂਕਾਰ ਨੂੰ ਇੱਕ ਵਿਕਲਪ ਚੁਣਨ ਦਿੰਦੇ ਹਨ। ਜੇ ਤੁਹਾਨੂੰ ਲੱਗਦਾ ਹੈ ਕਿ ਵਰਤੋਂਕਾਰ ਨੂੰ ਉਪਲਬਧ ਵਿਕਲਪਾਂ ਨੂੰ ਇੱਕ-ਇੱਕ ਕਰਕੇ ਦੇਖਣ ਦੀ ਲੋੜ ਹੈ ਤਾਂ ਖਾਸ ਚੋਣ ਲਈ ਰੇਡੀਓ ਬਟਨ ਵਰਤੋ।
pl: Przyciski opcji pozwalają na wybranie jednej z kilku dostępnych opcji. Należy ich używać, by użytkownik wybrał tylko jedną opcję, ale mógł zobaczyć wszystkie pozostałe.
pt: Os botões de opção permitem que o usuário selecione uma opção em um conjunto delas. Use botões de opção para seleções exclusivas se você achar que o usuário precisa ver todas as opções disponíveis lado a lado.
pt_pt: Os botões de opção permitem ao utilizador selecionar uma opção num conjunto. Utilize os botões de opção para uma seleção exclusiva se considerar que o utilizador necessita de ver todas as opções disponíveis lado a lado.
ro: Cu ajutorul butoanelor radio, utilizatorul poate să selecteze o singură opțiune dintr-un set. Folosiți-le pentru selectări exclusive dacă credeți că utilizatorul trebuie să vadă toate opțiunile disponibile alăturate.
ru: С помощью радиокнопки пользователь может выбрать один параметр из списка. Радиокнопки хорошо подходят для тех случаев, когда вы хотите показать все доступные варианты в одном списке.
si: රේඩියෝ බොත්තම පරිශීලකට කට්ටලයකින් එක් විකල්පයක් තේරීමට ඉඩ දෙයි. පරිශීලකට ලබා ගත හැකි සියලු විකල්ප පැත්තෙන් පැත්තට බැලීමට අවශ්‍යයැයි ඔබ සිතන්නේ නම් සුවිශේෂි තේරීම සඳහා රේඩියෝ බොත්තම භාවිත කරන්න.
sk: Prepínače umožňujú používateľovi vybrať jednu položku zo skupiny možností. Prepínače použite na výhradný výber, ak sa domnievate, že používateľ by mal vidieť všetky dostupné možnosti vedľa seba.
sq: Butonat e radios e lejojnë përdoruesin të zgjedhë një opsion nga një grup. Përdor butonat e radios për përzgjedhje ekskluzive nëse mendon se përdoruesi ka nevojë të shikojë të gjitha opsionet e disponueshme përkrah njëri-tjetrit.
sr: Дугмад за избор омогућавају кориснику да изабере једну опцију из скупа. Користите дугмад за избор да бисте омогућили ексклузивни избор ако сматрате да корисник треба да види све доступне опције једну поред друге.
sr_latn: Dugmad za izbor omogućavaju korisniku da izabere jednu opciju iz skupa. Koristite dugmad za izbor da biste omogućili ekskluzivni izbor ako smatrate da korisnik treba da vidi sve dostupne opcije jednu pored druge.
sv: Med hjälp av alternativknapparna kan användarna välja ett alternativ från en uppsättning. Använd alternativknapparna för ömsesidig uteslutning om du tror att användaren behöver se alla tillgängliga alternativ sida vid sida.
te: రేడియో బటన్‌లు అనేవి ఒక సెట్ నుండి ఒక ఎంపికను ఎంచుకోవడానికి యూజర్‌ను అనుమతిస్తాయి. అందుబాటులో ఉన్న అన్ని ఎంపికలను, యూజర్, పక్కపక్కనే చూడాలని మీరు అనుకుంటే ప్రత్యేక ఎంపిక కోసం రేడియో బటన్‌లను ఉపయోగించండి.
th: ปุ่มตัวเลือกให้ผู้ใช้เลือก 1 ตัวเลือกจากชุดตัวเลือก ใช้ปุ่มตัวเลือกสำหรับการเลือกพิเศษในกรณีที่คุณคิดว่าผู้ใช้จำเป็นต้องเห็นตัวเลือกที่มีอยู่ทั้งหมดแสดงข้างกัน
tr: Radyo düğmeleri, kullanıcının bir dizi seçenek arasından birini belirlemesine olanak sağlar. Kullanıcının tüm mevcut seçenekleri yan yana görmesi gerektiğini düşünüyorsanız özel seçim için radyo düğmelerini kullanın.
uk: Радіокнопки дають користувачам змогу вибирати один параметр із набору. Використовуйте радіокнопки, коли потрібно, щоб користувач бачив усі доступні варіанти, а вибирав лише один.
ur: ریڈیو بٹنز صارف کو سیٹ سے ایک اختیار منتخب کرنے کی اجازت دیتے ہیں۔ اگر آپ کو لگتا ہے کہ صارف کو سبھی دستیاب اختیارات کو پہلو بہ پہلو دیکھنے کی ضرورت ہے تو خاص انتخاب کے لیے ریڈیو بٹنز استعمال کریں۔
uz: Radiotugma faqat bir tanlov imkonini beradi. Ular mavjud tanlovlarni bir roʻyxatda chiqarish uchun qulay.
vi: Các nút radio cho phép người dùng chọn một tùy chọn trong một tập hợp. Hãy dùng nút radio để lựa chọn riêng nếu bạn cho rằng người dùng cần xem song song tất cả các tùy chọn có sẵn.
zh_hk: 圓形按鈕讓使用者從一組選項中選擇一個選項。如果您認為使用者需要並排查看所有選項並從中選擇一個選項，便可使用圓形按鈕。
zu: Izinkinobho zerediyo zivumela umsebenzisi ukuthi akhethe inketho eyodwa kusukela kusethi. Sebenzisa izinkinobho zerediyo zokukhethwa okukhethekile uma ucabanga ukuthi umsebenzisi kumele abone zonke izinketho ezikhethekile uhlangothi ukuya kolunye.

# demoSelectionControlsSwitchTitle
source: Switch
af: Wissel
am: ቀይር
ar_eg: مفاتيح التبديل
as: সলনি কৰক
az: Dəyişdirici
be: Пераключальнік
bn: পাল্টান
bs: Prekidač
ca: Interruptor
da: Kontakt
es_ar: Interruptor
et: Lüliti
eu: Etengailua
fa: کلید
fr_ca: Commutateur
gl: Interruptor
gu: સ્વિચ
he: מתגים
hi: बदलें
hu: Kapcsoló
hy: Փոխանջատիչ
id: Tombol Akses
it: Opzione
ja: スイッチ
ka: გადამრთველი
km: ប៊ូតុង​បិទបើក
kn: ಬದಲಿಸಿ
ko: 스위치
ky: Которулуу
lo: ປຸ່ມ
lt: Perjungti
lv: Slēdzis
mk: Прекинувач
ml: മാറുക
mn: Сэлгэх
mr: स्विच
ms: Tukar
my: ပြောင်းရန်
nb: Bryter
ne: स्विच
pa: ਸਵਿੱਚ
pl: Przełącznik
pt: Chave
pt_pt: Interruptor
ro: Comutatoare
ru: Переключатель
si: මාරු කරන්න
sk: Prepínač
sq: Çelës
sr: Прекидач
sr_latn: Prekidač
sv: Reglage
te: స్విచ్
th: สวิตช์
tr: Anahtar
uk: Перемикач
ur: سوئچ کریں
uz: Almashtirgich
vi: Công tắc
zh_hk: 開關
zu: Iswishi
