Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# demoDividerDescription
source: Dividers can be used in lists, drawers, and elsewhere to separate content.
af: Verdelers kan in lyste, laaie en elders gebruik word om inhoud te skei.
am: አካፋዮች ይዘትን ለመለየት በዝርዝሮች፣ በመሳቢያዎች እና በሌሎች ቦታዎች ውስጥ ጥቅም ላይ ሊውሉ ይችላሉ።
ar_eg: يمكن استخدام أدوات تقسيم الشاشة في القوائم والأدراج وغيرها لوضع فواصل بين المحتوى.
as: সূচী, ড্ৰৱাৰ আৰু সমল পৃথক কৰিবলৈ অন্য ঠাইত বিভাজক ব্যৱহাৰ কৰিব পাৰি।
az: Ayırıcılar məzmunu ayırmaq üçün siyahılar, çəkməcələr və başqa yerlərdə istifadə edilə bilər.
be: Раздзяляльнікі можна выкарыстоўваць у спісах, высоўных меню і іншых месцах для раздзялення змесціва.
bn: ডিভাইডার তালিকা, ড্রয়ার ও অন্যান্য জায়গায় কন্টেন্টকে আলাদা আলাদাভাবে দেখানোর জন্য ব্যবহার করা হয়।
bs: Graničnici se mogu koristiti na listama, panelima i na drugim mjestima za razdvajanje sadržaja.
ca: Els divisors es poden utilitzar en llistes, taulers i en qualsevol altre lloc per separar contingut.
da: Skillelinjer kan bruges i lister, skuffer og andre steder til at adskille indhold.
es_ar: Un divisor se puede usar en listas, paneles laterales y cualquier otro lugar para separar contenido.
et: Jaotured võib kasutada loendites, sahtlites ja mujal sisu eraldamiseks.
eu: Bereizleak zerrendetan, panel lerrakorretan eta bestelakoetan erabil daitezke edukia banatzeko.
fa: از تقسیم‌کننده‌ها می‌توان در فهرست‌ها، کشوها، و جاهای دیگر برای جدا کردن محتوا استفاده کرد.
fil: Magagamit ang mga divider sa mga listahan, drawer, at iba pang lugar para maghiwa-hiwalay ng content.
fr_ca: Les séparateurs peuvent être utilisés dans les listes, les tiroirs de navigation et ailleurs pour séparer le contenu.
gl: Os separadores poden usarse en listas, paneis e outros elementos para separar contido.
gu: કન્ટેન્ટને અલગ કરવા માટે, વિભાજકોનો ઉપયોગ સૂચિઓ, ડ્રોઅર અને કોઈ બીજી જગ્યામાં કરી શકાય છે.
he: אפשר להשתמש בקווים מפרידים ברשימות, בחלוניות הזזה ובמקומות אחרים כדי להפריד בין תכנים.
hi: डिवाइडर का इस्तेमाल सूचियों, ड्रॉर, और अन्य जगहों पर कॉन्टेंट को बांटने के लिए किया जा सकता है.
hu: Az elválasztókat tartalom elkülönítésére használhatja listákban, fiókokban és egyéb helyeken.
hy: Բաժանիչները կարող են օգտագործվել ցանկերում, դարակներում և այլ տեղերում՝ բովանդակությունն առանձնացնելու համար։
id: Pembagi dapat digunakan dalam daftar, panel samping, dan tempat lainnya untuk memisahkan konten.
it: I divisori possono essere utilizzati in elenchi, riquadri a scomparsa e altrove per separare i contenuti.
ja: 分割線をリストやドロワー内などに使用すると、コンテンツをグループ化して表示できます。
ka: გამყოფების გამოყენება შიგთავსის გასაყოფად შესაძლებელია სიებში, უჯრებში და სურვილისამებრ ყველგან.
km: បន្ទាត់ខណ្ឌចែក​អាចប្រើនៅក្នុងបញ្ជី ថត និងកន្លែងផ្សេងទៀត ដើម្បីបែងចែកខ្លឹមសារ។
kn: ಪಟ್ಟಿಗಳು, ಡ್ರಾಯರ್‌ಗಳು ಮತ್ತು ಬೇರೆಡೆ ಇರುವ ವಿಷಯವನ್ನು ಪ್ರತ್ಯೇಕಿಸಲು ವಿಭಾಜಕಗಳನ್ನು ಬಳಸಬಹುದು.
ko: 구분선은 목록, 창 등에서 콘텐츠를 구분하는 데 사용될 수 있습니다.
ky: Бөлгүчтөр тизмелерде, суурмаларда жана башка жерлерде контентти бөлүү үчүн колдонулат.
lo: ສາມາດໃຊ້ຕົວຂັ້ນໃນລາຍຊື່, ລິ້ນຊັກ ແລະ ບ່ອນອື່ນໆເພື່ອແຍກເນື້ອຫາໄດ້.
lt: Dalikliai gali būti naudojami sąrašuose, skydeliuose ir kitur, siekiant atskirti turinį.
lv: Atdalītājus var izmantot sarakstos, atvilktnēs un citur, lai nodalītu saturu.
mk: Разделувачите може да се користат во списоци, фиоки и на други места за да се одделат содржини.
ml: ലിസ്റ്റുകളിലും ഡ്രോയറുകളിലും മറ്റിടങ്ങളിലും ഉള്ളടക്കം വേർതിരിക്കാൻ ഡിവൈഡറുകൾ ഉപയോഗിക്കാം.
mn: Хуваагчдыг жагсаалт, шургуулга болон бусад газарт контентыг тусгаарлахад ашиглах боломжтой.
mr: विभाजक सूची, ड्रॉवर आणि इतर ठिकणी आशय वेगळे करण्यासाठी वापरले जाऊ शकतात.
ms: Pembahagi boleh digunakan dalam senarai, laci dan di tempat lain bagi memisahkan kandungan.
my: စာရင်း၊ အံဆွဲနှင့် အကြောင်းအရာကို နေရာခြားပေးသော အခြားတစ်နေရာရာတွင် ပိုင်းခြားမျဉ်းများကို သုံးနိုင်သည်။
nb: Skillelinjer kan brukes i lister, uttrekksmenyer og andre steder for å skille innhold.
ne: सूची, ड्रअर र अन्य ठाउँमा सामग्री छुट्याउनका लागि विभाजकहरूको प्रयोग गरिन्छ।
pa: ਵਿਭਾਜਕਾਂ ਦੀ ਵਰਤੋਂ ਸਮੱਗਰੀ ਨੂੰ ਵੱਖ ਕਰਨ ਲਈ ਸੂਚੀਆਂ, ਦਰਾਜ਼ਾਂ ਅਤੇ ਹੋਰ ਥਾਵਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ।
pl: Separatorów można używać na listach, panelach i w innych miejscach, gdzie chcemy oddzielić od siebie poszczególne treści.
pt: Divisores podem ser usados em listas, gavetas e outros lugares para separar conteúdos.
pt_pt: É possível usar divisores em listas, gavetas e outros locais para separar conteúdo.
ro: Separatoarele se pot folosi în liste, panouri și alte locuri pentru a separa conținutul.
ru: Разделители позволяют группировать контент. Их можно использовать, например, в списках и выдвигающихся панелях.
si: අන්තර්ගතය වෙන් කිරීම සඳහා ලැයිස්තු, ලාච්චු සහ වෙනත් තැන්වල වෙන්කරණ භාවිත කළ හැකිය.
sk: Pomocou rozdeľovačov môžete oddeliť obsah v zoznamoch, vysúvacích paneloch a inde.
sq: Ndarësit mund të përdoren në lista, sirtarë dhe kudo për të ndarë përmbajtje.
sr: Разделници могу да се користе за листе, фиоке и на другим местима за раздвајање садржаја.
sr_latn: Razdelnici mogu da se koriste za liste, fioke i na drugim mestima za razdvajanje sadržaja.
sv: Avgränsare kan användas i listor, utdragbara paneler och på andra ställen för att dela upp innehåll.
te: కంటెంట్‌ను వేరు చేయడానికి లిస్ట్‌లు, డ్రాయర్‌లు, ఇతర చోట్ల డివైడర్‌లను ఉపయోగించవచ్చు.
th: ตัวแบ่งสามารถใช้แยกเนื้อหาในรายการ ลิ้นชัก และตำแหน่งอื่นๆ
tr: Ayırıcılar, içeriği ayırmak için listelerde, çekmecelerde ve başka yerlerde kullanılabilir.
uk: Роздільники можуть використовувати в списках, висувних панелях та інших місцях для розділення контенту.
ur: تقسیم کاران فہرستوں، درازوں اور کسی اور جگہ میں مواد کو الگ کرنے کے لیے استعمال کیے جا سکتے ہیں۔
uz: Ajratkichdan kontentni ajratish uchun roʻyxatlarda, chizmalarda va boshqa joylarda ishlatish mumkin.
vi: Đường phân chia có thể được sử dụng trong danh sách, ngăn hoặc nơi khác để phân cách nội dung.
zh_hk: 分隔線可用分隔內容，無論是清單、導覽列或其他地方均可使用。
zu: Izihlukanisi zingasetshenziswa ezinhlwini, emakhabetheni, nakwezinye izindawo ukuze kuhlukaniswe okuqukethwe.

# demoVerticalDividerTitle
source: Vertical Divider
af: Vertikale verdeler
am: አቀባዊ አካፋይ
ar_eg: أداة تقسيم الشاشة عموديًا
as: উলম্ব বিভাজক
az: Vertikal Ayırıcı
be: Вертыкальны раздзяляльнік
bn: ভার্টিকাল ডিভাইডার
bs: Vertikalni graničnik
ca: Divisor vertical
da: Lodret skillelinje
es_ar: Divisor vertical
et: Vertikaalne jaotur
eu: Bereizle bertikala
fa: تقسیم‌کننده عمودی
fil: Vertical na Divider
fr_ca: Séparateur vertical
gl: Separador vertical
gu: ઊભું વિભાજક
he: קו מפריד אנכי
hi: वर्टिकल डिवाइडर
hu: Függőleges elválasztó
hy: Ուղղաձիգ բաժանիչ
id: Pembagi Vertikal
it: Divisore verticale
ja: 縦方向の分割線
ka: ვერტიკალური გამყოფი
km: បន្ទាត់ខណ្ឌចែក​បញ្ឈរ
kn: ಲಂಬವಾದ ವಿಭಾಜಕ
ko: 세로 구분선
ky: Вертикалдык бөлгүч
lo: ຕົວຂັ້ນລວງຕັ້ງ
lt: Vertikalusis daliklis
lv: Vertikāls atdalītājs
mk: Вертикален разделувач
ml: വെർട്ടിക്കൽ ഡിവൈഡർ
mn: Босоо хуваагч
mr: व्हर्टिकल विभाजक
ms: Pembahagi Menegak
my: ဒေါင်လိုက်ပိုင်းခြားမျဉ်း
nb: Vertikal skillelinje
ne: ठाडो विभाजक
pa: ਖੜ੍ਹਵਾਂ ਵਿਭਾਜਕ
pl: Separator pionowy
pt: Divisor vertical
pt_pt: Divisor vertical
ro: Separator vertical
ru: Вертикальный разделитель
si: සිරස් වෙන්කරණය
sk: Vertikálny rozdeľovač
sq: Ndarësi vertikal
sr: Вертикални разделник
sr_latn: Vertikalni razdelnik
sv: Vertikal avgränsare
te: వర్టికల్ డివైడర్
th: ตัวแบ่งแนวตั้ง
tr: Dikey Ayırıcı
uk: Вертикальний роздільник
ur: عمودی تقسیم کار
uz: Vertikal ajratkich
vi: Đường phân chia dọc
zh_hk: 垂直分隔線
zu: Isihlukanisi Esiqondile

# demoCupertinoContextMenuTitle
source: Context Menu
af: Kontekskieslys
am: ተገቢ ሁኔታ ምናሌ
ar_eg: قائمة السياقات
as: প্ৰসংগ মেনু
az: Kontekst Menyusu
be: Кантэкстнае меню
bn: কনটেক্সট মেনু
bs: Kontekstni meni
ca: Menú contextual
da: Genvejsmenu
es_ar: Menú contextual
et: Kontekstimenüü
eu: Laster-menua
fa: منوی بافت
fil: Menu ng Konteksto
fr_ca: Menu contextuel
gl: Menú contextual
gu: સંદર્ભ મેનૂ
he: תפריט הקשר
hi: संदर्भ मेन्यू
hu: Helyi menü
hy: Տեղային ընտրացանկ
id: Menu Konteks
it: Menu contestuale
ja: コンテキスト メニュー
ka: კონტექსტური მენიუ
km: ម៉ឺនុយ​បរិបទ
kn: ಸಂದರ್ಭದ ಮೆನು
ko: 컨텍스트 메뉴
ky: Контексттик меню
lo: ເມນູບໍລິບົດ
lt: Kontekstinis meniu
lv: Kontekstizvēlne
mk: Контекстуално мени
ml: സന്ദർഭ മെനു
mn: Хам сэдэв цэс
mr: काँटेक्स्ट मेनू
ms: Menu Konteks
my: အကြောင်းအရာမီနူး
nb: Kontekstuell meny
ne: कन्टेक्स्ट मेनु
pa: ਸੰਦਰਭੀ ਮੀਨੂ
pl: Menu kontekstowe
pt: Menu de contexto
pt_pt: Menu de contexto
ro: Meniu contextual
ru: Контекстное меню
si: ප්‍රකරණ මෙනුව
sk: Kontextová ponuka
sq: Menyja konstekstuale
sr: Контекстуални мени
sr_latn: Kontekstualni meni
sv: Snabbmeny
te: సందర్భోచిత మెనూ
th: เมนูตามบริบท
tr: İçerik Menüsü
uk: Контекстне меню
ur: سیاق و سباق کا مینیو
uz: Kontekst menyusi
vi: Trình đơn theo bối cảnh
zh_hk: 內容選單
zu: Imenyu Yokuqukethwe

# demoCupertinoContextMenuSubtitle
source: iOS-style context menu
af: iOS-stylkontekskieslys
am: የiOS-ቅጥ ተገቢ ሁኔታ ምናሌ
ar_eg: قائمة سياقات بنمط iOS
as: iOS-শৈলীৰ প্ৰসংগ মেনু
az: iOS üslublu kontekst menyusu
be: Кантэкстнае меню ў стылі iOS
bn: iOS-স্টাইলের কনটেক্সট মেনু
bs: Kontekstni meni u iOS stilu
ca: Menú contextual d'estil iOS
da: Genvejsmenu til iOS
es_ar: Menú contextual con estilo de iOS
et: iOS-i stiilis kontekstimenüü
eu: iOS estiloko laster-menua
fa: منوی بافت به‌سبک iOS
fil: Menu ng konteksto na may istilong pang-iOS
fr_ca: Menu contextuel de style iOS
gl: Menú contextual de tipo iOS
gu: iOS-શૈલીનું સંદર્ભ મેનૂ
he: תפריט הקשר בסגנון iOS
hi: iOS स्टाइल का संदर्भ मेन्यू
hu: iOS-stílusú helyi menü
hy: iOS-ի ոճով տեղային ընտրացանկ
id: Menu konteks bergaya iOS
it: Menu contestuale in stile iOS
ja: iOS スタイルのコンテキスト メニュー
ka: iOS სტილის კონტექსტური მენიუ
km: ម៉ឺនុយ​បរិបទរចនាប័ន្ម iOS
kn: iOS-ಶೈಲಿಯ ಸಂದರ್ಭದ ಮೆನು
ko: iOS 스타일 컨텍스트 메뉴
ky: iOS стилиндеги контексттик меню
lo: ເມນູບໍລິບົດຮູບແບບ iOS
lt: „iOS“ stiliaus kontekstinis meniu
lv: iOS stila kontekstizvēlne.
mk: Контекстуално мени со iOS-стил
ml: iOS-സ്റ്റൈൽ സന്ദർഭ മെനു
mn: iOS загварын хам сэдэв цэс
mr: iOS शैलीतील कॉंटेक्स्ट मेनू
ms: Menu konteks bergaya iOS
my: iOS-ပုံစံ အကြောင်းအရာမီနူး
nb: Kontekstuell meny i iOS-stil
ne: iOS-शैलीको सन्दर्भ मेनु
pa: iOS-ਸਟਾਈਲ ਵਾਲਾ ਸੰਦਰਭੀ ਮੀਨੂ
pl: Menu kontekstowe znane z iOS
pt: Menu de contexto no estilo iOS
pt_pt: Menu de contexto ao estilo do iOS
ro: Meniu contextual în stil iOS
ru: Контекстное меню в стиле iOS
si: iOS-විලාසයේ ප්‍රකරණ මෙනුව
sk: Kontextová ponuka typu iOS
sq: Menyja kontekstuale në stilin për iOS
sr: Контекстуални мени у iOS стилу
sr_latn: Kontekstualni meni u iOS stilu
sv: Snabbmeny i iOS-stil
te: iOS-స్టయిల్ సంబంధిత మెనూ
th: เมนูตามบริบทแบบ iOS
tr: iOS stili içerik menüsü
uk: Контекстне меню в стилі iOS
ur: iOS طرز کے سیاق و سباق کا مینیو
uz: iOS uslubidagi kontekst menyusi
vi: Trình đơn theo bối cảnh phong cách iOS
zh_hk: iOS 樣式內容選單
zu: Imenyu yokuqukethwe yesitayela se-iOS

# demoAppBarSubtitle
source: Displays information and actions relating to the current screen
af: Wys inligting en handelinge wat met die huidige skerm verband hou
am: ከአሁኑ ማያ ገፅ ጋር የተያያዙ መረጃዎችን እና እርምጃዎችን ያሳያል
ar_eg: يعرض الشريط معلومات وإجراءات متعلقة بالشاشة الحالية.
as: বৰ্তমানৰ স্ক্ৰীনখনৰ সৈতে জড়িত তথ্য আৰু কাৰ্য দেখুৱায়
az: Cari ekrana aid məlumatları və əməliyyatları göstərir
be: Паказвае інфармацыю і дзеянні, звязаныя з бягучым экранам
bn: বর্তমান স্ক্রিন সম্পর্কিত তথ্য ও অ্যাকশন ডিসপ্লে করে
bs: Prikazuje informacije i radnje povezane s trenutnim ekranom
ca: Mostra informació i accions relacionades amb la pantalla actual
da: Viser oplysninger og handlinger, der er knyttet til den aktuelle skærm
es_ar: Muestra información y acciones relacionadas a la pantalla actual
et: Näitab praeguse kuvaga seotud teavet ja toiminguid
eu: Bertan, une horretan ikusten den pantailarekin erlazionatutako informazioa eta ekintzak bistaratzen dira
fa: اطلاعات و کنش‌های مربوط به صفحه فعلی را نمایش می‌دهد
fil: Nagpapakita ng impormasyon at mga pagkilos kaugnay ng kasalukuyang screen
fr_ca: Affiche des renseignements et des actions relatifs au contenu de l'écran actuel
gl: Mostra información e accións relacionadas coa pantalla actual
gu: હાલની સ્ક્રીન સંબંધિત માહિતી અને ક્રિયાઓ બતાવે છે
he: מוצגים בו פרטים ופעולות שקשורים למסך הנוכחי
hi: मौजूदा स्क्रीन से जुड़ी जानकारी और कार्रवाइयां दिखाता है
hu: Megjeleníti az aktuális képernyőt érintő információkat és műveleteket
hy: Ցուցադրում է ընթացիկ էկրանին առնչվող տեղեկություններն ու գործողությունները
id: Menampilkan informasi dan tindakan yang terkait dengan layar saat ini
it: Mostra azioni e informazioni relative alla schermata corrente
ja: 現在の画面に関連する情報やアクションを表示します
ka: აჩვენებს მიმდინარე ეკრანთან დაკავშირებულ ინფორმაციასა და მოქმედებებს
km: បង្ហាញព័ត៌មាន និងសកម្មភាពទាក់ទងនឹងអេក្រង់បច្ចុប្បន្ន
kn: ಪ್ರಸ್ತುತ ಸ್ಕ್ರೀನ್‌ಗೆ ಸಂಬಂಧಿಸಿದ ಮಾಹಿತಿ ಮತ್ತು ಕ್ರಿಯೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತದೆ
ko: 현재 화면과 관련된 정보 및 작업 표시
ky: Учурдагы экранга байланыштуу маалыматты жана аракеттерди көрсөтөт
lo: ສະແດງຂໍ້ມູນ ແລະ ຄຳສັ່ງຕ່າງໆທີ່ກ່ຽວຂ້ອງກັບໜ້າຈໍປັດຈຸບັນ
lt: Rodoma informacija ir veiksmai, susiję su esamu ekranu
lv: Tiek rādīta informācija un darbības, kas saistītas ar pašreizējo ekrānu.
mk: Прикажува информации и дејства поврзани со тековниот екран
ml: നിലവിലെ സ്ക്രീനുമായി ബന്ധപ്പെട്ട വിവരങ്ങളും പ്രവർത്തനങ്ങളും കാണിക്കുന്നു
mn: Одоогийн дэлгэцтэй холбоотой мэдээлэл болон үйлдлүүдийг үзүүлнэ
mr: सध्याच्या स्क्रीनसंबंधित माहिती आणि कृती दाखवते
ms: Memaparkan maklumat dan tindakan berkaitan dengan skrin semasa
my: လက်ရှိစခရင်နှင့် ဆက်စပ်သော အချက်အလက်နှင့် လုပ်ဆောင်ချက်များ ပြသသည်
nb: Viser informasjon og handlinger som er tilknyttet den aktive skjermen
ne: हालको स्क्रिनसँग सम्बन्धित जानकारी र कारबाहीहरू देखाउँछ
pa: ਮੌਜੂਦਾ ਸਕ੍ਰੀਨ ਨਾਲ ਸੰਬੰਧਿਤ ਜਾਣਕਾਰੀ ਅਤੇ ਕਾਰਵਾਈਆਂ ਨੂੰ ਦਿਖਾਉਂਦੀ ਹੈ
pl: Zawiera informacje i czynności dotyczące aktualnego ekranu
pt: Mostra informações e ações relacionadas à tela atual
pt_pt: Apresenta informações e ações relacionadas com o ecrã atual
ro: Afișează informații și acțiuni legate de ecranul actual
ru: На ней показаны сведения и действия, относящиеся к текущему экрану
si: වත්මන් තිරයට අදාළ තොරතුරු සහ ක්‍රියා පෙන්වයි
sk: Zobrazuje informácie a akcie súvisiace s aktuálnou obrazovkou
sq: Shfaq informacione dhe veprime në lidhje me ekranin aktual
sr: Приказује информације и радње у вези са актуелним екраном
sr_latn: Prikazuje informacije i radnje u vezi sa aktuelnim ekranom
sv: Visar information och åtgärder för den aktuella skärmen
te: ప్రస్తుత స్క్రీన్‌కు సంబంధించిన సమాచారం, చర్యలను ప్రదర్శిస్తుంది
th: แสดงข้อมูลและการทำงานที่เกี่ยวข้องกับหน้าจอปัจจุบัน
tr: Geçerli ekranla ilgili bilgileri ve işlemleri gösterir
uk: Показує інформацію та дії, пов’язані з поточним екраном
ur: موجودہ اسکرین سے متعلق معلومات اور کارروائیاں ڈسپلے کرتا ہے
uz: Joriy ekranga tegishli maʼlumot va amallarni koʻrsatadi
vi: Hiện thông tin và thao tác liên quan đến màn hình hiện tại
zh_hk: 顯示與目前畫面相關的資料和動作
zu: Ibonisa ulwazi nezenzo ezihlobene nesikrini samanje

# demoCupertinoContextMenuActionOne
source: Action one
af: Handeling een
am: እርምጃ አንድ
ar_eg: الإجراء الأول
as: কাৰ্য এক
az: Əməliyyat bir
be: Першае дзеянне
bn: প্রথম অ্যাকশন
bs: Prva radnja
ca: Acció 1
da: Første handling
es_ar: Acción uno
et: Esimene toiming
eu: Lehen ekintza
fa: کنش یک
fil: Pagkilos isa
fr_ca: Première action
gl: Acción 1
gu: ક્રિયા એક
he: פעולה ראשונה
hi: पहली कार्रवाई
hu: Első művelet
hy: Գործողություն 1
id: Tindakan satu
it: Azione uno
ja: アクション 1
ka: მოქმედება პირველი
km: សកម្មភាពទីមួយ
kn: ಕ್ರಿಯೆ ಒಂದು
ko: 작업 1
ky: Биринчи аракет
lo: ຄຳສັ່ງໜຶ່ງ
lt: Pirmas veiksmas
lv: Pirmā darbība
mk: Прво дејство
ml: ഒന്നാമത്തെ പ്രവർത്തനം
mn: Нэгдүгээр үйлдэл
mr: पहिली कृती
ms: Tindakan satu
my: လုပ်ဆောင်ချက်တစ်
nb: Handling én
ne: कारबाही एक
pa: ਪਹਿਲੀ ਕਾਰਵਾਈ
pl: Czynność pierwsza
pt: Primeira ação
pt_pt: Ação um
ro: Prima acțiune
ru: Действие 1
si: ක්‍රියාව එක
sk: Prvá akcia
sq: Veprimi një
sr: Прва радња
sr_latn: Prva radnja
sv: Åtgärd ett
te: ఒకటవ చర్య
th: การทำงาน 1
tr: Birinci işlem
uk: Перша дія
ur: کارروائی ایک
uz: Birinchi amal
vi: Thao tác 1
zh_hk: 動作一
zu: Isenzo sokuqala

# demoCupertinoContextMenuActionTwo
source: Action two
af: Handeling twee
am: እርምጃ ሁለት
ar_eg: الإجراء الثاني
as: কাৰ্য দুই
az: Əməliyyat iki
be: Другое дзеянне
bn: দ্বিতীয় অ্যাকশন
bs: Druga radnja
ca: Acció 2
da: Anden handling
es_ar: Acción dos
et: Teine toiming
eu: Bigarren ekintza
fa: کنش دو
fil: Pagkilos dalawa
fr_ca: Deuxième action
gl: Acción 2
gu: ક્રિયા બે
he: פעולה שנייה
hi: दूसरी कार्रवाई
hu: Második művelet
hy: Գործողություն 2
id: Tindakan dua
it: Azione due
ja: アクション 2
ka: მოქმედება მეორე
km: សកម្មភាពទីពីរ
kn: ಕ್ರಿಯೆ ಎರಡು
ko: 작업 2
ky: Экинчи аракет
lo: ຄຳສັ່ງສອງ
lt: Antras veiksmas
lv: Otrā darbība
mk: Второ дејство
ml: രണ്ടാമത്തെ പ്രവർത്തനം
mn: Хоёрдугаар үйлдэл
mr: दुसरी कृती
ms: Tindakan dua
my: လုပ်ဆောင်ချက်နှစ်
nb: Handling to
ne: कारबाही दुई
pa: ਦੂਜੀ ਕਾਰਵਾਈ
pl: Czynność druga
pt: Segunda ação
pt_pt: Ação dois
ro: A doua acțiune
ru: Действие 2
si: ක්‍රියාව දෙක
sk: Druhá akcia
sq: Veprimi dy
sr: Друга радња
sr_latn: Druga radnja
sv: Åtgärd två
te: రెండవ చర్య
th: การทำงาน 2
tr: İkinci işlem
uk: Друга дія
ur: کارروائی دو
uz: Ikkinchi amal
vi: Thao tác 2
zh_hk: 動作二
zu: Isenzo sesibili

# demoDateRangePickerDescription
source: Shows a dialog containing a Material Design date range picker.
af: Wys ’n dialoog met ’n Materiaalontwerp-datumreekskieser.
am: የቁስ ንድፍ ከ..እስከ ቀን መራጭ የያዘ መገናኛን ያሳያል።
ar_eg: تعرض هذه الأداة مربّع حوار يحتوي على أداة بتصميم متعدد الأبعاد لاختيار المرحلة الزمنية.
as: মেটেৰিয়েল ডিজাইনযুক্ত তাৰিখ বাছনি কৰোঁতা থকা এটা ডায়ল’গ দেখুৱায়।
az: Material Dizayn tarix aralığı seçicisini ehtiva edən dialoq pəncərəsini göstərir.
be: Дыялогавае акно ў Матэрыяльным дызайне, у якім можна выбраць дыяпазон дат.
bn: মেটেরিয়াল ডিজাইনের ডেট রেঞ্জ চয়নকারী রয়েছে এমন ডায়ালগ দেখায়।
bs: Prikazuje dijaloški okvir koji sadrži birač raspona datuma u materijalnom dizajnu.
ca: Mostra un quadre de diàleg que conté un selector d'intervals de dates de Material Design.
da: Viser en dialogboks med en Material Design-datointervalvælger.
es_ar: Muestra un diálogo que contiene un selector de períodos de Material Design.
et: Kuvatakse dialoog, mis sisaldab materiaalse disaini kuupäevavahemiku valijat.
eu: Material diseinuko data tarteen hautatzailea duen leiho bat dago ikusgai.
fa: کادر گفتگویی حاوی گزینشگر محدوده تاریخ «طراحی مواد» را نمایش می‌دهد.
fil: Nagpapakita ng dialog na naglalaman ng picker ng hanay ng petsa ng Material Design.
fr_ca: Affiche une boîte de dialogue comportant un outil Material Design de sélection de périodes.
gl: Mostra un cadro de diálogo que inclúe un selector de intervalo de datas de Material Design.
gu: મટિરિયલ ડિઝાઇનની તારીખની શ્રેણીનું પિકર ધરાવતો કોઈ સંવાદ બતાવે છે.
he: במסך מוצגת תיבת דו-שיח שמכילה כלי של Material Design לבחירת טווח תאריכים.
hi: यह ऐसा डायलॉग दिखाता है जिसमें मटीरियल डिज़ाइन वाला टूल मौजूद होता है, जिससे तारीख की सीमा चुन सकते हैं.
hu: Anyagszerű megjelenéssel rendelkező dátumtartomány-választót tartalmazó párbeszédpanelt jelenít meg.
hy: Ցուցադրում է երկխոսության պատուհան, որը պարունակում է Material Design-ի ոճով ամսաթվերի միջակայքի ընտրիչ։
id: Menampilkan dialog yang berisi pemilih rentang tanggal Desain Material.
it: Viene mostrata una finestra di dialogo contenente un selettore di intervallo di date di Material Design.
ja: マテリアル デザインの期間選択ツールを含むダイアログが表示されます。
ka: აჩვენებს დიალოგს, რომელიც შეიცავს Material Design-ის თარიღის ამომრჩევს.
km: បង្ហាញ​ប្រអប់ ដែលមាន​ផ្ទាំងជ្រើសរើសចន្លោះ​កាលបរិច្ឆេទ​ដែលមានការរចនាគ្រប់ជ្រុងជ្រោយ។
kn: ವಸ್ತು ವಿನ್ಯಾಸವು, ದಿನಾಂಕ ವ್ಯಾಪ್ತಿ ಪಿಕರ್ ಹೊಂದಿರುವ ಡೈಲಾಗ್ ಅನ್ನು ತೋರಿಸುತ್ತದೆ.
ko: 머티리얼 디자인의 기간 선택 도구가 포함된 대화상자를 표시합니다.
ky: Material Design даталар диапазонун тандагыч камтылган диалогду көрсөтөт.
lo: ສະແດງກ່ອງໂຕ້ຕອບທີ່ມີຕົວເລືອກໄລຍະວັນທີແບບ Material Design.
lt: Rodomas dialogo langas, kuriame pateikiamas trimačių objektų dizaino datos rinkiklis.
lv: Tiek rādīts dialoglodziņš ar materiāla dizaina datumu diapazona atlasītāju.
mk: Прикажува дијалог што содржи избирач на временски период во Material Design.
ml: മെറ്റീരിയൽ ഡിസൈൻ തീയതി ശ്രേണി പിക്കർ ഉള്ള ഡയലോഗ് കാണിക്കുന്നു.
mn: Материалын загварын хугацааны интервал сонгогчийг агуулсан харилцах цонхыг харуулна.
mr: मटेरियल डिझाइन याची तारीख रेंज पिकर असलेला डायलॉग दाखवतो.
ms: Menunjukkan dialog yang mengandungi pemilih julat tarikh Reka Bentuk Bahan.
my: Material Design ရက်အပိုင်းအခြား ရွေးစနစ်ပါဝင်သော ဒိုင်ယာလော့ကို ပြပေးသည်။
nb: Viser en dialogboks med en datoperiodevelger i Material Design-stil.
ne: सामग्रीको डिजाइनको मितिको दायरा पिकर समावेश भएको डायलग देखाउँछ।
pa: ਮੈਟੀਰੀਅਲ ਡਿਜ਼ਾਈਨ ਦੇ ਤਾਰੀਖ ਦੀ ਰੇਂਜ ਸੰਬੰਧੀ ਚੋਣਕਾਰ ਵਾਲੀ ਵਿੰਡੋ ਦਿਖਾਉਂਦਾ ਹੈ।
pl: Wyświetla okno z selektorem zakresu dat w stylu Material Design.
pt: Mostra uma caixa de diálogo com um seletor de período do Material Design.
pt_pt: Apresenta uma caixa de diálogo que contém um selecionador do intervalo de datas do Material Design.
ro: Afișează o casetă de dialog cu un selector al intervalului de date pentru Design material.
ru: Диалоговое окно в стиле Material Design, в котором можно выбрать диапазон дат.
si: ද්‍රව්‍යමය සැලසුම් දින තෝරකය අඩංගු වන සංවාදයක් පෙන්වයි.
sk: Zobrazuje dialógové okno výberu dátumu so vzhľadom Material Design.
sq: Shfaq një dialog që përfshin një zgjedhës të diapazonit të datave me dizajnin e materialit.
sr: Приказује дијалог са бирачем датума материјалног дизајна.
sr_latn: Prikazuje dijalog sa biračem datuma materijalnog dizajna.
sv: Visar en dialogruta med en väljare för datumintervall i Material Design.
te: మెటీరియల్ డిజైన్ తేదీ పరిధి పికర్‌ను కలిగి ఉండే డైలాగ్‌ను చూపుతుంది.
th: แสดงกล่องโต้ตอบที่มีเครื่องมือเลือกช่วงวันที่แบบ Material Design
tr: Materyal Tasarıma sahip tarih seçici içeren bir iletişim kutusu gösterir.
uk: Показує вікно з інструментом вибору діапазону дат із матеріальним дизайном.
ur: مٹیریل ڈیزائن کی تاریخ کی حد منتخب کنندہ پر مشتمل ڈائیلاگ دکھاتا ہے۔
uz: Material Design uslubidagi oyna orqali sana oraligʻini tanlash mumkin.
vi: Hiện hộp thoại chứa bộ chọn phạm vi ngày Material Design.
zh_hk: 顯示載有 Material Design 日期範圍點選器的對話框。
zu: Ibonisa ibhokisi eliqukethe ibanga lelanga lokukhetha Idizayini Ebalulekile.

# demoDateRangePickerTitle
source: Date Range Picker
af: Datumreekskieser
am: ከ..እስከ ቀን መራጭ
ar_eg: أداة اختيار المرحلة الزمنية
as: তাৰিখৰ পৰিসৰ বাছনি কৰোঁতা
az: Tarix Aralığı Seçicisi
be: Сродак выбару дыяпазону дат
bn: ডেট রেঞ্জ চয়নকারী
bs: Birač raspona datuma
ca: Selector d'intervals de dates
da: Datointervalvælger
es_ar: Selector de períodos
et: Kuupäevavahemiku valija
eu: Data tarteen hautatzailea
fa: گزینشگر محدوده تاریخ
fil: Picker ng Hanay ng Petsa
fr_ca: Sélecteur de périodes
gl: Selector de intervalo de datas
gu: તારીખની શ્રેણીનું પિકર
he: כלי לבחירת טווח תאריכים
hi: तारीख की सीमा चुनने की सुविधा
hu: Dátumtartomány-választó
hy: Ամսաթվերի միջակայքի ընտրիչ
id: Pemilih Rentang Tanggal
it: Selettore intervallo di date
ja: 期間選択ツール
ka: თარიღების დიაპაზონის ამომრჩევი
km: ផ្ទាំងជ្រើសរើសចន្លោះកាលបរិច្ឆេទ
kn: ದಿನಾಂಕ ವ್ಯಾಪ್ತಿಯ ಪಿಕರ್
ko: 기간 선택 도구
ky: Даталар диапазонун тандагыч
lo: ຕົວເລືອກໄລຍະວັນທີ
lt: Dienų sekos rinkiklis
lv: Datumu diapazona atlasītājs
mk: Избирач на временски период
ml: തീയതി ശ്രേണി പിക്കർ
mn: Хугацааны интервал сонгогч
mr: तारीख रेंज पिकर
ms: Pemilih Julat Tarikh
my: ရက်အပိုင်းအခြား ရွေးစနစ်
nb: Datoperiodevelger
ne: मितिको दायरा पिकर
pa: ਤਾਰੀਖ ਦੀ ਰੇਂਜ ਸੰਬੰਧੀ ਚੋਣਕਾਰ
pl: Selektor zakresu dat
pt: Seletor de período
pt_pt: Selecionador do intervalo de datas
ro: Selector pentru intervalul de date
ru: Выбор диапазона дат
si: දින පරාස තෝරකය
sk: Výber obdobia
sq: Zgjedhësi i diapazonit të datave
sr: Бирач периода
sr_latn: Birač perioda
sv: Väljare för datumintervall
te: తేదీల పరిధి పికర్
th: เครื่องมือเลือกช่วงวันที่
tr: Tarih Aralığı Seçici
uk: Засіб вибору діапазону дат
ur: تاریخ کی حد منتخب کنندہ
uz: Sana oraligʻini tanlagich
vi: Bộ chọn phạm vi ngày
zh_hk: 日期範圍點選器
zu: Ibanga Lelanga Lokukhetha
