Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# craneFly6
source: Mexico City, Mexico
af: Meksikostad, Meksiko
am: ሜክሲኮ ሲቲ፣ ሜክሲኮ
ar_eg: مكسيكو سيتي، المكسيك
as: মেক্সিক’ চহৰ, মেক্সিক’
az: Mexiko şəhəri, Meksika
be: Мехіка, Мексіка
bn: মেক্সিকো সিটি, মেক্সিকো
bs: Mexico City, Meksiko
ca: Ciutat de Mèxic, Mèxic
es_ar: Ciudad de México, México
et: Mexico City, Mehhiko
eu: Mexiko Hiria (Mexiko)
fa: مکزیکو سیتی، مکزیک
fr_ca: Mexico, Mexique
gl: Cidade de México, México
gu: મેક્સિકો સિટી, મેક્સિકો
he: מקסיקו סיטי, מקסיקו
hi: मेक्सिको सिटी, मेक्सिको
hu: Mexikóváros, Mexikó
hy: Մեխիկո, Մեքսիկա
id: Meksiko, Meksiko
it: Città del Messico, Messico
ja: メキシコシティ（メキシコ）
ka: მეხიკო, მექსიკა
km: ទីក្រុង​ម៉ិកស៊ិក ប្រទេស​ម៉ិកស៊ិក
kn: ಮೆಕ್ಸಿಕೋ ನಗರ, ಮೆಕ್ಸಿಕೋ
ko: 멕시코 멕시코시티
ky: Мехико, Мексика
lo: ເມັກຊິກໂກ​ຊິຕີ, ເມັກ​ຊິ​ໂກ
lt: Meksikas, Meksika
lv: Mehiko, Meksika
mk: Мексико Сити, Мексико
ml: മെക്‌സിക്കോ സിറ്റി, മെക്‌സിക്കോ
mn: Мексик улс, Мексик хот
mr: मेक्सिको शहर, मेक्‍सिको
my: မက္ကဆီကိုမြို့၊ မက္ကဆီကို
nb: Mexico by, Mexico
ne: मेक्सिको सिटी, मेक्सिको
pa: ਮੈਕਸੀਕੋ ਸ਼ਹਿਰ, ਮੈਕਸੀਕੋ
pl: Meksyk (miasto), Meksyk
pt: Cidade do México, México
pt_pt: Cidade do México, México
ro: Ciudad de Mexico, Mexic
ru: Мехико, Мексика
si: මෙක්සිකෝ නගරය, මෙක්සිකෝව
sk: Mexiko (mesto), Mexiko
sq: Meksiko, Meksikë
sr: Мексико Сити, Мексико
sr_latn: Meksiko Siti, Meksiko
sv: Mexico City, Mexiko
te: మెక్సికో నగరం, మెక్సికో
th: เม็กซิโกซิตี้ เม็กซิโก
tr: Mexico City, Meksika
uk: Мехіко, Мексика
ur: میکسیکو سٹی، میکسیکو
uz: Mexiko, Meksika
vi: Thành phố Mexico, Mexico
zh_hk: 墨西哥墨西哥城
zu: I-Mexico City, Mexico

# craneFly7
source: Mount Rushmore, United States
af: Mount Rushmore, Verenigde State
am: ራሽሞር ተራራ፣ አሜሪካ
ar_eg: جبل راشمور، الولايات المتحدة
as: মাউণ্ট ৰাশ্বম'ৰ, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Raşmor dağı, ABŞ
be: Гара Рашмар, ЗША
bn: মাউন্ট রুসমোর, মার্কিন যুক্তরাষ্ট্র
bs: Planina Rushmore, Sjedinjene Američke Države
ca: Mont Rushmore, Estats Units
da: Mount Rushmore, USA
es_ar: Monte Rushmore, Estados Unidos
et: Mount Rushmore, Ameerika Ühendriigid
eu: Rushmore mendia (Ameriketako Estatu Batuak)
fa: مونت راشمور، ایالات متحده
fr_ca: Mount Rushmore, États-Unis
gl: Monte Rushmore, Estados Unidos
gu: માઉન્ટ રુશમોરે, યુનાઇટેડ સ્ટેટ્સ
he: הר ראשמור, ארצות הברית
hi: माउंट रशमोर, अमेरिका
hu: Rushmore-hegy, Amerikai Egyesült Államok
hy: Ռաշմոր լեռ, ԱՄՆ
id: Gunung Rushmore, Amerika Serikat
it: Monte Rushmore, Stati Uniti
ja: ラシュモア山（米国）
ka: რუშმორის მთა, შეერთებული შტატები
km: ភ្នំ​រ៉ាស្សម៉រ សហរដ្ឋ​អាមេរិក
kn: ಮೌಂಟ್ ರಶ್ಮೋರ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 러시모어산
ky: Рашмор тоосу, Америка Кошмо Штаттары
lo: ພູຣັຊມໍ, ສະຫະລັດ
lt: Rašmoro Kalnas, Jungtinės Amerikos Valstijos
lv: Rašmora kalns, ASV
mk: Маунт Рашмор, САД
ml: മൗണ്ട് റഷ്മോർ, യുണൈറ്റഡ് സ്‌റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Рашмор
mr: माउंट रशमोर, युनायटेड स्टेट्स
ms: Mount Rushmore, Amerika Syarikat
my: ရပ်ရှ်မောတောင်၊ အမေရိကန် ပြည်ထောင်စု
nb: Mount Rushmore, USA
ne: माउन्ट रसमोर, संयुक्त राज्य अमेरिका
pa: ਮਾਊਂਟ ਰਸ਼ਮੋਰ, ਸੰਯੁਕਤ ਰਾਜ
pl: Mount Rushmore, Stany Zjednoczone
pt: Monte Rushmore, Estados Unidos
pt_pt: Monte Rushmore, Estados Unidos
ro: Muntele Rushmore, Statele Unite
ru: Гора Рашмор, США
si: මවුන්ට් රෂ්මෝර්, එක්සත් ජනපදය
sk: Mount Rushmore, USA
sq: Mali Rushmore, Shtetet e Bashkuara
sr: Маунт Рашмор, Сједињене Америчке Државе
sr_latn: Maunt Rašmor, Sjedinjene Američke Države
sv: Mount Rushmore, USA
te: మౌంట్ రష్మోర్, యునైటెడ్ స్టేట్స్
th: ภูเขารัชมอร์ สหรัฐอเมริกา
tr: Rushmore Dağı, ABD
uk: Гора Рашмор, США
ur: ماؤنٹ رشمور، ریاستہائے متحدہ امریکہ
uz: Rashmor togʻi, AQSH
vi: Núi Rushmore, Hoa Kỳ
zh_hk: 美國拉什莫爾山
zu: I-Mount Rushmore, United States

# settingsTextDirectionLocaleBased
source: Based on locale
af: Gegrond op locale
am: በአካባቢ ላይ በመመርኮዝ
ar_eg: بناءً على اللغة
as: ল’কেল ভিত্তিক
az: Yerli xüsusiyyətlərə əsaslanır
be: На падставе рэгіянальных налад
bn: লোকেলের উপর ভিত্তি করে
bs: Na osnovu jezika/zemlje
ca: Segons la configuració regional
da: Baseret på landestandard
es_ar: En función de la configuración regional
et: Põhineb lokaadil
eu: Lurraldeko ezarpenetan oinarrituta
fa: براساس منطقه زبانی
fil: Batay sa lokalidad
fr_ca: Selon le lieu
gl: Baseada na configuración rexional
gu: લોકેલ પર આધારિત
he: על סמך לוקאל
hi: स्थानीय भाषा के हिसाब से
hu: A nyelv- és országbeállítás alapján
hy: Տարածաշրջանային կարգավորումներ
id: Berdasarkan lokal
it: In base alla lingua
ja: 言語 / 地域に基づく
ka: ლოკალის მიხედვით
km: ផ្អែកលើ​ភាសា
kn: ಸ್ಥಳೀಯ ಭಾಷೆಯನ್ನು ಆಧರಿಸಿದೆ
ko: 언어 기준
ky: Тилдин негизинде
lo: ອ້າງອີງຈາກພາສາ
lt: Pagal lokalę
lv: Pamatojoties uz lokalizāciju
mk: Според локација
ml: ഭാഷാടിസ്ഥാനത്തിൽ
mn: Хэл болон улсын код дээр суурилсан
mr: लोकॅलवर आधारित
ms: Berdasarkan tempat peristiwa
my: ဘာသာစကားနှင့် နိုင်ငံအသုံးအနှုန်းအပေါ် အခြေခံထားသည်
nb: Basert på lokalitet
ne: लोकेलमा आधारित
pa: ਲੋਕੇਲ ਦੇ ਆਧਾਰ 'ਤੇ
pl: Na podstawie regionu
pt: Com base na localidade
pt_pt: Com base no local
ro: În funcție de codul local
ru: Региональные настройки
si: පෙදෙසිය මත පදනම්
sk: Na základe miestneho nastavenia
sq: Bazuar në cilësimet lokale
sr: На основу локалитета
sr_latn: Na osnovu lokaliteta
sv: Utifrån språkkod
te: లొకేల్ ఆధారంగా
th: อิงตามภาษา
tr: Yerel ayara göre
uk: На основі мовного коду
ur: مقام کی بنیاد پر
uz: Mamlakat soliqlari asosida
vi: Dựa trên vị trí
zh_hk: 根據語言代碼設定
zu: Kususelwa kokwasendaweni

# craneFly9
source: Havana, Cuba
af: Havana, Kuba
am: ሃቫና፣ ኩባ
ar_eg: هافانا، كوبا
as: হানাভা, কিউবা
az: Havana, Kuba
be: Гавана, Куба
bn: হাভানা, কিউবা
bs: Havana, Kuba
ca: L'Havana, Cuba
es_ar: La Habana, Cuba
et: Havanna, Kuuba
eu: Habana (Kuba)
fa: هاوانا، کوبا
fr_ca: La Havane, Cuba
gl: A Habana, Cuba
gu: હવાના, ક્યૂબા
he: הוואנה, קובה
hi: हवाना, क्यूबा
hu: Havanna, Kuba
hy: Հավանա, Կուբա
id: Havana, Kuba
it: L'Avana, Cuba
ja: ハバナ（キューバ）
ka: ჰავანა, კუბა
km: ហាវ៉ាណា គុយបា
kn: ಹವಾನಾ, ಕ್ಯೂಬಾ
ko: 쿠바 아바나
ky: Гавана, Куба
lo: ຮາວານາ, ຄິວບາ
lt: Havana, Kuba
lv: Havana, Kuba
mk: Хавана, Куба
ml: ഹവാന, ക്യൂബ
mn: Куба, Хавана
mr: हवाना, क्यूबा
my: ဟာဗားနား၊ ကျူးဘား
ne: हवाना, क्युबा
pa: ਹਵਾਨਾ, ਕਿਊਬਾ
pl: Hawana, Kuba
ru: Гавана, Куба
si: හවානා, කියුබාව
sk: Havana, Kuba
sq: Havanë, Kubë
sr: Хавана, Куба
sr_latn: Havana, Kuba
sv: Havanna, Kuba
te: హవానా, క్యూబా
th: ฮาวานา คิวบา
tr: Havana, Küba
uk: Гавана, Куба
ur: ہوانا، کیوبا
uz: Gavana, Kuba
zh_hk: 古巴哈瓦那
zu: I-Havana, Cuba

# craneFly10
source: Cairo, Egypt
af: Kaïro, Egipte
am: ካይሮ፣ ግብጽ
ar_eg: القاهرة، مصر
as: কাইৰ', ঈজিপ্ত
az: Qahirə, Misir
be: Каір, Егіпет
bn: কায়েরো, মিশর
bs: Kairo, Egipat
ca: El Caire, Egipte
da: Cairo, Egypten
es_ar: El Cairo, Egipto
et: Kairo, Egiptus
eu: Kairo (Egipto)
fa: قاهره، مصر
fr_ca: Le Caire, Égypte
gl: O Cairo, Exipto
gu: કેરો, ઇજિપ્ત
he: קהיר, מצרים
hi: काहिरा, मिस्र
hu: Kairó, Egyiptom
hy: Կահիրե, Եգիպտոս
id: Kairo, Mesir
it: Il Cairo, Egitto
ja: カイロ（エジプト）
ka: კაირო, ეგვიპტე
km: គែរ អេហ្ស៊ីប
kn: ಕೈರೊ, ಈಜಿಪ್ಟ್
ko: 이집트 카이로
ky: Каир, Египет
lo: ໄຄໂຣ, ອີ​ຢິບ
lt: Kairas, Egiptas
lv: Kaira, Ēģipte
mk: Каиро, Египет
ml: കെയ്‌റോ, ഈജിപ്ത്
mn: Египет, Каир
mr: कैरो, इजिप्त
ms: Kaherah, Mesir
my: ကိုင်ရို၊ အီဂျစ်
nb: Kairo, Egypt
ne: कायरो, इजिप्ट
pa: ਕਾਹਿਰਾ, ਮਿਸਰ
pl: Kair, Egipt
pt: Cairo, Egito
pt_pt: Cairo, Egito
ro: Cairo, Egipt
ru: Каир, Египет
si: කයිරෝ, ඊජිප්තුව
sk: Káhira, Egypt
sq: Kajro, Egjipt
sr: Каиро, Египат
sr_latn: Kairo, Egipat
sv: Kairo, Egypten
te: కైరో, ఈజిప్ట్
th: ไคโร อียิปต์
tr: Kahire, Mısır
uk: Каїр, Єгипет
ur: قاہرہ، مصر
uz: Qohira, Misr
vi: Cairo, Ai Cập
zh_hk: 埃及開羅
zu: I-Cairo, Egypt

# craneFly11
source: Lisbon, Portugal
af: Lissabon, Portugal
am: ሊዝበን፣ ፖርቱጋል
ar_eg: لشبونة، البرتغال
as: লিছবন, পর্তুগাল
az: Lissabon, Portuqaliya
be: Лісабон, Партугалія
bn: লিসবন, পর্তুগাল
bs: Lisabon, Portugal
ca: Lisboa, Portugal
da: Lissabon, Portugal
es_ar: Lisboa, Portugal
et: Lissabon, Portugal
eu: Lisboa (Portugal)
fa: لیسبون، پرتغال
fr_ca: Lisbonne, Portugal
gl: Lisboa, Portugal
gu: લિસ્બન, પોર્ટુગલ
he: ליסבון, פורטוגל
hi: लिस्बन, पुर्तगाल
hu: Lisszabon, Portugália
hy: Լիսաբոն, Պորտուգալիա
it: Lisbona, Portogallo
ja: リスボン（ポルトガル）
ka: ლისაბონი, პორტუგალია
km: លីសបោន ព័រទុយហ្គាល់
kn: ಲಿಸ್ಬನ್, ಪೋರ್ಚುಗಲ್
ko: 포르투갈 리스본
ky: Лиссабон, Португалия
lo: ລິສບອນ, ປໍຕູກອລ
lt: Lisabona, Portugalija
lv: Lisabona, Portugāle
mk: Лисабон, Португалија
ml: ലിസ്ബൺ, പോർച്ചുഗൽ
mn: Португал, Лисбон
mr: लिस्बन, पोर्तुगाल
my: လစ္စဘွန်း၊ ပေါ်တူဂီ
nb: Lisboa, Portugal
ne: लिसबन, पोर्तुगल
pa: ਲਿਸਬਨ, ਪੁਰਤਗਾਲ
pl: Lizbona, Portugalia
pt: Lisboa, Portugal
pt_pt: Lisboa, Portugal
ro: Lisabona, Portugalia
ru: Лиссабон, Португалия
si: ලිස්බන්, පෘතුගාලය
sk: Lisabon, Portugalsko
sq: Lisbonë, Portugali
sr: Лисабон, Португалија
sr_latn: Lisabon, Portugalija
sv: Lissabon, Portugal
te: లిస్బన్, పోర్చుగల్
th: ลิสบอน โปรตุเกส
tr: Lizbon, Portekiz
uk: Лісабон, Португалія
ur: لسبن، پرتگال
uz: Lissabon, Portugaliya
vi: Lisbon, Bồ Đào Nha
zh_hk: 葡萄牙里斯本
zu: I-Lisbon, e-Portugal

# craneFly12
source: Napa, United States
af: Napa, Verenigde State
am: ናፓ፣ አሜሪካ
ar_eg: نابا، الولايات المتحدة
as: নাপা, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Napa, ABŞ
be: Напа, ЗША
bn: নাপা, মার্কিন যুক্তরাষ্ট্র
bs: Napa, Sjedinjene Američke Države
ca: Napa, Estats Units
da: Napa, USA
es_ar: Napa, Estados Unidos
et: Napa, Ameerika Ühendriigid
eu: Napa (Ameriketako Estatu Batuak)
fa: ناپا، ایالات متحده
fr_ca: Napa, États-Unis
gl: Napa, Estados Unidos
gu: નાપા, યુનાઇટેડ સ્ટેટ્સ
he: נאפה, ארצות הברית
hi: नापा, अमेरिका
hu: Napa, Amerikai Egyesült Államok
hy: Նապա, ԱՄՆ
id: Napa, Amerika Serikat
it: Napa, Stati Uniti
ja: ナパ（米国）
ka: ნაპა, შეერთებული შტატები
km: ណាប៉ា សហរដ្ឋ​អាមេរិក
kn: ನಾಪಾ, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 나파
ky: Напа, Америка Кошмо Штаттары
lo: ນາປາ, ສະຫະລັດ
lt: Napa, Jungtinės Amerikos Valstijos
lv: Napa, ASV
mk: Напа, САД
ml: നാപ്പ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Напа
mr: नापा, युनायटेड स्टेट्स
ms: Napa, Amerika Syarikat
my: နာပါ၊ အမေရိကန် ပြည်ထောင်စု
nb: Napa, USA
ne: नापा, संयुक्त राज्य अमेरिका
pa: ਨੈਪਾ, ਸੰਯੁਕਤ ਰਾਜ
pl: Napa, Stany Zjednoczone
pt: Napa, Estados Unidos
pt_pt: Napa, Estados Unidos
ro: Napa, Statele Unite
ru: Напа, США
si: නාපා, එක්සත් ජනපදය
sk: Napa, USA
sq: Napa, Shtetet e Bashkuara
sr: Напа, Сједињене Америчке Државе
sr_latn: Napa, Sjedinjene Američke Države
sv: Napa, USA
te: నాపా, యునైటెడ్ స్టేట్స్
th: นาปา สหรัฐอเมริกา
tr: Napa, ABD
uk: Напа, США
ur: ناپا، ریاستہائے متحدہ
uz: Napa, AQSH
vi: Napa, Hoa Kỳ
zh_hk: 美國納帕
zu: I-Napa, United States

# craneFly13
source: Bali, Indonesia
af: Bali, Indonesië
am: ባሊ፣ ኢንዶኔዥያ
ar_eg: بالي، إندونيسيا
as: বালি, ইণ্ডোনেছিয়া
az: Bali, İndoneziya
be: Балі, Інданезія
bn: বালি, ইন্দোনেশিয়া
bs: Bali, Indonezija
ca: Bali, Indonèsia
da: Bali, Indonesien
et: Bali, Indoneesia
fa: بالی، اندونزی
fr_ca: Bali, Indonésie
gu: બાલી, ઇન્ડોનેશિયા
he: באלי, אינדונזיה
hi: बाली, इंडोनेशिया
hu: Bali, Indonézia
hy: Բալի, Ինդոնեզիա
ja: バリ島（インドネシア）
ka: ბალი, ინდონეზია
km: បាលី ឥណ្ឌូណេស៊ី
kn: ಬಾಲಿ, ಇಂಡೋನೇಷ್ಯಾ
ko: 인도네시아, 발리
ky: Бали, Индонезия
lo: ບາຫຼີ, ອິນໂດເນເຊຍ
lt: Balis, Indonezija
lv: Bali, Indonēzija
mk: Бали, Индонезија
ml: ബാലി, ഇന്തോനേഷ്യ
mn: Индонез, Бали
mr: बाली, इंडोनेशिया
my: ဘာလီ၊ အင်ဒိုနီးရှား
ne: बाली, इन्डोनेसिया
pa: ਬਾਲੀ, ਇੰਡੋਨੇਸ਼ੀਆ
pl: Bali, Indonezja
pt: Bali, Indonésia
pt_pt: Bali, Indonésia
ro: Bali, Indonezia
ru: Бали, Индонезия
si: බාලි, ඉන්දුනීසියාව
sk: Bali, Indonézia
sq: Bali, Indonezi
sr: Бали, Индонезија
sr_latn: Bali, Indonezija
sv: Bali, Indonesien
te: బాలి, ఇండోనేషియా
th: บาหลี อินโดนีเซีย
tr: Bali, Endonezya
uk: Балі, Індонезія
ur: بالی، انڈونیشیا
uz: Bali, Indoneziya
zh_hk: 印尼峇里
zu: I-Bali, Indonesia

# craneSleep0
source: Malé, Maldives
af: Malé, Maledive
am: ማሌ፣ ማልዲቭስ
ar_eg: ماليه، جزر المالديف
as: মালে, মালদ্বীপ
az: Male, Maldiv adaları
be: Мале, Мальдывы
bn: মালে, মালদ্বীপ
bs: Malé, Maldivi
ca: Male, Maldives
da: Malé, Maldiverne
es_ar: Malé, Maldivas
et: Malé, Maldiivid
eu: Malé (Maldivak)
fa: ماله، مالدیو
gl: Malé, Maldivas
gu: માલી, માલદીવ્સ
he: מאלה, האיים המלדיביים
hi: माले, मालदीव
hu: Malé, Maldív-szigetek
hy: Մալե, Մալդիվներ
id: Malé, Maladewa
it: Malé, Maldive
ja: マレ（モルディブ）
ka: მალე, მალდივები
km: ម៉ាល ម៉ាល់ឌីវ
kn: ಮಾಲೆ, ಮಾಲ್ಡೀವ್ಸ್
ko: 몰디브 말레
ky: Мале, Мальдив аралдары
lo: ມາເລ່​, ມັລດີຟ
lt: Malė, Maldyvai
lv: Male, Maldīvu salas
mk: Мале, Малдиви
ml: മാലി, മാലദ്വീപുകൾ
mn: Мальдив, Мале
mr: मेल, मालदीव
my: မာလီ၊ မော်လဒိုက်
nb: Malé, Maldivene
ne: मेल, माल्दिभ्स
pa: ਮਾਲੇ, ਮਾਲਦੀਵ
pl: Malé, Malediwy
pt: Malé, Maldivas
pt_pt: Malé, Maldivas
ro: Malé, Maldive
ru: Мале, Мальдивы
si: මාලේ, මාලදිවයින
sk: Malé, Maldivy
sr: Мале, Малдиви
sr_latn: Male, Maldivi
sv: Malé, Maldiverna
te: మాలే, మాల్దీవులు
th: มาเล มัลดีฟส์
tr: Malé, Maldivler
uk: Мале, Мальдіви
ur: مالے، مالدیپ
uz: Male, Maldiv orollari
zh_hk: 馬爾代夫馬累
zu: I-Malé, Maldives

# craneSleep1
source: Aspen, United States
af: Aspen, Verenigde State
am: አስፐን፣ አሜሪካ
ar_eg: أسبن، الولايات المتحدة
as: এছপেন, মার্কিন যুক্তৰাষ্ট্ৰ
az: Aspen, ABŞ
be: Аспен, ЗША
bn: অ্যাসপেন, মার্কিন যুক্তরাষ্ট্র
bs: Aspen, Sjedinjene Američke Države
ca: Aspen, Estats Units
da: Aspen, USA
es_ar: Aspen, Estados Unidos
et: Aspen, Ameerika Ühendriigid
eu: Aspen (Ameriketako Estatu Batuak)
fa: آسپن، ایالات متحده
fr_ca: Aspen, États-Unis
gl: Aspen, Estados Unidos
gu: અસ્પેન, યુનાઇટેડ સ્ટેટ્સ
he: אספן, ארצות הברית
hi: ऐस्पन, अमेरिका
hu: Aspen, Amerikai Egyesült Államok
hy: Ասպեն, ԱՄՆ
id: Aspen, Amerika Serikat
it: Aspen, Stati Uniti
ja: アスペン（米国）
ka: ასპენი, შეერთებული შტატები
km: អាស្ប៉ិន សហរដ្ឋ​អាមេរិក
kn: ಆಸ್ಪೆನ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 애스펀
ky: Аспен, Америка Кошмо Штаттары
lo: ແອສເພນ, ສະຫະລັດ
lt: Aspenas, Jungtinės Amerikos Valstijos
lv: Espena, ASV
mk: Аспен, САД
ml: ആസ്പെൻ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Аспен
mr: ॲस्पेन, युनायटेड स्टेट्स
ms: Aspen, Amerika Syarikat
my: အက်စ်ပန်၊ အမေရိကန် ပြည်ထောင်စု
nb: Aspen, USA
ne: एस्पेन, संयुक्त राज्य अमेरिका
pa: ਐਸਪਨ, ਸੰਯੁਕਤ ਰਾਜ
pl: Aspen, Stany Zjednoczone
pt: Aspen, Estados Unidos
pt_pt: Aspen, Estados Unidos
ro: Aspen, Statele Unite
ru: Аспен, США
si: ඇස්පෙන්, එක්සත් ජනපදය
sk: Aspen, USA
sr: Аспен, Сједињене Америчке Државе
sr_latn: Aspen, Sjedinjene Američke Države
sv: Aspen, USA
te: ఆస్పెన్, యునైటెడ్ స్టేట్స్
th: แอสเพน สหรัฐอเมริกา
tr: Aspen, ABD
uk: Аспен, США
ur: اسپین، ریاستہائے متحدہ
uz: Aspen, AQSH
vi: Aspen, Hoa Kỳ
zh_hk: 美國阿斯彭
zu: I-Aspen, United States

# craneSleep2
source: Machu Picchu, Peru
am: ማቹ ፒቹ፣ ፔሩ
ar_eg: ماتشو بيتشو، بيرو
as: মাশ্বু পিচশ্বু, পেৰু
az: Maçu Pikçu, Peru
be: Мачу-Пікчу, Перу
bn: মাচু পিচ্চু, পেরু
ca: Machu Picchu, Perú
es_ar: Machu Picchu, Perú
et: Machu Picchu, Peruu
fa: ماچوپیچو، پرو
fr_ca: Machu Picchu, Pérou
gl: Machu Picchu, Perú
gu: માચુ પિચ્ચુ, પેરુ
he: מאצ'ו פיצ'ו, פרו
hi: माचू पिच्चू, पेरू
hy: Մաչու Պիկչու, Պերու
it: Machu Picchu, Perù
ja: マチュピチュ（ペルー）
ka: მაჩუ-პიკჩუ, პერუ
km: ម៉ាឈូភីឈូ ប៉េរូ
kn: ಮಾಚು ಪಿಚು, ಪೆರು
ko: 페루 마추픽추
ky: Мачу-Пичу, Перу
lo: ມາຈູ ພິຈູ​, ເປ​ຣູ
lt: Maču Pikču, Peru
lv: Maču Pikču, Peru
mk: Мачу Пикчу, Перу
ml: മാച്ചു പിച്ചു, പെറു
mn: Перу, Мачу Пикчу
mr: माचू पिचू, पेरू
my: မာချူ ပီချူ၊ ပီရူး
ne: माचू पिक्चू, पेरु
pa: ਮਾਚੂ ਪਿਕਚੂ, ਪੇਰੂ
ru: Мачу-Пикчу, Перу
si: මාචු පික්කූ, පේරු
sq: Maçu Piçu, Peru
sr: Мачу Пикчу, Перу
sr_latn: Maču Pikču, Peru
te: మాచు పిచ్చు, పెరూ
th: มาชูปิกชู เปรู
uk: Мачу-Пікчу, Перу
ur: ماچو پچو، پیرو
uz: Machu-Pikchu, Peru
zh_hk: 秘魯馬丘比丘
zu: I-Machu Picchu, Peru

# demoCupertinoSegmentedControlTitle
source: Segmented control
af: Gesegmenteerde kontrole
am: የተከፋፈለ መቆጣጠሪያ
ar_eg: عنصر تحكّم شريحة
as: বিভাজিত নিয়ন্ত্ৰণ
az: Seqmentləşdirilmiş nəzarət
be: Сегментаваныя элементы кіравання
bn: বিভাগীয় নিয়ন্ত্রণ
bs: Segmentirano kontroliranje
ca: Control segmentat
da: Segmenteret styring
es_ar: Control segmentado
et: Segmenditud juhtimine
eu: Segmentatutako kontrola
fa: کنترل تقسیم‌بندی‌شده
fil: Naka-segment na kontrol
fr_ca: Contrôle segmenté
gl: Control segmentado
gu: વિભાગ મુજબ નિયંત્રણ
he: בקרה מחולקת
hi: सेगमेंट में दिए नियंत्रण
hu: Szegmentált vezérlés
hy: Կառավարման սեգմենտավորված տարր
id: Kontrol tersegmen
it: Controllo segmentato
ja: セグメンテッド コントロール
ka: სეგმენტირებული მართვა
km: ការគ្រប់គ្រង​ដែល​បែងចែក​ជាផ្នែក
kn: ವಿಭಾಗೀಕರಣದ ನಿಯಂತ್ರಣ
ko: 세그먼트 컨트롤
ky: Сегменттер боюнча көзөмөлдөө
lo: ການຄວບຄຸມແບບແຍກສ່ວນ
lt: Segmentuotas valdiklis
lv: Segmentēta pārvaldība
mk: Сегментирана контрола
ml: വിഭാഗീകരിച്ച നിയന്ത്രണം
mn: Хэсэгчилсэн хяналт
mr: विभाजित नियंत्रण
ms: Kawalan disegmenkan
my: အပိုင်းလိုက် ထိန်းချုပ်မှု
nb: Segmentert kontroll
ne: सेग्मेन्ट गरिएका अवयवको नियन्त्रण
pa: ਉਪ-ਸਮੂਹ ਕੰਟਰੋਲ
pl: Sterowanie segmentowe
pt: Controle segmentado
pt_pt: Controlo segmentado
ro: Control segmentat
ru: Сегментированный элемент управления
si: කොටස් කළ පාලනය
sk: Segmentované ovládanie
sq: Kontrolli i segmentuar
sr: Сегментирана контрола
sr_latn: Segmentirana kontrola
sv: Segmentstyrning
te: విభజించబడిన నియంత్రణ
th: ตัวควบคุมที่แบ่งกลุ่ม
tr: Bölümlere ayrılmış kontrol
uk: Сегментований контроль
ur: سیگمینٹ کردہ کنٹرول
uz: Segmentlangan boshqaruv elementlari
vi: Chế độ kiểm soát được phân đoạn
zh_hk: 劃分控制
zu: Ulawulo olufakwe kusegmenti

# craneSleep4
source: Vitznau, Switzerland
af: Vitznau, Switserland
am: ቪትዝናው፣ ስዊዘርላንድ
ar_eg: فيتزناو، سويسرا
as: ভিজনাও, ছুইজাৰলেণ্ড
az: Vitznau, İsveçrə
be: Віцнау, Швейцарыя
bn: ভিতজানাউ, সুইজারল্যান্ড
bs: Vitznau, Švicarska
ca: Vitznau, Suïssa
da: Vitznau, Schweiz
es_ar: Vitznau, Suiza
et: Vitznau, Šveits
eu: Vitznau (Suitza)
fa: ویتسناو، سوئیس
fr_ca: Vitznau, Suisse
gl: Vitznau, Suíza
gu: વિઝનાઉ, સ્વિટ્ઝરલૅન્ડ
he: ויצנאו, שווייץ
hi: वित्ज़नेउ, स्विट्ज़रलैंड
hu: Vitznau, Svájc
hy: Վիցնաու, Շվեյցարիա
id: Vitznau, Swiss
it: Vitznau, Svizzera
ja: ヴィッツナウ（スイス）
ka: ვიცნაუ, შვეიცარია
km: វីតស្នោវ ស្វ៊ីស
kn: ವಿಟ್ಜನೌ, ಸ್ವಿಟ್ಜರ್‌ಲ್ಯಾಂಡ್
ko: 스위스 비츠나우
ky: Витзнау, Швейцария
lo: ວິຊເນົາ, ສະວິດເຊີແລນ
lt: Vicnau, Šveicarija
lv: Vicnava, Šveice
mk: Вицнау, Швјцарија
ml: വിറ്റ്‌സ്നോ, സ്വിറ്റ്സർലൻഡ്
mn: Швейцар, Вицнау
mr: फिट्सनाऊ, स्वित्झर्लंड
my: ဗစ်ဇ်နောင်၊ ဆွစ်ဇာလန်
nb: Vitznau, Sveits
ne: भिज्नाउ, स्विट्जरल्यान्ड
pa: ਵਿਟਸਨਾਊ, ਸਵਿਟਜ਼ਰਲੈਂਡ
pl: Vitznau, Szwajcaria
pt: Vitznau, Suíça
pt_pt: Vitznau, Suíça
ro: Vitznau, Elveția
ru: Вицнау, Швейцария
si: විට්ස්නෝ, ස්විට්සර්ලන්තය
sk: Vitznau, Švajčiarsko
sq: Vitznau, Zvicër
sr: Вицнау, Швајцарска
sr_latn: Vicnau, Švajcarska
sv: Vitznau, Schweiz
te: విట్నావ్, స్విట్జర్లాండ్
th: วิทซ์นาว สวิตเซอร์แลนด์
tr: Vitznau, İsviçre
uk: Віцнау, Швейцарія
ur: وٹزناؤ، سوئٹزر لینڈ
uz: Vitsnau, Shveytsariya
vi: Vitznau, Thụy Sĩ
zh_hk: 瑞士維茨瑙
zu: I-Vitznau, Switzerland

# craneSleep5
source: Big Sur, United States
af: Big Sur, Verenigde State
am: ቢግ ሱር፣ አሜሪካ
ar_eg: بيغ سور، الولايات المتحدة
as: বিগ ছুৰ, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Biq Sur, ABŞ
be: Біг-Сур, ЗША
bn: বিগ সার, মার্কিন যুক্তরাষ্ট্র
bs: Big Sur, Sjedinjene Američke Države
ca: Big Sur, Estats Units
da: Big Sur, USA
es_ar: Big Sur, Estados Unidos
et: Big Sur, Ameerika Ühendriigid
eu: Big Sur (Ameriketako Estatu Batuak)
fa: بیگ سور، ایالات متحده
fr_ca: Big Sur, États-Unis
gl: Big Sur, Estados Unidos
gu: બિગ સર, યુનાઇટેડ સ્ટેટ્સ
he: ביג סר, ארצות הברית
hi: बिग सर, अमेरिका
hu: Big Sur, Amerikai Egyesült Államok
hy: Բիգ Սուր, ԱՄՆ
id: Big Sur, Amerika Serikat
it: Big Sur, Stati Uniti
ja: ビッグサー（米国）
ka: ბიგ სური, შეერთებული შტატები
km: ប៊ីកសឺ សហរដ្ឋ​អាមេរិក
kn: ಬಿಗ್ ಸುರ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 빅 서어
ky: Биг-Сур, Америка Кошмо Штаттары
lo: ບິກເຊີ, ສະຫະລັດ
lt: Big Sur, Jungtinės Amerikos Valstijos
lv: Bigsura, ASV
mk: Биг Сур, САД
ml: ബിഗ് സുർ, യുണൈറ്റഡ് സ്‌റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Биг Сур
mr: बिग सुर, युनायटेड स्टेट्स
ms: Big Sur, Amerika Syarikat
my: ဘစ်စာ၊ အမေရိကန် ပြည်ထောင်စု
nb: Big Sur, USA
ne: बिग सुर, संयुक्त राज्य अमेरिका
pa: ਬਿੱਗ ਸਰ, ਸੰਯੁਕਤ ਰਾਜ
pl: Big Sur, Stany Zjednoczone
pt: Big Sur, Estados Unidos
pt_pt: Big Sur, Estados Unidos
ro: Big Sur, Statele Unite
ru: Биг-Сур, США
si: බිග් සර්, එක්සත් ජනපදය
sk: Big Sur, USA
sq: Big Sur, Shtetet e Bashkuara
sr: Биг Сур, Сједињене Америчке Државе
sr_latn: Big Sur, Sjedinjene Američke Države
sv: Big Sur, USA
te: బిగ్ సర్, యునైటెడ్ స్టేట్స్
th: บิ๊กเซอร์ สหรัฐอเมริกา
tr: Big Sur, ABD
uk: Біґ-Сур, США
ur: بگ سور، ریاستہائے متحدہ
uz: Katta Sur, AQSH
vi: Big Sur, Hoa Kỳ
zh_hk: 美國大蘇爾
zu: I-Big Sur, United States

# craneSleep6
source: Napa, United States
af: Napa, Verenigde State
am: ናፓ፣ አሜሪካ
ar_eg: نابا، الولايات المتحدة
as: নাপা, মাৰ্কিন যুক্তৰাষ্ট্ৰ
az: Napa, ABŞ
be: Напа, ЗША
bn: নাপা, মার্কিন যুক্তরাষ্ট্র
bs: Napa, Sjedinjene Američke Države
ca: Napa, Estats Units
da: Napa, USA
es_ar: Napa, Estados Unidos
et: Napa, Ameerika Ühendriigid
eu: Napa (Ameriketako Estatu Batuak)
fa: ناپا، ایالات متحده
fr_ca: Napa, États-Unis
gl: Napa, Estados Unidos
gu: નાપા, યુનાઇટેડ સ્ટેટ્સ
he: נאפה, ארצות הברית
hi: नापा, अमेरिका
hu: Napa, Amerikai Egyesült Államok
hy: Նապա, ԱՄՆ
id: Napa, Amerika Serikat
it: Napa, Stati Uniti
ja: ナパ（米国）
ka: ნაპა, შეერთებული შტატები
km: ណាប៉ា សហរដ្ឋ​អាមេរិក
kn: ನಾಪಾ, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್
ko: 미국 나파
ky: Напа, Америка Кошмо Штаттары
lo: ນາປາ, ສະຫະລັດ
lt: Napa, Jungtinės Amerikos Valstijos
lv: Napa, ASV
mk: Напа, САД
ml: നാപ്പ, യുണൈറ്റഡ് സ്റ്റേറ്റ്സ്
mn: Америкийн Нэгдсэн Улс, Напа
mr: नापा, युनायटेड स्टेट्स
ms: Napa, Amerika Syarikat
my: နာပါ၊ အမေရိကန် ပြည်ထောင်စု
nb: Napa, USA
ne: नापा, संयुक्त राज्य अमेरिका
pa: ਨੈਪਾ, ਸੰਯੁਕਤ ਰਾਜ
pl: Napa, Stany Zjednoczone
pt: Napa, Estados Unidos
pt_pt: Napa, Estados Unidos
ro: Napa, Statele Unite
ru: Напа, США
si: නාපා, එක්සත් ජනපදය
sk: Napa, USA
sq: Napa, Shtetet e Bashkuara
sr: Напа, Сједињене Америчке Државе
sr_latn: Napa, Sjedinjene Američke Države
sv: Napa, USA
te: నాపా, యునైటెడ్ స్టేట్స్
th: นาปา สหรัฐอเมริกา
tr: Napa, ABD
uk: Напа, США
ur: ناپا، ریاستہائے متحدہ
uz: Napa, AQSH
vi: Napa, Hoa Kỳ
zh_hk: 美國納帕
zu: I-Napa, United States

# craneSleep7
source: Porto, Portugal
am: ፖርቶ፣ ፖርቱጋል
ar_eg: بورتو، البرتغال
as: প'র্ট', পর্তুগাল
az: Portu, Portuqaliya
be: Порту, Партугалія
bn: পোর্টো, পর্তুগাল
es_ar: Oporto, Portugal
fa: پورتو، پرتغال
gu: પોર્ટો, પોર્ટુગલ
he: פורטו, פורטוגל
hi: पोर्तो, पुर्तगाल
hu: Porto, Portugália
hy: Պորտու, Պորտուգալիք
it: Porto, Portogallo
ja: ポルト（ポルトガル）
ka: პორტო, პორტუგალია
km: ព័រតូ ព័រទុយហ្គាល់
kn: ಪೋರ್ಟೊ, ಪೋರ್ಚುಗಲ್
ko: 포르투갈 포르토
ky: Порто, Португалия
lo: ປໍໂຕ, ປໍຕູກອລ
lt: Portas, Portugalija
lv: Porto, Portugāle
mk: Порто, Португалија
ml: പോർട്ടോ, പോർച്ചുഗൽ
mn: Португал, Порту
mr: पोर्तो, पोर्तुगीज
my: ပေါ်တို၊ ပေါ်တူဂီ
ne: पोर्टो, पोर्तुगल
pa: ਪੋਰਟੋ, ਪੁਰਤਗਾਲ
pl: Porto, Portugalia
ro: Porto, Portugalia
ru: Порту, Португалия
si: පෝටෝ, පෘතුගාලය
sk: Porto, Portugalsko
sq: Porto, Portugali
sr: Порто, Португалија
sr_latn: Porto, Portugalija
te: పోర్టో, పోర్చుగల్
th: ปอร์โต โปรตุเกส
tr: Porto, Portekiz
uk: Порту, Португалія
ur: پورٹو، پرتگال
uz: Porto, Portugaliya
vi: Porto, Bồ Đào Nha
zh_hk: 葡萄牙波多
zu: I-Porto, Portugal

# craneSleep8
source: Tulum, Mexico
af: Tulum, Meksiko
am: ቱሉም፣ ሜክሲኮ
ar_eg: تولوم، المكسيك
as: টুলুম, মেক্সিকো
az: Tulum, Meksika
be: Тулум, Мексіка
bn: তুলুম, মেক্সিকো
bs: Tulum, Meksiko
ca: Tulum, Mèxic
es_ar: Tulum, México
et: Tulum, Mehhiko
eu: Tulum (Mexiko)
fa: تولوم، مکزیک
fr_ca: Tulum, Mexique
gl: Tulum, México
gu: ટુલુમ, મેક્સિકો
he: טולום, מקסיקו
hi: टुलूम, मेक्सिको
hu: Tulum, Mexikó
hy: Տուլում, Մեքսիկա
id: Tulum, Meksiko
it: Tulum, Messico
ja: トゥルム（メキシコ）
ka: ტულუმი, მექსიკა
km: ទូលូម ម៉ិកស៊ិក
kn: ತುಲುಮ್, ಮೆಕ್ಸಿಕೊ
ko: 멕시코 툴룸
ky: Тулум, Мексика
lo: ທູລຳ, ເມັກຊິໂກ
lt: Tulumas, Meksika
lv: Tuluma, Meksika
mk: Тулум, Мексико
ml: ടുലും, മെക്സിക്കോ
mn: Мексик, Тулум
mr: तुलुम, मेक्सिको
my: တူလမ်၊ မက္ကဆီကို
ne: तुलुम, मेक्सिको
pa: ਟੁਲੁਮ, ਮੈਕਸੀਕੋ
pl: Tulum, Meksyk
pt: Tulum, México
pt_pt: Tulum, México
ro: Tulum, Mexic
ru: Тулум, Мексика
si: ටුලුම්, මෙක්සිකෝව
sk: Tulum, Mexiko
sq: Tulum, Meksikë
sr: Тулум, Мексико
sr_latn: Tulum, Meksiko
sv: Tulum, Mexiko
te: టలమ్, మెక్సికో
th: ตูลุม เม็กซิโก
tr: Tulum, Meksika
uk: Тулум, Мексика
ur: تولوم ، میکسیکو
uz: Tulum, Meksika
zh_hk: 墨西哥圖盧姆
zu: I-Tulum, Mexico
