Repository: flutter/flutter
Catalog: dev/integration_tests/new_gallery/lib/l10n/intl_*.arb
Languages: af, am, ar_eg, as, az, be, bn, bs, ca, da, es_ar, et, eu, fa, fil, fr_ca, gl, gu, he, hi, hu, hy, id, it, ja, ka, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, my, nb, ne, pa, pl, pt, pt_pt, ro, ru, si, sk, sq, sr, sr_latn, sv, te, th, tr, uk, ur, uz, vi, zh_hk, zu

# placeSilkMaker
source: Silk Maker
af: Symaker
am: ሐር ሠሪ
ar_eg: صانع الحرير
as: ছিল্ক প্ৰস্তুতকর্তা
az: İpək hazırlayan
be: Працаўнік на шаўковай фабрыцы
bn: যারা সিল্ক তৈরি করেন
bs: Proizvođač svile
ca: Teler de seda
da: Silkeproducent
es_ar: Fabricante de seda
et: Siidimeister
eu: Zetagilea
fa: ابریشم‌باف
fil: Panggawa ng Seda
fr_ca: Tisserand de soie
gl: Fabricante de seda
gu: રેશમ નિર્માતા
he: יוצר משי
hi: सिल्क बनाने वाला
hu: Selyemkészítő
hy: Մետաքսագործ
id: Penenun Sutra
it: Produttore di seta
ja: 絹織物の製作
ka: მეაბრეშუმე
km: ឧបករណ៍ផលិតសូត្រ
kn: ರೇಷ್ಮೆ ವಸ್ತ್ರದ ತಯಾರಕ
ko: 비단 제작자
ky: Жибек жасоочу
lo: ເຄື່ອງທໍຜ້າໄໝ
lt: Šilko gamintojas
lv: Zīda ražotne
mk: Пазар за свила
ml: സിൽക്ക് മേക്കർ
mn: Торго нэхэгч
mr: सिल्क मेकर
ms: Pembuat Sutera
my: ပိုးချည် ပြုလုပ်သူ
nb: Silkeprodusent
ne: रेशम निर्माता
pa: ਰੇਸ਼ਮ ਨਿਰਮਾਤਾ
pl: Producent jedwabiu
pt: Fábrica de seda
pt_pt: Fabricante de seda
ro: Producător de mătase
ru: Рабочий на шелковой фабрике
si: සේද කර්මාන්තකරු
sk: Výrobca hodvábu
sq: Prodhues mëndafshi
sr: Произвођач свиле
sr_latn: Proizvođač svile
sv: Sidenvävare
te: సిల్క్ తయరీదారు
th: เครื่องทอผ้าไหม
tr: İpek Üreticisi
uk: Виробник шовку
ur: ریشم بنانے والا
uz: Ipak fabrikasida ishchi
vi: Máy làm lụa
zh_hk: 製絲人
zu: Isenzi sesilikhi

# placeLunchPrep
source: Lunch Prep
af: Middagetevoorbereiding
am: የምሳ ዝግጅት
ar_eg: إعداد الغداء
as: দুপৰীয়াৰ আহাৰৰ প্ৰস্তুতি
az: Nahar hazırlanması
be: Прыгатаванне абеду
bn: লাঞ্চ তৈরি করা
bs: Pripremanje ručka
ca: Preparació del dinar
da: Gøre frokost klar
es_ar: Preparación del almuerzo
et: Lõunasöögi valmistamine
eu: Bazkaria prestatzen
fa: تهیه ناهار
fil: Paghanda ng Tanghalian
fr_ca: Préparation du dîner
gl: Preparación da comida
gu: બપોરના ભોજનની તૈયારી
he: הכנת ארוחת צהריים
hi: दोपहर के खाने की तैयारी
hu: Ebéd elkészítése
hy: Ճաշի պատրաստում
id: Persiapan Makan Siang
it: Preparazione del pranzo
ja: ランチの準備
ka: ლანჩის მომზადება
km: ការរៀបចំ​អាហារ​ថ្ងៃត្រង់
kn: ಊಟದ ತಯಾರಕ
ko: 점심 준비
ky: Түшкү тамакты даярдоо
lo: ກຽມອາຫານສວາຍ
lt: Priešpiečių ruošimas
lv: Pusdienu gatavošana
mk: Подготовка за ручек
ml: ഉച്ച ഭക്ഷണത്തിനുള്ള തയ്യാറെടുപ്പ്
mn: Үдийн хоолны бэлтгэл
mr: जेवणासाठी खाद्यपदार्थ
ms: Penyediaan Makan Tengahari
my: နေ့လည်စာ ပြင်ဆင်ခြင်း
nb: Lunsjforberedelse
ne: दिउँसोको भोजन बनाउने तयारी
pa: ਦੁਪਹਿਰ ਦੇ ਭੋਜਨ ਦੀ ਤਿਆਰੀ
pl: Przygotowanie lunchu
pt: Preparo do almoço
pt_pt: Preparação do almoço
ro: Prepararea mesei de prânz
ru: Приготовление обеда
si: දිවා ආහාරය පිළියෙළ කිරීම
sk: Príprava obeda
sq: Përgatitja e drekës
sr: Спремање ручка
sr_latn: Spremanje ručka
sv: Lunchförberedelser
te: భోజనం తయారీ
th: เตรียมอาหารกลางวัน
tr: Öğle Yemeği Hazırlığı
uk: Приготування обіду
ur: لنچ کی تیاری
uz: Tushlikni tayyorlash
vi: Chuẩn bị bữa trưa
zh_hk: 準備午餐
zu: Ukulungiswa kwesidlo sasemini

# placeBeach
source: Beach
af: Strand
am: የባሕር ዳርቻ
ar_eg: شاطئ
as: সমুদ্ৰতীৰ
az: Çimərlik
be: Пляж
bn: সমুদ্র সৈকত
bs: Plaža
ca: Platja
da: Strand
es_ar: Playa
et: Rand
eu: Hondartza
fa: ساحل
fr_ca: Plage
gl: Praia
gu: બીચ
he: חוף
hi: समुद्र तट
hu: Tengerpart
hy: Ծովափ
id: Pantai
it: Spiaggia
ja: ビーチ
ka: სანაპირო
km: ឆ្នេរ
kn: ಸಮುದ್ರತೀರ (ಬೀಚ್)
ko: 해변
ky: Кумжээк
lo: ຫາດຊາຍ
lt: Paplūdimys
lv: Pludmale
mk: Плажа
ml: കടൽത്തീരം
mn: Далайн эрэг
mr: समुद्रकिनारा
ms: Pantai
my: ကမ်းခြေ
nb: Strand
ne: समुद्र किनारा
pa: ਬੀਚ
pl: Plaża
pt: Praia
pt_pt: Praia
ro: Plajă
ru: Пляж
si: වෙරළ
sk: Pláž
sq: Plazh
sr: Плажа
sr_latn: Plaža
sv: Strand
te: బీచ్
th: ชายหาด
tr: Kumsal
uk: Пляж
ur: ساحل
uz: Sohil
vi: Bãi biển
zh_hk: 海灘
zu: Ebhishi

# placeFisherman
source: Fisherman
af: Visser
am: ዓሣ አስጋሪ
ar_eg: صياد سمك
as: মাছমৰীয়া
az: Balıqçı
be: Рыбак
bn: জেলে
bs: Ribar
ca: Pescador
da: Fisker
es_ar: Pescador
et: Kalur
eu: Arrantzalea
fa: ماهی‌گیر
fil: Mangingisda
fr_ca: Pêcheur
gl: Pescador
gu: માછીમાર
he: דייג
hi: मछली पकड़ने वाला
hu: Horgász
hy: Ձկնորս
id: Nelayan
it: Pescatore
ja: 漁師
ka: მეთევზე
km: អ្នក​នេសាទ
kn: ಮೀನುಗಾರ
ko: 어부
ky: Балыкчы
lo: ຊາວປະມົງ
lt: Žvejys
lv: Zvejnieks
mk: Рибар
ml: മുക്കുവൻ
mn: Загасчин
mr: कोळी
ms: Nelayan
my: ငါးဖမ်းသူ
nb: Fisker
ne: माझी
pa: ਮਛਿਆਰਾ
pl: Rybak
pt: Pescador
pt_pt: Pescador
ro: Pescar
ru: Рыбак
si: ධීවරයා
sk: Rybár
sq: Peshkatar
sr: Рибар
sr_latn: Ribar
sv: Fiskare
te: మత్స్యకారుడు
th: ชาวประมง
tr: Balıkçı
uk: Риболов
ur: ماہی گیر
uz: Baliqchi
vi: Người đánh cá
zh_hk: 漁夫
zu: Umdobi wezinhlanzi

# demoMenuSelected
source: Selected: {value}
af: Gekies: {value}
am: ተመርጧል፦ {value}
ar_eg: القيمة التي تم اختيارها: {value}
as: এইটো বাছনি কৰা হৈছে: {value}
az: Seçilib: {value}
be: Выбрана: {value}
bn: বেছে নেওয়া হয়েছে: {value}
bs: Odabrano: {value}
ca: Seleccionat: {value}
da: Valgt: {value}
es_ar: Seleccionado: {value}
et: Valitud: {value}
eu: Hautatuta: {value}
fa: انتخاب‌شده: {value}
fil: Napili: {value}
fr_ca: Élément sélectionné : {value}
gl: Seleccionado: {value}
gu: પસંદ કર્યું: {value}
he: הערך שנבחר: {value}
hi: इसे चुना गया: {value}
hu: Kiválasztva: {value}
hy: Ընտրված է՝ {value}
id: Dipilih: {value}
it: Valore selezionato: {value}
ja: 選択: {value}
ka: არჩეულია: {value}
km: បាន​ជ្រើសរើស​៖ {value}
kn: ಆಯ್ಕೆಮಾಡಿರುವುದು: {value}
ko: 선택된 값: {value}
ky: Тандалды: {value}
lo: ເລືອກແລ້ວ: {value}
lt: Pasirinkta: {value}
lv: Atlasītā vērtība: {value}
mk: Избрано: {value}
ml: തിരഞ്ഞെടുത്തു: {value}
mn: Сонгосон: {value}
mr: निवडलेले: {value}
ms: Dipilih: {value}
my: ရွေးထားသော- {value}
nb: Valgt: {value}
ne: चयन गरिएको: {value}
pa: ਚੁਣਿਆ ਗਿਆ: {value}
pl: Wybrano: {value}
pt: Selecionado: {value}
pt_pt: Selecionado: {value}
ro: Selectat: {value}
ru: Выбранное значение: {value}
si: තෝරා ගත්: {value}
sk: Vybrané: {value}
sq: Zgjedhur: {value}
sr: Изабрано: {value}
sr_latn: Izabrano: {value}
sv: Valdes: {value}
te: ఎంపిక చేసినది: {value}
th: เลือกไว้: {value}
tr: Seçildi: {value}
uk: Вибрано: {value}
ur: منتخب کردہ: {value}
uz: Tanlangan qiymat: {value}
vi: Đã chọn: {value}
zh_hk: 已選擇：{value}
zu: Ikhethiwe: {value}

# demoMenuRemove
source: Remove
af: Verwyder
am: አስወግድ
ar_eg: إزالة
as: আঁতৰাওক
az: Silin
be: Выдаліць
bn: সরিয়ে দিন
bs: Ukloni
ca: Suprimeix
da: Fjern
es_ar: Quitar
et: Eemalda
eu: Kendu
fa: حذف
fil: Alisin
fr_ca: Retirer
gl: Quitar
gu: કાઢી નાખો
he: הסרה
hi: हटाएं
hu: Eltávolítás
hy: Ջնջել
id: Hapus
it: Rimuovi
ja: 削除
ka: ამოღება
km: លុប
kn: ತೆಗೆದುಹಾಕಿ
ko: 삭제
ky: Өчүрүү
lo: ລຶບ
lt: Pašalinti
lv: Noņemt
mk: Отстрани
ml: നീക്കം ചെയ്യുക
mn: Хасах
mr: काढा
ms: Alih keluar
my: ဖယ်ရှားရန်
nb: Fjern
ne: हटाउनुहोस्
pa: ਹਟਾਓ
pl: Usuń
pt: Remover
pt_pt: Remover
ro: Eliminați
ru: Удалить
si: ඉවත් කරන්න
sk: Odstrániť
sq: Hiq
sr: Уклони
sr_latn: Ukloni
sv: Ta bort
te: తీసివేయండి
th: นำออก
tr: Kaldır
uk: Вилучити
ur: ہٹائیں
uz: Olib tashlash
vi: Xóa
zh_hk: 移除
zu: Susa

# demoMenuGetLink
source: Get link
af: Kry skakel
am: አገናኝ ያግኙ
ar_eg: الحصول على الرابط
as: লিংকটো পাওক
az: Keçid əldə edin
be: Атрымаць спасылку
bn: লিঙ্ক পান
bs: Preuzmi link
ca: Obtén l'enllaç
da: Hent link
es_ar: Obtener vínculo
et: Hangi link
eu: Eskuratu esteka
fa: دریافت پیوند
fil: Kumuha ng link
fr_ca: Obtenir le lien
gl: Obter ligazón
gu: લિંક મેળવો
he: קבלת קישור
hi: लिंक पाएं
hu: Link lekérése
hy: Ստանալ հղումը
id: Dapatkan link
it: Crea link
ja: リンクを取得
ka: ბმულის მიღება
km: យក​តំណ
kn: ಲಿಂಕ್ ಪಡೆದುಕೊಳ್ಳಿ
ko: 링크 생성
ky: Шилтеме алуу
lo: ຮັບລິ້ງ
lt: Gauti nuorodą
lv: Iegūt saiti
mk: Добијте линк
ml: ലിങ്ക് നേടുക
mn: Холбоос авах
mr: लिंक मिळवा
ms: Dapatkan pautan
my: လင့်ခ်ရယူရန်
nb: Hent link
ne: लिंक प्राप्त गर्नुहोस्
pa: ਲਿੰਕ ਪ੍ਰਾਪਤ ਕਰੋ
pl: Pobierz link
pt: Gerar link
pt_pt: Obter link
ro: Obțineți linkul
ru: Получить ссылку
si: සබැඳිය ලබා ගන්න
sk: Získať odkaz
sq: Merr lidhjen
sr: Преузми линк
sr_latn: Preuzmi link
sv: Hämta länk
te: లింక్‌ను పొందండి
th: รับลิงก์
tr: Bağlantıyı al
uk: Отримати посилання
ur: لنک حاصل کریں
uz: Havolani olish
vi: Nhận đường liên kết
zh_hk: 取得連結
zu: Thola isixhumanisi

# demoMenuShare
source: Share
af: Deel
am: አጋራ
ar_eg: مشاركة
as: শ্বেয়াৰ কৰক
az: Paylaşın
be: Абагуліць
bn: শেয়ার করুন
bs: Dijeli
ca: Comparteix
da: Del
es_ar: Compartir
et: Jaga
eu: Partekatu
fa: هم‌رسانی
fil: Ibahagi
fr_ca: Partager
gl: Compartir
gu: શેર કરો
he: שיתוף
hi: शेयर करें
hu: Megosztás
hy: Կիսվել
id: Bagikan
it: Condividi
ja: 共有
ka: გაზიარება
km: ចែករំលែក
kn: ಹಂಚಿಕೊಳ್ಳಿ
ko: 공유
ky: Бөлүшүү
lo: ແບ່ງປັນ
lt: Bendrinti
lv: Kopīgot
mk: Сподели
ml: പങ്കിടുക
mn: Хуваалцах
mr: शेअर करा
ms: Kongsi
my: မျှဝေရန်
nb: Del
ne: सेयर गर्नुहोस्
pa: ਸਾਂਝਾ ਕਰੋ
pl: Udostępnij
pt: Compartilhar
pt_pt: Partilhar
ro: Trimiteți
ru: Поделиться
si: බෙදා ගන්න
sk: Zdieľať
sq: Ndaj
sr: Дели
sr_latn: Deli
sv: Dela
te: షేర్ చేయి
th: แชร์
tr: Paylaş
uk: Поділитися
ur: اشتراک کریں
uz: Ulashish
vi: Chia sẻ
zh_hk: 分享
zu: Yabelana

# demoBottomAppBarSubtitle
source: Displays navigation and actions at the bottom
af: Wys navigasie en handelinge aan die onderkant
am: ዳሰሳን እና እርምጃዎችን በግርጌው ላይ ያሳያል
ar_eg: يعرض لائحة التنقل والإجراءات في أسفل التطبيق
as: নেভিগে’শ্বন আৰু কাৰ্যসমূহ তলত দেখুৱায়
az: Alt hissədə naviqasiya və əməliyyatları göstərir
be: Паказвае ўнізе экрана навігацыю і дзеянні
bn: স্ক্রিনের নিচের দিকে নেভিগেশন এবং অ্যাকশনের বিকল্প দেখান
bs: Prikazuje navigaciju i radnje na dnu
ca: Mostra la navegació i les accions a la part inferior
da: Viser navigation og handlinger nederst på skærmen
es_ar: Muestra la navegación y las acciones en la parte inferior
et: Kuvab navigeerimise ja toimingud allosas
eu: Nabigazio-aukerak eta erabilgarri dauden ekintzak bistaratzen ditu behealdean
fa: پیمایش و کنش‌ها را در پایین صفحه نمایش می‌دهد
fil: Nagpapakita ng navigation at mga pagkilos sa ibaba
fr_ca: Affiche la navigation et les actions dans le bas
gl: Mostra a navegación e as accións na parte inferior
gu: સૌથી નીચે નૅવિગેશન અને ક્રિયાઓ બતાવે છે
he: מציג ניווט ופעולות בתחתית המסך
hi: स्क्रीन पर सबसे नीचे मौजूद नेविगेशन और कार्रवाइयों को दिखाता है
hu: A képernyő alján jeleníti meg a navigációs fiókot és a műveleteket
hy: Էկրանի ներքևի հատվածում ցուցադրում է նավիգացիայի տարրերն ու հասանելի գործողությունները
id: Menampilkan navigasi dan tindakan di bagian bawah
it: Consente di visualizzare la navigazione e le azioni in basso
ja: 下部にナビゲーションとアクションが表示されます
ka: ნავიგაციასა და მოქმედებებს აჩვენებს ბოლოში
km: បង្ហាញ​ការរុករក និងសកម្មភាព​នៅផ្នែកខាងក្រោម
kn: ಕೆಳಗೆ ನ್ಯಾವಿಗೇಶನ್ ಮತ್ತು ಕ್ರಿಯೆಗಳನ್ನು ಡಿಸ್‌ಪ್ಲೇ ಮಾಡುತ್ತದೆ
ko: 하단에 탐색 메뉴 및 작업 표시
ky: Чабыттоону жана аракеттерди ылдый жакта көрсөтөт
lo: ສະແດງການນຳທາງ ແລະ ຄຳສັ່ງຢູ່ລຸ່ມສຸດ
lt: Pateikiami naršymo elementai ir veiksmai apačioje
lv: Apakšdaļā tiek rādītas navigācijas iespējas un pieejamās darbības
mk: Прикажува навигација и дејства во долниот дел
ml: നാവിഗേഷനും പ്രവർത്തനങ്ങളും ചുവടെ പ്രദർശിപ്പിക്കുന്നു
mn: Навигац болон үйлдлийг доод талд үзүүлдэг
mr: नेव्हिगेशन आणि अ‍ॅक्शन तळाशी दाखवते
ms: Memaparkan navigasi dan tindakan di bahagian bawah
my: အောက်ခြေတွင် လမ်းညွှန်ချက်နှင့် လုပ်ဆောင်ချက်များကို ပြပေးသည်
nb: Viser navigering og handlinger nederst
ne: नेभिगेसन र कार्यहरू फेदमा देखाउँछ
pa: ਹੇਠਾਂ ਨੈਵੀਗੇਸ਼ਨ ਅਤੇ ਕਾਰਵਾਈਆਂ ਦਿਖਾਉਂਦਾ ਹੈ
pl: Wyświetla opcje nawigacji i działań na dole ekranu
pt: Exibe a navegação e as ações na parte inferior da tela
pt_pt: Apresenta a navegação e as ações na parte inferior.
ro: Afișează navigarea și acțiunile în partea de jos
ru: На панели в нижней части экрана располагаются элементы навигации и доступные действия
si: පහළදී සංචාලනය සහ ක්‍රියා සංදර්ශනය කරයි
sk: Zobrazuje v dolnej časti navigáciu a akcie
sq: Shfaq navigimin dhe veprimet në fund
sr: Приказује навигацију и радње у дну
sr_latn: Prikazuje navigaciju i radnje u dnu
sv: Visar navigering och åtgärder längst ned på skärmen
te: నావిగేషన్‌ను, చర్యలను దిగువున చూపిస్తుంది
th: แสดงการนำทางและการทำงานที่ด้านล่าง
tr: Gezinmeyi ve işlemleri altta gösterir
uk: Показує кнопки навігації та командні кнопки внизу екрана
ur: سب سے نیچے نیویگیشن اور کارروائیاں ڈسپلے کرتا ہے
uz: Navigatsiya va amallar ekranning quyi qismida chiqadi
vi: Hiển thị ngăn điều hướng và các hành động ở dưới cùng
zh_hk: 在底部顯示導覽和動作
zu: Ibonisa ukuzula nezenzo phansi

# demoMenuAnItemWithASectionedMenu
source: An item with a sectioned menu
af: 'n Item met 'n verdeelde kieslys
am: ከተከፋፈለ ምናሌ ጋር ያለ ንጥል
ar_eg: عنصر يفتح قائمة ذات أقسام
as: এখন বিভক্ত মেনুৰ সৈতে এটা বস্তু
az: Bölməli menyu ilə element
be: Элемент з меню з раздзеламі
bn: বিভাগ অনুযায়ী ভাগ করা মেনু সহ একটি আইটেম
bs: Stavka s menijem s odjeljcima
ca: Un element amb un menú amb seccions
da: Et element med en menu med sektioner
es_ar: Un elemento con un menú dividido
et: Jaotistega menüüga üksus
eu: Menu sekziodun bat duen aukera bat
fa: مورد با منوی بخش‌بندی‌شده
fil: Isang item na may nakaseksyong menu
fr_ca: Un élément avec un menu à sections
gl: Un elemento cun menú con seccións
gu: વિભાગીય મેનૂવાળી આઇટમ
he: פריט עם תפריט שמחולק לקטעים
hi: सेक्शन वाले मेन्यू से जुड़ा आइटम
hu: Elem tagolt menüvel
hy: Բաժիններ պարունակող ընտրացանկով տարր
id: Item dengan menu bagian
it: Un elemento con un menu a sezioni
ja: セクション分割メニュー付きの項目
ka: ერთეული სექციებად დაყოფილი მენიუთი
km: ធាតុ​ដែលមាន​ម៉ឺនុយ​តាមផ្នែក
kn: ವಿಭಾಗದ ಮೆನು ಹೊಂದಿರುವ ಐಟಂ
ko: 섹션으로 구분된 메뉴가 포함된 항목
ky: Бөлүмдөр менюсундагы элемент
lo: ລາຍການທີ່ມີເມນູແບບພາກສ່ວນ
lt: Į skiltis suskirstyto meniu elementas
lv: Vienums ar izvēlni, kurai ir sadaļas
mk: Ставка со мени со секции
ml: വിഭാഗീകരിച്ച മെനു ഉള്ള ഒരിനം
mn: Хэсэгчилсэн цэстэй зүйл
mr: विभागाचा मेनू असलेला एक आयटम
ms: Item dengan menu berbahagian
my: အပိုင်းခွဲထားသည့် မီနူးပါ အကြောင်းအရာ
nb: Et element med en inndelt meny
ne: खण्डमा बाँडिएको मेनुमा भएको वस्तु
pa: ਸੈਕਸ਼ਨਬੱਧ ਮੀਨੂ ਨਾਲ ਇੱਕ ਆਈਟਮ
pl: Element z menu z podziałem na sekcje
pt: Um item com um menu em seções
pt_pt: Um item com um menu em secções
ro: Element cu meniu cu secțiuni
ru: Объект, у которого есть меню с разделами
si: කොටස් කළ මෙනුවක් සහිත අයිතමයක්
sk: Položka s rozdelenou ponukou
sq: Një artikull me një meny me seksione
sr: Ставка са менијем са одељцима
sr_latn: Stavka sa menijem sa odeljcima
sv: Ett alternativ med en meny med avsnitt
te: విభాగాల మెనూ కలిగి ఉన్న అంశం
th: รายการพร้อมเมนูแบบเป็นส่วน
tr: Bölümlere ayrılmış menüsü olan öğe
uk: Елемент, що відкриває меню з розділами
ur: سیکشن کردہ مینیو والا ایک آئٹم
uz: Qismli menyusi bor obyekt
vi: Mục có trình đơn theo phần
zh_hk: 設有分類選單的項目
zu: Into enemenyu efakwe kusigaba

# demoMenuADisabledMenuItem
source: Disabled menu item
af: Gedeaktiveerde kieslysitem
am: የተሰናከለ ምናሌ ንጥል
ar_eg: عنصر قائمة غير مفعّل
as: অক্ষম কৰা মেনুৰ বস্তু
az: Deaktiv menyu elementi
be: Адключаны пункт меню
bn: মেনু আইটেম দেখানো বন্ধ করুন
bs: Onemogućena stavka menija
ca: Element de menú desactivat
da: Deaktiveret menupunkt
es_ar: Elemento de menú inhabilitado
et: Keelatud menüü-üksus
eu: Menuko desgaitutako aukera
fa: گزینه منوی غیرفعال
fil: Na-disable na item sa menu
fr_ca: Option de menu désactivée
gl: Elemento de menú desactivado
gu: બંધ કરેલી મેનૂ આઇટમ
he: אפשרות מושבתת בתפריט
hi: बंद किया गया मेन्यू आइटम
hu: Letiltott menüelem
hy: Ընտրացանկի ոչ ակտիվ տարր
id: Item menu nonaktif
it: Voce di menu disattivata
ja: 無効なメニュー項目
ka: მენიუს ერთეულის გათიშვა
km: ធាតុ​ម៉ឺនុយ​ដែលបានបិទ
kn: ನಿಷ್ಕ್ರಿಯ ಮೆನು ಐಟಂ
ko: 사용 중지된 메뉴 항목
ky: Менюдагы элемент өчүрүлдү
lo: ລາຍການເມນູບໍລິບົດສອງ
lt: Išjungtas meniu elementas
lv: Atspējots izvēlnes vienums
mk: Оневозможена ставка на менито
ml: പ്രവർത്തനരഹിതമാക്കിയ മെനു ഇനം
mn: Цэсийн идэвхгүй болгосон зүйл
mr: मेनू आयटम बंद केला
ms: Item menu dilumpuhkan
my: မီနူးအကြောင်းအရာကို ပိတ်ထားသည်
nb: Deaktivert menyelement
ne: असक्षम पारिएका मेनुको वस्तु
pa: ਬੰਦ ਕੀਤੀ ਮੀਨੂ ਆਈਟਮ
pl: Wyłączona pozycja menu
pt: Item de menu desativado
pt_pt: Item de menu desativado
ro: Element de meniu dezactivat
ru: Недоступный пункт меню
si: අබල කළ මෙනු අයිතමය
sk: Deaktivovaná položka ponuky
sq: Artikulli i çaktivizuar i menysë
sr: Онемогућена ставка менија
sr_latn: Onemogućena stavka menija
sv: Inaktiverat menyalternativ
te: డిజేబుల్ చేసిన మెనూ అంశం
th: รายการในเมนูที่ปิดใช้
tr: Devre dışı menü öğesi
uk: Вимкнений пункт меню
ur: مینیو آئٹم غیر فعال کر دیا گیا
uz: Menyuning faolsizlantirilgan bandi
vi: Mục có trình đơn ở trạng thái vô hiệu hóa
zh_hk: 已停用選單項目
zu: Into yemenyu ekhutshaziwe

# demoLinearProgressIndicatorTitle
source: Linear Progress Indicator
af: Lineêre vorderingaanwyser
am: የቀጥታ መስመር የግስጋሴ ጠቋሚ
ar_eg: مؤشر تقدم خطي
as: ৰৈখিক অগ্ৰগতি সূচক
az: Xətti Gedişat İndikatoru
be: Лінейны індыкатар выканання
bn: লিনিয়ার প্রগ্রেস নির্দেশক
bs: Linearni pokazatelj napretka
ca: Indicador de progrés lineal
da: Lineær statusindikator
es_ar: Indicador de progreso lineal
et: Lineaarne edenemisnäidik
eu: Garapen-adierazle lineala
fa: نشانگر پیشرفت خطی
fil: Linear na Indicator ng Pag-usad
fr_ca: Indicateur de progression linéaire
gl: Indicador de progreso lineal
gu: રેખીય પ્રગતિ સૂચક
he: אינדיקטור של התקדמות ליניארית
hi: गतिविधि की स्थिति लीनियर फ़ॉर्मैट में दिखाने वाला इंडिकेटर
hu: Lineáris folyamatjelző
hy: Ընթացքի գծային ցուցիչ
id: Indikator Progres Linear
it: Indicatore di avanzamento lineare
ja: 線形進行状況インジケーター
ka: პროგრესის წრფივი ინდიკატორი
km: សូចនាករដំណើរការរាងបន្ទាត់ត្រង់
kn: ಲೀನಿಯರ್ ಪ್ರಗತಿ ಸೂಚಕ
ko: 선형 진행 상태 표시기
ky: Түз кыймылдын аткарылышынын индикатору
lo: ຕົວຊີ້ບອກສະຖານະແບບເສັ້ນຊື່
lt: Linijinis eigos indikatorius
lv: Lineārs norises indikators
mk: Линиски индикатор на напредок
ml: ലീനിയർ പ്രോഗ്രസ് ഇൻഡിക്കേറ്റർ
mn: Шугаман үйл явцын заалт
mr: लिनिअर प्रगती इंडिकेटर
ms: Penunjuk Kemajuan Linear
my: မျဉ်းဖြောင့် တိုးတက်မှုအညွှန်း
nb: Lineær fremdriftsindikator
ne: रेखीय प्रगति सूचक
pa: ਲੀਨੀਅਰ ਪ੍ਰਗਤੀ ਸੂਚਕ
pl: Liniowy wskaźnik postępu
pt: Indicador de progresso linear
pt_pt: Indicador de progresso linear
ro: Indicator de progres liniar
ru: Линейный индикатор прогресса
si: රේඛීය ප්‍රගති දර්ශකය
sk: Lineárny indikátor priebehu
sq: Treguesi linear i progresit
sr: Линеарни индикатор напретка
sr_latn: Linearni indikator napretka
sv: Linjär förloppsindikator
te: లీనియర్ ప్రోగ్రెస్ సూచీ
th: สัญญาณบอกสถานะความคืบหน้าแบบเชิงเส้น
tr: Doğrusal İlerleme Durumu Göstergesi
uk: Індикатор лінійного перебігу
ur: لینئیر پیش رفت کا انڈیکیٹر
uz: Chiziqli jarayon indikatori
vi: Chỉ báo tiến trình tuyến tính
zh_hk: 直線進度指標
zu: Isikhombisi sokuqhubeka se-Linear

# demoMenuContextMenuItemOne
source: Context menu item one
af: Kontekskieslysitem een
am: ዓውድ ምናሌ ንጥል አንድ
ar_eg: أول عنصر في قائمة السياقات
as: প্ৰসংগ মেনুৰ প্ৰথম বস্তু
az: Birinci kontekst menyusu elementi
be: Першы пункт кантэкстнага меню
bn: সংশ্লিষ্ট মেনুর প্রথম আইটেম
bs: Prva stavka kontekstnog menija
ca: Element de menú contextual u
da: Genvejsmenupunkt ét
es_ar: Primer elemento del menú contextual
et: Kontekstimenüü üksus 1
eu: Laster-menuko lehen aukera
fa: گزینه یک منوی بافتی
fil: Unang item sa menu ng konteksto
fr_ca: Option de menu contextuel un
gl: Elemento do menú contextual un
gu: સંદર્ભ મેનૂમાં પહેલી આઇટમ
he: אפשרות ראשונה בתפריט הקשר
hi: संदर्भ मेन्यू का पहला आइटम
hu: Helyi menü első eleme
hy: Տեղային ընտրացանկի տարր 1
id: Item menu konteks satu
it: Voce uno del menu contestuale
ja: コンテキスト メニュー項目 1
ka: კონტექსტური მენიუს პირველი ერთეული
km: ធាតុ​ទីមួយ​ក្នុង​ម៉ឺនុយ​បរិបទ
kn: ಸಂದರ್ಭ ಮೆನುವಿನ ಮೊದಲನೇ ಐಟಂ
ko: 컨텍스트 메뉴 항목 1
ky: Контексттик менюдагы биринчи элемент
lo: ລາຍການເມນູບໍລິບົດໜຶ່ງ
lt: Pirmas kontekstinio meniu elementas
lv: Kontekstizvēlnes pirmais vienums
mk: Прва ставка на контекстуално мени
ml: സന്ദർഭ മെനു ഇനം ഒന്ന്
mn: Хадам сэдэв цэсийн нэгдүгээр зүйл
mr: कॉंटेक्स्ट मेनू आयटम एक
ms: Item menu konteks pertama
my: အကြောင်းအရာမီနူး နံပါတ်တစ်
nb: Element én i kontekstuell meny
ne: सन्दर्भ मेनुको पहिलो वस्तु
pa: ਸੰਦਰਭੀ ਮੀਨੂ ਵਿਚਲੀ ਪਹਿਲੀ ਆਈਟਮ
pl: Pierwsza pozycja menu kontekstowego
pt: Item um do menu de contexto
pt_pt: Primeiro item de menu de contexto
ro: Elementul de meniu contextual unu
ru: Первый пункт контекстного меню
si: සන්දර්භ මෙනු අයිතම එක
sk: Prvá položka kontextovej ponuky
sq: Artikulli i parë i menysë kontekstuale
sr: Прва ставка контекстуалног менија
sr_latn: Prva stavka kontekstualnog menija
sv: Snabbmeny – alternativ ett
te: మొదటి సందర్భోచిత మెనూ అంశం
th: รายการในเมนูตามบริบทที่ 1
tr: İçerik menüsü öğesi bir
uk: Перший пункт контекстного меню
ur: سیاق و سباق کے مینیو والا پہلا آئٹم
uz: Kontekst menyusining birinchi bandi
vi: Mục đầu tiên trong trình đơn ngữ cảnh
zh_hk: 第一個內容選單項目
zu: Into yokuqala yokuqukethwe kwemenyu

# demoMenuAnItemWithASimpleMenu
source: An item with a simple menu
af: 'n Item met 'n eenvoudige kieslys
am: ንጥል ከቀላል ምናሌ ጋር
ar_eg: عنصر يفتح قائمة بسيطة
as: এখন সৰল মেনুৰ সৈতে এটা বস্তু
az: Sadə menyu ilə element
be: Элемент з простым меню
bn: সহজ মেনু সহ একটি আইটেম
bs: Stavka s jednostavnim menijem
ca: Un element amb un menú senzill
da: Et element med en enkel menu
es_ar: Un elemento con un menú simple
et: Lihtsa menüüga üksus
eu: Menu sinple bat duen aukera bat
fa: مورد با منوی ساده
fil: Isang item na may simpleng menu
fr_ca: Un élément avec un menu simple
gl: Un elemento cun menú simple
gu: સરળ મેનૂવાળી આઇટમ
he: פריט עם תפריט פשוט
hi: सरल मेन्यू वाला आइटम
hu: Elem egyszerű menüvel
hy: Պարզ ընտրացանկով տարր
id: Item dengan menu sederhana
it: Un elemento con un menu semplice
ja: シンプル メニュー付きの項目
ka: ერთეული მარტივი მენიუთი
km: ធាតុ​ដែលមាន​ម៉ឺនុយ​ធម្មតា
kn: ಸರಳ ಮೆನು ಹೊಂದಿರುವ ಐಟಂ
ko: 단순 메뉴가 포함된 항목
ky: Жөнөкөй менюдагы элемент
lo: ລາຍການທີ່ມີເມນູແບບງ່າຍ
lt: Paprasto meniu elementas
lv: Vienums ar vienkāršu izvēlni
mk: Ставка со едноставно мени
ml: സിമ്പിൾ മെനു ഉള്ള ഒരിനം
mn: Энгийн цэстэй зүйл
mr: सोपा मेनू असलेला एक आयटम
ms: Item dengan menu ringkas
my: ရိုးရှင်းသော မီနူးပါ အကြောင်းအရာ
nb: Et element med en enkel meny
ne: सामान्य मेनुमा भएको वस्तु
pa: ਸਧਾਰਨ ਮੀਨੂ ਨਾਲ ਇੱਕ ਆਈਟਮ
pl: Element z prostym menu
pt: Um item com um menu simples
pt_pt: Um item com um menu simples
ro: Element cu meniu simplu
ru: Объект, у которого есть простое меню
si: සරල මෙනුවක් සහිත අයිතමයක්
sk: Položka s jednoduchou ponukou
sq: Një artikull me një meny të thjeshtë
sr: Ставка са једноставним менијем
sr_latn: Stavka sa jednostavnim menijem
sv: Ett alternativ med en enkel meny
te: సరళమైన మెనూ కలిగి ఉన్న అంశం
th: รายการพร้อมเมนูแบบง่าย
tr: Basit menüsü olan öğe
uk: Елемент із простим меню
ur: آسان مینیو والا ایک آئٹم
uz: Oddiy menyuli obyekt
vi: Mục có trình đơn đơn giản
zh_hk: 設有簡單選單的項目
zu: Into enemenyu elula

# demoCustomSlidersTitle
source: Custom Sliders
af: Gepasmaakte glyers
am: ብጁ ተንሸራታቾች
ar_eg: شرائط التمرير المخصَّصة
as: কাষ্টম শ্লাইডাৰসমূহ
az: Fərdi Slayderlər
be: Карыстальніцкія паўзункі
bn: কাস্টম স্লাইডার
bs: Prilagođeni klizači
ca: Controls lliscants personalitzats
da: Tilpassede skydere
es_ar: Controles deslizantes personalizados
et: Kohandatud liugurid
eu: Graduatzaile pertsonalizatuak
fa: لغزنده سفارشی
fil: Mga Custom na Slider
fr_ca: Curseurs personnalisés
gl: Controis desprazables personalizados
gu: કસ્ટમ સ્લાઇડર
he: מחוונים מותאמים אישית
hi: पसंद के मुताबिक बनाए गए स्लाइडर
hu: Egyéni csúszkák
hy: Հատուկ սահիչներ
id: Penggeser Kustom
it: Cursori personalizzati
ja: カスタム スライダー
ka: მორგებული სლაიდერები
km: របាររំកិលផ្ទាល់ខ្លួន
kn: ಕಸ್ಟಮ್ ಸ್ಲೈಡರ್‌ಗಳು
ko: 맞춤 슬라이더
ky: Ыңгайлаштырылган сыдырмалар
lo: ຕົວເລື່ອນແບບກຳນົດເອງ
lt: Tinkinti šliaužikliai
lv: Pielāgoti slīdņi
mk: Лизгачи за приспособување
ml: ഇഷ്‌ടാനുസൃതം സ്ലെെഡറുകൾ
mn: Захиалгат слайдер
mr: कस्टम स्लायडर
ms: Peluncur Tersuai
my: စိတ်ကြိုက် ရွှေ့တုံးများ
nb: Egendefinerte glidebrytere
ne: आफू अनुकूल स्लाइडरहरू
pa: ਵਿਉਂਤਬੱਧ ਸਲਾਈਡਰ
pl: Suwaki niestandardowe
pt: Controles deslizantes personalizados
pt_pt: Controlos de deslize personalizados
ro: Glisoare personalizate
ru: Настраиваемые ползунки
si: අභිරුචි ස්ලයිඩර්
sk: Vlastné posúvače
sq: Rrëshqitësit e personalizuar
sr: Прилагођени клизачи
sr_latn: Prilagođeni klizači
sv: Anpassade skjutreglage
te: అనుకూల స్లయిడర్‌లు
th: แถบเลื่อนที่กำหนดเอง
tr: Özel Kaydırma Çubukları
uk: Власні повзунки
ur: حسب ضرورت سلائیڈرز
uz: Maxsus slayderlar
vi: Thanh trượt tùy chỉnh
zh_hk: 自訂滑桿
zu: Izilayidi zangokwezifiso
